{
  "title": "Roadside Tesla Semi fire where temperatures reached 1,000 degrees draws in NTSB investigative team",
  "score": 207,
  "selftext": "A crash and large fire along a California freeway involving an electric Tesla Semi has drawn the attention of federal safety investigators.\n\nThe U.S. National Transportation Safety Board said Thursday it’s sending a team of investigators from the Office of Highway Safety mainly to look into fire risks posed by lithium-ion batteries.\n\nThe team will work with the California Highway Patrol to “examine the wreckage and gather details about the events leading up to the collision and the subsequent fire response,” the agency said in a statement.\n\nThe Los Angeles Times reported that the Tesla rig was traveling east on Interstate 80 around 3:15 a.m. Monday near Emigrant Gap, about 70 miles (113 kilometers) northeast of Sacramento, when it went off the road and collided with trees near the right shoulder.\n\nThe battery caught fire, spewing toxic fumes and reaching a temperature of 1,000 degrees, forcing firefighters to wait for it to burn out, the Highway Patrol told the newspaper. The Tesla driver walked away from the crash and was taken to a hospital, and the freeway was temporarily closed.\n\nThe battery burned into the late afternoon while firefighters tried to cool it down for cleanup, and the freeway didn’t reopen until 7:20 p.m., authorities said.\n\nA message was left Thursday seeking comment on the crash and fire from Tesla.\n\nAfter an investigation that ended in 2021 the NTSB determined that high-voltage electric vehicle battery fires pose risks to first responders and that guidelines from manufacturers about how to deal with them were inadequate.\n\nThe agency, which has no enforcement powers and can only make recommendations, called for manufacturers to write vehicle-specific response guides for fighting battery fires and limiting chemical thermal runaway and reignition. The guidelines also should include information on how to safely store vehicles with damaged lithium-ion batteries, the agency said.\n\nTesla began delivering the electric Semis in December of 2022, more than three years after CEO Elon Musk said his company would start making the trucks. Musk has said the Semi has a range per charge of 500 miles (800 kilometers) when pulling an 82,000-pound (37,000-kilo) load.\n\nSource: https://www.cnbc.com/2024/08/22/roadside-tesla-semi-fire-where-temperatures-reached-1000-degrees-draws-in-ntsb-investigative-team.html",
  "link_flair_text": null,
  "id": "1ez0u00",
  "num_comments": 72,
  "created_utc": 1724377751,
  "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/",
  "comments": [
    {
      "id": "ljiye5x",
      "score": 35,
      "body": "Headline 1000 degrees?  Fire generally much hotter than that.",
      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljiye5x/",
      "created": 1724410600,
      "depth": 0,
      "replies": [
        {
          "id": "ljkj7ph",
          "score": 4,
          "body": "Are vehicle fires typically hotter than 1000°? In ICE vehicle fires, it’s typically the vehicle itself burning, not the fuel (which I assume would explode). Battery vehicle fires are scary because the lithium itself combusts for a long time.",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljkj7ph/",
          "created": 1724431129,
          "depth": 1,
          "replies": [
            {
              "id": "ljow3se",
              "score": 1,
              "body": "Vehicles are mostly made of petroleum products, they burn hot, and magnesium doesn’t ignite until 850F then get gets really hot when that’s on fire.",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljow3se/",
              "created": 1724500048,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljl6eug",
          "score": 1,
          "body": "But NBC said this was much hotter and dangerous than other EVs when they burn because they intentionally  use batteries too powerful. ",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljl6eug/",
          "created": 1724438480,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljhq73j",
      "score": 39,
      "body": "Pretty surprising fire departments in the US aren't better prepared for lithium battery fires. I guess with the US being so far behind in EV usage vs East Asia and Europe they haven't felt the need to.\n\nI wonder if EV manufactures will have to include some sort fire extinguishing system in batteries or if fire departments will all adopt something like f500 or Novacool. Anyone know what departments are looking at? Seems like overall lithium fires are so rare in the US there's not much usage info on these agents.\n\nCould be something to look into though if any public companies are involved in the supply chain for those foam agents",
      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljhq73j/",
      "created": 1724384538,
      "depth": 0,
      "replies": [
        {
          "id": "ljhr0i1",
          "score": 19,
          "body": "How do you suggest they prepare for lithium fires?",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljhr0i1/",
          "created": 1724384911,
          "depth": 1,
          "replies": [
            {
              "id": "ljieopd",
              "score": 6,
              "body": "I'm not a chemist or fire expert, but a lot of military/commercial vehicles have halon, from what I looked up it won't prevent thermal runaway but should stop the electrolyte in the batteries from burning.",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljieopd/",
              "created": 1724398194,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljhtfvj",
              "score": 25,
              "body": "I don't have any firefighting experience so I wouldn't suggest anything, but from what I understand, other countries use foam agents  to extinguish lithium battery fires. Some fire departments in the US have it others just use water. I think it's just new tech woes, but manufacturers seem to have firefighting strategies that are better suited to lithium fires than whatever they had in LA",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljhtfvj/",
              "created": 1724386056,
              "depth": 2,
              "replies": [
                {
                  "id": "ljjl4uq",
                  "score": 19,
                  "body": "Foam is limited outside of the airports and helipads, due to the fact that the foam/s that we were using was found to be giving us cancer, similar to our gear, they've been slowly rolling out a new foam which in theory doesn't give us cancer but who can say until 10-20 years down the road. That's why you see only a handful of departments using the new foam and the rest relying on water and chemical extinguishers, since the old foam is banned in certain states",
                  "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljjl4uq/",
                  "created": 1724420135,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljkl3ov",
                      "score": 2,
                      "body": "> that we were using was found to be giving us cancer, similar to our gear\n\nDamn bro, try to stay safe. People shouldn’t be at risk of cancer for doing their job.",
                      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljkl3ov/",
                      "created": 1724431725,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljkme6o",
                          "score": 7,
                          "body": "The numbers might be different now, but I seem to recall the cancer rate in the fire service being around 68%-70% which along with cardiac related death is a leading cause of death in the fire service which is why both are considered line of duty. It's one of those often underlooked things with firefighting, along with the mental strain that often gets ignored while people focus on the physical strain of the job, not to mention the dwindling numbers of people actually willing to do the job and often underfunded departments.",
                          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljkme6o/",
                          "created": 1724432130,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ljow6ys",
                      "score": 1,
                      "body": "Not true we still have Class A foam",
                      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljow6ys/",
                      "created": 1724500094,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ljhugy4",
                  "score": 8,
                  "body": "I wonder if they dumped a bunch of sand on it it would help",
                  "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljhugy4/",
                  "created": 1724386551,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lji5iww",
                      "score": 3,
                      "body": "Sand is too porous and wouldn’t even put out a campfire. Copper powder and graphite powder seems like compounds that can do the trick against lithium fires but I don’t know how well that works on a larger scale and which is better with regards to being more eco friendly.",
                      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/lji5iww/",
                      "created": 1724392494,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljj90yw",
                          "score": 12,
                          "body": "> graphite powder \n\nUsing graphite powder in an uncontrolled manner sounds like a great way to give 20,000 cancer...",
                          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljj90yw/",
                          "created": 1724415504,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ljks70w",
                              "score": 2,
                              "body": "Graphite by itself is not a carcinogen. In any case, just hold your breath. It’s not like the smoke from the lithium fire is doing you any favors.",
                              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljks70w/",
                              "created": 1724433955,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lji86xd",
                  "score": 1,
                  "body": "The best you can do for a battery fire may just be letting it burn.",
                  "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/lji86xd/",
                  "created": 1724394111,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljkjcuz",
                      "score": 2,
                      "body": "Not great if the fire occurs on a bridge or near other infrastructure.",
                      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljkjcuz/",
                      "created": 1724431174,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ljzavqo",
                      "score": 1,
                      "body": "Not true.  Immersion is best. Commercial dumpster, front loader, and enough water to immerse the battery pack. Still not going to stop it immediately, but helps significantly. Dispose of properly.",
                      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljzavqo/",
                      "created": 1724657790,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ljjyat0",
                  "score": 1,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljjyat0/",
                  "created": 1724424525,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljzb7ti",
                      "score": 1,
                      "body": "Manufacturers recommend copious water at this point. Water Immersion is best. Commercial dumpster, front loader, and enough water to immerse the battery pack. Dispose of properly. Electrical issues are fixed with the short provided by water. It’s just a heat problem at that point, which water is great at dissipating into steam.",
                      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljzb7ti/",
                      "created": 1724658023,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ljowcvs",
              "score": 5,
              "body": "New techniques in dealing with lithium-ion battery fires is dumping wet sand on that, Phoenix fire department has pioneered this technique",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljowcvs/",
              "created": 1724500179,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljilram",
          "score": 5,
          "body": "Of course they are trained to handle stuff like this. What do you think they do? Sit on their hands and twiddle their thumbs? Lithium ion batteries have been around since the 90s and lithium battery fires (small and large), while rare, are nothing new.\n\n[https://www.firehouse.com/operations-training/article/21288860/firefighting-considerations-for-fires-that-involve-lithium-ion-batteries](https://www.firehouse.com/operations-training/article/21288860/firefighting-considerations-for-fires-that-involve-lithium-ion-batteries)",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljilram/",
          "created": 1724402866,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljj5kik",
          "score": 4,
          "body": "EV fires are way too rare for that to make sense. It'd be the same kind of overregulation we've seen in nuclear.",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljj5kik/",
          "created": 1724414033,
          "depth": 1,
          "replies": [
            {
              "id": "ljlu8h9",
              "score": 4,
              "body": "Big Oil gets it",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljlu8h9/",
              "created": 1724446236,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljkld95",
              "score": 1,
              "body": "It’s always over regulation until it affects you or your family. \n\nWith EVs becoming more common, people need to take preemptive steps.",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljkld95/",
              "created": 1724431808,
              "depth": 2,
              "replies": [
                {
                  "id": "ljo98w4",
                  "score": 4,
                  "body": "As the data clearly shows, EVs are much safer for people just like Nuclear is much safer than coal. Regulation is not about saving your family, it's about saving special business interests of a dominant industry and sacrificing your family's health to do so.",
                  "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljo98w4/",
                  "created": 1724484990,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ljpi2hd",
              "score": 1,
              "body": "Are EV fires rare? We are seeing several big ones a week worldwide.",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljpi2hd/",
              "created": 1724509357,
              "depth": 2,
              "replies": [
                {
                  "id": "ljtvhyg",
                  "score": 2,
                  "body": "Yes. 120x less likely than Hybrid fires, 60x less likely than ICE fires according to the data.\n\nThe reason you're seeing them is because they're the only fires being reported on. There are tens if not hundreds of big ICE/hybrid fires every day but media just doesn't report on them because they're nothing new.",
                  "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljtvhyg/",
                  "created": 1724574114,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ljkzlbb",
          "score": 1,
          "body": "After all those Cruze fires, yes surprising they aren’t better.",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljkzlbb/",
          "created": 1724436294,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lji2zzt",
      "score": 21,
      "body": "I live westbound about 30-40 miles of where this happened. There are multiple fires a year from big rigs in the summer. Mostly from the breaks catching the entire trailer on fire and spreading to dried grass on the road when they're coming down the mountain. This is the first one I've seen that's from an electric battery. 99% are from breaks catching on fire from regular 18-wheelers. Roughly 5-10 a year that potentially start wild fires. I think most happen right after Newcastle CA. Cal Fire should be better equipped to deal with it. It's funny that this happens once, and people go crazy. Not a word about the other break fires, though. Kudos to Cal Fire for not letting it spread.",
      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/lji2zzt/",
      "created": 1724391032,
      "depth": 0,
      "replies": [
        {
          "id": "ljj5sdh",
          "score": -2,
          "body": "Exactly. And hybrids catch fire more than twice as often as ICE, and 120x more often than EVs, yet we don't hear anything about that either.\n\nIt's pretty obvious who is paying media to selectively cover these EV fires...",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljj5sdh/",
          "created": 1724414128,
          "depth": 1,
          "replies": [
            {
              "id": "ljjeo4f",
              "score": 7,
              "body": "Agreed, EV fires are way less common then you'd think listening to the news media.\n\nYears ago Tesla agreed to start publicly reporting all the EV fires Tesla was involved in, but said that they'd only do it annually, as there's a lot of quarters where there's zero Tesla EV fires (such as the quarter prior to their announcement of this). \n\nThey even said that if they reported it quarterly that it would allow people to take the percentage numbers out of context to purposely mislead the public, like if it went from 1 fire a quarter to 2 the next quarter then they'd be screaming \"Tesla EV fires are up 100%!\".",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljjeo4f/",
              "created": 1724417753,
              "depth": 2,
              "replies": [
                {
                  "id": "ljpi8ep",
                  "score": 1,
                  "body": "Tesla has also been accused of hiding crash data, and we know Elon loves a good lie",
                  "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljpi8ep/",
                  "created": 1724509417,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ljk0pco",
      "score": 2,
      "body": "NTSB is going to be interested if only because they don't yet have anywhere near the volume of data on large EV fires compared to ICE. \nNot sure that warrants a headline.",
      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljk0pco/",
      "created": 1724425283,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljj5ht1",
      "score": 5,
      "body": "This is complete non-news. Last year in the US (as per the NTSB), hybrids caught fire more than 2x as often as ICE, while EVs caught fire 60x less often.\n\nWhy are we not hearing anything about these 3.5K fires per 100K hybrids sold? And even if EV fires are worse (which is debatable), they happen so rarely that it's not relevant.",
      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljj5ht1/",
      "created": 1724414001,
      "depth": 0,
      "replies": [
        {
          "id": "ljkb5pr",
          "score": 4,
          "body": "It's like shootings in Chicago, it's not \"new\" so it's not news.",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljkb5pr/",
          "created": 1724428578,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljkdryq",
          "score": 1,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljkdryq/",
          "created": 1724429402,
          "depth": 1,
          "replies": [
            {
              "id": "ljo9ci9",
              "score": 1,
              "body": "[The data is very clearly showing you're completely wrong.](https://www.carjunkya.com/electric-car-fire-statistics/#:~:text=Electric%2Dpowered%20vehicles%20have%20the,and%203.4%25%20for%20hybrid%20vehicles.)",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljo9ci9/",
              "created": 1724485058,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljpihfi",
          "score": -1,
          "body": "That data is mostly from Tesla who has been shown to not be reliable truth tellers.",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljpihfi/",
          "created": 1724509509,
          "depth": 1,
          "replies": [
            {
              "id": "ljtv3kb",
              "score": 3,
              "body": "NTSB is not Tesla. And how so?",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljtv3kb/",
              "created": 1724573842,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lji268u",
      "score": 4,
      "body": "thousands of trucks haul fuel and other very flammable products every day, how is a lithium battery less or more dangerous?",
      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/lji268u/",
      "created": 1724390569,
      "depth": 0,
      "replies": [
        {
          "id": "lji9r23",
          "score": 6,
          "body": "It's much harder to extinguish once it catches fire. The chemical reaction in the battery makes it so that it can reignite, even days later, even if you do end up extinguishing it. In other words, it's A LOT more dangerous.",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/lji9r23/",
          "created": 1724395092,
          "depth": 1,
          "replies": [
            {
              "id": "ljj6i5r",
              "score": 5,
              "body": "You mean it costs a lot more time to control, but it's A LOT less dangerous. Seeing as most injuries and loss of life occurs immediately after an accident, not hours later while firefighters are controlling the fire.",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljj6i5r/",
              "created": 1724414436,
              "depth": 2,
              "replies": [
                {
                  "id": "ljpidfp",
                  "score": 1,
                  "body": "How is a much larger and longer burning lithium battery fire LESS dangerous? You have that backwards.\n\nwww.teslafire.com",
                  "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljpidfp/",
                  "created": 1724509467,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljtveau",
                      "score": 2,
                      "body": "What's unclear about my comment? Most injuries/deaths from fires occur immediately after a crash. Lithium fires tend to take more time before they ignite, so it's more likely occupants are already out of the car by the time the fire starts. Whether a fire burns for 30min or 3 hours doesn't affect injuries. Nobody survives sitting in a burning car for 30 minutes anyways.\n\nAlso, battery fires aren't larger. Fuel has a much higher energy density so it burns fast and larger, just not as long.",
                      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljtveau/",
                      "created": 1724574046,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ljhrvk1",
      "score": 6,
      "body": "That firefighters in California a very wealthy state where the fire department should have good equipment yet cant put out these EV fires but Alabama firefighters can is very interesting.  What's going on here when underfunded old equipment using Alabama firefighters put these hot EV fires out fast yet California cant with all the EVs on their roads.\n\nI will say no more because I respect firefighters and had been a volunteer years ago but something is deeply wrong if California firefighters can't put these fires out.  The state is pushing EVs, get the firefighters the equipment and training.   Something stinks here as Alabama with very low number of EVs handled a EV fire like pros no waiting for it the burn out the put it out.",
      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljhrvk1/",
      "created": 1724385313,
      "depth": 0,
      "replies": [
        {
          "id": "ljhubhh",
          "score": 15,
          "body": "This article peaked my interest and I've been going down a bit of a rabbit hole. Funny enough it might be Alabamas preparedness for coal fires that also prepared them for EV fires. There's foam agents like F500 and Novacool that fire departments have when they need to be prepared for emergencies like coal magazine fires.",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljhubhh/",
          "created": 1724386478,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lji5w8f",
          "score": 8,
          "body": "Probably because of battery size. Tesla model 3 is 50-80kwh where as the semi heavy is 850kwh. So at 10x or more the size of a passenger EV battery it probably burns hotter longer and would take a lot more fire retardant (or water) to control and put out. Some fire departments also have guidance to let the batteries burn themselves out if it’s not a danger to the surroundings due to how difficult it is to put the fire out once it starts.",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/lji5w8f/",
          "created": 1724392713,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lji2imu",
          "score": 3,
          "body": "Have you lived in California at all? The state taxes the hell out of people but al the infrastructure and public services are extremely questionable. Plus, cops don't show up most the times in major cities when you call them. Only good community maintenance you see is in super wealthy areas or destination towns like lake tahoe. I wouldn't be shocked if everything gets audited 50 years from now and it turns out california is the most inept and corrupt state at of the 50.",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/lji2imu/",
          "created": 1724390761,
          "depth": 1,
          "replies": [
            {
              "id": "lji5vy1",
              "score": 10,
              "body": "California is like anywhere else; some of the infrastructure is amazing. Some of it sucks.",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/lji5vy1/",
              "created": 1724392708,
              "depth": 2,
              "replies": [
                {
                  "id": "ljipy15",
                  "score": -4,
                  "body": "Yes, everywhere is exactly the same. In Singapore some of the infrastructure is amazing, some of it sucks. In Somalia some of the infrastructure is amazing, some of it sucks. Goverments don't make a difference.",
                  "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljipy15/",
                  "created": 1724405587,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ljixk6g",
          "score": 1,
          "body": "Alabama has a lot more industry. The fighters there likely are more experienced with metal and weird chemical fires than in California.",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljixk6g/",
          "created": 1724410153,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljl6okm",
          "score": 0,
          "body": "Exactly. Republicans ran their stares into the ground. ",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljl6okm/",
          "created": 1724438568,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljhznhc",
      "score": 1,
      "body": "Ye I was there. 6 hr trip turned into 12hr trip",
      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljhznhc/",
      "created": 1724389185,
      "depth": 0,
      "replies": [
        {
          "id": "ljkfpbl",
          "score": 1,
          "body": "No It did not this would not have taken 6 hours to get by😂",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljkfpbl/",
          "created": 1724430015,
          "depth": 1,
          "replies": [
            {
              "id": "ljnn0mn",
              "score": 2,
              "body": "Well the highway I15 was shut down, and the alternate route actually had a terrible traffic jam",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljnn0mn/",
              "created": 1724471780,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ljjhbjb",
      "score": 1,
      "body": "I am waiting to see the liability for a TESLA caused wildfire in California.",
      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljjhbjb/",
      "created": 1724418751,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljuhnis",
      "score": 2,
      "body": "KULR thermal",
      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljuhnis/",
      "created": 1724588147,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljhczja",
      "score": -12,
      "body": "They are a really stupid idea.",
      "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljhczja/",
      "created": 1724379094,
      "depth": 0,
      "replies": [
        {
          "id": "ljhgseu",
          "score": 17,
          "body": "They ignite 5 times less than regular cars",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljhgseu/",
          "created": 1724380582,
          "depth": 1,
          "replies": [
            {
              "id": "ljj5xde",
              "score": 7,
              "body": "Actual number as per NTSB are:\n\nHybrids caught fire at a rate of 3,475 per 100k sold\n\nICE vehicles at a rate of 1,530 per 100k sold\n\nEV's at a rate of 25 per 100k sold\n\nSo 120x less than hybrids, 60x less than ICE.",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljj5xde/",
              "created": 1724414187,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljhqpf1",
              "score": 2,
              "body": "And are far worse when they do. ",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljhqpf1/",
              "created": 1724384769,
              "depth": 2,
              "replies": [
                {
                  "id": "ljj65tb",
                  "score": 2,
                  "body": "That's extremely debatable. EV fires rarely happen instantly after a crash. It usually requires some kind of runaway effect. ICE/Hybrid cars tend to ignite on impact, with typically much bigger consequences to humans in or around them.\n\nEV batteries are more difficult to put and keep out though, that's true. I prefer wasting some firefighters' time over people doing though.",
                  "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljj65tb/",
                  "created": 1724414288,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ljhv1z1",
                  "score": -8,
                  "body": "You have to let them burn and spread that cancerous smoke because that chemical fire is impossible to put out, also ”they ignite 5 times less” yeah, EVs are a fraction of the total combustion engine cars in existence.",
                  "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljhv1z1/",
                  "created": 1724386832,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ljhka2c",
              "score": -5,
              "body": "Nice, so we'll have 1400 of these glorious unstoppable fires that burn for hours every year.  That's good, lots of people should get a chance to see them.",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljhka2c/",
              "created": 1724382005,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljhhr73",
          "score": 3,
          "body": "According to one of the biggest semi truck manufacturers, they estimate 7000 semi truck fires every year.  \n\n[Prevent Truck Fires - Penske Truck Leasing](https://www.pensketruckleasing.com/resources/resource-library/truck-fires/)",
          "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljhhr73/",
          "created": 1724380974,
          "depth": 1,
          "replies": [
            {
              "id": "ljhssdi",
              "score": 10,
              "body": "1.5% of all gas vehicles catch fire during their lifetime. I thought that was pretty crazy...\n\noh and in case anyone is wondering, 0.025% of EV's catch fire, and not all of those are going to be battery fires",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljhssdi/",
              "created": 1724385749,
              "depth": 2,
              "replies": [
                {
                  "id": "ljiirrr",
                  "score": 3,
                  "body": "That seems insanely high..",
                  "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljiirrr/",
                  "created": 1724400861,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ljhmngg",
              "score": 3,
              "body": "Penske isn’t a heavy truck OEM",
              "permalink": "/r/stocks/comments/1ez0u00/roadside_tesla_semi_fire_where_temperatures/ljhmngg/",
              "created": 1724382991,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}