{
  "title": "Do you also have these \"mental traps\"?",
  "score": 94,
  "selftext": "I've been investing for one year, so I consider myself a newbie. I completed a 3-month course on investing and decided to go all in. So far, I’m up 20% on my trial-and-error portfolio. What I’ve noticed through this process is that I'm extremely irrational—yeah, I said it out loud...\n\n* It's hard for me to invest in my targeted positions when my stocks are going up (for example, Rocket Lab recently). I\n* I prefer to add to my positions only during dips; I just can't make myself stick to dollar-cost averaging. I have monthly allocated cash to invest, which I keep aside earning 5% interest until I see a dip.\n* I'm unhappy when the market goes up because I feel I \"missed\" the chance to buy at lower prices companies on my watchlist. \n* The bigger the sum in my investment account, the more nervous I feel about \"recessions\" and \"corrections.\"\n\nFrom my point of view, these are all mental traps. Does anyone else experience this, or is it just my mind playing tricks on me? How can I get rid of these feelings?\n\n  \np.s.: I’m open to any feedback, but please be kind in your comments. I'm already feeling like I am an idiot 😆 ",
  "link_flair_text": null,
  "id": "1f0100i",
  "num_comments": 52,
  "created_utc": 1724490288,
  "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/",
  "comments": [
    {
      "id": "ljolmvx",
      "score": 47,
      "body": "It's normal to have these feelings!\n\nWhat you need to learn is about the patience. Start thinking about long-term investments, like 10 years or more.  \n\nTherefore, zoom out on the graphs and you will understand that when we are patient, we overcome all the depths of the market.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljolmvx/",
      "created": 1724493665,
      "depth": 0,
      "replies": [
        {
          "id": "ljpme1j",
          "score": 6,
          "body": "Great advice. I have missed some \"obvious\" short-term gains because I didn't have the cash and didn't want to sell any of my long-term holdings.  I've also experienced \"obvious\" short-term plays that took so long to play out, they didn't appreciably beat the index.\n\n\nLook at long term charts and think about long term returns. \n\n\nThe real enemies are STRESS and ANXIETY. They'll kill you before you can spend that extra 1 percent you made over index funds.",
          "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljpme1j/",
          "created": 1724510905,
          "depth": 1,
          "replies": [
            {
              "id": "ljq622i",
              "score": 4,
              "body": "NVDA is up 30% in a few weeks and this guy is talking about 1% alpha",
              "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljq622i/",
              "created": 1724517610,
              "depth": 2,
              "replies": [
                {
                  "id": "ljq6ob6",
                  "score": 4,
                  "body": "Selection bias. Over the course of your life you're not making 30 percent alpha",
                  "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljq6ob6/",
                  "created": 1724517819,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljq7r6n",
                      "score": 1,
                      "body": "Not with that attitude",
                      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljq7r6n/",
                      "created": 1724518184,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljrs3bn",
                          "score": 4,
                          "body": "Yeah I'm way over for the last decade or so, but I try to remain humble and convince myself Bogleheads are right in the long term.",
                          "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljrs3bn/",
                          "created": 1724537779,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ljoula9",
      "score": 33,
      "body": "These are not traps brother. You shouldn't want to get rid of these feelings. I have been investing in stocks for 15 years and have been very successful and I experience all of these feelings and recognize them as part of the advantage to my success(I recognize there are many different, and sometimes contradictory ways to be successful at investing). Part of being successful in investing is balancing different emotions and avoiding bad habits. If you got rid of these so called \"traps\" the likelihood that you become reckless will increase. \n\nWhen I buy into a company, I start with a little. If it goes up, then it goes up, I let what I have ride. I am not FOMOing into more shares just to watch the stock go back down to a lower price. If the stock goes up so much then it's still a win, just a smaller win. Sometimes you do miss out when you start a position at say $80, watch it go to $120 and then 6 months later you are buying more shares when it dips to $100. Or it doesn't dip and you never buy more shares. But that's ok. More often than not it wins out in the long run. You reference Rocket Lab, I just looked the stock up this is the 3rd time the stock has Ran up to $7+, guess what the other 2 times the stock price was in the $4's not too soon after. So if you bought Rocket Labs at $7 then because you were afraid you missed the rocket, well you would have made a bad investments. If you waited till after they dipped to $5, then you would have made a better investment. If you wait for Rocket Lab to dip to $5 again and it doesn't go that low this time, well atleast you didnt make a bad investment and your goal is to not make bad investments. There are infinite number of good investments you will miss out on, get used to it. If you want to buy at $7, just buy a small position so if it goes down you can buy more. I recently did that with Applovin. Bought a small amount of shares around $84 only to pick up more shares in the low $70's a few weeks later. Now it's at $90 and it's around 1.5% of my portfolio(I only own 12 stocks). I would like to own more shares but no way I buy more shares after it went from $70 to $90. Do I think it's a good investment at $90? It doesn't matter, habits and discipline are more important. I will just have to be happy with my 61 shares. \n\nYou should see my META purchase history, 10 shares, 5 shares, 5 shares, 2 shares, 5 shares, 3 shares, 10 shares, 15 shares, 30 shares, 5 shares, 2 shares, 1 share, etc. This was 250 shares all the way down as the stock dropped from $375 down to $90. But when I first opened my position in META it was for about $330 after a drop and I thought it was a pretty solid investment at $330, my final average cost was about $160. I never bought more as it went up. I originally bought at $330, why wouldn't I buy when the stock went from $90 to $150? Because I don't want to develop FOMO habits. I did buy a few times like in April when it went down from $525 to $430. So that means I trimmed shares at $270 but a year later I'm happily buying some more at $440? Doesn't make sense does it? But it does if you are thinking about protecting your emotions and habits. Because almost every time a company you want to invest in has their stock price increase, you think it's going to shoot up more, only to be wrong more often than not. So it doesn't matter what you think or feel at the moment. Protect your emotions and habits at all costs.\n\nI get excited when the stock market goes down too. This is good because it helps counter the negative feeling that is created as your portfolio is losing value. Just like when you start a small position, if the stock goes up you made a good investment so you are happy but if the stock goes down you are happy because you can buy more at a cheaper price. That means your emotions will be balanced no matter what direction the stock goes. Protecting your emotions is very important. \n\nI tell myself my portfolio is worth less than it is. So currently it's $353,000. I'll just tell myself I have about $300,000. Every year I keep track of the lowest and highest values for my portfolio and I tell myself I am just focused on raising my lowest value each year, not growing my highest value. It's just mental games. \n\nA lot of people on here will not understand what I am saying. They think that when you buy stocks you are trying to find the best investments, but the reality is you are trying to avoid the bad investments. And these feelings you currently have will greatly increase your chances of avoiding the bad investments if you accept them for what they are. \n\nI would like to add that my education is in business and I am very good at understanding business models relative to the average investor and I only buy companies with attractive valuations so that helps a lot. What I did with buying META If you just blindly did that with Peloton or Unity or Beyond Meat or any other way over priced stocks you would be a very bad investor. If anyone reading this is a momentum investor, everything I just said may be of negative value to them. But I have a feeling everything I said will be of value to you because you have the same emotions that I do. It took me about 7 years of investing to finally realize I was much better than most investors. Now after 15 years I'm almost arrogant about it but that's because I know these emotions we were gifted with keep our investing habits in check.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljoula9/",
      "created": 1724499232,
      "depth": 0,
      "replies": [
        {
          "id": "ljpqoml",
          "score": 3,
          "body": "> I get excited when the stock market goes down too. This is good because it helps counter the negative feeling that is created as your portfolio is losing value. Just like when you start a small position, if the stock goes up you made a good investment so you are happy but if the stock goes down you are happy because you can buy more at a cheaper price.\n\nMy problem is, the money I have on the sidelines is not even 1 percent of my portfolio. So, if the market crashes, I can't really take advantage of anything, because I'm already \"all-in\".\n\nI suppose the solution to this problem would be:\n\n1. Make way more income than I currently am\n2. Liquidate a percentage of my portfolio into a cash position that can take advantage of major downswings\n\nBut, I have problems with both of those ideas...\n\nFirst off, I'm currently 53 years old and I'm hoping to actually retire in like one or two years and do some traveling. I haven't taken any vacations in five years! I've basically been avoiding vacations, because I know that when I retire, I might do some international travel, spending 90 days in various countries (on the cheap).\n\nSo, at this point in my life, trying to drastically improve my income isn't going to happen.\n\nThe other option, selling out of a percentage of my portfolio, into cash and maybe just keeping 10 or 15 percent of my portfolio in cash, so that I have some dry powder to take care of rare opportunities with flash crashes and whatnot....\n\nThe problem with this, is that when the market is really taking off, I feel like a serious dumbass having 10 to 15 percent of my portfolio not enjoying any of that.\n\nThe other thing is, I did have a cash position of this amount, but bought some stocks on a dip, and now I don't have it anymore. Should I really be forcing myself to sell out of another position to try to re-up on that 10 to 15 percent cash position? What if I have no other positions that make sense to sell at this current time?",
          "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljpqoml/",
          "created": 1724512401,
          "depth": 1,
          "replies": [
            {
              "id": "ljqlnl0",
              "score": 3,
              "body": "That's not a problem at all. We all know that having your money in the market beats having your money out of the market way more often than not. With that established that means we know you are doing the right thing by having 95%+ in the market at all times no matter how you feel over any short period of time. I do the same thing as you. I work in film so my income comes in waves and then can also be dry for months. Sometimes the market goes down and I am actively pulling money out to pay rent, it's a short term risk that works out more often than not. Usually I have less than 1% of my portfolio in cash.\n\nSo with that strategy of being 95%+ in the market at all times established what we are now mostly trying to deal with is not letting the short term emotions of a dip/crash change our long term winning formula of keeping money in the market. We know also from science that the number of actions affects your emotions way more than the weight of them. So if you buy small amounts of shares of stocks as they dip this will have almost as much of an effect of alleviating your negative emotions than if you were making large purchases with more cash. So instead of dumping all your  money into 20 shares at a 10% dip. Buy 5 shares, see where it goes, If it goes down more buy 5 more shares, maybe another 5 shares. Maybe you don't even spend all of your cash because the market goes back up. That's ok because you are already 95%+ in the market.\n\nIf it's a bigger crash like in 2022. You will ultimately end up burning all of your dry powder and if it keeps going down maybe you start to pull a little bit of money out of your bank account just to buy 2 more shares. Maybe you call your brother that has horrible financial sense and tells him to buy META at $90 right now! Just to make you feel better because you have no money left to spend. It's all about keeping your short term emotions from self sabotaging you.\n\nAnother thing you can do, that doesn't require you to carry cash is to sell less volatile stocks to buy other more attractive stocks during a dip. In 2022 I trimmed some of my AAPL shares multiple times because it didn't really go down for a while even though the broader market was down 25+%. I used it to buy META shares that was down 40, 50, 60%+. META ended up being so attractive I sold off all of my All State, Waste Management, Williams-Sonoma and Marriott shares during their dips(Which are great companies that I would have been happy to hold long term) just to buy way more META shares and more CROX shares. All 4 of those stocks have done well since I sold them, but not even half the return that META has had over that time and not quite as good as CROX. Had CROX not gone down below $70 and instead of around $120, who knows I may have sold CROX to buy more Marriott. As META was going up I started trimming some of those shares to buy VZ, WSM(much lower than I had sold it for), and MO. I didn't end up pulling the trigger, but when the recent dip happened I was getting ready to start trimming some MO and VZ to buy more META, GOOGL, PYPL, etc. Whatever revealed itself as the most attractive. What those Dividend stocks allow me to do is collect a 7-10% dividend and then possibly trade a small dip in a stock for a big dip in another stock I like. (Or in this recent case MO actually went up while market went down) To me that is the best of both worlds of being fully leveraged into the market, but also being able to make advantageous trades during a big dip in the market.\n\nWith all of that said, it's all to help combat the feelings that try to sabotage the clear long term strategy of being fully leveraged into the market at all times. And I think you are doing a great job, don't worry that you don't have as much dry powder for a dip as you would want during a dip because you can't build a short term strategy that contradicts your long term strategy in investing.\n\nEdit: I would just like to add there is nothing wrong with having times where you are not in a rush to put your 5% cash to work because nothing seems attractive. There will be times where you feel so strongly that no investment is a guaranteed good investment at the moment and that can override your desire to be fully leveraged into the market. That's ok. The point is you don't want to build habits of constantly feeling like you need to have 20% in cash for a dip.",
              "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljqlnl0/",
              "created": 1724522790,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljp8v89",
          "score": 1,
          "body": "These is gold comment. Loved everything you said.",
          "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljp8v89/",
          "created": 1724505840,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljs7gmf",
          "score": 0,
          "body": "Do You recomend any book? Specially for understanding business? Thanks, begginer here.",
          "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljs7gmf/",
          "created": 1724543787,
          "depth": 1,
          "replies": [
            {
              "id": "ljsijgq",
              "score": 1,
              "body": "I don't unfortunately. That is not how I learned. I was a terrible reader growing up but I went to business school and I thrived on absorbing lectures and participating in class discussions. I've always loved math, strategy, psychology, and most importantly being hyper driven to understand everything. If I didn't understand something I would just start researching it. I wish I had a short cut so you could learn a lifetime of lessons in a couple books but I don't know if that shortcut exists. I learned about business long before I started buying stocks. I do have a duffle bag full of all my business school text books that I want to get rid of but find it really hard to throw them out. You can have those. lol \n\nYou can't go wrong listening to Warren buffet and Peter lynch's lectures though and just eternalizing the concepts they talk about. Also listening to earnings calls you can absorb strategies that companies are trying implement to better understand their thought process. I go on walks and just listen to earnings calls. What I would not do is try to learn from articles because I would say about 95% of articles I've read online the author completely misunderstands what a companies strategy actually is or what effects an event will have on a company's long term prospects, etc. I can't tell if they are purposely spreading false information or they are just morons. \n\nWith all that said I'm sure the best thing to do if you want to read books is start to read books. You will be way better at understanding business by your 3rd or 4th book than you ever will by waiting for the greatest 1st book ever to read. Good luck out there.",
              "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljsijgq/",
              "created": 1724548318,
              "depth": 2,
              "replies": [
                {
                  "id": "ljsjc3u",
                  "score": 1,
                  "body": "Hello, thanks for the advice. I am more of a reader and I'm just starting out. Yes, reading helps a lot. Although there are always times when some topics make you lazy, but you have to force yourself to do it. It's good that you have been able to stand out as an investor, not everyone does.",
                  "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljsjc3u/",
                  "created": 1724548650,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ljpf1sf",
      "score": 9,
      "body": "Trading psychology is why buy and hold VOO outperforms 90% of traders.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljpf1sf/",
      "created": 1724508239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljq3b90",
      "score": 7,
      "body": "> So far, I’m up 20% on my trial-and-error portfolio.\n\nVOO is up 28% in the last year.  Just an observation.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljq3b90/",
      "created": 1724516661,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljoqdis",
      "score": 6,
      "body": "This sounds exactly like me. I wasn’t able to deal with all of these internal “discussions “. That’s why my money is all invested in mutual funds, and diversified. BUY AND HOLD.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljoqdis/",
      "created": 1724496792,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljolpsq",
      "score": 17,
      "body": "I also pretty much only use the dip buying/averaging down strategy. If you want to invest like this, it's extremely important you adhere to it and do not impulse buy if a stock you were watching misses your target price and rebounds or average up once it surges. I also have Rocket Lab shares but only 1000 but could have bought a lot more, so the hindsight stings a little.\n\nThe benefit of the buying low strategy is the potential upside both short and long term. On the other hand you are at risk of buying garbage that will go down forever, so be very picky with what you buy and at what price. Only the best deals e.g. RKLB below $4 or PayPal below $60 or solid cyclical companies at the trough of the cycle.\n\nThe main thing to remember that the first rule of investing is not making money, it's about not losing money. FOMOing into a pump or buying garbage companies with no future is a nice way to lose money. Sometimes it takes losing some money to learn this.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljolpsq/",
      "created": 1724493720,
      "depth": 0,
      "replies": [
        {
          "id": "ljqtc44",
          "score": 5,
          "body": "I have always feared losing a substantial sum of money much more than missing out on upside. Especially if the upside is being driven by vibes/multiple expansion.\n\nPeople say 'just zoom out', but you won't feel like that if you're down 50% on your money and counting. Nobody plans to sell low but many do. Never disrespect risk",
          "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljqtc44/",
          "created": 1724525333,
          "depth": 1,
          "replies": [
            {
              "id": "ljr8uqr",
              "score": 3,
              "body": "> I have always feared losing a substantial sum of money much more than missing out on upside.\n\nThis is pretty universal, it is called \"loss aversion\" and it's a hallmark of human risk analysis.",
              "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljr8uqr/",
              "created": 1724530724,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ljp1yrn",
      "score": 3,
      "body": "I don't tend to think about DCA or averaging down -- each transaction is separate, even if they're into the same stock.  I track them separately too.  Anything else tends to lead to sunk cost fallacies.\n\nFor a fun example... QQQ in Jan 2022, currently 9.7% annualized return.  QQQ in May 2022, currently 26% annualized return.  \n\nI tend to look at my performance relative to a broad fund, because that's my opportunity cost... I don't really even pay attention to whether the market went up vs down.  Yesterday, my portfolio returned the exact same 1.08% as VOO.  In the last year, I have about 6.5% excess returns relative to the S&P 500.  Going back 7 years, I'm about 3% excess returns per year.  \n\nUsing the previous example, 9.7% for that QQQ buy vs 7.2% for the S&P 500, and 26% vs 17.1% for the S&P 500.  So both are in the black relative to an S&P 500 index fund, but by very different amounts.  \n\nI do pay attention to what I think markets will do in the future... Like if I'm antsy about a market downturn, I might aim for lower beta, high alpha stocks, or stocks with low correlation to the market as a whole.  If things have already shit the bed, then I'm more likely to look at high beta stocks that I think took a short term beating.  \n\nAfter a while, you stop worrying too much about corrections and recessions, at least WRT portfolio.  Recessions give me anxiety because I was out of work for a year back during the 2008 recession and it suuuucked.  But for the portfolio?  Between my 401k, IRA, and brokerage account, I can lose more in a day than I make in a month.  Since I'm not intending to live on that money yet, it's all just... numbers.  The numbers just get more insane as you accumulate wealth.  Like my retired mother lost more in 2022 than I made in 2022.  And despite saving more money in 2022 than any other year in my life, my NW went down.  Whatever.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljp1yrn/",
      "created": 1724502887,
      "depth": 0,
      "replies": [
        {
          "id": "ljptsuc",
          "score": 1,
          "body": ">I don't tend to think about DCA or averaging down -- each transaction is separate, even if they're into the same stock. I track them separately too.\n\nI do the same thing. I've bought GOOG like 6 different times, but I track each of those 6 purchases like they're a separate stock. For me, it's more of an OCD thing, about knowing how my \"real\" investment is doing.\n\nWhat I mean by \"real\" investment, is that if you bought Google at $185, $145, $90, $95, etc, then average all of those out for your average cost basis, then your purchase of the shares at $185 looks better than it should, and your purchases at $90 look worse than they should, because everything is just averaged in.\n\nI don't like that.\n\nI want to know how each individual investment is doing, in a vacuum. Each time I bought, I had a particular thesis and a particular idea of why I was buying at that price at that time. I want to know how each instance is doing. Not all of them added together and averaged out.\n\nI can do that too, just to be aware of what my overall cost basis is, across all purchases, but I love keeping track of each individual entry/exit.",
          "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljptsuc/",
          "created": 1724513464,
          "depth": 1,
          "replies": [
            {
              "id": "ljqozsz",
              "score": 1,
              "body": "The line for me is that I don't bother to count dividend reinvestment as its own trade -- it's just part of the original investment and lowers the cost basis as far as my tracking is concerned.  FWIW, GOOG cost basis for me is $46 :-)",
              "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljqozsz/",
              "created": 1724523886,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ljpi8xb",
      "score": 4,
      "body": "Check the year over year gain or loss once a quarter. That's probably the shortest time frame that isn't primarily market noise. \n\nMore often than that, don't look at the charts, look at the hard news. M&A activity, ratings upgrades/downgrades, lawsuits, adverse weather events, activist investor interest, and changes in laws and regulations are all things that are not tied to the normal schedule of earnings reports and SEC filings. Those are all the kinds of things professional analysts watch for when recommending buy/hold/sell. If you don't understand why a price is rising or falling, you are following the herd, not leading it.\n\nIf you don't feel you can do that each quarter for each stock in your portfolio, either trim the number of stocks you hold, or put your money in ETFs.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljpi8xb/",
      "created": 1724509422,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljpb09v",
      "score": 3,
      "body": "Funny that I think quite opposite to you.  If a stock goes up by a very large amount over a long time, you want to have as large a position as possible and it makes total sense to add to your positions as cash becomes available.  If a stock goes down a lot over time, the worst possible strategy would be to add to your positions.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljpb09v/",
      "created": 1724506687,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljpvgk3",
      "score": 3,
      "body": "If your portfolio is balanced towards value it doesn't matter what JPow decides. Lower rates aren't a question of if they are a question of when.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljpvgk3/",
      "created": 1724514018,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljqbetj",
      "score": 3,
      "body": "Watch Ben Felix on YouTube, especially \"how bond are hurting your portfolio\", \"is the stock market overvalued\", and find his suggested portfolio by searching Ben Felix Portfolio.  Its all backed by studies, and its all simple and boring.\n\n\nLeave the meme stocks and 100% SPY to the speculators.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljqbetj/",
      "created": 1724519418,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljqdy8e",
      "score": 3,
      "body": "Yeah good luck. \n\nStopped reading after your first bullet point. \n\nIf it's a \"life savings\" thing, seek professional help.\n\nIf you're under (realistically) 35, learn more about fundamentals and....\n\nSide note: I cut myself off there. You're probably a long term investor. \n\nMy advice: understand that significant shifts in the value of an asset are very quick. \n\nBe prepared to see the + go to a -, don't sell and keep investing [general advice].",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljqdy8e/",
      "created": 1724520248,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljsde9s",
      "score": 3,
      "body": "There are only 2 types of traders/investors in the entire world. Trend followers and reversion to the mean people. Trend followers see a trend and jump on board, keep buying. The S&P going up for 40 years is a trend. Reversion to the mean people buy the dip and sell the rip. Value investors wait for a low price, and many other situations. It's extremely difficult for a person to change from one to the other.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljsde9s/",
      "created": 1724546179,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljohnew",
      "score": 5,
      "body": "I have all but the last one because if that happens, I would still have time to recover, so I would actually add more.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljohnew/",
      "created": 1724490872,
      "depth": 0,
      "replies": [
        {
          "id": "ljohs47",
          "score": 1,
          "body": "Really? How do you deal with those feelings?",
          "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljohs47/",
          "created": 1724490963,
          "depth": 1,
          "replies": [
            {
              "id": "ljoiu85",
              "score": 5,
              "body": "I am still learning how to deal with them.\n\nThis year has been the biggest lesson in terms of not letting your emotions affect your judgement. I did the most common mistakes for beginners:\n\n- I sold one position at a small gain because I feared that it was going to lose in the long term and instead I missed out on massive gains because it recovered and rose more.\n- I chased the price down on one stock that I have high confidence in the long term, but I invested in it too soon without understanding the business and the company stage. So I have a holding price that is higher than what I could have had for the same size if I only waited and did my research before buying in the first place.\n\nBut I take these lessons and I will remember them in future to avoid making the same mistakes.",
              "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljoiu85/",
              "created": 1724491712,
              "depth": 2,
              "replies": [
                {
                  "id": "ljovw34",
                  "score": 2,
                  "body": "Sometimes you will need to hedge on your emotions not on your investments. Trim 2-5% after a big jump up. Does that change your total return that much? Not really. But it will balance out your emotions quite a bit. If the stock goes down you will feel like you trimmed at the right time (Maybe even buy back in if it's a big enough drop) but if the stock goes up more you will be glad because you gained more on the 95%+ shares you kept. The end result to your portfolio is negligible but the end result to your emotions will be great.",
                  "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljovw34/",
                  "created": 1724499934,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljp048a",
                      "score": 2,
                      "body": "Good advice",
                      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljp048a/",
                      "created": 1724502017,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ljovsll",
      "score": 3,
      "body": "This is the psychology of trading, and why it is recommended to just invest in broad market etfs like VOO, and have automatic deposits/buys every pay check. Doing anything else, you will likely underperform the market.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljovsll/",
      "created": 1724499883,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljpmhy5",
      "score": 2,
      "body": "Im 2 years in. I think it gets easier weathering the events as you add experience and go through it. Its very stressful at 1st but  that fades",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljpmhy5/",
      "created": 1724510943,
      "depth": 0,
      "replies": [
        {
          "id": "ljpul2g",
          "score": 4,
          "body": "Yeah, especially if you can survive a particularly nasty down market. Like late 2022 for tech stocks.\n\nIn late 2022 I was down on paper more than 200k!\n\nI was pretty depressed during that time, NGL. \n\nBut... making it to the other side of the rainbow is HUGE. When we had that recent red Monday and it was starting to look like everything was going to collapse again, I wasn't nearly as depressed as I would have been had I not survived late 2022. \n\nI knew that if I made it out to the other side after 2022, I can do that again. At least, that's what you're hoping. Nothing is guaranteed. There can always be a black swan event that ruins everything.\n\nBut I feel like I can weather basically any storm now. I've seen shit at it's worst.",
          "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljpul2g/",
          "created": 1724513728,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljqfymj",
      "score": 3,
      "body": "Mental traps... thats what I thought too when I started.\n\nFast forward about 15 years and I greatly outperformed the indecies. Not saying you get the same performance but those things you mention above were also thing that bothered me. Now, I dont think they are mental traps at all. I literally call those things risk mitigation. Risk mitigation is one of the reasons I out performed. The other is...\n\nThough inadvertent, those \"mental traps\" actually resulted in you being patient. Guess what one of the keys to success is?\n\nYour last two points go away with more experience because you will witness more cycles. There will always be more companies to buy and even if they go down, they will eventually come back up, assuming you picked solid companies and not just fluff hype stocks.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljqfymj/",
      "created": 1724520907,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljsf5nb",
      "score": 2,
      "body": "> Please be Kind\n\nSums it all up. Your being too emotional.\n\n• If stocks are going up, better to invest in them on the way up than on the way down.\n\n• Anybody who's DCA'd for a period of time will confirm, trying to time DCA's will have you loosing money in the long run\n\n• Do you feel you missed out when the market went down? You can't have it both ways. Acceptance is where its at.\n\n• This is Natural.\n\nThey're not mental traps, they're emotional traps.\n\nRemove your emotions from doing business.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljsf5nb/",
      "created": 1724546907,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljtg6bj",
      "score": 2,
      "body": "I have a broker manage my account so i don't do any irrational things.  I started using him last year and i am up 48%  If you are becoming irrational then i think you should look into at least a finance planner that can possibly help you.  Or you can study companies and pick what ones you like from the data you find.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljtg6bj/",
      "created": 1724564221,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljots8l",
      "score": 2,
      "body": "Point 1, This is a hard one to overcome. I usually help this by selling put options which give me so money for picking good stocks.\n\npoint 2, Yes I do the same thing but having the put options usually means if their is a dip, those options will be exercised and I will own the stock. \n\npoint 3, If you are managing 100% of your assets, then this feels bad. I have been maxing out my 401 for a long time so I have a substantial amount of money that follows the general market trends. It is usually doing fine so a am not upset.\n\npoint 4. Oh this one is so difficult but you have to get a better perspective. You are investing which is a process 50% of people will never do. Once you join the top 50% and start accumulating wealth, you will keep climbing the ladder if you stick with a plan. Once I got to 20K in my brokerage account, I felt confident that even the worse drop would not go below 10K. then I got to the 200K threshold and then the 1M threshold and it just keeps climbing.\n\nI will tell you this, if you are young, there will be large negative drops in the stock market when fear is very high. ie Covid, If you have money and you can buy in those frightening times, you will be rewarded handsomely in the future.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljots8l/",
      "created": 1724498784,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljpbnlv",
      "score": 2,
      "body": "Invest every month in broad market ETFs, check your balances no more often than once a month, and be patient. Do this and you will become rich in a few decades. If you are trying to time the market or are buying in and out of individual stocks, you are speculating, not investing.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljpbnlv/",
      "created": 1724506941,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljp0fj9",
      "score": 1,
      "body": "Yes, same for me.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljp0fj9/",
      "created": 1724502166,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljs0tlv",
      "score": 1,
      "body": "> The bigger the sum in my investment account, the more nervous I feel about \"recessions\" and \"corrections.\"\n\nFYI, large your portfolio the more you'll get mentally prepared for \"big\" movements up and down. i.e if you have a million dollar portfolio then movements up and down of $10,000 are literally just a 1% movement, which will happen fairly often.\n\nAlso just because a stock or ETF has gone up from where you bought it doesn't necessarily mean that it's too expensive now. You need to do some analysis to determine if it's overvalued or not. The S&P500 beats the average investor because it's a strategy that involves throwing more money at your existing holdings even if they've gone up a bunch already. A good business with strong fundamentals SHOULD rise in price over a long time period, and should outperform the index overtime if it's a really good business that keeps consistently growing their earnings faster than the index.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljs0tlv/",
      "created": 1724541176,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljtnsh1",
      "score": 1,
      "body": "I *still* don't really understand the advantage of consistent DCA vs. only buying during dips; It just feels so unintuitive. I ended up splitting my portfolio into 4 accounts:  \n  \nMoney Market - General stock investing.  \nCapital Incubation - Daily ETFs and short-term gambles where the gains are skimmed off and diverted to longer term investments.  \nDigital Resource Securities - Crypto ETFs and mining companies.  \nCryptographic Brokerage - BTC I hold purely for dollar value and have no interest in moving to an external wallet.  \n  \nI let myself \"break the rules\" somewhat in \"Capital Incubation\" as long as I don't fall too close to the initial balance.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljtnsh1/",
      "created": 1724568966,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lju2xe8",
      "score": 1,
      "body": "\"It's hard for me to invest in my targeted positions when my stocks are going up (for example, Rocket Lab recently).\"\n\nIt's difficult for me to invest in something that is going up in a way that's basically moon-ing in the very short term with an RSI of 70-80+. I just think I'll get a better opportunity - mostly a better opportunity happens, occasionally it doesn't. \n\n\"I'm unhappy when the market goes up because I feel I \"missed\" the chance to buy at lower prices companies on my watchlist.\"\n\nFor me, I like to go to my risk tolerance and stay close to that. I'm almost always fully invested - the only times when I'm not is when I'm making large scale renovations (if I have a large % of the portfolio in a theme and I want to exit that.) If I'm close to risk tolerance, then that leaves room for smaller additions, but there's not much FOMO/\"missed out.\" \n\n\"The bigger the sum in my investment account, the more nervous I feel about \"recessions\" and \"corrections.\"\n\nThat's entirely understandable but maybe don't look at it as nervous, but see it as more focused? The better you do, the more effort you put in to making sure it stays that way. Put even more consideration into the companies you invest in, be more patient for opportunities, etc. Put the lessons you've learned in investing along the way so far into play even more.\n\n\"I'm already feeling like I am an idiot 😆\"\n\nI don't think any of what you talked about was idiotic at all. Very common, understandable stuff. \n\nGood luck.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/lju2xe8/",
      "created": 1724579312,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljuj96z",
      "score": 1,
      "body": "Time will help you . Its on your side. Just ignore the day to day, year to year unless you are looking for a specific entry point.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljuj96z/",
      "created": 1724588939,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljv8pt1",
      "score": 1,
      "body": "A good book for you to read would be trading in the zone",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljv8pt1/",
      "created": 1724598786,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk4ivuh",
      "score": 1,
      "body": "Don't worry about DCAing so much. If you are doing individual stocks, you need to hold 20 or more. Just buy when they present you the opportunity, or when you feel like it is a good time. If you aren't in 20 stocks, limit yourself to maybe invest a few percent of your portfolio into any one stock and put the rest in ETFs. When you find opportunities in stocks, you can a have a few percent of cash lying around to buy. \n\nThere will be times when you don't feel like you can buy anything. Put the cash into sweep, bonds, or something like SVOL until you are ready to use it.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/lk4ivuh/",
      "created": 1724731715,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljoqqvu",
      "score": 1,
      "body": "My dude the Fed is about to cut rates and every schmuck like you (and me!) is going to say “huh… 5% wasn’t so bad but now my reserves are only getting 3%” then they start buying what they wanted all along and the price ticks up by the day.\n\nBuy what you want now and be happy.",
      "permalink": "/r/stocks/comments/1f0100i/do_you_also_have_these_mental_traps/ljoqqvu/",
      "created": 1724497020,
      "depth": 0,
      "replies": []
    }
  ]
}