{
  "title": "An interesting fact. Do you know which stock has been the best performing since 1925 in the US stock market?",
  "score": 1298,
  "selftext": " It is Altria, a tobacco company founded in 1925, which has achieved a compound annual return of 16.3% from 1925 to 2023. Every $1 invested in Altria in 1925 would have grown to $2.7 million by 2023. This is the magic of compounding.",
  "link_flair_text": "Company Discussion",
  "id": "1f0803k",
  "num_comments": 328,
  "created_utc": 1724513430,
  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/",
  "comments": [
    {
      "id": "ljq97e9",
      "score": 777,
      "body": "And not selling for 98 years",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq97e9/",
      "created": 1724518668,
      "depth": 0,
      "replies": [
        {
          "id": "ljrw56b",
          "score": 264,
          "body": "Nevermind being dead on average 21 years prior",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljrw56b/",
          "created": 1724539360,
          "depth": 1,
          "replies": [
            {
              "id": "ljs57zt",
              "score": 155,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljs57zt/",
              "created": 1724542899,
              "depth": 2,
              "replies": [
                {
                  "id": "ljzkvh4",
                  "score": 4,
                  "body": "That's a good thing because the portfolios of the dead outperform the living!",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljzkvh4/",
                  "created": 1724664725,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ljskg04",
              "score": 19,
              "body": "More of grandma’s stuff to feed intc",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljskg04/",
              "created": 1724549113,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljsf5lj",
          "score": 3,
          "body": "Well observed",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljsf5lj/",
          "created": 1724546907,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljsfdoq",
          "score": 5,
          "body": "It would have benefited the likes of Charlie Munger or Buffet but for us in this era, it's a totally useless fact...",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljsfdoq/",
          "created": 1724546999,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljpwipv",
      "score": 1067,
      "body": "Somehow that's really depressing. ",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljpwipv/",
      "created": 1724514371,
      "depth": 0,
      "replies": [
        {
          "id": "ljpzrtl",
          "score": 317,
          "body": "Sell an addictive product even if it hurts people...",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljpzrtl/",
          "created": 1724515461,
          "depth": 1,
          "replies": [
            {
              "id": "ljq8wul",
              "score": 139,
              "body": "Is that why coke stock has done so well?",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq8wul/",
              "created": 1724518570,
              "depth": 2,
              "replies": [
                {
                  "id": "ljrghso",
                  "score": 50,
                  "body": "Yes",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljrghso/",
                  "created": 1724533413,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lju28uz",
                  "score": 22,
                  "body": "And McDonald’s, and nestle and Dow chemicals, and a million others.",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/lju28uz/",
                  "created": 1724578835,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ljugx9e",
                  "score": 2,
                  "body": "I work for the big red company (overall I will for just some time now...).  On one hand it's just a brand.  It has water too and spends a lot of effort in zero sugar alternatives I think genuinely to provide alternatives to traditional soda.\n\nThey target children though.  In that sense they're 100% as bad as big tobacco.  And they still haven't shaken that from their ethics.  They lose millions every year on promoting to <15 year olds because they'll get returns for the next 40+ years.\n\nI don't see it from where I am but it's a bit chilling those campaigns are orchestrated by boards from the local to national levels.",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljugx9e/",
                  "created": 1724587772,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ljq470l",
              "score": 128,
              "body": "There’s a ton of fat people addicted to high calorie fast food with no nutritional value. Many poor people addicted to state lottery. A bunch of less than smart people addicted to colllecting their coins on their games. Just wondering if virtue signaling regarding these things is as strong as the virtue signaling around tobacco.",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq470l/",
              "created": 1724516961,
              "depth": 2,
              "replies": [
                {
                  "id": "ljq7gdj",
                  "score": 50,
                  "body": "I know right? Apple makes lots of money off iOS apps that have in-game loot boxes that basically hit the gambling mechanics in our brains, and there's a lot of kids with their parents credit cards spending money on those apps. Fast food companies are dousing their food in sugar which is addictive... Social media is addictive... If you're invested in the S&P 500 you are mostly making money on products with addictive mechanics.",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq7gdj/",
                  "created": 1724518083,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ljq7k3l",
                  "score": 1,
                  "body": "Difference is if you eat fast food, play games and gamble in moderation it will not significantly shorten your lifespan. Even moderate use of cigarettes will shorten your life by a decade",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq7k3l/",
                  "created": 1724518118,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljq8zts",
                      "score": 87,
                      "body": "Yes It does. Fast food IS related to a lot of health problens",
                      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq8zts/",
                      "created": 1724518597,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljqdpb9",
                          "score": 21,
                          "body": "Wouldn't be surprised if fast food becomes the next tobacco",
                          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqdpb9/",
                          "created": 1724520168,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ljqir7r",
                              "score": 26,
                              "body": "Sugar will be the next tobacco but they will never tell us. It is in, and helps sell, everything food related but is horrible for you.",
                              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqir7r/",
                              "created": 1724521836,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ljr07uw",
                                  "score": 6,
                                  "body": "I wouldn’t doubt if big pharma is involved somehow in promoting sugary foods. Think of how much money insulin making companies are bringing in from lifelong customers. And it’s growing substantially. \n\nNow with some of these companies in the weight loss drug space, with projections of $100 billion in sales within the decade. I think it’s foolish to think they aren’t involved in someway shape or form on promoting these foods and silencing the data that shows just how bad it is for you.",
                                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljr07uw/",
                                  "created": 1724527665,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ljr2gm8",
                                      "score": 5,
                                      "body": "Sell food and phones to make you idle and fat, then sell you a pill so you dont die from it right away, then sell you another pill to lose the weight. IIRC the 3 most prescribed pills in the US are for high blood pressure, high cholesterol, and diabetes",
                                      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljr2gm8/",
                                      "created": 1724528457,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "ljqnv16",
                                  "score": 5,
                                  "body": "And it'll get labeled as 'sugar bad' instead of 'use in moderation' and 'we created products that sweeten like sugar for cheaper, but your body treats them differently than simple table sugar.'",
                                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqnv16/",
                                  "created": 1724523514,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ljrufn0",
                          "score": 6,
                          "body": "Hot take the food isn’t the problem, it’s the lack of exercise. \n\nPeople in the US don’t fucking WALK ANYWHERE. It’s fucking nuts. I average 15-20 miles a day for work (which I admit is a high step count job) and walking around my neighborhood. \n\nI eat fast food like a motherfucker but I’m still on the under side of average weight for my age and height.  \n\nMy cardio is great, doctor never sees any issues, I’m generally a healthy human, yet I absolutely destroy a cheesy Gordita crunch. \n\nWe never walk, not like our ancestors did. \n\nPeople walked from fucking one state to another in the US. Just imagine that, how the fuck could you ever be obese???",
                          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljrufn0/",
                          "created": 1724538689,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ljspnw3",
                              "score": 4,
                              "body": "how's your cholesterol?",
                              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljspnw3/",
                              "created": 1724551332,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ljth11l",
                                  "score": 3,
                                  "body": "Totally fine. I just don’t only eat fast food, I love salads, veggies, fruit, everything. \n\nWhy have shitty or healthy food when you can have both",
                                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljth11l/",
                                  "created": 1724564727,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ljqb6ub",
                          "score": 3,
                          "body": "Hell, it's the number one reason in the US why people die... 1) heart disease.  over a million die a year to it. \n\nDon't ban, regulate or educate on fast food and healthy eating... but ban the guns that kill a lousy 40k a year, 20k of which are suicide, 10k of which are justified self defense, a smaller fraction, accidents. and the smallest fraction, murders which most are gang or crime related. Only a tiny tiny fraction of the 300 million people in the US die to a gun let alone murder.  But let us all shift focus from McDonalds, cigarettes and alcohol and lets not bother talking about investing in Cancer research, or just being just plane safe around the house... accidents like falls  are the NUMBER 3 reason... How much does that show just how STUPID society is that most die to some stupid shit like falling off a ladder that you don't know how to use or getting electrocuted because you stick your sausage fingers... THAT You probably got from McDonalds anyway, into your breaker box and zap. lmfao.  \n\nBut nothing like the government to instill unrealistic fears into the morons who vote... a certain anti gun way.\n\nIt's unfortunate, but a lack of logic and intellect are the biggest reasons for pretty much everything wrong in the world. Pretty much EVERYTHING.",
                          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqb6ub/",
                          "created": 1724519344,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ljuntd8",
                              "score": 3,
                              "body": "The government education system purposely doesn’t teach critical thinking anymore because it’s easier to control a population that is too stupid to do their own research and dispute the lies they are told all day long, every day on news media, social media, commercials, radio, etc.",
                              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljuntd8/",
                              "created": 1724591026,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ljupcbs",
                                  "score": 2,
                                  "body": "As I got older I started to notice that the news story's weren't there for information... They are there for the views.  They are, after all, an entertainment company.  All they care about are views and so they'll only show content they think will increase views... Violence. Etc.  We see so many shootings on the news because guns are a big debate.  Even though statistically insignificant compared to other reasons for death.  Imagine if we showed every fall or accident people had instead? More people die from falling off roofs, slips, falls etc. Imagine what people would think or how serious they would take safety if that is all the news showed people dying from? \n\nI also started to see how different CNN was from fox, or from abc etc.  Or how the government could possibly vote on an issue that one of the voters benefit from even when the issue isn't something people want.  Or how many actual conflicts of interest there are in the government.  \n\nWhen I was in 8th grade I saw 911.  I joined the Navy my junior year and left for boot camp after graduation my senior year (DEP program) loved every second of it. Glad I got out and enjoyed my jobs so far making more.  But honestly, I've come to regret my time in.  I feel like the Navy is easy and definitely not the same risk as say infantry in Afghanistan.  But I still regret serving.  The people in charge are the ones creating the conflict, profit from it and send us in to do their bidding.  All while back home we have all this absolutely exhausting stupidity and conflict I've just grown tired of it frankly speaking. \n\nThis country and the people in charge do not deserve one life defending them.  Period.  Not any more. From now on, people should defend themselves.  If a politician wants the oil from somewhere, give him a gun... Not an AR since they want them banned.  Just give him the Ruger 10-22 and all he needs is that hunting rifle and drop him off.  He can have as much oil as he can carry.  \n\n\nIf you ask me. Don't trust a single person in charge that wouldn't be at the front line with you.  If you ask me, no one above the average is citizen should be in charge, and no one who's never served our country should ever be allowed to run for office.  If you want to be in office.  Enlist or commission into the military. And people worth 50 million don't know what you or I need or want so they can't possibly be on our side. So they shouldn't even be allowed to run.  \n\nIt should be the people governing the people.  Do we need people in charge in a centralized way? Sure.  But not people so far removed from the rest that they don't even know what's needed.  Not what they want.\n\nFYI, was still waking up and did this on my phone, so it's not pretty and probably a bit over the place. But I think it gets the gist lol.",
                                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljupcbs/",
                                  "created": 1724591675,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "ljqx1cn",
                              "score": 6,
                              "body": "By your own logic, you should ban guns, because obviously people are too stupid to make something good out of it. Guns in the hands of those that are trained and serve to protect the people is one thing; everyone else simply doesnt need a gun, period. What the heck do you need a gun for? Ofc, I am european and my children are not afraid to go to school and be shot, so I maybe lack the understanding. But what the actual f\\*\\*\\* do you need a gun for??\n\nAlso, I dont think we need to discuss the differences between being shot and dying of fast food, sugar, or smoking. The former is forced onto you, the other is your own decision and fault.\n\nHeart disease has many reasons, not only bad eating habbits. Smoking can also induce heart disease, similar to genetic predisposition, lack of physical activity, stress, and gun shots that penetrate your heart. Pun intended.\n\nBut sure, lets ignore everything that is not the top 3 reasons for death and pretend it doesnt affect people. After all, gradma dying with the age of 80 from heart attack because she began the day with a cigar and ended it with a shot of whiskey is comparable to my son of 13 being shot at the school caffeteria because of a ricochet. Since there are 10x as many grandmas dying from heart attack than children being killed at school shootings, we must not discuss gun laws. Because it kills less people. That is basically our logic. Come on dude...",
                              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqx1cn/",
                              "created": 1724526575,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "ljqekw8",
                              "score": 3,
                              "body": "What! Tell people they’re fat! My body my choice. And, I want free healthcare….",
                              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqekw8/",
                              "created": 1724520454,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ljq8tus",
                      "score": 10,
                      "body": "People have lost their homes and jobs addicted to microtransactions in mobile games.\n\nPeople have died of dehydration, lack of sleep and malnutrition from being unable to stop playing video games.\n\nSo sadly, what you are saying is simply not true.  Addictions to state supported lottery tickets and sports betting have destroyed many lives as well.\n\nAlcohol also destroys lives.  I'm glad both that I am allowed to drink it but also that it is heavily regulated.\n\nFTR, I do not own MO and recommend selling it if you do.",
                      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq8tus/",
                      "created": 1724518542,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljq9i0j",
                          "score": 9,
                          "body": "Thats why I said in moderation \n\nThere is no such thing as smoking in moderation and being healthy. Someone can play games several times a week and have a good life. You smoke a couple times a week and you probably are dying 10 years earlier than you should.\n\nAnything in excess can kill you. Difference is even smoking a little can drastically shorten your.",
                          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq9i0j/",
                          "created": 1724518769,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ljqfuq9",
                      "score": 4,
                      "body": "I have a terrible suspicion it's now healthier to smoke than eat the junk that passes as food.",
                      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqfuq9/",
                      "created": 1724520872,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ljqfla6",
                      "score": 1,
                      "body": "Fast absolutely shortens your life and health span",
                      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqfla6/",
                      "created": 1724520784,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ljrhvqe",
                      "score": 1,
                      "body": "It definitely significantly shortens your lifespan…",
                      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljrhvqe/",
                      "created": 1724533920,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljriqe4",
                          "score": 2,
                          "body": "Eating a Big Mac once a month won’t shorten your life span. Unless you are allergic to sesame seeds",
                          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljriqe4/",
                          "created": 1724534235,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ljru2u3",
                      "score": 1,
                      "body": "This is science based on AVERAGES, AVERAGE people do not exist. Meaning the “life”, that you refer to is merely a rhetorical straw man that is being used to prove your point. \n\nI have a grandparent who continues to smoke 3-4 cigs a day, and he’s the only one alive and pushing 90. \n\nAll the rest were active and healthy but died in their 70s and 80s. \n\nThese are examples of real people, both sides anecdotally dismantle your argument. \n\nPeople on the Reddit need to stop acting like pubmed articles and scientific analysis is the zenith of critical thinking.",
                      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljru2u3/",
                      "created": 1724538549,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ljrzj4q",
                      "score": 1,
                      "body": "Fast food even in moderation will most certainly shorten your life expectancy, and I will be the first to admit it may be worth it.  But it comes with consequences as it is absolutely terrible for your health.",
                      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljrzj4q/",
                      "created": 1724540671,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ljq3rni",
              "score": 6,
              "body": "It needs to be taxed and regulated heavily. Put tons of warning labels on it,. Make selling to minors a severe crime, use proceeds to fund campaigns on the significant health risks. Taxes must exceed health costs to society and then some.\n\nBut like many things I do with some risk to myself... I enjoy having the ability to purchase a pack occasionally.\n\nI blame the executives that denied the truth of the harm for so long and fought attempts to regulate them.  Those people were evil.  But at the same time, I don't like the idea that every business that sells something able to cause harm must be considered evil.\n\nEdit: just to be clear, I do not think MO is a good investment.  I do not own it and would not buy it.",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq3rni/",
              "created": 1724516814,
              "depth": 2,
              "replies": [
                {
                  "id": "ljq4iek",
                  "score": 15,
                  "body": "If all tobacco was outlawed, it would depress me. Tobacco is addictive, but it's also one of life's simple pleasures.",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq4iek/",
                  "created": 1724517071,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ljqa5kb",
                  "score": 10,
                  "body": "Blah bllah blah.\n\nYes, let’s regulate every fucking thing everywhere.\n\nIn NYC Mayor Bloomberg wanted to ban big gulp sodas or some shit like that because some people believe they  know whats best for every human being and so they will dedide how the world should be.\n\nI dont drink or smoke and I dont drink giant sodas but I believe people should choose how they want to live the same way if they are straight or gay or trans…or wnat abortions or not.\n\nFreedom and personal responsibility/choice should reign and if your ride thru life means you enjoy cigarettes or giant sodas…then it’s your choice….have at it…and if you dont fucking realize that smoking or drinking or giant sodas may not be good for you then don’t go there — be smart for you.\n\nI love this bs where people think they should regulate the shit out of society but then turn around and say okey doke to everything else so long as it fits how they want the world to be.\n\nJumping out of planes with a parachute looks like alot of fun.\n\nBut something might go wrong and  you might die.\n\nLet’s ban that.\n\nOr maybe you decide it aint worth the risk so Im not doing it.\n\nYou think different and what an amazing experience you have had.\n\nYou do you.\n\nI do me.\n\nAll good.\n\nEnd of rant — and your opinions on the matter are yours like mine are mine and so be it.\n\nI still love everyone and want everyone to be happy and healthy and FREE to choose the life they want to live.\n\nI don’t feel I or anybody else should be regulating life to be how I say it should be.\n\nYour life.\n\nYour choices.\n\nChoose wisely folks",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqa5kb/",
                  "created": 1724518990,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ljqnwhi",
              "score": 1,
              "body": "\"but muh freedoms\"",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqnwhi/",
              "created": 1724523527,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljqq4si",
              "score": 1,
              "body": "Meta likes to have a word",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqq4si/",
              "created": 1724524262,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljrru03",
              "score": 1,
              "body": "Every fast food stock is that",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljrru03/",
              "created": 1724537679,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljsfysb",
              "score": 1,
              "body": "The Sacklers tried it, but they went full addict :)",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljsfysb/",
              "created": 1724547239,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljswhgw",
              "score": 1,
              "body": "So DKNG long term?",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljswhgw/",
              "created": 1724554279,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljqecng",
          "score": 14,
          "body": "I also find it equally depressing that $1 in 1925 is equal to less than $20 today. Like, damn—how awesome would it be to throw $20 at something and have the payout be millions?!",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqecng/",
          "created": 1724520380,
          "depth": 1,
          "replies": [
            {
              "id": "ljrm51r",
              "score": 7,
              "body": "Only if you lived over a hundred years. That's a long way to wait.",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljrm51r/",
              "created": 1724535505,
              "depth": 2,
              "replies": [
                {
                  "id": "ljrvvoe",
                  "score": 6,
                  "body": "Or just inherited the stock.",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljrvvoe/",
                  "created": 1724539257,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ljr8btj",
          "score": 4,
          "body": "An oligopoly sells an product that is basically an soft drug.\n\nNot only that there are only 4-5 big tobacco companies on the ENTIRE PLANET.\n\nBut in hindsight I'm surprised XOM is barely on 20th place,even if got split as Standard Oil with Chevron",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljr8btj/",
          "created": 1724530539,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljq21tr",
          "score": 9,
          "body": "It is not that depressing.\n\nAltria is in terminal decline with what currently looks like irreversible revenue contraction.  Only investors still in this are hoping the dividends paid before wheels fall off are enough to hold a dying business.\n\n  \nEdit: MO is dying, PMI purchased ZYN not Altria.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq21tr/",
          "created": 1724516232,
          "depth": 1,
          "replies": [
            {
              "id": "ljq2ksb",
              "score": 24,
              "body": "They just bought Swedish match which is the world's biggest producer of nicotine pouches, among them ZYN, which has grown alot in the US. They aren't going anywhere, they are just tweaking their business, and they definitely have the cash for it",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq2ksb/",
              "created": 1724516410,
              "depth": 2,
              "replies": [
                {
                  "id": "ljq8v2j",
                  "score": 16,
                  "body": "Philip Morris acquired Swedish Match.",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq8v2j/",
                  "created": 1724518553,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ljqasw5",
                  "score": 1,
                  "body": "Vertical integration. Control both the addictive drug and the treatment.",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqasw5/",
                  "created": 1724519212,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ljq58n1",
              "score": 14,
              "body": "Huh...terminal decline? I've been invested in Altria since 2007. It's been my best performing stock. It's outperformed all off my tech stocks even. You may not like the company and that's understandable, but sorry Altria is a money machine.",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq58n1/",
              "created": 1724517325,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljq79ck",
              "score": 2,
              "body": "have you heard of Zyns? Depressingly, they’re really popular with my generation",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq79ck/",
              "created": 1724518018,
              "depth": 2,
              "replies": [
                {
                  "id": "ljq7uwc",
                  "score": 2,
                  "body": "I have but have never used it.  I buy a pack of cigarettes once every year or 2 years.\n\nI am addicted to caffeine and coffee though!\n\nI do not own MO and do not recommend buying it.",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq7uwc/",
                  "created": 1724518219,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljq80qn",
                      "score": 3,
                      "body": "I have a caffeine addiction too haha",
                      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq80qn/",
                      "created": 1724518273,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lk68018",
          "score": 1,
          "body": "I feel like tobacco is one of the few businesses that could still exist from 1925.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/lk68018/",
          "created": 1724765533,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljq7ze2",
      "score": 139,
      "body": "Also you would be dead in 2023",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq7ze2/",
      "created": 1724518260,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljpxv9t",
      "score": 482,
      "body": "What if you invest in sears, circuit city, JCPenney, Kodak, blockbuster, toys r us \nWhat happens to the magic of compounding?",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljpxv9t/",
      "created": 1724514822,
      "depth": 0,
      "replies": [
        {
          "id": "ljpygfd",
          "score": 265,
          "body": "Nobody talks about this^^ your buy and hold forever strategy will not work 90% of the time. Companies are cyclical and are quickly phased out.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljpygfd/",
          "created": 1724515019,
          "depth": 1,
          "replies": [
            {
              "id": "ljq3f91",
              "score": 157,
              "body": "....which is why you buy a diversified ETF and not individual stocks.  So you don't have to eat shit when an individual company takes a nosedive.",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq3f91/",
              "created": 1724516698,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljpz0ai",
              "score": 43,
              "body": "Sure but your 2,700,000% return on a homerun stock pays for those investments and more",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljpz0ai/",
              "created": 1724515203,
              "depth": 2,
              "replies": [
                {
                  "id": "ljq3303",
                  "score": 30,
                  "body": "Knowing my luck none of them will even get on first base",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq3303/",
                  "created": 1724516583,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ljsti0o",
                  "score": 1,
                  "body": "I think you mean 270,000,000%",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljsti0o/",
                  "created": 1724552975,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljt0beq",
                      "score": 3,
                      "body": "I was wondering if anyone was gonna check my math",
                      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljt0beq/",
                      "created": 1724555987,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ljqc4k6",
              "score": 4,
              "body": "No one lives forever get with the times",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqc4k6/",
              "created": 1724519651,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljqhd2e",
              "score": 4,
              "body": "Or maybe just don't buy retail stores",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqhd2e/",
              "created": 1724521369,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljtr23p",
              "score": 1,
              "body": "If it doesn't work, you're doing it wrong.",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljtr23p/",
              "created": 1724571120,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljq16nr",
          "score": 45,
          "body": "I don't know if this is still true, but it was in the 2000s when a research paper was written on it: if you held the original 500 stocks that were in the S&P500 and never bought or sold based on yearly changes to the makeup on the index, you would outperform the index. Even though many of the companies no longer exist, the ones that still do exist out-performed. And there were companies that were removed from the index when they did poorly (selling low) and then re-added when they did well again (buying high).\n\nFollowing the S&P500 index is essentially a buy-high sell-low strategy because a company needs to be successful to be added to the index but they are removed when they perform poorly.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq16nr/",
          "created": 1724515940,
          "depth": 1,
          "replies": [
            {
              "id": "ljq4c88",
              "score": 14,
              "body": "While the mechanics behind it make sense, it is still less risky than trying to time the market, for the common investor.",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq4c88/",
              "created": 1724517011,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljrjx5g",
          "score": 4,
          "body": "ToysRUs actually delivered good value to shareholders. There was a leveraged buyout so all the shareholders got paid (and these buyouts always have to pay a premium to incentivise the sale so even better for investors). The people who lost out were the people who bought the company from the shareholders and the banks which lent them money.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljrjx5g/",
          "created": 1724534676,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljt6hm2",
          "score": 5,
          "body": "Sears would still have been a W in accounting for all of the spinoff shares acquired, even if Sears shares ultimately were held to BK. Sears spun off a ton of successful companies over the years - Allstate, Discover Financial, Dean Witter (acquired by Morgan Stanley) particularly. [Source](https://www.dividend.com/how-to-invest/the-complete-visual-history-of-sears/)",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljt6hm2/",
          "created": 1724558944,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljq9rrq",
          "score": 3,
          "body": "Notice that those were all consumer discretionary companies. Now look at the consumer staples sector for comparison. Many of the companies have been around for over a century, e.g. Hershey, Colgate-Palmolive, Procter & Gamble, Coca-Cola, Nestle, and Brown-Forman.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq9rrq/",
          "created": 1724518861,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljrkpkb",
          "score": 1,
          "body": "this is a good point..but none of these companies sold anything addictive",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljrkpkb/",
          "created": 1724534970,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljsn9bp",
          "score": 1,
          "body": "Yes, but none of those are addictive.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljsn9bp/",
          "created": 1724550310,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljt6z5d",
          "score": 1,
          "body": "Well to be fair, those companies failed because they were illegally cellar boxed by a certain online retailer/hedge fund",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljt6z5d/",
          "created": 1724559189,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljua53y",
          "score": 1,
          "body": "Someone did the math a few years ago....\n\nBuying sears in 1989 [massively](https://www.reddit.com/r/investing/comments/aqhvo3/buying_sears_stock_30_years_ago_would_return_more/) outperformed the S&P as of 2019. \n\nSears had so many great spin offs, that holding those spin off companies, companies with dividends.....you come out pretty well. Allstate, discover, and apparently Morgan Stanley are all spin offs, according to the cited post.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljua53y/",
          "created": 1724584030,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljq3by4",
      "score": 61,
      "body": "Do one for the last 50 years...",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq3by4/",
      "created": 1724516667,
      "depth": 0,
      "replies": [
        {
          "id": "ljq6mls",
          "score": 47,
          "body": "Right?  How many companies are still in business and trading since 1925.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq6mls/",
          "created": 1724517802,
          "depth": 1,
          "replies": [
            {
              "id": "ljq9a9i",
              "score": 19,
              "body": "If I was to guess, I'd say like 50. But some of them are dog shit like US Steel, some railroads, and a lot of mergers. \n\nOutright, unchanged ownership and still currently a viable investment, from over the past 100yrs I'd guess less than 10. Most of them are Dow30 stocks.",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq9a9i/",
              "created": 1724518695,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljs5l20",
          "score": 7,
          "body": "Monster energy is a crazy high return, but it had a name before monster.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljs5l20/",
          "created": 1724543045,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkt4j65",
          "score": 1,
          "body": "That would still be Philip Morris",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/lkt4j65/",
          "created": 1725096913,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljq5hu3",
      "score": 31,
      "body": "Surely the decreasing number of people smoking has negatively affected the stock recently right?",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq5hu3/",
      "created": 1724517414,
      "depth": 0,
      "replies": [
        {
          "id": "ljqtg31",
          "score": 23,
          "body": "Nope, because what they are selling and making them bank is nicotine products.\n\nWhy do you think they endorse products like nicotine patches, vapes, gums, snus, sprays, anything to keep you addicted.\n\nDisclaimer, got a fairly big position in Scandinavian tobacco group\n\nEdit side note: They might produce these products like patches to keep you from smoking, but the real purpose for these products is to keep you in the addiction of nicotine products. Nothing else. \nThey sell addiction and label it as either help ( gum and patches ) or lifestyle products ( cigars, pibes, snus, vapes ) and that is what makes the money.\n\nUnethical investment, sure. But makes for some great returns and will sure not go away. We have been doing this for thousands of years and will continue to do so.\n\nThe dividends are great.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqtg31/",
          "created": 1724525370,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljqjgzy",
          "score": 18,
          "body": "You'd think, but now they have zin",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqjgzy/",
          "created": 1724522073,
          "depth": 1,
          "replies": [
            {
              "id": "ljqljz6",
              "score": 13,
              "body": "Zyn is owned by Phillip Morris (PM)",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqljz6/",
              "created": 1724522759,
              "depth": 2,
              "replies": [
                {
                  "id": "ljqmz0r",
                  "score": 10,
                  "body": "They are one in the same my guy, I guess you're not technically wrong.",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqmz0r/",
                  "created": 1724523227,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljrek6r",
                      "score": 2,
                      "body": "Well… there is Altria, which owns the Philip Morris brands (Marlboro, etc) in the United States. And then there’s Philip Morris, which operates the brands outside of the US. It’s a little confusing, but the two companies split and are distinct entities currently",
                      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljrek6r/",
                      "created": 1724532729,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ljrl6z3",
          "score": 5,
          "body": "It is counterintuitive but you can still profit in an otherwise declining industry. \n\nA mature company that has peaked can use its cash to buyback shares and increase FCF per share. Or just pay out huge dividends. If they deleverage, investors will see less risk and give them a higher multiple (e.g., coal or oil and gas companies pre Covid versus now). Often times these companies can get so cheap that an investment can outperform even the sexiest companies over the following years purely from a re-rate. (see below)\n\nThey can use their cash to acquire new growth or investing in rising companies (think Pepsi buying up energy drinks like Celsius). They can spinoff the 'bad' parts of the business and cause the remaining portion to rerate the multiple. (E.g., miners selling out non-ESG segments like coal but buying up 'green' metals like copper or lithium)\n\nExamples:\n\n- Coal has done really well if you bought at the right times. If you bought in the 2020 panic you might have 10xed (or more) your investment.\n- HP has outperformed Salesforce since 2015 ([I elaborate here](https://www.reddit.com/r/stocks/comments/1d5j8ai/rstocks_weekend_discussion_saturday_jun_01_2024/l6o88mu/)). HP was at a multiple of 3-4x back then, Salesforce was unprofitable. HP barely grew its earnings over the period (losing to inflation), while CRM grew earnings 44% annually. But HP's multiple literally 6xed so you won out in the end with the clearly worse company while Salesforce suffered from major multiple compression.\n- Going back to June of this year, Dell has outperformed Apple,  MSFT, GOOG, META on a 5 year basis.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljrl6z3/",
          "created": 1724535151,
          "depth": 1,
          "replies": [
            {
              "id": "ljuy1xf",
              "score": 1,
              "body": "i guess you are not talking about bare stock price right? did it beat the other companies thanks to dividends? and if so how did yo take it into account to be able to compare the companies? hasn’t HP gone down like 50% while CRM quadrupled in the last ten years?",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljuy1xf/",
              "created": 1724595088,
              "depth": 2,
              "replies": [
                {
                  "id": "ljwdfs3",
                  "score": 1,
                  "body": "I'm looking at total return here, i.e., price appreciation + dividends. Here is a screenshot from the [FT article](https://i.imgur.com/pGXxLAZ.png) I linked in my comment. Importantly this starts right after HP split off its HP Enterprises segment.\n\nPretty astounding right? But today, \"HP now trades at 11 times this year’s estimated earnings, expensive compared to its history; Salesforce, at 21 times, is as cheap as it has ever been.\"\n\nNot sure if the last month has changed the outperformance.",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljwdfs3/",
                  "created": 1724612424,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ljqkyfp",
          "score": 1,
          "body": "Have the total number of smokers decreased? I could see a larger percentage of a smaller population being less people than a smaller percentage of a larger population",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqkyfp/",
          "created": 1724522563,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljqfdll",
      "score": 11,
      "body": "Deere is still going strong after 187 years",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqfdll/",
      "created": 1724520713,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljpy5w8",
      "score": 55,
      "body": "That is definitely a stock I never would have guessed when it came to this.  I can never bring myself to invest in a tobacco company.",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljpy5w8/",
      "created": 1724514920,
      "depth": 0,
      "replies": [
        {
          "id": "ljpzyx7",
          "score": 40,
          "body": "Investing in tobacco is the straightest line to profiting off of (unquestionably unnecessary) human suffering.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljpzyx7/",
          "created": 1724515528,
          "depth": 1,
          "replies": [
            {
              "id": "ljq0r73",
              "score": 32,
              "body": "What about defense contractors? Or alcoholic beverage companies?",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq0r73/",
              "created": 1724515795,
              "depth": 2,
              "replies": [
                {
                  "id": "ljq4ngk",
                  "score": 31,
                  "body": "you’re listing my portfolio lol",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq4ngk/",
                  "created": 1724517119,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljqmp7n",
                      "score": 9,
                      "body": "*taking notes*\n\nTobacco… defense companies… alcohol… hmmm what else should I invest in… ",
                      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqmp7n/",
                      "created": 1724523135,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljqqjtr",
                          "score": 11,
                          "body": "gambling industry 🫡",
                          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqqjtr/",
                          "created": 1724524401,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ljqcjxp",
                  "score": 7,
                  "body": "Or Kraft? Wait they spun them off from Altria already",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqcjxp/",
                  "created": 1724519791,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ljq87n7",
                  "score": 2,
                  "body": "Alcohol can be consumed in moderation and not severely shortened life span. Smoking will shorten your life by a decade or more even if you smoke in moderation. Hell even if you don’t smoke but simply live with a smoker it can severely shorten your life",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq87n7/",
                  "created": 1724518336,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljs191o",
                      "score": 3,
                      "body": "Even a small amount of drinking is bad for you. There is no dose of alcohol that is “safe.” Its poison that has destroyed countless lives. \n\nhttps://www.who.int/europe/news/item/04-01-2023-no-level-of-alcohol-consumption-is-safe-for-our-health\n\nhttps://www.nytimes.com/2023/01/13/well/mind/alcohol-health-effects.html",
                      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljs191o/",
                      "created": 1724541343,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ljr4yso",
              "score": 4,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljr4yso/",
              "created": 1724529346,
              "depth": 2,
              "replies": [
                {
                  "id": "ljroyrx",
                  "score": 8,
                  "body": "Good ole redditor virtue signaling. \n\nNeed to create the virtue signaling index. Average annual return of 2.3%",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljroyrx/",
                  "created": 1724536568,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ljq1k4o",
          "score": 4,
          "body": "Do you see alcohol and cannabis in a similar light?",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq1k4o/",
          "created": 1724516066,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljq3pi4",
          "score": 6,
          "body": "People are going to smoke regardless if you invest in it or not.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq3pi4/",
          "created": 1724516794,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljqbyua",
          "score": 1,
          "body": "How do we invest in a heroin company? /s",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqbyua/",
          "created": 1724519599,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljqfiyd",
          "score": 1,
          "body": "But you probably wouldn’t have thought like that between 1925 and 1980 (just to take random year, I don’t know when people started taking the health risks seriously).",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqfiyd/",
          "created": 1724520762,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljpxjj8",
      "score": 192,
      "body": "And it's subsidiary is a pharmaceutical company aimed at curing lung cancer... crazy how that works...",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljpxjj8/",
      "created": 1724514713,
      "depth": 0,
      "replies": [
        {
          "id": "ljq3ydt",
          "score": 42,
          "body": "The ultimate hedge",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq3ydt/",
          "created": 1724516879,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljpxwnu",
          "score": 73,
          "body": "Which pharmaceutical company?",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljpxwnu/",
          "created": 1724514834,
          "depth": 1,
          "replies": [
            {
              "id": "ljqg9hc",
              "score": 92,
              "body": "none, he lied",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqg9hc/",
              "created": 1724521006,
              "depth": 2,
              "replies": [
                {
                  "id": "ljujeh0",
                  "score": 5,
                  "body": "Classic reddit. 200 upvotes, though.",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljujeh0/",
                  "created": 1724589011,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkt4oex",
                  "score": 1,
                  "body": "Wrong. Look up Helix",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/lkt4oex/",
                  "created": 1725097015,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ljq2bj0",
          "score": 37,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq2bj0/",
          "created": 1724516323,
          "depth": 1,
          "replies": [
            {
              "id": "ljq3hif",
              "score": 25,
              "body": "Tbf. If the health implications of smoking are gone. It'd be way less bad and curing any cancer is also a net positive.\n\nThat being said. Smoking sucks.",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq3hif/",
              "created": 1724516719,
              "depth": 2,
              "replies": [
                {
                  "id": "ljq7snf",
                  "score": 8,
                  "body": "you'd have to cure more than just lung cancer for the health implications of smoking to be gone though",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq7snf/",
                  "created": 1724518198,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljq8l87",
                      "score": 4,
                      "body": "Well yes.\n\nBut anything cured is good.",
                      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq8l87/",
                      "created": 1724518462,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljr8p93",
                          "score": 1,
                          "body": "100% agreed",
                          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljr8p93/",
                          "created": 1724530670,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ljq3hlc",
              "score": 5,
              "body": "I play both sides so I always come out on top",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq3hlc/",
              "created": 1724516720,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljpyanl",
          "score": 17,
          "body": "fr that shit is wild, talk about treating the symptoms not the cause. That there is a miracle of law/regulation control.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljpyanl/",
          "created": 1724514966,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljpz7a8",
          "score": 19,
          "body": "Unilever also advertises body acceptance with their Dove brand while also advertising hot women for their men deodorant brand (forgot the name)\n\nIt's called business",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljpz7a8/",
          "created": 1724515269,
          "depth": 1,
          "replies": [
            {
              "id": "ljq360x",
              "score": 3,
              "body": "Very different market segments.",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq360x/",
              "created": 1724516611,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljq5lao",
              "score": 1,
              "body": "Axe body spray?",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq5lao/",
              "created": 1724517448,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljpztu1",
          "score": 11,
          "body": "Source? MO isn't a subsidiary as far as I know.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljpztu1/",
          "created": 1724515480,
          "depth": 1,
          "replies": [
            {
              "id": "ljq3f2t",
              "score": 3,
              "body": "It's some of the companies it have split out",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq3f2t/",
              "created": 1724516696,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljq3z4o",
              "score": 3,
              "body": "They were saying MO has a subsidiary that is looking at treating/curing cancer. They are an investor in Lexaria and Micreos.",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq3z4o/",
              "created": 1724516885,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljqmdze",
              "score": 2,
              "body": "I would say The Plain Bagel's last YT video.",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqmdze/",
              "created": 1724523032,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ljqbbio",
      "score": 6,
      "body": "And continue to raise their dividend and stock is up over 30 percent since October 2023.  1.02 a quarter is not chump change on a stock that was 39 bucks in October.  Hold and compound forever.  Always buy more on the dips.  They are a cash flow cow king.  They can heavily discount tobacco because of margins and have continued to give additional major returns to shareholders with spin off, buy backs and dividend increases every year.",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqbbio/",
      "created": 1724519388,
      "depth": 0,
      "replies": [
        {
          "id": "ljtdata",
          "score": 2,
          "body": "Yeah, but... I don't know if I can morally invest in them.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljtdata/",
          "created": 1724562547,
          "depth": 1,
          "replies": [
            {
              "id": "ljteloc",
              "score": 6,
              "body": "You are if you have most popular etfs",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljteloc/",
              "created": 1724563294,
              "depth": 2,
              "replies": [
                {
                  "id": "ljtepgx",
                  "score": 3,
                  "body": "I thought about that as I was posting and it's a fair point.  \nI...may throw together a mini compounding dividend portfolio, this and Kraft-Heinz.",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljtepgx/",
                  "created": 1724563356,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljti3td",
                      "score": 2,
                      "body": "Can’t go wrong in a Roth or ira",
                      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljti3td/",
                      "created": 1724565382,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ljtgfgu",
              "score": 1,
              "body": "What are moral investments?",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljtgfgu/",
              "created": 1724564372,
              "depth": 2,
              "replies": [
                {
                  "id": "ljtgvps",
                  "score": 1,
                  "body": "Ones you don't feel hesitancy over and questionable about.",
                  "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljtgvps/",
                  "created": 1724564639,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ljqftur",
      "score": 5,
      "body": "My neighbor smokes outside every day on the hour. I keep buying mo.",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqftur/",
      "created": 1724520864,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljq15tt",
      "score": 5,
      "body": "MO?",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq15tt/",
      "created": 1724515932,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljqd4fl",
      "score": 5,
      "body": "There is money to be made in addiction. \n\nHard truth.",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqd4fl/",
      "created": 1724519980,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljpwnwr",
      "score": 51,
      "body": "\"This is the magic of compounding.\"\n\nCherry picks one stock*",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljpwnwr/",
      "created": 1724514420,
      "depth": 0,
      "replies": [
        {
          "id": "ljpxnhs",
          "score": 33,
          "body": "How else would you describe $1 turning into $2,700,000 over 100 years?",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljpxnhs/",
          "created": 1724514750,
          "depth": 1,
          "replies": [
            {
              "id": "ljqfkqy",
              "score": 12,
              "body": "Any day now my Lehman brothers stock will be with 2.7 million",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqfkqy/",
              "created": 1724520779,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljpybsa",
              "score": 4,
              "body": "Shhh, they don't understand, let them sleep",
              "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljpybsa/",
              "created": 1724514976,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ljq45so",
      "score": 5,
      "body": "Where's that guy with the evil portfolio?",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq45so/",
      "created": 1724516949,
      "depth": 0,
      "replies": [
        {
          "id": "ljt37kj",
          "score": 2,
          "body": "He got a new job at Games Workshop. ![gif](emote|free_emotes_pack|stuck_out_tongue)",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljt37kj/",
          "created": 1724557339,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljqdtb2",
      "score": 4,
      "body": "All you have to do is wait 100 years",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqdtb2/",
      "created": 1724520204,
      "depth": 0,
      "replies": [
        {
          "id": "ljtrmjo",
          "score": 1,
          "body": "Also: Don't smoke while you're waiting. ",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljtrmjo/",
          "created": 1724571505,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljqui0c",
      "score": 4,
      "body": "My first stock back when it was Phillip Morris. Picking my first stock was a really cool idea my dad had for a 14th birthday gift. Been in and interested in the market ever since",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqui0c/",
      "created": 1724525725,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljruz7r",
      "score": 3,
      "body": "Man, if I was immortal and had unlimited money to DCA into the market, I sure would be rich right now.",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljruz7r/",
      "created": 1724538905,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljqbrwp",
      "score": 5,
      "body": "Aka PHILLIP MORRIS",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqbrwp/",
      "created": 1724519536,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljqbvy6",
      "score": 10,
      "body": "Would be nice to have a discussion about the stock without all the righteous ratchet  asses.",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqbvy6/",
      "created": 1724519573,
      "depth": 0,
      "replies": [
        {
          "id": "ljqgjj4",
          "score": 10,
          "body": "Right? r/stocks is an odd place to be pearl clutching.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqgjj4/",
          "created": 1724521099,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljq6sv5",
      "score": 2,
      "body": "Monster",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq6sv5/",
      "created": 1724517862,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljvaifj",
      "score": 2,
      "body": "Definitely interesting. Of course it is worth mentioning that past performance does not guarantee future results.",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljvaifj/",
      "created": 1724599399,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljq9aer",
      "score": 3,
      "body": "Lots of companies have gone bust since 1925....Just saying...",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljq9aer/",
      "created": 1724518697,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljqt8am",
      "score": 2,
      "body": "IBM founded in 1911.\n\nIBM (International Business Machines) first listed on the New York Stock Exchange (NYSE) on November 11, 1915, under the name Computing-Tabulating-Recording Co.. The company officially listed under its current name in 1924.",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljqt8am/",
      "created": 1724525296,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljr42qm",
      "score": 2,
      "body": "I love tobacco so this is great news",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljr42qm/",
      "created": 1724529031,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljr3wwp",
      "score": 1,
      "body": "Ah yes, Philip Morris, and additionally Kraft",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljr3wwp/",
      "created": 1724528973,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljraegv",
      "score": 1,
      "body": "Not that many tobacco companies in the market. Great for the long term investor.",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljraegv/",
      "created": 1724531265,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljrr5dv",
      "score": 1,
      "body": "Not counting inflation, yeah?",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljrr5dv/",
      "created": 1724537414,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljs49l6",
      "score": 1,
      "body": "Healthy dividend yield",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljs49l6/",
      "created": 1724542523,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljs4xwy",
      "score": 1,
      "body": "I hold some bonds that pay great because tobacco is considered dirty",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljs4xwy/",
      "created": 1724542789,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljs8wsp",
      "score": 1,
      "body": "This is a large part of my dividend portfolio, but I don’t like to brag about it since it’s not doing society any good.  It gives me good cash flow though :)",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljs8wsp/",
      "created": 1724544366,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljsbbu5",
      "score": 1,
      "body": "I actually bought it in 1932 in april",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljsbbu5/",
      "created": 1724545334,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljst7ep",
      "score": 1,
      "body": "Maybe, but taking inflation into account, a 1925 dollar is worth $3 million today.",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljst7ep/",
      "created": 1724552847,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljt1c43",
      "score": 1,
      "body": "It’s also very easy to grow when you started that year with zero",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljt1c43/",
      "created": 1724556457,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljt3j8s",
      "score": 1,
      "body": "Yeah... All that tells me is it's best days are behind it.",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljt3j8s/",
      "created": 1724557493,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lju3t3u",
      "score": 1,
      "body": "Only +12% in the last 5 years though.",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/lju3t3u/",
      "created": 1724579922,
      "depth": 0,
      "replies": [
        {
          "id": "ljuk0gq",
          "score": 3,
          "body": "\\~50% including dividends.",
          "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljuk0gq/",
          "created": 1724589305,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljxehav",
      "score": 1,
      "body": "Smoke if you got ‘em",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljxehav/",
      "created": 1724625375,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljxf6dq",
      "score": 1,
      "body": "Dividends baby….",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljxf6dq/",
      "created": 1724625641,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljyo8w4",
      "score": 1,
      "body": "You make a lot of money killing people.",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/ljyo8w4/",
      "created": 1724644204,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk0ban9",
      "score": 1,
      "body": "Uh that’s not magic of compounding. That’s cherry-picking… nonetheless, still interesting.",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/lk0ban9/",
      "created": 1724678117,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk0lw8p",
      "score": 1,
      "body": "Selling cocaine on the street is higher gains per dollar. \n\nAltria is about as close as you can get to that legally speaking for a publicly traded company.",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/lk0lw8p/",
      "created": 1724682001,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk0p2b5",
      "score": 1,
      "body": "Fun fact, there're a few companies that have paid a dividend for over 100 years. Eli and Lilly, P&G, Coca Cola, DuPont, General Mills, Edison International, Johnson Controls, Church and Dwight, Stanley Black Decker, Exxon Mobil, Consolidated Edison, UGI Corp, Colgate-Palmolive, PPG industries and Chub Corp. Altria is close to joining that list",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/lk0p2b5/",
      "created": 1724683083,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk5f1x1",
      "score": 1,
      "body": "Technically each stock enjoys compounding. Once it rises 1%, the next 1% will actually be 1,01% and so on.\n\nIf the market was efficient, the dividend stocks would die of decay because of it since the dividend amount decreases its value by that exact amount (though in reality it's usually a lot less).",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/lk5f1x1/",
      "created": 1724751893,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkes660",
      "score": 1,
      "body": "The saying was “buy Coke and Smokes so you don’t go broke!”",
      "permalink": "/r/stocks/comments/1f0803k/an_interesting_fact_do_you_know_which_stock_has/lkes660/",
      "created": 1724884358,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "Altria has been the best performing US stock since 1925 with a compound annual return of 16.3%.",
    "companies": [
      "Altria"
    ],
    "tickers": [
      "MO"
    ],
    "main_ticker": [
      "MO"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The post highlights that Altria has been the best-performing stock in the US market since 1925.",
    "stock_recommendations": "The user is not recommending buying or selling any stocks.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "The post is informational, presenting historical data without recommending any stock actions.",
    "sentiment": "neutral"
  }
}