{
  "title": "Your thought on SNOW and RIVN?",
  "score": 43,
  "selftext": "Hi r/stocks,\n\nCouple years ago I bought 20 shares of SNOW and 15 shares RIVN during their IPOs. I sold about 10 shares of SNOW when it was fairly high. (\\~300) If I sold the rest of my shares, I will probably have a net gain about 0. Should I continue to hold to see if it will bounce back up or just sell it to invest in other investment vehicles? As for RIVN it is just a complete (excuse my frech) shit show. I bought it during the peak and the stock price never went up from there. In times like these, should I just sell all my shares to reap my loss?  Thanks in advance!",
  "link_flair_text": null,
  "id": "1f10vt4",
  "num_comments": 57,
  "created_utc": 1724604591,
  "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/",
  "comments": [
    {
      "id": "ljw7q48",
      "score": 57,
      "body": "I was up 200% on shares of F, so I sold them a few days ago and put it all into RIVN. Here are my thoughts:\n\nThey are a ways away from being profitable. Being profitable in automotive means being able to churn out volume. But they’re getting g there with Amazon, USPS and FedEx fleet contracts. \n\nTheir trucks are just so nice to drive. They feel so premium in every way, and pretty much every Rivian owner I’ve encountered loves their truck!  They push out new features all the time, and those features actually seem to work. \n\nThe R2 is coming out next year and the R3/R3X the year after. This is where they’ll gain a lot of market share, because they are affordable. People think EV’s are going away, but how many KIA’s Model 3’s, and Model Y’s do you see on a daily basis?  Millions!  And once people start installing home chargers, their gas/maintenance costs will fall dramatically. \n\nOf the EV stocks, I think RIVN has the best story. Lucid might have the best car, but Rivian (especially with VW investment) has a lot of upside, IMO",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljw7q48/",
      "created": 1724610524,
      "depth": 0,
      "replies": [
        {
          "id": "ljxhxi3",
          "score": 12,
          "body": "I don’t think anyone thinks electric vehicles are going anywhere. The issue is consumers don’t want to pay the prices manufacturers are charging for the models they have available.\n\nBeyond that, the home charging issue isn’t going to be resolved by people simply installing chargers at home. The issue exists because many people, especially in cities where EVs are most common and future buyers are most likely to live, rent.\n\nElectric vehicles are the future but there are a lot of barriers standing in their way for many consumers that just don’t make them worth it for them, currently.",
          "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljxhxi3/",
          "created": 1724626695,
          "depth": 1,
          "replies": [
            {
              "id": "ljxj5jq",
              "score": 7,
              "body": "You’re absolutely right…let me refine my statement a little:\n\nThe big 3 OEM’s decided to go all in on EV’e starting with their least affordable models. This was largely because they could pack the biggest battery in there - and range anxiety is what marketing studies point to as the biggest issue. \nRivian (and the others) are going to tap into a very hungry market when they are putting out a sub-$50k or even sub $40k vehicle. Once Rivian can start manufacturing at scale, profits will amplify. \n\nAs far as the energy, energy cost, energy infrastructure…I’m a Keynesian. The supply will follow the demand.",
              "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljxj5jq/",
              "created": 1724627167,
              "depth": 2,
              "replies": [
                {
                  "id": "ljyug18",
                  "score": 6,
                  "body": "Rivian the company (its investors) lost 38k to produce the truck I bought on average. \n\n“Once Rivian can start operating at scale” is the problem here. Barrier to break into profitability is non existent in the car industry for new joiners other than Tesla for decades. \n\nDon’t get me wrong, I love my Rivian, amazing quality. Not a company I’d invest in though. \n\nThe quality of my truck was funded by investors and not consumer dollars. I don’t see their play here to profitability.",
                  "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljyug18/",
                  "created": 1724647408,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ljxv9h7",
              "score": 1,
              "body": "I’m a landlord(just 2 houses) and I would totally allow a tenant to put in a charger. That type of thing isn’t a big deal. Apartment complexes are obviously different, but I would think there would be efficiencies to adding a few stations there. I don’t think it’s an insurmountable problem, it’ll just take time and working out means of payment",
              "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljxv9h7/",
              "created": 1724632094,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljxthtm",
              "score": 0,
              "body": "Another problem with the home charging is the power grid.  I lived in St Louis County for over 61 years.  When I left, county officials were saying if more than two residences in each subdivision required home charging, they didn't have the power to supply it.  We have a long way to go to make electric cars for the masses.  It is going to take some time.",
              "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljxthtm/",
              "created": 1724631364,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljzs0ww",
          "score": 1,
          "body": ">once people start installing home chargers, their gas/maintenance costs will fall dramatically\n\nThis concerns me about the EV space in general. More people in the country are renting than ever before, and landlords aren't generally going to put in chargers without some kind of mandate. Beyond that, the cost to install a home charger is variable, it sometimes depends on the building and can get wildly costly if a significant upgrade to the ejection system is needed to support that. I won't even get into public chargers and how common they aren't, because that part is largely irrelevant and could be rectified faster than the other issues.\n\nGeneral example from my own life, I considered going EV on my last upgrade. My reality was that I was going to have to park at my local police station for over an hour once per week, and it would be a 20 minute walk back and forth to my apartment if I didn't want to sit in the parking lot that whole time. Convincing my landlord to install a charger at our apartment building has logistical problems because there is nowhere obvious to put one (let alone two or three), even if convincing them to do it is a slam dunk (it isn't). So here I am with a gas car, not by choice, and I don't see a path to a convienienient charger unless I move.",
          "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljzs0ww/",
          "created": 1724669199,
          "depth": 1,
          "replies": [
            {
              "id": "ljzsv1a",
              "score": 2,
              "body": "I know it’s a drop in the bucket, but an increasing amount of new construction dwellings are coming with EV hookups installed already.",
              "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljzsv1a/",
              "created": 1724669671,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ljwf1la",
      "score": 11,
      "body": "Snowflake got huge from companies that were expanding their data analytics that was true specially during covid as enterprises were accelerating their digital spend. But that head wind is gone and now they face heavy competition from data bricks and companies are also cutting back on this spent to focus more on Ai.\n\nIt doesn’t help that SNOW heavily relies on stock based compensation and loosing a ton of $$ due to that. The minute they cut back on stock based compensation all top talent will flee. Which will crush their growth rate even more.\n\nThey are stuck in dilemma of slowing growth and huge losses..",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwf1la/",
      "created": 1724612966,
      "depth": 0,
      "replies": [
        {
          "id": "ljzyyj8",
          "score": 4,
          "body": "The need for data and processing is not going anywhere , so I'm not worried about it. Many people think companies pick one product or the other but almost any company of reasonable size has mutiple products. \n\nSo I'm not worried about lack of demand or a crowded space because I believe neither of those are true. \n\nBut the stock compensation I do believe is a real issue",
          "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljzyyj8/",
          "created": 1724672803,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljzemu4",
      "score": 6,
      "body": "RIVN is the “other” pure EV company besides Tesla.  There’s an argument RIVN will eventually be viable.\n\nThey have products people like and a CEO who isn’t crazy.  \n\nThe downside is their very small scale and lack of profitability.  They didn’t expand their production that much this year and steep ongoing losses forced them to mothball their planned new factory in some emergency cost cutting.  Those losses also did cast some doubt on their runway and viability to continue.\n\nBUT there’s counterpoint good news for all of that.  \n\nOne, they’ve now been backstopped by a $5+ billion (?) commitment from VW, so the worries of cash starvation, dilution and bankruptcy are off the table for several years, assuming VW honors the agreement.  \n\nThe modest production numbers do at least reflect accurate and realistic forecasting, and the credibility of the CEO.  Many even bet they’d never get to production at all, then doubted how many units.  He’s delivered on his promises all along the way, which no other EV company seems to do.\n\nRivian vehicles are expensive, and the headline numbers suggest that they need high margins but that means keeping prices high.  The upside is their low production numbers mean at their scale they only need to attract affluent buyers anyway.  But if they ever scale up, they’ll have to solve the margin puzzle and so far it doesn’t seem like they can do both.  Maybe with VW being more actively invovled?",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljzemu4/",
      "created": 1724660405,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljw3tui",
      "score": 12,
      "body": "I think SNOW had a head start in the data warehouse / data lake space with a great exec-level marketing campaign that hit pre-covid and (at the time), a clear and differentiated product. Sales cycles were really fast, and companies were all onboard with this idea of one unified analytics platform where they could push all their data and easily enable new use-cases. \n\nIn reality, while Snowflake ~works, it doesn’t have anything close to the extended capabilities of the big3 mature cloud platforms (AWS, GCP & Azure) and the difficulty remains in orchestrating useful data use-cases. Simultaneously, the hyperscalers have continued to develop and push their own competing platforms — why would i leave my full GCP stack to do random one-off work on Snowflake that I could do on BigQuery? Or Redshift, or Synapse/Fabric? And then at least I have a mature AI platform next to my data (Snowpark is an absolute joke). Not to mention that Databricks has done a much better job of winning over developers than Snowflake has, and Databricks integrates better with existing cloud providers.\n\nI don’t think SNOW is dead, and I think the rising tide in AI will life all data boats, but I personally look at the low PE hyperscalers as being a more interesting option in the next few years.",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljw3tui/",
      "created": 1724609228,
      "depth": 0,
      "replies": [
        {
          "id": "ljw9yyp",
          "score": 18,
          "body": "> why would i leave my full GCP stack to do random one-off work on Snowflake that I could do on BigQuery? Or Redshift, or Synapse/Fabric?\n\nBecause all of those options suck comparatively.",
          "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljw9yyp/",
          "created": 1724611272,
          "depth": 1,
          "replies": [
            {
              "id": "ljwrgne",
              "score": 2,
              "body": "Redshift at this point is now ahead on all things Iceberg... you have Redshift Spectrum, Serverless, and provisioned nodes to fulfill every use case, Zero ETL from RDS and Dynamo and other sources... Redshift is more performant and cost effective than Snowflake now, it's nuts. Everything flipped in the last few years, while Snowflake did almost nothing.",
              "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwrgne/",
              "created": 1724617178,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljwamcc",
              "score": 0,
              "body": "The do suck right now but for how long.",
              "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwamcc/",
              "created": 1724611490,
              "depth": 2,
              "replies": [
                {
                  "id": "ljwbbji",
                  "score": 6,
                  "body": "They don't have much of a moat, but the question is whether SNOW, who has a track record of exactly _1 product_ can repeat and expand their business successfully before those companies who have a track record of _inferior innovation in this space_ will match SNOW. Neither is a sure bet, but when talking about the present, I would pick SNOW over BigQuery (LOL) any day.",
                  "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwbbji/",
                  "created": 1724611722,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljwbz0x",
                      "score": 7,
                      "body": "I think Snowflake is here to stay however if BigQuery is cheaper and can do 90% of what Snowflake does alot of people wont buy Snow. However Snowflake has great marketing",
                      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwbz0x/",
                      "created": 1724611937,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljwd72y",
                          "score": 8,
                          "body": "> if BigQuery is cheaper \n\nThat *if* is doing some heavy lifting for you. BigQuery is more expensive as your dataset scales. We've modeled it.",
                          "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwd72y/",
                          "created": 1724612343,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ljwe32n",
                              "score": 1,
                              "body": "I dont see smaller companies buying into Snowflake if bigquery can do what snow does.",
                              "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwe32n/",
                              "created": 1724612639,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ljwete7",
                                  "score": 2,
                                  "body": "Snowflake is easier to set up for small companies and you don't need to be on GCP.",
                                  "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwete7/",
                                  "created": 1724612888,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ljwew04",
                                      "score": 2,
                                      "body": "Fair enough",
                                      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwew04/",
                                      "created": 1724612912,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ljwr2a1",
              "score": -1,
              "body": "The biggest demand right now in these workflows is AI capabilities, & Snowpark is a joke compared to what the hyper-scalers offer.\n\nI agree with you that Snowflake does what Snowflake intended to do better than the 3, but that’s not enough of a value add to justify using it over an ecosystem that integrates ML workflows natively (not to mention GenAI, where Azure and GCP are potentially a decade ahead of Snowflake, and AWS only slightly behind).",
              "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwr2a1/",
              "created": 1724617042,
              "depth": 2,
              "replies": [
                {
                  "id": "ljxfv7r",
                  "score": 2,
                  "body": "Depends on ML worlkflow. Snowflake is much more plug and play than Databricks for ML models. It’s ideal for simple models and for organizations heavy on traditional BI dw teams not looking to spend too much to create new teams and still use their data for simple classification and forecasting. Not every corp will be developing cutting edge in-house AI models. Some just need the ease of use and qol features to get a foot in the door and Snowflake is a hidden sleeper for that. IT organizations are not the most efficient typically in large companies that are not traditionally an IT business.",
                  "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljxfv7r/",
                  "created": 1724625903,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljy3ovx",
                      "score": 1,
                      "body": "I mostly agree with that, although the trend for simple plug&play ML models is growing towards GenAI. Snowflake lags pretty heavily in that department, compared to Databricks and the big3.",
                      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljy3ovx/",
                      "created": 1724635572,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ljxs7es",
                  "score": 1,
                  "body": "What do you do for a living? You don't sound like you work in tech.",
                  "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljxs7es/",
                  "created": 1724630826,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljy34rx",
                      "score": 1,
                      "body": "I own an ML cloud product at one of the aforementioned hyperscalers lmao",
                      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljy34rx/",
                      "created": 1724635344,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ljvyp0e",
      "score": 8,
      "body": "Databricks is better than snowflake currently. Snowflake is also extremely expensive",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljvyp0e/",
      "created": 1724607533,
      "depth": 0,
      "replies": [
        {
          "id": "ljw0uzo",
          "score": 19,
          "body": "Databricks is more expensive than Snowflake. Databricks also requires more manpower/labor to get it up and running due to it's running on Spark whereas Snowflake is more towards the 'it just works' philosophy.",
          "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljw0uzo/",
          "created": 1724608247,
          "depth": 1,
          "replies": [
            {
              "id": "ljwmmbw",
              "score": 10,
              "body": "This. The right cost comparison seems to be data scientists + Snowflake vs data scientists + Databricks + engineers to manage it.  \n\nData scientists are tasked with using data to improve the business, the rest is overhead to support their work.\n\nIf you ask a team of engineers who know how to run the open source stack themselves, they'll prefer Databricks because it makes that easier while Snowflake makes it impossible and for many use cases unnecessary.",
              "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwmmbw/",
              "created": 1724615551,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljw6up4",
          "score": 6,
          "body": "Anyone know if Databricks will have an IPO?",
          "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljw6up4/",
          "created": 1724610234,
          "depth": 1,
          "replies": [
            {
              "id": "ljzzcci",
              "score": 1,
              "body": "They're operating as if they are already public which is a good indicator.",
              "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljzzcci/",
              "created": 1724672987,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljwa420",
          "score": 7,
          "body": "A better company or a better product? As a user (procure $1M+ in software per year), Snowflake is an amazing product and nothing comes close. They could literally double their prices and we would gladly pay for the value it drives.\n\nIf they start building on their core product and can transition into adjacent offerings, there won't be a reason to go elsewhere.",
          "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwa420/",
          "created": 1724611321,
          "depth": 1,
          "replies": [
            {
              "id": "ljwafq9",
              "score": 0,
              "body": "Product. My company ditched Snowflake for Databricks and we love it.",
              "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwafq9/",
              "created": 1724611429,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljx9m4l",
          "score": 2,
          "body": "Databricks doesn’t have to report public information allowing them to burn SBC far faster than SNOW",
          "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljx9m4l/",
          "created": 1724623527,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljwkqzu",
          "score": 1,
          "body": "Not sure why anyone pays for any of this crap when all you need is an S3 bucket and *polars* (/s).\n\nDatabricks is growing like crazy too. They went from sort of obscure novelty just a few years ago to an absolute powerhouse seemingly overnight.",
          "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwkqzu/",
          "created": 1724614917,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljw6u0f",
      "score": 3,
      "body": "That Rivn I see more of it running on the street in Northern CA. But if you look at earnings and profitability you do way better with anything but eV.   I own 1 share of Rivn paid 8.9 so I can see when it will hit the floor.\n\nAs for Snow I bet on the wrong horse got out in 2022 dumped at 292. Will never want to make that mistake again.",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljw6u0f/",
      "created": 1724610228,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljw1a6o",
      "score": 2,
      "body": "Average down",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljw1a6o/",
      "created": 1724608388,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljvuuy4",
      "score": 1,
      "body": "Wasn’t rivian on fire?",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljvuuy4/",
      "created": 1724606259,
      "depth": 0,
      "replies": [
        {
          "id": "ljw7xdw",
          "score": 9,
          "body": "Some cars were on fire",
          "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljw7xdw/",
          "created": 1724610589,
          "depth": 1,
          "replies": [
            {
              "id": "ljwfwed",
              "score": 2,
              "body": "In the defect lot.",
              "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwfwed/",
              "created": 1724613256,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljvycxe",
          "score": 2,
          "body": "[https://www.google.com/search?q=rivn&rlz=1C1ONGR\\_enUS1004US1004&oq=rivn&gs\\_lcrp=EgZjaHJvbWUqDwgAEAAYQxixAxiABBiKBTIPCAAQABhDGLEDGIAEGIoFMg8IARAAGEMYsQMYgAQYigUyDAgCEAAYQxiABBiKBTIMCAMQABhDGIAEGIoFMgwIBBAAGEMYgAQYigUyDAgFEAAYQxiABBiKBTIPCAYQABhDGLEDGIAEGIoFMgYIBxBFGDzSAQc2ODVqMGo0qAIAsAIB&sourceid=chrome&ie=UTF-8](https://www.google.com/search?q=rivn&rlz=1C1ONGR_enUS1004US1004&oq=rivn&gs_lcrp=EgZjaHJvbWUqDwgAEAAYQxixAxiABBiKBTIPCAAQABhDGLEDGIAEGIoFMg8IARAAGEMYsQMYgAQYigUyDAgCEAAYQxiABBiKBTIMCAMQABhDGIAEGIoFMgwIBBAAGEMYgAQYigUyDAgFEAAYQxiABBiKBTIPCAYQABhDGLEDGIAEGIoFMgYIBxBFGDzSAQc2ODVqMGo0qAIAsAIB&sourceid=chrome&ie=UTF-8)\n\nI mean their share is up around 8% for the day which makes the share price at \\~$14. But I bought it at IPO ($129/share)",
          "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljvycxe/",
          "created": 1724607422,
          "depth": 1,
          "replies": [
            {
              "id": "ljw0dbp",
              "score": 19,
              "body": "He means literally",
              "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljw0dbp/",
              "created": 1724608087,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljw1g7y",
              "score": 0,
              "body": "Ah, there's another post somewhere in here.. with a video of the rivian factory  on fire. I think it happened yesterday.\n\nSo Rivian was literally on fire.",
              "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljw1g7y/",
              "created": 1724608443,
              "depth": 2,
              "replies": [
                {
                  "id": "ljwfr31",
                  "score": 4,
                  "body": "Not in the factory it is parking lot fire where they had cars for repair in the normal (city name) Rivian plant. Seems to be happening quite often per locals https://www.25newsnow.com/2024/08/25/electric-vehicles-catch-fire-rivians-normal-plant/?outputType=amp",
                  "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwfr31/",
                  "created": 1724613206,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ljvwe4f",
      "score": 5,
      "body": "Snowflake will continue to take regular beatings until they change their business practices. Sure, they aren't responsible for hackers using credentials stolen from elsewhere, but their lax security policies allow for that sort of common attack to work, and the media will continue to jump on it when it happens.",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljvwe4f/",
      "created": 1724606769,
      "depth": 0,
      "replies": [
        {
          "id": "ljw16cm",
          "score": 12,
          "body": "Blaming Snowflake for that hack is like blaming Google for you getting your gmail credentials stolen. It's not their fault customers didn't use 2FA which they're now proactively having customers address, hardly anything inherent to their 'business practices', do you even know anything about Snowflake or the space?",
          "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljw16cm/",
          "created": 1724608352,
          "depth": 1,
          "replies": [
            {
              "id": "ljw394f",
              "score": 1,
              "body": "As I said, Snowflake isn't responsible for the breaches, but the media has latched onto that point and will bring it up every time another breach happens. Even if the customer was giving out their credentials on billboards, the name Snowflake will still come up in the press. Snowflake could eliminate that risk and come out with a great press release about those attacks never affecting their customers again, but they still only \"strongly recommend\" enhanced security measures like 2FA. \n\nNow, if we're talking about knowing anything, do you think markets care more about business practices or news articles/reputation?",
              "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljw394f/",
              "created": 1724609040,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lk11o0p",
      "score": 1,
      "body": "Horrible price to buy at ipo.. Great time now to buy",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/lk11o0p/",
      "created": 1724687219,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljvsi4k",
      "score": 0,
      "body": "Some ipos just never really take off it seems and just keep bleeding money til they go bankrupt and cease to exist. Rivn and snowflake seem like that but i guess if people knew where a company would be in 5 to 10 years we could all be trillionaires. Realistically no one knows not even the ceo and boards of a company know but the best thing I'd say is to keep up to date on how the company is doing, are they growing their revenue, becoming more and more profitable, gaining popularity and make your decision from there. I personally haven't seen a rivian here in Toronto and I've heard people have been leaving snowflake as customers but I don't follow them super closely so I don't really know.",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljvsi4k/",
      "created": 1724605476,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljvx04e",
      "score": -4,
      "body": "Your comments on both stocks are just on the share price. You seem to have done zero research on their financial performance, risks, valuation, etc. \n\nSell.",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljvx04e/",
      "created": 1724606970,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljwe5rb",
      "score": 0,
      "body": "Thinking about SNOW here, it’s below its IPO price but wondering if the chart suggests it could fall below 100.",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljwe5rb/",
      "created": 1724612665,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljy5cgg",
      "score": 1,
      "body": "RIVN",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljy5cgg/",
      "created": 1724636246,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk06bgp",
      "score": 1,
      "body": "Palantir is better than snow",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/lk06bgp/",
      "created": 1724676107,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljxlwmw",
      "score": -4,
      "body": "Rivn and snow are a shit show and you know this. Why hope when you could recycle the money into profitable stocks instead?",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljxlwmw/",
      "created": 1724628257,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljy6y2x",
      "score": -4,
      "body": "A rivian plant caught fire in Indiana today. For what it's worth.",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljy6y2x/",
      "created": 1724636888,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljycu81",
      "score": -5,
      "body": "Didn't rivn just have a giant fire at a plant?",
      "permalink": "/r/stocks/comments/1f10vt4/your_thought_on_snow_and_rivn/ljycu81/",
      "created": 1724639218,
      "depth": 0,
      "replies": []
    }
  ]
}