{
  "title": "You, too, can easily predict Boeing crashes! (A serious and in depth discussion on Boeing, ULA, NASA, and the future of spaceflight)",
  "score": 120,
  "selftext": "Good day fellow regards,\n\nFirst of all, y'all are wild! A lazy Saturday morning tongue-in-cheek shitpost about Boeing and the NASA press conference has a lot of you wearing tin foil hats, but man Stevie Wonder saw this coming on Thursday. No, there’s no “insider trading” or outing my dad, or any other wacky ideas you have. Here, I'll walk you through it:\n\n2014 - NASA announces the  \nISS CCP contract, awarding both Boeing ($4.2 bil) and SpaceX ($2.6 bil) getting  \nthe actual final contracts, with first flights targeted for 2017. Space-X  \ndevelops the Dragon, launches on the Falcon 9, massive success, yada yada, you  \nknow the story. Boeing meanwhile buys Atlas V rockets (from itself at ULA) to  \nfly their Starliner, which we'll get back to in a bit.\n\nStarliner's unmanned OFT1 test flight came 2 years late in 2019 and was an absolute shitshow start to finish. So bad, in fact, that NASA required a second unmanned OFT2 test flight, which Boeing didn't complete until 2022, and was also a total failure (remember that it tried launching in 2021 and couldn’t, and a crew abort system test was required afterwards). There was a lot of speculation that an OFT3 was needed,  \nbut NASA kind of surprised everyone by letting the Astronauts go up on the  \ncurrent CFT1 mission this summer, albeit with highly experienced NASA  \nastronauts on board, and not Boeing’s crew (for reasons that are highly  \napparent now). \n\nThe ISS is a menagerie of disparate modules strapped together with next to no standardization. There’s an excellent USA Today article that came out a couple of weeks ago: [https://www.usatoday.com/story/graphics/2024/08/15/nasa-starliner-astronauts-iss/74590421007/](https://www.usatoday.com/story/graphics/2024/08/15/nasa-starliner-astronauts-iss/74590421007/) That means that until the Starliner is jettisoned, nobody else was coming up. The writing was on the wall on 8/16 when Boeing quietly announced that it was in talks to sell ULA to Sierra [https://www.reuters.com/business/aerospace-defense/boeing-lockheed-martin-talks-sell-ula-sierra-space-2024-08-16/](https://www.reuters.com/business/aerospace-defense/boeing-lockheed-martin-talks-sell-ula-sierra-space-2024-08-16/)\n\nThursday NASA announced it was holding the final decision press conference on Saturday at 1 PM ET - [https://www.nasa.gov/news-release/leadership-to-discuss-nasas-boeing-crew-flight-test/](https://www.nasa.gov/news-release/leadership-to-discuss-nasas-boeing-crew-flight-test/) This is where even Stevie Wonder saw the final decision. Ask yourself if you’ve ever known a government worker to come in on a Saturday? And why would NASA hold that conference at that date and time unless it was bad news for their publicly-traded contractor? You should have all been calling your nana’s puts or whatever the heck it is you do (I’m only here for the memes and spaceflight chatter, I dunno why you like space company stocks, but that’s how I got here)\n\nAnd seriously, this decision has been predicted for weeks by the likes of NASASpaceflightNow and Ars Technica (who have amazing Rocket Reports, highly recommended - [https://arstechnica.com/space/2024/08/rocket-report-a-ula-sale-tidbit-polaris-dawn-mission-is-on-deck/](https://arstechnica.com/space/2024/08/rocket-report-a-ula-sale-tidbit-polaris-dawn-mission-is-on-deck/) )\n\nThat brings us to the actual announcement of SpaceX to the rescue (in the words of Billie Eilish, duh) - [https://www.nasa.gov/news-release/nasa-decides-to-bring-starliner-spacecraft-back-to-earth-without-crew/](https://www.nasa.gov/news-release/nasa-decides-to-bring-starliner-spacecraft-back-to-earth-without-crew/) The more telling piece in this announcement, is that there will be a 3-week lag time between Starliner undocking and the SpaceX Crew 9 launch. History students of NASA will recognize that as an abnormally large amount of time to leave the ISS manned with a single lifeboat (Crew 8), especially one that does not exactly have the space (or space suits) for all the astronauts onboard. The fact that NASA thinks it’s less risky to keep so many people on the ISS without adequate lifeboat coverage for such duration is frankly pretty huge. Let’s talk about what that means.\n\nFirst, why did NASA not require the 3^(rd) unmanned test with so many issues on the 2 OFT’s? Well, remember the Atlas V thing? ULA builds the Atlas V and announced in 2021 that it was getting retired, and finished the last production rockets earlier this year. All 15 Atlas V’s left have been spoken for, and that includes all of Boeing’s ISS CCP missions (only 6).\n\nWell, NASA also announced that the ISS is being shut down and de-orbited in 2030 - [https://www.nasa.gov/news-release/nasa-selects-international-space-station-us-deorbit-vehicle/](https://www.nasa.gov/news-release/nasa-selects-international-space-station-us-deorbit-vehicle/) which isn’t that far away. NASA has more or less 6 years of needs to service the ISS at this point, and it will absolutely take Boeing at least 2 years to get the next mission ready, which let’s face it, will be a test again. (Two of the board members on the safety panel for this mission were on the Columbia panel and were overruled, they are damn well not going to let that happen again).\n\nWell ULA is already contracted with Amazon for some of it’s Kuiper constellation of satellites, on those aforementioned Atlas V’s. It makes far more financial sense at this point for Boeing to wash it’s hands of the Starliner (which is a cost-plus contract $1.4 bil over budget so far) and sell those remaining 6 ULA Atlas V’s to Amazon and/or other highest bidders, and use those pumped numbers to help sell off ULA (or at least for Boeing to exit and leave ULA entirely in Lockheed’s hands, which isn’t a bad play for either of them). Boeing leaving is so much more than Starliner, as they are the contractor for the Space Launch System (lol wsb won't me use it's real acronym cause it's a stock) Block 2 EUS ($2.4 bil already and they haven’t even built one), and even bigger yet, they are the contractor for the Space Launch System Block 1 Core Stages, which frankly is a deep dive all on it’s own. Suffice it to say, Boeing has received at least $10 bil for the 1^(st) of the 6 of these it needs to supply, and then after that the Block 2 Core Stage will be a Boeing/Grumman concern (of which Grumman can easily handle on it’s own).\n\nBoeing has it’s fingers in a lot of the future NASA missions, but almost all of them involve much more highly experienced partners that can take over, and the two sole Boeing products (Starliner and Block 1 Cores) can be respectively canceled, and paired back (we don’t even have enough RS-25 engines to build the last 2 Cores, and only 2-4 are in production right now, it would be super easy to stop at 4)\n\nSo, stonks then. This mission has been a \\*very\\* public demonstration of technical ineptitude that has captured the attention of the American media and public. To paraphrase, 2 deaths is a tragedy, 346 deaths is statistics. To the general public, a couple of crashes overseas by airlines they never heard of isn’t going to move the needle like 2 certified American heroes being stranded in space, and yes, stranded is the right word. I have no idea what the BA stock will do (nor do I care, my position is 0 and always been, same with dear old dad), that’s for you apes to prognosticate.\n\nI predict (based on the very publicly available “insider information” that is government contracts and NASA press releases), that NASA and Boeing will announce a cancellation of Starliner (and likely blame it on the short amount of time ISS has left and lack of need for the 6, nay 5, service missions), followed by more news on Boeing pulling the plug on all of it’s NASA commitments one joint venture at a time. Does that make Lockheed, Grumman, Sierra, and Blue Origin look more attractive for investment? And will Boeing “crash” because of filthy normals calling their brokers to sell, or will it go up based on selling off all their unprofitable spaceflight work to concentrate on building convertible airplanes? I dunno, you tell me down below.  \n  \nThanks for the wild ride and good luck with nana’s money. I’m going to go talk to dad about de-orbiting this hunk of junk and other space safety nerd stuff.",
  "link_flair_text": "Discussion",
  "id": "1f15o62",
  "num_comments": 47,
  "created_utc": 1724616788,
  "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/",
  "comments": [
    {
      "id": "ljwqbgz",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 1 day ago\n**Total Comments** | 24 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljwqbgz/",
      "created": 1724616792,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljwu9e4",
      "score": 110,
      "body": "Tldr = boeing price may go up or down",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljwu9e4/",
      "created": 1724618119,
      "depth": 0,
      "replies": [
        {
          "id": "ljwvaiy",
          "score": 8,
          "body": "I need more money for puts!",
          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljwvaiy/",
          "created": 1724618465,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljzdynl",
          "score": 3,
          "body": "And it will be the opposite of what you choose.",
          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljzdynl/",
          "created": 1724659939,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lk33r8a",
          "score": 2,
          "body": "Now that's what I call DD",
          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/lk33r8a/",
          "created": 1724711505,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljyww07",
          "score": 1,
          "body": "I bought puts, so it's going up.",
          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljyww07/",
          "created": 1724648776,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljwr2dv",
      "score": 113,
      "body": "Jesus Christ where’s the TL;DR??  I’m not reading all that shit. This is WSB, not a library!",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljwr2dv/",
      "created": 1724617043,
      "depth": 0,
      "replies": [
        {
          "id": "ljwvci0",
          "score": 53,
          "body": "TL;DR - Boeing likely selling off all spaceflight interests after Starliner public debacle and end of the ISS in 2030.",
          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljwvci0/",
          "created": 1724618482,
          "depth": 1,
          "replies": [
            {
              "id": "ljwyi7d",
              "score": 12,
              "body": "Thanks!  That I can read :)",
              "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljwyi7d/",
              "created": 1724619551,
              "depth": 2,
              "replies": [
                {
                  "id": "ljxisi3",
                  "score": 7,
                  "body": "Real news is calls on Musk",
                  "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljxisi3/",
                  "created": 1724627026,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljycw58",
                      "score": 3,
                      "body": "Not when he hurts other feelings. ",
                      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljycw58/",
                      "created": 1724639240,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljyk4gk",
                          "score": 3,
                          "body": "#🤕",
                          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljyk4gk/",
                          "created": 1724642277,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lk8wx7g",
              "score": 1,
              "body": "Eh, sell off wasn’t THAT bad…",
              "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/lk8wx7g/",
              "created": 1724796734,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljxbvxs",
              "score": 1,
              "body": "No they won’t.",
              "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljxbvxs/",
              "created": 1724624385,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ljxza4i",
      "score": 22,
      "body": "You guys are idiots.\n\nIf Boeing isn't at sub 100 after literally assassinating people and having like 10 consecutive weeks of terrible news you think anything can move this stock?\n\nThis is just like Carvana. The stock is rigged. Stop trying to short it and lighting your money on fire.",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljxza4i/",
      "created": 1724633747,
      "depth": 0,
      "replies": [
        {
          "id": "lk1e42h",
          "score": 4,
          "body": "isnt them assassinating people bullish?",
          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/lk1e42h/",
          "created": 1724691207,
          "depth": 1,
          "replies": [
            {
              "id": "lk4j03q",
              "score": 1,
              "body": "as long as it's whistleblowers",
              "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/lk4j03q/",
              "created": 1724731773,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lk4j1q2",
          "score": 1,
          "body": "stock is rigged like INTC, too-big-to-fail, US govt will  always bail out",
          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/lk4j1q2/",
          "created": 1724731796,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljwuqul",
      "score": 17,
      "body": "You must tell us if daddy lets you in on any more juicy knowledge…",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljwuqul/",
      "created": 1724618282,
      "depth": 0,
      "replies": [
        {
          "id": "ljxqh77",
          "score": 4,
          "body": "Daddy is agent 69.",
          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljxqh77/",
          "created": 1724630111,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljwsi42",
      "score": 11,
      "body": "So nervous about outing your dad you made another post…. SEC is busy bro market was closed and nobody important has time to waste on a wsb post. You’re good. Or not I literally have no idea.",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljwsi42/",
      "created": 1724617527,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljwweb1",
      "score": 6,
      "body": "Stock will have a wide candle in premarket and minute 1 of opening but will otherwise do nothing of significance. This was known and priced in weeks ago. A small surge of loss porn will get posted next week by wsb normies crushed on weeklies. The end",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljwweb1/",
      "created": 1724618835,
      "depth": 0,
      "replies": [
        {
          "id": "ljx0rfs",
          "score": 2,
          "body": "Any thoughts on longer term implications of pulling out of the commercial crew program and/or spaceflight all together?",
          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljx0rfs/",
          "created": 1724620334,
          "depth": 1,
          "replies": [
            {
              "id": "ljyv6ui",
              "score": 3,
              "body": "It seems like the logical choice to escape the money pit. But there are a lot of space-infrastructure type contracts out there that don’t involve human payloads. It seems like boeing are still interested in stuff like payload transfer and secure comms. They got that DOD satcom contract and rumor is they’re bidding on NASAs near-space network services contract. It’s where the industry is going, where the money is, and where boeing can still be competitive, although the field is a lot more crowded than it was.",
              "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljyv6ui/",
              "created": 1724647819,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljx9yj8",
          "score": 1,
          "body": "I bet some investors are breathing a sigh of relief that the worse was being bailed out by SpaceX instead of going through a dicey return with the astronauts.",
          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljx9yj8/",
          "created": 1724623656,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljyljc8",
      "score": 5,
      "body": "Just put the fries in the bag bro",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljyljc8/",
      "created": 1724642918,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljyn9gj",
      "score": 4,
      "body": "Nice summary, thanks 👌",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljyn9gj/",
      "created": 1724643734,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljz0c50",
      "score": 5,
      "body": "This is at least one full order of magnitude too intelligent for this sub.",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljz0c50/",
      "created": 1724650820,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljy330y",
      "score": 3,
      "body": "Great write up! \n\nI’ve been thinking if Sierra doesn’t buy ULA, what are the odds that Blue Origin makes a play for them in order to expand their operations.",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljy330y/",
      "created": 1724635324,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljz1ll1",
      "score": 3,
      "body": "What I find interesting that no one is talking about is how we might see Starliner fail on reentry. I was going to make a post about this earlier today, but work got in the way and now you come along with this great explainer, I’ll just put my 2 cents in a comment.\n\nTo the uninitiated: Starliner’s failures were in its RCS thrusters, which basically control how it’s oriented and the direction it’s going. They got very lucky that the failure was able to be controlled enough to dock with the ISS. I am not sure if luck will be on their side again. Not only did Starliner not originally have autonomous descent software in it, but these thrusters will also control how it reenters the atmosphere.\n\nThere are a few scenarios that could happen:\n1. They don’t fail again, reentry goes off without a hitch\n2. They fail in such a way that causes the reentry profile to be too steep, causing it to burn up on reentry.\n3. They fail in such a way that causes the reentry profile to be too shallow, causing it to take multiple orbits to slow down enough for atmospheric capture, altering its final destination and even possibly causing scenario 2 to happen.\n4. They fail in such a way that causes it to crash into the ISS. This one is much less likely from the basis that NASA is even ok’ing it to undock, crashing into the ISS would not just endanger the lives of everyone on board, but also cause rifts in global geopolitics (they don’t call it the INTERNATIONAL Space Station for nothing), ain’t no way NASA is risking this.\n\nScenario 1 is boring and does nothing for all of your puts. Scenario 2 and 3 I believe would cause a lot of panic selling. Boeing has reportedly been adamant about the astronauts using Starliner still despite these failures, and if it’s destroyed upon reentry all anyone will be talking about is “holy shit Boeing almost knowingly caused another Columbia.”\n\nThen again, I know more about rocket science than I’ll ever know about stocks, and I only know the very basics of rocket science.",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljz1ll1/",
      "created": 1724651601,
      "depth": 0,
      "replies": [
        {
          "id": "ljz1lly",
          "score": 1,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljz1lly/",
          "created": 1724651602,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljyk5yz",
      "score": 4,
      "body": "> No, there’s no “insider trading” or outing my dad\n\nI saw him on Grindr though, so...",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljyk5yz/",
      "created": 1724642294,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljz1qk3",
      "score": 1,
      "body": "Lockheed and Raytheon are where the action is baby they got that recovered UAP technology.",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljz1qk3/",
      "created": 1724651690,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk06xwt",
      "score": 1,
      "body": "I didn't read all that, but just checked Boeing price is still 50+% higher than the 2022 lows. That is impressive.",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/lk06xwt/",
      "created": 1724676370,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk0flvz",
      "score": 1,
      "body": "if this kid told me he had ADHD and was on the spectrum in a TikTok video I'd definitely believe it.",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/lk0flvz/",
      "created": 1724679763,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk3uuzj",
      "score": 1,
      "body": "And the \"sell off the manned space business\" signaling has begun - https://fortune.com/2024/08/25/boeings-ceo-kelly-ortberg-starliner-writedown-nasa-spacex-cash-reserves/",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/lk3uuzj/",
      "created": 1724721599,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljxbfpa",
      "score": 1,
      "body": "This Boeing shitshow is a premium example of why government should not interfere with innovation by awarding meritless contracts. Don’t kill me boeing. ",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljxbfpa/",
      "created": 1724624214,
      "depth": 0,
      "replies": [
        {
          "id": "ljxmy3c",
          "score": 3,
          "body": "Boeing is watching! No backsies...",
          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljxmy3c/",
          "created": 1724628678,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lk0fgjk",
          "score": 1,
          "body": "remember to tell that to the people who want to Nationalize Boeing.",
          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/lk0fgjk/",
          "created": 1724679707,
          "depth": 1,
          "replies": [
            {
              "id": "lk0ho9u",
              "score": 1,
              "body": "You cannot talk logic to illogical people.",
              "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/lk0ho9u/",
              "created": 1724680512,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ljyvx2w",
      "score": 1,
      "body": "Gives me Girl Wood thinking about Elon Musk’s Spacex being competent enough to rescue those astronauts.",
      "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/ljyvx2w/",
      "created": 1724648224,
      "depth": 0,
      "replies": [
        {
          "id": "lk002yk",
          "score": 2,
          "body": "Wait for them to Colombia SpaceX on re entry because they hate the musk aroma.  FAA grounded them because FAA is Boeing. All praise boeing.",
          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/lk002yk/",
          "created": 1724673335,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lk0e084",
          "score": 2,
          "body": "But SpaceX is a private company. So why are you fully torqued about that...",
          "permalink": "/r/wallstreetbets/comments/1f15o62/you_too_can_easily_predict_boeing_crashes_a/lk0e084/",
          "created": 1724679157,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}