{
  "title": "Is it smart for a younger investor to invest in dividend stocks?",
  "score": 36,
  "selftext": "I’m 23 and looking to start investing, i’ve always been fascinated by dividend portfolios. The idea of investing enough money to where your dividend returns are eventually able to cover your living expenses is cool and something I’d want to do down the road, but i’m curious if it would be smarter to invest in dividend stocks now (with dividends reinvested) or if i should invest in other things while i’m still young and can take extra risk to prioritize growth & then when it’s closer to retirement time swap those holdings out into dividend stocks . What would you do? what should I be focusing on now",
  "link_flair_text": null,
  "id": "1f1tchd",
  "num_comments": 112,
  "created_utc": 1724691795,
  "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/",
  "comments": [
    {
      "id": "lk1fz7k",
      "score": 1,
      "body": "Welcome to r/stocks!\n\nFor stock recommendations please see our portfolio sticky, sort by hot, it's the first sticky, or see [past portfolio stickies here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all)\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1fz7k/",
      "created": 1724691795,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk1iiqe",
      "score": 86,
      "body": "\"Total Return\" = Growth in Equity Value + Earnings returned to Equity Holders.\n\nSometimes a company grow well, and also pay dividends.\n\nWorth keeping out a look for those.\n\n![gif](emote|free_emotes_pack|neutral_face)",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1iiqe/",
      "created": 1724692601,
      "depth": 0,
      "replies": [
        {
          "id": "lk5xrlz",
          "score": 5,
          "body": "My son was playing golf and was advised by a super successful guy to use Charles Schwab, Robo adviser and invest in S&P. Any thoughts?",
          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk5xrlz/",
          "created": 1724761551,
          "depth": 1,
          "replies": [
            {
              "id": "lk65wpp",
              "score": 10,
              "body": "He doesn't need the robo advisor, just buy VOO in a Schwab account and add to it consistently.",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk65wpp/",
              "created": 1724764764,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lk63960",
              "score": 4,
              "body": "I do not give investment advice.\n\nHere are some topics to look over for your self.\n\n\"Warren Buffet Ratio\" - An indicator of market value swings against Gross Domestic Product value.\n\nThe best investor I personally knew, often remained silent during high valuation years.  That was hard for me to reconcile, since super growth was all the news would talk about.  I see that wisdom now. \n\n\"Learn from the present without risk\" - I frequently created dashboard screen portfolios.  A hypothetical list of holding of funds and stocks.  It takes years for the pattern to become clear.\n\n\"The best investment is in yourself\" - Focus on a career you enjoy and stay with it.  Always be learning and improving.  Make sure you have adequate savings to cover your expected & unexpected living costs.\n\n![gif](emote|free_emotes_pack|shrug)",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk63960/",
              "created": 1724763756,
              "depth": 2,
              "replies": [
                {
                  "id": "lk65kri",
                  "score": 3,
                  "body": "Thank you!  Patterns are always obvious in hindsight—::) and seemingly random at other times-but the practice portfolio is a great idea. Reading Buffet seems like an endeavor for really savvy investors-those who are extremely disciplined and knowledgeable, but worthwhile, too.",
                  "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk65kri/",
                  "created": 1724764640,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lk212wi",
          "score": -21,
          "body": "Like 3m",
          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk212wi/",
          "created": 1724698524,
          "depth": 1,
          "replies": [
            {
              "id": "lk372jx",
              "score": 8,
              "body": "Once....   not recently.",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk372jx/",
              "created": 1724712721,
              "depth": 2,
              "replies": [
                {
                  "id": "lk3bgzd",
                  "score": 8,
                  "body": "It's up 47% since Oct 2023 after the stock split from its Healthcare company",
                  "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk3bgzd/",
                  "created": 1724714317,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lk1je7o",
      "score": 70,
      "body": "You pay tax each year on the dividends, so the capital that is not longer left in the market for compound growth has to be taken into account. This could lead to much lower returns in your portfolio over decades. Dividends are perceived as safer, but they are not very tax or capital efficient.\n\nEDIT: Investing at 23 is always a solid strategy. You are ahead of the game. Good luck!",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1je7o/",
      "created": 1724692877,
      "depth": 0,
      "replies": [
        {
          "id": "lk3z0tm",
          "score": 18,
          "body": "At such early age. Unless OP makes a ton of money somewhere else the dividends will fall within the 0% tax. For 2024 tax season it is $44625  for singles filers (Taxable account holdings)\n\nhttps://www.irs.gov/taxtopics/tc409",
          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk3z0tm/",
          "created": 1724723215,
          "depth": 1,
          "replies": [
            {
              "id": "lk4p16b",
              "score": 3,
              "body": "Depends on location. As always people in HCOL places get screwed. 45k would be poverty level in some areas",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk4p16b/",
              "created": 1724734994,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lk2dwoy",
          "score": 9,
          "body": "Not true. You won’t take pay tax every year if it’s in a IRA.",
          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2dwoy/",
          "created": 1724702641,
          "depth": 1,
          "replies": [
            {
              "id": "lk2eaw3",
              "score": 5,
              "body": "Correct. If it’s a non-taxable account this does not apply. HSA, 401k, IRA..",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2eaw3/",
              "created": 1724702768,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lk3zxjn",
          "score": 3,
          "body": "Not true. I pay 0 tax.",
          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk3zxjn/",
          "created": 1724723568,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lk1w61p",
          "score": 4,
          "body": "That's only if you withdraw the dividends which defeats the purpose of compound growth at age 23. \n\nThe proper way to invest with dividend companies is to use a DRIP account so your dividends are automatically reinvested at no cost.",
          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1w61p/",
          "created": 1724696922,
          "depth": 1,
          "replies": [
            {
              "id": "lk1xbax",
              "score": 5,
              "body": "Another note, you don’t get hit if you have your dividend paying stocks in a 401k or other non-taxable account. This is the way to go for your dividend payers.",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1xbax/",
              "created": 1724697282,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lk1wuee",
              "score": 4,
              "body": "But you still have to pay tax on them every year, so even if you reinvest them, they are still taxable. So the money you pay the tax with is not being invested. Example, if you have 10k/year in dividends, reinvested or not, you have to pay the 1.5k in taxes when that 1.5k could have been invested.",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1wuee/",
              "created": 1724697133,
              "depth": 2,
              "replies": [
                {
                  "id": "lk3zqyy",
                  "score": 1,
                  "body": "How are they taxable that they are in a tax deferred account?",
                  "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk3zqyy/",
                  "created": 1724723498,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lk2bgx5",
                  "score": -10,
                  "body": "\nYou don't pay any tax or fees on dividends in a DRIP account.\n\n DRIP stands for dividend reinvestment program. The company issues the amount of shares equivalent to your dividend payment and then provides the remaining amount as money. So you get shares not cash. You'd get taxed on the remaining cash difference if You're using a margin account. However you can avoid all these by using a TFSA or RSP account.",
                  "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2bgx5/",
                  "created": 1724701892,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lk2cum4",
                      "score": 6,
                      "body": "A DRIP account in a taxable brokerage still receives a 1099-DIV in which you are on the hook for the taxes. Just google it. You may just be getting less back in your tax return, but you are still paying taxes on your dividends IF they are in a taxable brokerage account.",
                      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2cum4/",
                      "created": 1724702312,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lk2dnbc",
                          "score": 0,
                          "body": "True, you are right. This strategy only works best in a tax free account.",
                          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2dnbc/",
                          "created": 1724702557,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lk2dxwp",
                              "score": 2,
                              "body": "Another redditor said I was right? I think I love you now… haha.",
                              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2dxwp/",
                              "created": 1724702652,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lkjw78c",
          "score": 1,
          "body": "Question for you, my advisor recently told me not to hold dividend funds in my Roth because they are taxed less.  Prior to this I thought they were good for a Roth because they grow tax feee.  What is the correct answer?",
          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lkjw78c/",
          "created": 1724959159,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk1ntxe",
      "score": 19,
      "body": "Invest in index funds for more growth, then later in life when if you have enough capital and maintain the desire to live off dividends rotate into a dividend fund. I wouldn’t do it til I’m at or near retirement age. Buy something like VOO",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1ntxe/",
      "created": 1724694271,
      "depth": 0,
      "replies": [
        {
          "id": "lk401o9",
          "score": 2,
          "body": "You really is different for everybody. For example, for myself, I’m 63 years old and I still work maybe 30-40 hours a week because I’m not yet a multimillionaire. I wouldn’t think about investing in dividends right now. I’m still enjoying building equity. I don’t do many index funds just a few foreign countries to do a little diversification I mainly research and purchase individual stocks and so make my own mutual fund that way with no expenses. It depends on the person and the level of financial education they have. And the confidence and their abilities to navigate the market.",
          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk401o9/",
          "created": 1724723611,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk25xlm",
      "score": 16,
      "body": "Dividends are irrelevant. Investing in a company shouldn't be based around if it has a dividend or not.\n\n\nDon't invest in a company just because it has a divided, invest in a company because the business fundamentals or future prospects indicate potential returns. Whether the company has a divided or not, it should NOT affect the math",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk25xlm/",
      "created": 1724700143,
      "depth": 0,
      "replies": [
        {
          "id": "lk66std",
          "score": 0,
          "body": "I hope your investments are better than your spelling",
          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk66std/",
          "created": 1724765090,
          "depth": 1,
          "replies": [
            {
              "id": "lk6fk7a",
              "score": 1,
              "body": "Fixed it for you~",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk6fk7a/",
              "created": 1724768193,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lk24n7p",
      "score": 5,
      "body": "This Is my 2 cents. I’m in a fairly similar position, don’t consider me an export or experienced but this is what I’ve found being similarly curious. You’re asking a good question.\n\nTLDR: Just because a company issued a dividend does not mean it is safe, does not mean it will yield stable returns, does not mean you will miss out on big potential gains. You can dividend snowball and beat the market or not beat the market as you can with any strategy (odds are you won’t beat it, doesn’t mean you shouldn’t build this portfolio, doesn’t mean you won’t beat it). Dividend snowball is just a strategy. A dividend snowball is best used for finding stable long term companies that generate extra cash that don’t need it to prosper. If you want to be more or less active in your portfolio I would include companies that are stable more or less. Or diversify to offset risk based on what you’re doing.\n\nLarge cap companies are huge because most investors and regular people put money into large cap ETF’s. Makes it much more reliable and you’ll find big P/E ratios that might be scary, but these passive investors and etf investors aren’t inclined to panic sell and cause volatility. Large caps often increase their dividend overtime, so it may have a smaller % dividend but if they increase that dividend it’s effectively larger over time.\n\nAs you addressed, some of the old classic dividend giants may not have the biggest returns, but some of them still may have huge returns. Consider the business model, is cash to the business more effective at generating returns than cash to the investor? \n\nFor tips on how to find them: I’d say look at the companies in the S&P 500 that issue dividends. If you want something more risky with bigger returns, I look for them by looking at Russel 2000 stocks or stocks in sectors like real estate, industrials, finance, retail, basic materials, shipping. Plenty of REITS and mining companies that are falling knives with eye popping dividends. Problem is you’re buying some risk and you may have to pay more attention to them as these companies are not as stable as like Coca-Cola. Also consider companies that raise their dividends. (Repetitive: If you buy a 20 dollar stock with a 5% dividend it’s a 1 dollar dividend. But if they keep raising it you’re effectively getting a larger % dividend on the same purchase over time.)\n\nFor how to buy them: create a list of those companies you’re interested in and add them to a list, buy the ones that look like they have a good value deal from there. Careful as some of those companies imo might be value traps. If you find a company that looks like great value with lots of upside potential, maybe see what other people like dividendology say about it. Also I highly recommend finding what an investor with an opposing view might say about them. I like Joseph Carlson’s opinion. I disagree with his philosophy but because of that he points out value traps and weaknesses in stocks I’d personally pick that I wouldn’t have found issues in myself. \n\nIf you’re looking for individual stock picks I’d maybe say UNP, O, PEP. If you wanna talk with someone about good dividend snowball stocks to buy at a certain time you can message me whenever about that topic if you want a second opinion. I intentionally gave safe picks here.\n\nI’m excited for you. Good mindset good hustle. Hope it pays off for you.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk24n7p/",
      "created": 1724699718,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk1ocet",
      "score": 10,
      "body": "Depends on the stock - Microsoft is a great dividend stock imo. If you’re just chasing high yield - that’s never a good idea",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1ocet/",
      "created": 1724694433,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk1i2aj",
      "score": 53,
      "body": "If you want to miss out on way higher returns for that cool feeling, then it's smart.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1i2aj/",
      "created": 1724692458,
      "depth": 0,
      "replies": [
        {
          "id": "lk1o41r",
          "score": 3,
          "body": "what would you suggest that'll give me way these way higher returns?",
          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1o41r/",
          "created": 1724694360,
          "depth": 1,
          "replies": [
            {
              "id": "lk1oljq",
              "score": 15,
              "body": "Stock in companies that have growth prospects, not necessarily the highest dividends or a dividend at all.",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1oljq/",
              "created": 1724694514,
              "depth": 2,
              "replies": [
                {
                  "id": "lk22tuw",
                  "score": 3,
                  "body": "How do you find companies with high growth prospects?",
                  "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk22tuw/",
                  "created": 1724699110,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lk2jxdz",
                      "score": 54,
                      "body": "[removed]",
                      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2jxdz/",
                      "created": 1724704579,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lk2pikr",
                          "score": 11,
                          "body": "Most underrated post of the day!",
                          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2pikr/",
                          "created": 1724706429,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lk2padt",
              "score": 3,
              "body": "Any index fund ETF\n\nMy go-to is:\n\nVOO, VTI, BRK.B and for that sweet dividend feeling I'd buy some VICI...\n\nCheck out if REIT dividends are tax free. YMMV\n\n\nNot financial advice. Just what I got in my long-term account.",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2padt/",
              "created": 1724706351,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lk20x1r",
          "score": -6,
          "body": "3M YTD is 42% with a dividend of $1.32 per share so that point is irrelevant",
          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk20x1r/",
          "created": 1724698472,
          "depth": 1,
          "replies": [
            {
              "id": "lk2cgmf",
              "score": 8,
              "body": "violet drab live party station shrill crown zephyr racial tart\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2cgmf/",
              "created": 1724702194,
              "depth": 2,
              "replies": [
                {
                  "id": "lk2cr7v",
                  "score": -5,
                  "body": "Long term stock*",
                  "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2cr7v/",
                  "created": 1724702283,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lk27b7u",
              "score": 5,
              "body": "They only grew revenue 5% from 2023 to 2024, and their revenue was declining the two years before that. If you’re a young investor, growth is your best bet. One dividend stock’s movements over a short time horizon doesn’t change that.\n\nAlso, what does the YTD performance matter if it’s still down over the last five years?",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk27b7u/",
              "created": 1724700588,
              "depth": 2,
              "replies": [
                {
                  "id": "lk28vbo",
                  "score": -8,
                  "body": "If you picked up the stock when it was low like I did guess what it grew by 44% or from $74. It's simple math",
                  "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk28vbo/",
                  "created": 1724701087,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lk2acvt",
                      "score": 10,
                      "body": "Yeah duh if you time any stock right it’s a good investment. If you bought 3m a decade ago minus dividends you would be about even in terms of share price.",
                      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2acvt/",
                      "created": 1724701549,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lk2cyyk",
                          "score": -12,
                          "body": "Good thing I didn't huh",
                          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2cyyk/",
                          "created": 1724702349,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lk2a1am",
                      "score": 6,
                      "body": "OP sounds like he just wants the best option for long term, buy and hold growth. 3M upside is limited from current price.",
                      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2a1am/",
                      "created": 1724701449,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lk2cwc2",
                          "score": -4,
                          "body": "Which 3m is after its stock split from its Healthcare business",
                          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2cwc2/",
                          "created": 1724702326,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lk2oq1g",
              "score": 0,
              "body": "\nIt’s basically flat over 10 years. You never know what an individual stock will do in the future.",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2oq1g/",
              "created": 1724706160,
              "depth": 2,
              "replies": [
                {
                  "id": "lk2rpp2",
                  "score": -5,
                  "body": "It's up 47% since Oct 2023 sooooo",
                  "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2rpp2/",
                  "created": 1724707200,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lk5q3vy",
                      "score": 1,
                      "body": "Okay, what's it going to do by October 2025?",
                      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk5q3vy/",
                      "created": 1724758108,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lk6qhij",
                          "score": 1,
                          "body": "How much is thr dow going to be by then? Just like every other stock once feds cut rates all stocks would increased",
                          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk6qhij/",
                          "created": 1724771775,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lk3p6nm",
      "score": 4,
      "body": "Are you aware that when a stock issues a dividend, it drops by an equivalent amount instantaneously? Dividends don't make you money. They cash it out for you, against your will, at a horrible tax rate.\n\nNo, it's not smart.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk3p6nm/",
      "created": 1724719421,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk3sjt4",
      "score": 4,
      "body": "As a younger investor getting started, start with ETFs and figure out how to do that correctly first. You should be spending most of your effort accumulating, that is, socking money away. When you get to $100k, the amount you can make on interest starts to become significant. So you have plenty of time to learn about stocks. Don't rush. Pick a simple ETF strategy, start socking the money away, and keep your \"learning\" stock purchases to less than 10% of your portfolio for five or ten years, and you will do fine.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk3sjt4/",
      "created": 1724720702,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk2drmk",
      "score": 2,
      "body": "Most of it in stocks don’t grow very much. They just pay a dividend. At your age and even at my age and I’m way older than you, in my opinion, we are better off owning undervalued great stocks that have a lot of growth ahead. You’ll make a lot more money that way than dividends.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2drmk/",
      "created": 1724702596,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk2rhuf",
      "score": 2,
      "body": "invest in low cost S&P 500 index funds, ETFs, make regular contributions, and reinvest dividends back into your portfolio. \n\nthats the most sound way of making decent returns on your initial investment over time. \n\ni highly recommend reading \"the little book of common sense investing\" by John c Bogle. it puts everything into perspective in an easy to understand and quick read. especially about index funds, but also the market as a whole. \n\nbut dont let that be the only book you ever read about investment! \n\nthis is a solid beginning strategy for lifelong gains, you can test others along the way once you get a better understanding of everything, but indexes are the way to go for a beginner so you dont end up blowing your whole wad from gam gam on Intel before it crashes :D \n\nalso indexes avoid a lot of costs and fees from managed accounts, and out pace inflation regularily in addition. specifically the S&P 500 indexes.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2rhuf/",
      "created": 1724707121,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk1jiwf",
      "score": 3,
      "body": "Define smart. What's your goal? To maximize returns over a period of time then no. To preserve your existing or future wealth maybe?\n\nGeneral framework should be the younger you are the more risky and growth oriented your strategy can be because you have higher potential upside (every dollar you make now can be compounded over a larger period of time than older people) with less downside (less to lose).\n\nSomething goes wrong you have a lot more time to make up for it. Conversely the more you can make when you're younger pays huge dividends over a longer amount of time.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1jiwf/",
      "created": 1724692918,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk1wr9a",
      "score": 1,
      "body": "At your age, I'd split your capital into two accounts. One for growth and higher risk stocks and the other as a DRIP account with solid dividend companies. \n\nIt's a good strategy when you have a long term horizon. It'll probably take two decades before your dividends will be high enough to cover your living expenses (unless you're already starting off with 6 figures).",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1wr9a/",
      "created": 1724697106,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk2g3p2",
      "score": 1,
      "body": "I pretty much only invest in dividend stocks in my own portfolio. I get more than enough dividends to live off of. I’m retired at 52. That said I have a 401k with some normal funds in it. \n\nCheck out jepq and Jepi. They follow the s&p 500 and the Nasdaq. They sell options with the funds holdings and pay out great dividends! Kinda the best of both worlds!",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2g3p2/",
      "created": 1724703343,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk2gx83",
      "score": 2,
      "body": "10k invested in each asset class in 1972 would now be....\n\nLarge Growth has dominated the last 15 years, but if you take the way way back machine, value has performed better over the last 50 years.\n\n||\n||\n|US Large Cap Growth|$2,182,253|\n|US Large Cap Value|$2,702,910|\n|US Mid Cap Growth|$1,692,171|\n|US Mid Cap Value|$5,161,136|\n|US Small Cap Growth|$1,284,835|\n|US Small Cap Value|$8,200,071|",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2gx83/",
      "created": 1724703605,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk2h1vi",
      "score": 1,
      "body": "Divi vs no divi doesn’t matter when young. Just how well you expect the company to grow over 30 years. And if you don’t want to put in ungodly hours researching and managing then buy an index market etf. Dividends are good once retired when you need cash flow for living expenses. If you have no dividends in retirement if the market tanks you are forced to sell at lows to cover lifestyle where as if you collect dividends you can live off those till the market goes back up… of course in a big crash companies may cut dividends too..",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2h1vi/",
      "created": 1724703645,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk2jfal",
      "score": 1,
      "body": "No,",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2jfal/",
      "created": 1724704416,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk2jg21",
      "score": 1,
      "body": "Ultra smart",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk2jg21/",
      "created": 1724704423,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk36z7c",
      "score": 1,
      "body": "If you have earned income,  start a Roth IRA... Pick what you want. Leave it all in there.   It's tax free on withdrawal    but the contributions need to stay put for several years (you have access to the earnings before that restriction disappears)",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk36z7c/",
      "created": 1724712688,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk3jvs4",
      "score": 1,
      "body": "Dividend stocks are overrated when you don’t have much money. Much better to get high growth stocks instead when you’re young and then slowly transition to dividend stocks as you accumulate more wealth.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk3jvs4/",
      "created": 1724717419,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk3lx8d",
      "score": 1,
      "body": "General rule is that you want companies  to prioritize growth (i.e investing in the business) rather than dividends to generate better returns and sustain high growth rates in the long run. The younger you are, the more risk you can tolerate and stocks that give steady dividends are generally safer slower growth companies. Moreover, dividends will be taxed so there’s no need to raise your taxable income if you don’t have to, especially when the dividends aren’t enough to live off of.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk3lx8d/",
      "created": 1724718178,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk3qn7c",
      "score": 1,
      "body": "Yes",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk3qn7c/",
      "created": 1724719973,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk3s70f",
      "score": 1,
      "body": "No. Think of dividends as income. You aren’t retired and don’t need passive income. \n\nYou’d be better off investing in growth. Then one day sell and switch to dividend. ",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk3s70f/",
      "created": 1724720564,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk4ds7z",
      "score": 1,
      "body": "If these investments are in pre-tax accounts like your company 401(k) then absolutely yes, and let it DRIP. Post-tax accounts, I would say its not a goal at this stage of your life but I would not avoid buying stocks with dividends if they are great stocks. For example big tech is starting to pay small dividends these days.\n\nOne interest point to make is that some stocks such as REITs actually pay their \"dividends\" as capital gain distributions so you can actually offset these with stock losses if needed.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk4ds7z/",
      "created": 1724729272,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk4l5c9",
      "score": 1,
      "body": "Typically no because div stocks aren't growth stocks, you can sit on Ford and get 7% annually or you can sit on nvda and you'd have doubled your investment in a year.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk4l5c9/",
      "created": 1724732884,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk4mwwj",
      "score": 1,
      "body": "I rarely invest in stocks except a few tech that does not pay dividend.  The stocks can go down but the dividend can be rolled over more stocks over time.  This si Buffet style investment.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk4mwwj/",
      "created": 1724733821,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk4r50l",
      "score": 1,
      "body": "Look up ticker symbol “O”, their dividend yield is high and if you’re looking for silicon, TSM, gold long I have B2G which has a super impressive dividend of above 5%. Also a quick google query will suffice.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk4r50l/",
      "created": 1724736217,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk4xaad",
      "score": 1,
      "body": "No.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk4xaad/",
      "created": 1724740090,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk4xhdd",
      "score": 1,
      "body": "There are plenty of growth dividend mutual funds.   They’re a great balance of growth and dividend.  \nAs an example VDIGX\n\nTake others opinions poopooing dividend with a grain of salt.   Growth can do no wrong right now but there are periods it can be not so great.  \n\nIf you’re looking at specific stocks strictly for dividend I’d table that effort for mutual funds for diversification.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk4xhdd/",
      "created": 1724740222,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk5188k",
      "score": 1,
      "body": "No",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk5188k/",
      "created": 1724742737,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk531pc",
      "score": 1,
      "body": "No",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk531pc/",
      "created": 1724743986,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk5l65c",
      "score": 1,
      "body": "A lot of companies which payout dividends don’t really grow much in share prices cause that’s where their profits go, to shareholders in dividends, so this might be a better overall strategy for someone living off investment income where some stability is valued, a lot of retired folks might use reits or jpm equity income etfs for this, along with many companies like Coke, sbux, khc etc…",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk5l65c/",
      "created": 1724755571,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk5nc8k",
      "score": 1,
      "body": "The most important thing you can do is max out your Roth as you won't be able to once you make more money. I'd suggest index funds. Max out your roth now with index funds and you're set for your later years.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk5nc8k/",
      "created": 1724756727,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk5qg29",
      "score": 1,
      "body": "I would say no. Time is the most important factor when growing your capital by investing in stocks. Income from investments is not as important when you are in your beginning years of your career and working age. Rather, use this time to build your investments early and when you're older you can switch a percentage of your investments into dividends.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk5qg29/",
      "created": 1724758270,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk5sjs0",
      "score": 1,
      "body": "The stocks you invest in now will likely not be the stocks you own when you retire.  People may say \"buy and hold\", which is generally good advice, but even Warren Buffet revisits his holdings, sells off what no longer has the a place in his portfolio and purchases new items.  Technologies and markets change, WBA was a fantastic dividend stock until recently (it is no longer in my portfoloio).  So don't look at the companies you invest in now as the companies you'll own when you retire.  Buy solid companies that will give you the highest total return (includes growth and dividend yield) if that is what is important to you.\n\n  \nThat said I, too, am fascinated by dividend stocks and have a small side-account where I dabble in dividend stocks.  This is not my main investment, it is just a fun hobby that has finally reached 5 figures in value.  I can see that the total return isn't as great as in my main accounts, but I'm dong it for my own enjoyment and mental stimulation, not for retirement.  Look at Dividend Kings, Dividend Aristocrats, Dividend Challengers, Dividend Contenders, Dogs of the Dow, or other lists of great dividend companies and decide if you, too, want to have a small hobby dividend account.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk5sjs0/",
      "created": 1724759257,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk5sqhh",
      "score": 1,
      "body": "Don’t make the same rookie mistake I made during my teen days . Invest in growth , too early for dividend investments",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk5sqhh/",
      "created": 1724759342,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk5vlgl",
      "score": 1,
      "body": "I AM LITERALLY SCREAMING THIS!!! WHY DONT WE ALL YAKE NIVIDIA AND BUY THE HELL OUT OF IT AND MAKE MILLIONS IF NOT HUNDREDS OF MILLIONS LIKE WE DID GAME STOP? THERES NOTHING TO STOP US AND WE WALK AWAY WITH GENERATIONAL WEALTH. COME ON GUYS LETS SEE SOME OLD FASHIONED DIAMOND HABDS. I KNOW THERES PEOPLE OUT THERE WHO WANT YHIS YOURE JUST SCARED. THERES NOTHING TO BE SCARED ABOUT IF WE ACT AS A TEAM!!!",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk5vlgl/",
      "created": 1724760618,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk5w02g",
      "score": 1,
      "body": "Dividends are great but younger you want to take higher risk. I say that but also MO is one of the world best preforming stocks yielding around 16% for the last 100 years on average.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk5w02g/",
      "created": 1724760795,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk5wfra",
      "score": 1,
      "body": "NO ONE, SERIOUSLY, NO ONE WANTS TO JUMP ON NIVODA AND DRIVE OT TO THE MOON? SAD THIS IS NOT THE REDDIR I REMEMBER. WE WERE ABOUT MAKING MONEY AT O M E TIME. NOW WE HAVR THE CHANCE AND EVERYONE IS TALKING ETF'S. BULLSHIT GET SOME BALLS EVERYONE START BUYING AND LETS GET MONEY.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk5wfra/",
      "created": 1724760985,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk5wjmn",
      "score": 1,
      "body": "Start buying producing stocks genius",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk5wjmn/",
      "created": 1724761032,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk7vfn6",
      "score": 1,
      "body": "I agree with those who say you’re better served right now with something like VOO. Btw, rather than trying to manage your stock portfolio yourself, I suggest you use an AI robo advisor. alphaAI.capital uses leveraged ETF strategies, and has an average annual return of 22%. Take a look; I think you’d like it.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk7vfn6/",
      "created": 1724784673,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk8eop4",
      "score": 1,
      "body": "Why not buyback stocks?",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk8eop4/",
      "created": 1724790738,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lka8gpl",
      "score": 1,
      "body": "Just DCA into VOO for the next 25 years.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lka8gpl/",
      "created": 1724814253,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkak5hr",
      "score": 1,
      "body": "To blunt, no dividend portfolio are nice when you have big amounts of cash to invest or you are making lots of money and have plenty of disposable income to dump into dividends stocks. Use the time you have on your side to appreciate your wealth by going to growth stocks/ETFs. Now dividends can be still a part of your portfolio but shouldn’t be a focus until closer to your retirement goal and don’t look for yield focus more on companies that are growing their dividends like V, MSFT, COST, MA, AAPL or ETFs like DGRO \n\nThis is all my opinion and what I’m doing for my own goals",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lkak5hr/",
      "created": 1724819700,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lke3ean",
      "score": 1,
      "body": "Dividend stocks are, by definition, mature companies — and often very stable, safe investments.  If your psychology is risk averse, dividend stocks might be a part of your investment portfolio even at 23 years old.  Google “dividend aristocrats” for a list of stocks with long track records of increasing their dividends.\n\nOne downside of dividend stocks is that you pay taxes on dividends — even if the dividends are reinvested.  And at 23 years old, you are at the start of your earning years and, hopefully(!), soon in a high tax bracket.  That is one reason why high quality growth stocks or an equity index fund may be a more natural fit for many investors in your age group.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lke3ean/",
      "created": 1724873494,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkfuc78",
      "score": 1,
      "body": "I prefer capital gains over dividends. Just sit your money in a s&p index fund and you’ll be fine in 20 years",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lkfuc78/",
      "created": 1724898050,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll0k0vg",
      "score": 1,
      "body": "As a risk-averse young person, I think there’s nothing wrong with making 8% dividends on jepi or upping it to jepq.  But most advisors I’ve talked to disagree with me.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/ll0k0vg/",
      "created": 1725210299,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk1mpki",
      "score": 1,
      "body": "No, you are chasing capital growth, dividends are for people in retirement.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1mpki/",
      "created": 1724693919,
      "depth": 0,
      "replies": [
        {
          "id": "lk1oo1x",
          "score": 7,
          "body": "so is the S&P 500 a better option or something else entirety? open to suggestions",
          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1oo1x/",
          "created": 1724694536,
          "depth": 1,
          "replies": [
            {
              "id": "lk1oyt4",
              "score": 6,
              "body": "That would be a good place to start for a beginner.",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1oyt4/",
              "created": 1724694629,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lk1pwz5",
              "score": 2,
              "body": "Absolutely. Average return of ~10% a year which you aren’t going to get with the vast majority of dividend stocks. You’ve got time on your side and you want your money to grow. You don’t have to go psycho risk but again, you’re earning, make that money work for you.",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1pwz5/",
              "created": 1724694923,
              "depth": 2,
              "replies": [
                {
                  "id": "lk1r13z",
                  "score": 2,
                  "body": "voo it is, thank you !",
                  "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1r13z/",
                  "created": 1724695271,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lk1rol8",
                      "score": 2,
                      "body": "Yessir, not financial advice but I’d dump money in there. Research it, see what its holdings are etc. have fun!",
                      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1rol8/",
                      "created": 1724695479,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lk1swoq",
                      "score": 2,
                      "body": "Yep this is a smart decision. I had to decide around the same. The returns are higher, but I sacrifice how **\"fun\"** it is to invest in dividend stocks and seeing your dividend distributions get 'bigger' over time.\n\n\"Oh look, I'm now bringing in $300 a month in dividends!\"\n\nYou lose that 'fun' aspect, but your returns are MUCH higher overall which is so much more important. It's a psychological thing. Ultimately comparing my total net worth now versus what it would be had I stayed in dividend stocks is moooore fun than the alternative 🤑",
                      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1swoq/",
                      "created": 1724695865,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lk1h2a9",
      "score": 1,
      "body": "Depends on which stocks",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1h2a9/",
      "created": 1724692143,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk1xh8y",
      "score": 1,
      "body": "do a backtest of growth etf and dividend etf. then ask yourself if you want more money or less money.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1xh8y/",
      "created": 1724697333,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk1jvvd",
      "score": 0,
      "body": "No. Short answer: no\n\nStocks are either value stocks (paying dividends but with no real growth prospect) or growths stock.\n\nLong term growth stocks will yield more return. If you are young and have many year ahead of you why would you want to miss the higher yield?",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1jvvd/",
      "created": 1724693040,
      "depth": 0,
      "replies": [
        {
          "id": "lk1oj9k",
          "score": 1,
          "body": " I don't want to miss out on a higher yield,  what would you suggest that I invest in instead?",
          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1oj9k/",
          "created": 1724694493,
          "depth": 1,
          "replies": [
            {
              "id": "lk36jaj",
              "score": 1,
              "body": "You don’t need to avoid dividends, but maybe don’t chase them specifically. Companies tend to pay dividends when they don’t have a good reason to invest in growing their market share. This means they are likely consistent earners but less risk and less growth. You can afford more risk at your age.",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk36jaj/",
              "created": 1724712526,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lk217d9",
          "score": -2,
          "body": "3m has a ytd of 43% and pays $1.32 in dividend what you talking about?",
          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk217d9/",
          "created": 1724698566,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk1n3a3",
      "score": 0,
      "body": "As a young investor, you don’t have enough money to generate sufficient income to cover expenses. You will also miss out the opportunity to grow your capital and use it to buy dividends stocks. In addition, you will pay extra tax for your dividends income. So you just do government a favour at the cost of your retirement\n\nIt’s pretty bad idea",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1n3a3/",
      "created": 1724694038,
      "depth": 0,
      "replies": [
        {
          "id": "lk1ourl",
          "score": 1,
          "body": "ah I didn't know that, what would you suggest I look into instead? the S&P?",
          "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk1ourl/",
          "created": 1724694594,
          "depth": 1,
          "replies": [
            {
              "id": "lk21c74",
              "score": 0,
              "body": "SCHD is a pretty good etf it's a high dividend etf within the s&p 500",
              "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk21c74/",
              "created": 1724698612,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lk240zj",
      "score": 0,
      "body": "For someone who’s in their get rich phase, the only advantage with dividends is that you can rebalance manually with the cash flow without having to sell anything. If you use margins to increase volatility, they can be used to pay down the credit if needed.",
      "permalink": "/r/stocks/comments/1f1tchd/is_it_smart_for_a_younger_investor_to_invest_in/lk240zj/",
      "created": 1724699514,
      "depth": 0,
      "replies": []
    }
  ]
}