{
  "title": "🚢 DD for Huntington Ingalls (HII), an explosively loaded policy profit",
  "score": 42,
  "selftext": "First off, full transparency, I really like boats.\n\nSections\n0) BLUF: New congressional policies are going to make $HII go to the moon 🚢🚀🌕\n1) Boats are important to the U.S. global supremacy (a short history)\n1) The U.S. doesn't like it when people touch its boats\n2) The U.S. will probably become a commercial shipping power\n3) Huntington Ingalls Industries is already incredibly stable\n\n** Bottom Line Up Front:**Congress is probably about to funnel hundreds of billions of $$ into Huntington Ingalls and General Dynamics to **revitalize the U.S. Navy and build a commercial shipping fleet possibly increasing revenue 10x**. People have put other DDs for $HII's strong financials but this primarily targets huge future growth catalysts.\n\n**The U.S. wants to maintain global supremacy, a short history**\nTo start the DD off, we have to look at the Bretton Woods Conference. Post WWII, Europe is decimated and the US is essentially the world superpower. It invites the rest of the world leaders to a shack in New Hampshire, locks them in, gets them drunk, and 3 weeks later, out comes the World Bank, IMF, and IBRD. The whole world agrees that the U.S. will be the global economic power and in exchange, the U.S. will maintain freedom of the seas (make sure pirates aren't mean and that cargo ships don't get blown up). To do this, the U.S. Navy stands up a huge navy and asserts dominance over all of the oceans.\n\nFast forward to 2024, China is doing the same thing. They are expanding their navy (currently 355 warships and growing incredibly fast). They are building economic alliances around the globe and upsetting the global world order. The U.S. has ~290 warships and can only build ~11/yr putting us strongly behind China in naval size. With this disparity in mind, the U.S. is waking up to the fact that countries that previously played nice for the U.S. possibly only did so for protection of maritime trade (90% of traded goods are transported by sea which comes to be 10s of trillions of $).\n\n\n**The U.S. doesn't like when people touch its boats**\nEverybody knows the U.S. doesn't mess around when it comes to boats. The U.S. treats its boats like sovereign territory and if someone hits a U.S. boat they freak out. The U.S. has a bunch of ships parked in the Red Sea that just sit there and shoot Huthi missiles out of the sky with an astonishingly good record. Missiles are getting better though and defense probably isn't perfect. If a missile from the Huthis actually hits a U.S. ship congress will probably go bonkers at the idea that if some guys in a Hilux can blow up a U.S. warship, China and Russia definitely can. Congress will dump $$$$$$ into modernizing the U.S. Navy and realize that there are only two actual companies that can produce warships in the U.S.; Huntington Ingalls Industries ($HII) and General Dynamics ($GD). In addition, these two build ships at an incredibly slow rate and have low capacity. The U.S. not wanting to lose to anybody will have no choice but to dump an incredible amount of money into these two companies to expand their infrastructure, likely to the order of **$100 billion.** These two companies are the only shipbuilders with an extensive knowledge base for making warships and submarines, both are also the only two who are able to make nuclear ships which are attractive for a future navy. In addition to hundreds of billions of infrastructure improvements, there will be 10s or 100s of billions of dollars placed for warships as the U.S. fleet is incredibly aged and most ships need replacing or modernizing.\n\n**The U.S. wants more commercial shipping power**\nThe U.S. is stuck between a rock and a hard place when it comes to commercial shipping. China, Japan, and Korea make up the majority of the world's ships. Because of the Jones Act, the U.S. shipping industry has essentially stalled entirely. Jones Act for reference requires any goods shipped from U.S. to U.S. to be on a U.S.-staffed, U.S.-built ship. This force makes U.S. cargo ships incredibly expensive to build. So much so that it is cheaper to permanently use other country's ships than to build a domestic maritime fleet. China and Korea conversely have massive cargo fleets. China continues to take a huge portion of the world trade, looking back to the U.S. lowering Naval force, countries begin to lose the incentive to trade with the U.S. To counter this, the U.S. needs to build a workable merchant fleet. Where China has over 5500 merchant ships, the U.S. has ~80 ships total. This is a huge disparity that is again going to require huge infrastructure upgrades which will be primarily awarded to current shipbuilders. Although there are slightly more commercial shipbuilders in the U.S., $HII remains in one of the best positions to pivot towards the industry, possibly bringing again 10s or 100s of billions of $. Congress has been doing research into this recently and has identified that the U.S. lacks almost any shipbuilding capability for a merchant fleet, threatening our world order. Again the U.S. doesn't like to lose and a new policy will likely arrive shortly.\n\n**Why $HII and not $GD**\nBoth of these companies are going to profit an incredible amount from these probably new policies. $HII gives more exposure to the rapid growth though because almost their entire profit comes from ships. $GD by comparison is only about a quarter because they are diversified into several other industries.\n\nHII specifically has an annual revenue of $11.5 billion and a backlog of $48.1 billion ships that have already been ordered. This, combined with the U.S. government's utter reliance on $HII and $GD, makes it an incredibly safe play. The company is far too big to fail and if it did fail, the U.S. could lose its global supremacy. Big Daddy Sam will just hand them some more money if they make any real mistakes. Again because there are only two shipbuilders, $HII continues to operate with almost no diversification as a shipbuilder giving them maximum exposure to the policy change. The aforementioned policies that are likely on the way would be in addition to the nearly guaranteed annual orders placed, most of which are almost a decade planned in advance if not more.\n\n$HII and $GD have a huge edge over other U.S. defense contractors as well. Other defense contractors have charged huge amounts for R&D and when the U.S. is in a crunch they will just ramp up manufacturing. $HII by comparison has historically stalled because of Naval shrinkage. Shipbuilding is not something that can be easily automated and will require massive infrastructure increases in addition to raw ship orders.\n\nDisclaimer, I own a bunch of $HII stock and $HII calls.\n\nEdit: 42 shares ~$11,500, 6x 10/18/2024 calls, and 4x 260C 270C December bull spreads\n\n**Here are some congressional reports**\nhttps://sgp.fas.org/crs/weapons/RL32665.pdf\n\nhttps://crsreports.congress.gov/product/pdf/RL/RL32665/408\n\nhttps://crsreports.congress.gov/product/pdf/IF/IF12534",
  "link_flair_text": "DD",
  "id": "1f23cp9",
  "num_comments": 37,
  "created_utc": 1724717205,
  "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/",
  "comments": [
    {
      "id": "lk3jbnu",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 11 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3jbnu/",
      "created": 1724717211,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk3l8qw",
      "score": 39,
      "body": "Boats the moon?\nI am interested",
      "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3l8qw/",
      "created": 1724717922,
      "depth": 0,
      "replies": [
        {
          "id": "lk3mlu6",
          "score": 13,
          "body": "If SpaceX can send a car to space, HII can put a boat on the moon",
          "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3mlu6/",
          "created": 1724718438,
          "depth": 1,
          "replies": [
            {
              "id": "lk3q1zd",
              "score": 3,
              "body": "Remind me when they start making spacecraft carriers instead of aircraft carriers.",
              "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3q1zd/",
              "created": 1724719750,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lk3laky",
      "score": 31,
      "body": "2 things:\n\nA. Positions or ban\n\nB. 2 words; Jones Act. Please dear regard, understand the implications of this degenerate law and how the US shipping industry is affected by it, because your thesis has holes bigger than Spongebob's ass crack.",
      "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3laky/",
      "created": 1724717941,
      "depth": 0,
      "replies": [
        {
          "id": "lk3mk3h",
          "score": 6,
          "body": "Yeah but \"\nI'm on a boat mother fucker, in my flippy floppys, while you at kinkos straight flipping copies\"",
          "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3mk3h/",
          "created": 1724718420,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lk3miaw",
          "score": 7,
          "body": "A. Positions updated\n\nB. The 3rd congressional report listed from May 2024 describes how Jones act has destroyed our shipping industry. Congress is already looking at removing it and it may be a political hot topic soon. I do understand the Jones Act more than I talked about it here but I digress.",
          "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3miaw/",
          "created": 1724718400,
          "depth": 1,
          "replies": [
            {
              "id": "lk3no0b",
              "score": 11,
              "body": "Here's the reality check for you; anything involving government, especially congress, is gonna take years. They dont give a fuck about you, unless you lobby them to do so. And right now, the lobbyists are on the Jones Act's side.\n\nUnless it becomes a national security interest( which it is not, the US military uses Korean and Japanese vassals so if the army thinks its ok, then its ok), or part of the national debate(low chances, its not really what people care about), it would take years for it to be abolished, or at the very least loosened.\n\nOnly once this fucking garbage is repealed, **then** there would be an opportunity",
              "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3no0b/",
              "created": 1724718842,
              "depth": 2,
              "replies": [
                {
                  "id": "lk697ir",
                  "score": 2,
                  "body": "Hey lets think this through man. Jones act is repealed..... what happens immediately after? Its too late to make this play!\n\n  \nIf that ASTS guy waited, like you probably would have advised them over a year ago, he wouldn't be a millionaire now.",
                  "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk697ir/",
                  "created": 1724765977,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lk3odyf",
                  "score": 1,
                  "body": "It is a national security interest, doesn’t have much to do with the army though. Either way commercial is only a half of my argument and I included stimuli that would cause congress to act quickly.\n\nThis is a bet partially on a Jones acts repeal",
                  "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3odyf/",
                  "created": 1724719117,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lk3ozgg",
                      "score": 5,
                      "body": "good luck holding that bag then.\n\nSeriously\n\nI really hope this shit gets repealed\n\nBut it won't\n\nat least for the foreseeable future.",
                      "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3ozgg/",
                      "created": 1724719344,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lk3ppdh",
                          "score": 4,
                          "body": "Thank you! I guess we will see. It truly is an awful policy. I see it’s repeal coming with huge subsidies which would reduce its negative effects on the industry",
                          "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3ppdh/",
                          "created": 1724719618,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lk9w3d1",
                  "score": 1,
                  "body": "Do you know that the military uses foreign vessels for fact, or do you have a hunch and just typing it online. I’d really like to see a contract for or proof of a US military vessel built by a foreign company.",
                  "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk9w3d1/",
                  "created": 1724809359,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lk3mibh",
          "score": 1,
          "body": "He mentioned the Jones act no?",
          "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3mibh/",
          "created": 1724718400,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk3sc8e",
      "score": 10,
      "body": "I hope you’re right, as I have a good bit of GD stock. I may be a bit biased as a GD employee, but we build better submarines than HII…",
      "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3sc8e/",
      "created": 1724720619,
      "depth": 0,
      "replies": [
        {
          "id": "lk3ydcw",
          "score": 5,
          "body": "GD shareholder here since I was gifted stock by my dad who worked at GD.  Great forever stock.  A well-diversified defense contractor with exposure to maritime, land systems (M1 Abrams Tank), aerospace (Gulfstream), and cyber space.  Holding GD (or any of the defense stocks) is like have a put on geopolitics as war and conflict is part of human nature.",
          "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3ydcw/",
          "created": 1724722961,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lk3sqfs",
          "score": 3,
          "body": "I have some GD as well, I do agree with you. If GD primarily shipbuilding I would have preferred that. I can’t imagine though that GD would receive much of a disproportionate amount of funding given that there’s only two major shipbuilders",
          "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3sqfs/",
          "created": 1724720772,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lup5d2i",
      "score": 4,
      "body": "Hello I would like to revisit this thread",
      "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lup5d2i/",
      "created": 1730383761,
      "depth": 0,
      "replies": [
        {
          "id": "lupfhxn",
          "score": 2,
          "body": "💀💀💀",
          "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lupfhxn/",
          "created": 1730387055,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luth1h5",
          "score": 1,
          "body": "Helluva day for HII",
          "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/luth1h5/",
          "created": 1730441055,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk3jb5n",
      "score": 3,
      "body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
      "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3jb5n/",
      "created": 1724717205,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk474y5",
      "score": 2,
      "body": "HII used to build commercial ships, it stopped because it hurt the core business and was not profitable due to fixed assets that cannot be used for anything other than aircraft carriers or subs. \n\nHII and EB will use a large portion of those funds to help the supply base upgrade its own infrastructure, not directly into the shipyards of these two companies. \n\nOP might be regarded.\n\nAlso, please invest significant capital into this stock. \n\nSource: lots of RSUs with HII",
      "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk474y5/",
      "created": 1724726399,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk3ndk2",
      "score": 1,
      "body": "When do you think they'll announce those contracts and policies. Congress moves like a turtle.",
      "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3ndk2/",
      "created": 1724718731,
      "depth": 0,
      "replies": [
        {
          "id": "lk4ejs8",
          "score": 2,
          "body": "Especially in election year.  No serious legislation will happen until dust settles on 2024 elections.",
          "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk4ejs8/",
          "created": 1724729624,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lk3nr0s",
          "score": 1,
          "body": "I’m thinking between 6 months and two years. I believe it will get bipartisan support soon though which will cause price to react before the bills are passed",
          "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk3nr0s/",
          "created": 1724718874,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk5ivva",
      "score": 1,
      "body": "Equally plausible is Congress passing legislation authorizing the USN to procure vessels made in ROK or Japanese shipyards. This would be a far quicker way of increasing the fleet size and would produce high quality, cheap ships already designed for integration with USN systems. Added bonus, those shipyards are geographically proximal to where they’re most likely to be employed, reducing the time it’d take to complete repairs after a skirmish. ",
      "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk5ivva/",
      "created": 1724754250,
      "depth": 0,
      "replies": [
        {
          "id": "lk66dt1",
          "score": 1,
          "body": "I agree with all of that except for that I think that choice would be a national security risk. Although it would be far cheaper and easier, Japan and Korea are both close to China and if war ever broke out we’d be back to square one because of blockades or whatever else",
          "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk66dt1/",
          "created": 1724764937,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk61tz7",
      "score": 1,
      "body": "Great post op. Thanks ",
      "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk61tz7/",
      "created": 1724763204,
      "depth": 0,
      "replies": [
        {
          "id": "lk8w600",
          "score": 1,
          "body": "Thanks for reading!",
          "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk8w600/",
          "created": 1724796487,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk64mys",
      "score": 1,
      "body": "You son of a bitch, I’m in after LUNR takes off",
      "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk64mys/",
      "created": 1724764287,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk75f9p",
      "score": 1,
      "body": "Why HII over GD?  Personally I like GD they are already making a killing on artillery shells for ukraine.",
      "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk75f9p/",
      "created": 1724776545,
      "depth": 0,
      "replies": [
        {
          "id": "lk8wne4",
          "score": 1,
          "body": "The logic is that I think HII and GD will receive a relatively even split of naval funding. Because GD is larger and gets about 75% of their profits from other stuff their stock would react less than HIIs if that makes sense",
          "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk8wne4/",
          "created": 1724796644,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk78cki",
      "score": 1,
      "body": "Shit DD with sweeping assumptions that make it seem like the US is only now realizing this and will do all of this at the flip of the switch. I like the long outlook tho. $HII",
      "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk78cki/",
      "created": 1724777470,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk9z2qh",
      "score": 1,
      "body": "my suspicions are that Chinese are investing so heavily in their Navy to silence their last political rival: the Taiwanese, which shows how important the Taiwanese are to global dominance.",
      "permalink": "/r/wallstreetbets/comments/1f23cp9/dd_for_huntington_ingalls_hii_an_explosively/lk9z2qh/",
      "created": 1724810474,
      "depth": 0,
      "replies": []
    }
  ]
}