{
  "title": "[Hindenburg Research] Super Micro (SMCI): Fresh Evidence Of Accounting Manipulation, Sibling Self-Dealing And Sanctions Evasion",
  "score": 187,
  "selftext": "Super Micro Computer Inc. is a $35 billion server maker based in Silicon Valley, California that has ridden the wave of AI enthusiasm.  \n\nOur 3-month investigation, which included interviews with former senior employees and industry experts as well as a review of litigation records, international corporate and customs records, found glaring accounting red flags, evidence of undisclosed related party transactions, sanctions and export control failures, and customer issues.  \n\nIn 2018, Super Micro was temporarily delisted from Nasdaq for failing to file financial statements. By August 2020, the company was charged by the SEC for “widespread accounting violations,” mainly related to $200+ million in improperly recognized revenue and understated expenses, resulting in artificially elevated sales, earnings and profit margins.  \n\nLess than 3 months after paying a $17.5 million SEC settlement, Super Micro began re-hiring top executives that were directly involved in the accounting scandal, per litigation records and interviews with former employees.  \n\nA former salesperson told us: “Almost all of them are back. Almost all of the people that were let go that were the cause of this malfeasance.”  \n\nAccording to a lawsuit filed in April 2024, Super Micro waited only 3 months after the SEC settlement before restarting “improper revenue recognition,” “recognizing incomplete sales,” and “circumvention of internal accounting controls”.  \n\nFull report is here: https://hindenburgresearch.com/smci/",
  "link_flair_text": "Company Discussion",
  "id": "1f2j5ss",
  "num_comments": 128,
  "created_utc": 1724770626,
  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/",
  "comments": [
    {
      "id": "lk6ok1f",
      "score": 85,
      "body": "I’m really curious to see what comes of this, if anything. Smci has been on the highest short interest list for several months, so this may not be a huge secret. It would also be really interesting to see EY have grossly fucked up auditing their financials to such a degree",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk6ok1f/",
      "created": 1724771157,
      "depth": 0,
      "replies": [
        {
          "id": "lk6u4ae",
          "score": 51,
          "body": "Hindenburg has a history of crushing stocks, whether or not their thesis has merit. I'd be worried as a holder, they've cost me a lot of money on stocks they've targeted in the past.",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk6u4ae/",
          "created": 1724772931,
          "depth": 1,
          "replies": [
            {
              "id": "lk78xbx",
              "score": 63,
              "body": "Well, their thesis generally does have merit, which is why stocks they file reports on get crushed. Whatever someone thinks of them, they genuinely do exhaustive research and delve far deeper than any sell side analyst. Most of their reports, the core findings are absolutely correct. What happens then is a question of magnitude, rather than whether the accusations are correct. Hindenburg thinks their core findings are material and enough to mean the stock they target is grossly overvalued. The market doesn’t always agree on how big a deal their findings are.",
              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk78xbx/",
              "created": 1724777650,
              "depth": 2,
              "replies": [
                {
                  "id": "lk9ofwz",
                  "score": 5,
                  "body": "Small nitpick, they are not sell side analysts just because they are a short selling firm.\n\nA sell side analyst is a representative at a bank that does stuff for information/investments/whatever the fuck the bank is selling. For instance, your standard equity analyst is a buy side analyst.",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk9ofwz/",
                  "created": 1724806485,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lk9sbcq",
                      "score": 3,
                      "body": "Well not all sell side equity analysts work for a bank. There are some independent shops like Hedgeye. However yes Hindenburg is buy side bacause they take positions",
                      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk9sbcq/",
                      "created": 1724807937,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lka7kp8",
                      "score": 2,
                      "body": "Yeah, I’m not saying they are a sell side analyst. I am contrasting the two. Hindenburg does a very deep dive when they publish a report. Sell side analysts on the other hand do fairly cursory analysis, largely taking anything the company says at face value and not questioning. Both reports move the stock, but one has conviction and the other does not.",
                      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lka7kp8/",
                      "created": 1724813876,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lk9p5u5",
                  "score": 7,
                  "body": "Sometimes they do make mountains out of mole hills. I remember they put out a release on Draft Kings but all it amounted to was accusations of gray market revenue from a subsidiary in eastern Europe of about $1M USD and acted like that was going to be the death of the company. Of course the stock price did drop into the low teens but would then more than triple from there. ",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk9p5u5/",
                  "created": 1724806749,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lk76obb",
              "score": 11,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk76obb/",
              "created": 1724776942,
              "depth": 2,
              "replies": [
                {
                  "id": "lk93mbw",
                  "score": 1,
                  "body": "I don't see those on their sites. They originally had RIOT and MARA back in 2018. If they do then they whitewash their information or they get into legal trouble and have to remove their articles. So that doesn't bode well and they seem to try to time their information right.  They did it at the start of the bear market.",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk93mbw/",
                  "created": 1724799004,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lk7j869",
              "score": 14,
              "body": "Hidenburg has a history of making mountains out of molehills.  \n\nAdani: still in business \nShopify: thriving\nEmphasis: still in businesses ",
              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7j869/",
              "created": 1724780873,
              "depth": 2,
              "replies": [
                {
                  "id": "lk7n8t1",
                  "score": 29,
                  "body": "For what it's worth, Adani also has the backing of the most powerful politicians in India.",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7n8t1/",
                  "created": 1724782120,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lk7r5zw",
                      "score": 16,
                      "body": "And is Modi's piggybank / retirement account.",
                      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7r5zw/",
                      "created": 1724783337,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lk7urvr",
                  "score": 24,
                  "body": "They’re also very often correct. Clover health, Nikola GrowGeneration, and many others. Adani group is materially down since the report, in excess of 20% still. “Still in business” isn’t exactly a refutation of Hindenburg’s report \n\nThey have a pretty good track record honestly. Many of the companies they report on go on to lose 99% or more of their value in the coming years. I don’t recall a report on either Mphasis or Shopify. Sure you didn’t make those up?",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7urvr/",
                  "created": 1724784468,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lk83lkr",
                      "score": -11,
                      "body": "Is pretty good, good enough when they have money riding on the outcome?",
                      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk83lkr/",
                      "created": 1724787232,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lk85et0",
                          "score": 12,
                          "body": "I don’t understand your question. Good enough for what?",
                          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk85et0/",
                          "created": 1724787800,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lk8e1f2",
                              "score": -8,
                              "body": "When they have money on the outcome of the report the information should be 100% factual. They have been called out for being misleading more than once. Their report on Block (SQ), has been questioned many times. They rely on market sentiment and fear of the report to move stock prices and profit off of that.",
                              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk8e1f2/",
                              "created": 1724790530,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lk8qt11",
                                  "score": 9,
                                  "body": "I don’t know what to tell you. I don’t think you understand how this works. Firms publish the results of their research and often have a financial stake. It is factual. Notice how they say there is evidence of accounting manipulation, and they present the evidence they obtained in their research. The word proof does not appear once in the report. This is how all research reports are, whether positive or negative. It is a presentation of a firm’s argument for whether a stock is under, over or fairly valued, supported by the results of the firm’s research.",
                                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk8qt11/",
                                  "created": 1724794722,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "lk95tol",
                                  "score": 9,
                                  "body": "I mean, I'm long Dell stock (so I have money riding on it) and I can tell you right here that I think it's a great company trading at a cheap valuation - and nobody thinks that should be illegal. So why should the inverse be illegal?\n\nNobody is forced to sell SMCI because Hindenburg put out a report. But people do it because they care what Hindenburg thinks - either because they believe they have a track record of being correct, or because they actually read the report and think the allegations have merit. \n\nIf you believe that Hindenburg's allegations on Block are without merit, you are free to buy the stock, which should go up as it becomes more clear over time that the allegations are not true. That is how free markets work.",
                                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk95tol/",
                                  "created": 1724799768,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lkalowo",
                                      "score": 0,
                                      "body": "It's all free market until you get sued, like Hindenburg. [https://www.business-standard.com/markets/news/sebi-has-a-strong-case-against-us-based-hindenburg-research-say-lawyers-124070301124\\_1.html](https://www.business-standard.com/markets/news/sebi-has-a-strong-case-against-us-based-hindenburg-research-say-lawyers-124070301124_1.html)",
                                      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkalowo/",
                                      "created": 1724820501,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lkam58r",
                                          "score": 5,
                                          "body": "This article is an Indian newspaper quoting a bunch of Indian lawyers saying that SEBI has a case in US courts.\n\nThe reality is that Hindenburg has brought over 70 cases. All of the targets have been very angry, and not one of them have one a lawsuit against Hindenburg.\n\nIn that context, under the legal definition of market manipulation under the US Securities Exchange Act, what Hindenburg is doing is clearly not manipulation (or defamation), and that's why Hindenburg has always been cleared of charges in past litigation.\n\nYou could take a broader definition and label market manipulation as anything which is interfering with free and fair market operations. But in order for markets to function, there needs to be a mechanism in which people are incentivized to investigate and unearth wrongdoing by companies, and the way markets are set up today, short selling provides that function.",
                                          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkam58r/",
                                          "created": 1724820741,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "lk8wsa7",
                                  "score": 2,
                                  "body": "No there is no such thing as 100% factual analysis of corporate intent, nor is there any way to fully out bad actors because they will lie. What you are asking for is something no legal system has ever achieved in all of human history.",
                                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk8wsa7/",
                                  "created": 1724796688,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lk90lyh",
                  "score": 2,
                  "body": "Adani has been trying to diversify its debts and de-lever, Hindenburg was right and Ceo agreed and has been doing everything to de-risk the stock",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk90lyh/",
                  "created": 1724797966,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkf9uma",
                  "score": 1,
                  "body": "And, reddit has a history of decimating 'smart money'. Hope this happens with SMCI",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkf9uma/",
                  "created": 1724890437,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkamvip",
          "score": 2,
          "body": "smci will be in double digits in couple of years",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkamvip/",
          "created": 1724821141,
          "depth": 1,
          "replies": [
            {
              "id": "lkccl2v",
              "score": 2,
              "body": "yeah, because of the split.",
              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkccl2v/",
              "created": 1724853924,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lk8s3pj",
          "score": -6,
          "body": "I have a family friend in EY (who is in a very Sr position in EY) and manages audit of many big ones from Bay Area and many of the big ones are hollow boxes. To start Tesla, Intel and few others.\n\n#####I would love if Hindenberg does more investigation on these.",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk8s3pj/",
          "created": 1724795152,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk73hue",
      "score": 19,
      "body": "So far the market has more or less shrugged it off. It might be because NVDA has earnings tomorrow.. I imagine what they report will determine which way the chip market goes.",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk73hue/",
      "created": 1724775922,
      "depth": 0,
      "replies": [
        {
          "id": "lk7q8cv",
          "score": 14,
          "body": "Just a heads up, NVDA earnings is tomorrow after market close.",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7q8cv/",
          "created": 1724783052,
          "depth": 1,
          "replies": [
            {
              "id": "lk7r4bp",
              "score": 1,
              "body": "Oops forgot what day today was lol thanks.",
              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7r4bp/",
              "created": 1724783323,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lp1gm7g",
          "score": 1,
          "body": "Doj is probing now",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lp1gm7g/",
          "created": 1727367196,
          "depth": 1,
          "replies": [
            {
              "id": "lp1ibwj",
              "score": 1,
              "body": "I have no horse in the race, but find it interesting to see the price swings. DOJ probe just means they are investigating, so either it could end up really bad for them or turn into nothing and be a buying opportunity. I am not touching it either way lol.",
              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lp1ibwj/",
              "created": 1727367724,
              "depth": 2,
              "replies": [
                {
                  "id": "lp33114",
                  "score": 1,
                  "body": "So I watched a video on this last week and I and others are 99% sure they are doing similar accounting things they were penalized for in the past. They literally rehired the same people or they had their partnering businesses rehire them. Some of those businesses are run by the CEOs family members.",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lp33114/",
                  "created": 1727385495,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp342vo",
                      "score": 1,
                      "body": "I don't doubt that they are, but what is the worst case penalty if they are? Can they recover from it? Those are some questions you ask if interested in a position in either direction.",
                      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lp342vo/",
                      "created": 1727385840,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lp3inwm",
                          "score": 1,
                          "body": "They got delisted last time, their stock dropped over 50% and got halted if I remember correctly. You had to buy them otc. So to drop from say $600 per share to idk, $50, get delisted would significantly reduce daily volume.",
                          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lp3inwm/",
                          "created": 1727390885,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lk6vz0p",
      "score": 22,
      "body": "I don't know if this is just a hit job or not, but SMCI has been in hot water before, legally.",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk6vz0p/",
      "created": 1724773525,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk6tznr",
      "score": 20,
      "body": "how big is Hindenburg's short position?",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk6tznr/",
      "created": 1724772890,
      "depth": 0,
      "replies": [
        {
          "id": "lk6wvkd",
          "score": -2,
          "body": "I don't understand the headlines. They're a market research firm as far as I can see.",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk6wvkd/",
          "created": 1724773810,
          "depth": 1,
          "replies": [
            {
              "id": "lk72yes",
              "score": 48,
              "body": "They're also a short seller. They do their research and then take a short position based on the research.\n\nThey're the ones that took down Nikola Motors.",
              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk72yes/",
              "created": 1724775749,
              "depth": 2,
              "replies": [
                {
                  "id": "lk8klgm",
                  "score": 22,
                  "body": "It might be more accurate to say Nikola took themselves down by having trucks with no engines.",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk8klgm/",
                  "created": 1724792657,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lka5inp",
                      "score": 8,
                      "body": "Amazingly Hindenburg we’re the ones to figure that out while the rest of Wall Street were pouring billions in",
                      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lka5inp/",
                      "created": 1724813022,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lkadc3z",
                  "score": 1,
                  "body": "Tons of people already knew that Nikola, and specifically Milton, was a fraud.",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkadc3z/",
                  "created": 1724816379,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lk9q11f",
                  "score": -1,
                  "body": "They do their research, take out a massive short position, and then release their report to the public which gets high coverage. Sometimes their report is meaningful, sometimes they're exaggerating and making a mountain out of a molehill.   \n\n\nOnly thing I'll opine on is if they're allowed to legally do this then all the people crying about GME saying it's market manipulation and should be illegal for Roaring Kitty to release a bull thesis need to shove it.",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk9q11f/",
                  "created": 1724807072,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lk7025s",
              "score": 9,
              "body": "They are disclosing their short position today. That’s what this is mostly about.",
              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7025s/",
              "created": 1724774830,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lp36uyt",
      "score": 4,
      "body": "Honestly, picking through the Hindenburg report. It all seems a bit off. The sources that they have selected are all disgruntled employees. None of them are from the financial side, they are claiming pipeline stuffing. Which is going to be extremely difficult to prove and likely overstated.\n\nEven if they are stuffing the pipeline, you can only stuff so much at the end of the month. It’s unlikely that it would move the needle significantly.\n\nThe individual that filed the lawsuit against SMCI was head of Customer Success and Support? How he would have a good understanding of the companies books is beyond me. It almost seems laughable.\n\nAdditionally SMCI sales directors and senior sales directors are a dime a dozen. They have them everywhere inside and outside of North America. It is most likely that someone was terminated and has an ax to grind against the company.\n\nThe allegations that they exported to Russia are completely false. They sold components to companies that then sold them to Russia.\n\nThat’s not exporting to Russia, nor is that going to get them in hot water. At worst they have lost those companies as customers. If you look at the report, those sales represent a maximum of 200 million dollars in annual revenue or 40 million per quarter…\n\nPast charges for improperly recognized revenue was booked between 2016 and 2018 for a total of 200 million. Over 6 quarters that would be a total maximum of 33 million per quarter. The total fine as part of the SEC settlement was 16 million… total\n\nMargins for the company have been dropping and it’s potentially lost some market share to Dell. However the industry as a whole is growing, they are the third largest company, and as a group they will only be able to drive margins to a point. That point is very unlikely to be single digits.\n\nAll this said, I bought shares at 400, and it seems like a really good deal in the long term. Unless every customer runs for the hills, these should pay of nicely. It always pays to do your research.\n\nOh… the three employées that were terminated and then rehired. None of them have any anything to do with sales, accounting, or anything that could be construed as financial sway.\n\nI think it’s unlikely that anything substantial comes from the report and certainly nothing earth shattering",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lp36uyt/",
      "created": 1727386765,
      "depth": 0,
      "replies": [
        {
          "id": "lpoj32c",
          "score": 5,
          "body": "Accusing Hindenburg of bad research is like signing your own death warrant.  They are one of the best forensic accounting shop and investigative firms in the world.  Your assessment on the 3 employees is wrong. \n\nSo let's go through the reaction...\n\n1.  Delay financial filings\n2.  JP Morgan downgrade\n3.  Department of Justice opens investigation...not the SEC...the DOJ...the US attorneys office who is issuing subpeonas.  The DOJ is agressively looking at the sanctions evasion issue in addition to the sibling self dealing.  \n\nThe report raises huge issues on what is essentially revenue manipulation, accounting fraud, and a lack of corporate governance.  \n\nMore importantly, long term, the company just isn't very good.  They have almost zero competitive AI advantage that Dell hasn't or isn't addressing and NVIDIA has made its affection for Dell very public.\n\nThe stock is incredibly overpriced.",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lpoj32c/",
          "created": 1727717878,
          "depth": 1,
          "replies": [
            {
              "id": "lpu12hi",
              "score": 3,
              "body": "I would say Nvidea isn’t putting all its eggs in one basket. At $40 the stock is fairly priced unless you think they are going to lose a significant portion of market share in the next 2 years. \n\nThey hired a few board members with corporate governance backgrounds, so I would say they have or will shore up that position.\n\nThere is no evidence of accounting manipulation and their whistle blower worked on the customer side and you have one former sales director out of a large pool of sales directors. Not exactly who I would bank on knowing the books.\n\nIf you look at their CFO position, he worked for Intel and AMD prior to SMCI. He has no track record of manipulation.\n\nEven if there is supply chain stuffing. From the Hindenburg report, if that is the worst of what they have going on. The company is more than fine. I think Novembers earnings will be the real tell. They won’t be able to manipulate anything with the current level of scrutiny. \n\nIf they release their 2023 finalized earnings (10K) before that time, without major changes, the stock will take off from its current position. \n\nYou also have the company scaling up as demand is going to grow across the board. You would have to be some kind of cynical to take a short position at this point. Additionally, given the number of shorts currently in play. If the stock moves north at all, those positions will be badly squeezed and unable to liquidate quickly.",
              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lpu12hi/",
              "created": 1727800147,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lqcurcs",
              "score": 1,
              "body": "The stock sold down to an 8 forward P/E. Not sure it's overpriced at those levels.",
              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lqcurcs/",
              "created": 1728073578,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lk727pc",
      "score": 17,
      "body": "This is Hindenburg's business model. Whether their research is right or wrong, they post a very high profile hit piece with the intention of sinking the stock, in turn making money on the short position they have. I'm surprised this is legal.",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk727pc/",
      "created": 1724775515,
      "depth": 0,
      "replies": [
        {
          "id": "lk93na9",
          "score": 27,
          "body": "I mean, you could go put a short position on a stock right now, and then set up a website and start publishing negative comments. As long as you don't say anything untrue to the point of being illegal defamation, that's just freedom of speech. People say good things about companies when they are long the stock all the time, and nobody is surprised it is legal. The problem, of course, is that the stock won't react.\n\nThe reason why stocks react to Hindenburg reports is that Hindenburg has a long track record of being right about these things - that's why people are willing to sell off 10% just on the news that Hindenburg put out a report, before even reading the report. And in this case, once people had time to read the report, they realized that the short thesis is weaker than some of the others Hindenburg has put out in the past, and the stock climbed back. Importantly, if Hindenburg keeps being wrong, people will take them less seriously, and stocks will stop reacting.",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk93na9/",
          "created": 1724799013,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lk73436",
          "score": 18,
          "body": "> I'm surprised this is legal.\n\nHow would it not be?",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk73436/",
          "created": 1724775800,
          "depth": 1,
          "replies": [
            {
              "id": "lk75hkk",
              "score": 4,
              "body": "Andrew Left is a recent example",
              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk75hkk/",
              "created": 1724776566,
              "depth": 2,
              "replies": [
                {
                  "id": "lk78sjm",
                  "score": 13,
                  "body": "From the SEC website: \"According to the SEC’s complaint, once the recommendations were issued and the stocks moved, Left and Citron Capital quickly reversed their positions to capitalize on the stock price movements. As a consequence, Left bought back stock immediately after telling his readers to sell, and he sold stock immediately after telling his readers to buy.\"\n\nIf Hindenburg did the same thing that Andrew Left did, then they should get the book thrown at them. If they consistently maintained the short position and disclosed everything according to the law, then they are doing nothing illegal.",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk78sjm/",
                  "created": 1724777609,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lk7ccu6",
                      "score": -2,
                      "body": "It’s still market manipulation, possibly defamation and they make a position well before a report. They also are private entities so there’s a lot more for them to hide themselves.\n\nThe tactics used, like spreading rumors, releasing sensationalist reports, and leveraging media to create panic, can manipulate stock prices in ways that are unethical. \n\nThere’s a reason why more recently countries like Germany, Italy, France and South Korea have added more restrictions and regulations to short sellers. \n\nIt all comes off like greed and if it’s like Adani, they won’t even be true to their allegations or positions.",
                      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7ccu6/",
                      "created": 1724778731,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lk7vijr",
                          "score": 4,
                          "body": "How is it any different than publishing a bullish report while you maintain a long position? You sound like someone who just believes there’s something inherently wrong or evil about being short.",
                          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7vijr/",
                          "created": 1724784699,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lk7y018",
                              "score": -3,
                              "body": "Bullish reports are typically based on economic indicators. Speculation and accusation are so different. They’re saying that SMCI committed fraud, not that the business isn’t doing well. Which would be great to expose companies of fraud, but this company has a profitable interest and that should be a huge indicator that it is untrustworthy, especially when they hide their positions and have a poor track record themselves.",
                              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7y018/",
                              "created": 1724785475,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lk834ox",
                                  "score": 0,
                                  "body": "Researching dubious accounting practices and self dealing is perfectly legitimate research. Sounds to me like you just think it’s wrong/illegal because you don’t like the result.",
                                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk834ox/",
                                  "created": 1724787082,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lk8iwaj",
                                      "score": -2,
                                      "body": "Legitimate research doesn’t rely on directly profiting from the outcome.\n\nThey’re rumors and accusations until proven otherwise. I’m all for companies not committing fraud.",
                                      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk8iwaj/",
                                      "created": 1724792104,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lk8soym",
                                          "score": 7,
                                          "body": "That’s hogwash, you are exhibiting a double standard here. Firms publish bullish reports on companies in which they have a stake all the time. I don’t hear any crying about that. Are you just butt hurt because you’re long SMCI? There is absolutely nothing wrong with taking a position and then publicly making a case for why you believe your position to be correct.",
                                          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk8soym/",
                                          "created": 1724795344,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lk7h9bq",
                          "score": -1,
                          "body": "It’s not defamation to publish a research report on why you think a stock is overvalued/a sell.  Even if you have a position.",
                          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7h9bq/",
                          "created": 1724780262,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lk7jbvw",
                              "score": 5,
                              "body": "The report is alleging illegal activities, based off of hired employees, not financial technical analysis.",
                              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7jbvw/",
                              "created": 1724780905,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lk7mgdk",
                                  "score": 4,
                                  "body": "I think that’s a reduction to the scope of the entire report, to be honest; they talk about shipments to odd JVs in other countries (among a list of other things)\n\nLook,  no one has to sell any stock when Hindenburg writes things.  They can choose to ignore it.",
                                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7mgdk/",
                                  "created": 1724781872,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lk7mn7u",
                                      "score": 0,
                                      "body": "I think your initial post was also a reduction to the report.",
                                      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7mn7u/",
                                      "created": 1724781932,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lk7nczd",
                                          "score": -1,
                                          "body": "Ok.  I amended my original comment.  I’m not about to respond with the entirety of their thesis in the comment section here. \n\nAgain, no one is making anyone sell the stock.  It’s an opinion.  If they’re wrong, then they’re wrong.",
                                          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7nczd/",
                                          "created": 1724782156,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lk7h2w8",
              "score": -2,
              "body": "Because the whole intent is market manipulation.",
              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7h2w8/",
              "created": 1724780205,
              "depth": 2,
              "replies": [
                {
                  "id": "lk7zmxa",
                  "score": 24,
                  "body": "Alternatively, it’s an incentive to make your case for why a company isn’t as valuable as they want you to think it is. There’s significant liability for untrue statements.",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7zmxa/",
                  "created": 1724785990,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lk80qu8",
                      "score": 0,
                      "body": "But all the \"research agency\" has to do is make sure that they don't make any egregiously false statements to avoid liability. Almost without fail a company that is subjected to these kinds of reports instantly drops 20-25 percent. The content of the report is not meaningful to that short term drop because it happens before anyone could actually read the report. So as long as they don't say anything that can get them into legal trouble they are just manipulating the market for free money.",
                      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk80qu8/",
                      "created": 1724786338,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lk92rw9",
                          "score": 8,
                          "body": ">Almost without fail a company that is subjected to these kinds of reports instantly drops 20-25 percent. The content of the report is not meaningful to that short term drop because it happens before anyone could actually read the report. \n\nLet's look at how things played out today. SMCI dropped ~10% when Hindenburg put out their report, but it climbed back up as people read the report, and ended the day down ~3%. \n\nYou could go put a short position on a stock right now, and then set up a website and start publishing negative comments. The problem, of course is the stock won't react. \n\nThe reason why stocks react to Hindenburg reports is that Hindenburg has a long track record of being right about these things - that's why people are willing to sell off 10% just on the news that Hindenburg put out a report, without even reading the report. And then once people had time to read the report, they realized that the short thesis is weaker than some of the others Hindenburg has put out in the past, and the stock climbed back. Importantly, if Hindenburg keeps being wrong, people will take them less seriously, and stocks will stop reacting.",
                          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk92rw9/",
                          "created": 1724798710,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lk96swg",
                              "score": -4,
                              "body": "The reason why stocks react to Hindenburg reports is that stocks have a long history of reacting to Hindenburg reports in exactly the same way. No one has read the report before the reaction. It is just algorithms. So the profit is to react to the algorithmic drop (or in Hindenburg's case to short before releasing the report). You can argue that they have somehow have earned the reputation to be able to manipulate the market but it is still just simple manipulation.",
                              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk96swg/",
                              "created": 1724800116,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lk9beuu",
                                  "score": 8,
                                  "body": "If Hindenburg releases a report that is without merit, the stock would climb back once people digest the contents and it is becomes clear that the short thesis is weak (which actually happened today), which in turn would wipe out the profits from Hindenburg's short position.\n\nUnless Hindenburg put out a report and immediately closed the short before the market has time to digest the thesis (which actually would be illegal manipulation, and in any case there are no allegations that Hindenburg does this), Hindenburg still needs to be right over a longer time horizon in order to make money. \n\nHindenburg actually discloses its positions to industry organizations like Breakout Point; Breakout Point's data shows that Hindenburg's 10 targets in 2022 were down an average of 42% a year later. \n\nThe point about algorithmic moves is trickier because in general algorithms do a lot of stuff which is counterintuitive to humans. But in general, most algos are market-neutral and look to avoid taking intra-day positions and close their books at the end of each trading day. Most price discovery is coming from fundamental investors, and as a result algos are often trying to predict how fundamental investors will react.\n\n>reputation to be able to manipulate the market but it is still just simple manipulation.\n\nI mean, under the legal definition of market manipulation under the US Securities Exchange Act, what Hindenburg is doing is not manipulation (or defamation). That's why none of the angry targets of Hindenburg's reports have successfully sued them. \n\nYou could take a broader definition and label market manipulation as anything which is interfering with free and fair market operations. In order for markets to function, there needs to be a mechanism in which people are incentivized to investigate and unearth wrongdoing by companies, and the way markets are set up today, short selling provides that function.",
                                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk9beuu/",
                                  "created": 1724801759,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lk811se",
                          "score": 1,
                          "body": "I think you might be right. \n\nBUT to steelman a bit… You’re free to make positive statements about the company or even stir uncertainty about the veracity of these statements too. \n\nFWIW, SMCI has barely moved today. Seems like maybe their case wasn’t strong enough for the market, at least not to overcome the anticipation of NVDA earnings or other evidence.",
                          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk811se/",
                          "created": 1724786432,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lk82my5",
                              "score": 1,
                              "body": "The thing is that positive statements don't have the same impact. If Hindenburg released a report that SCMI was the greatest its price would not spike, so positive statements lend themselves less well to maniupulation.\n\nSCMI did insta-frop 10 percent on the report. It did gain most of that back fairly quickly, which is pretty good if you are looking to manipulate. It had dropped a lot more than that yesterday, and I don't follow the company enough to know what caused that. I just get irritated whenever I see people like Hindenburg make these reports.",
                              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk82my5/",
                              "created": 1724786929,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lk94hpr",
                              "score": 1,
                              "body": "I think they go hey how come the government doesn't regulate AI supercomputer and stuff going overseas anyways. There is not a path forward don that. The government is responsible for this and they shouldn't rely on some short sellers with black budget money to weaponize short selling. More details on how a government black budget is financing their research.",
                              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk94hpr/",
                              "created": 1724799304,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lkahsx6",
                  "score": 3,
                  "body": "So should analyst price targets also be illegal?",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkahsx6/",
                  "created": 1724818501,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkaivhw",
                      "score": 0,
                      "body": "Analyst price targets do not have the same effect.",
                      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkaivhw/",
                      "created": 1724819042,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lkadh6r",
                  "score": 1,
                  "body": "Without Merit, the reports wouldn't have such an impact.\n\nHindenburg mostly focuses on fraudulent activities, and catching these kinds of things is better for most investors.\n\nOf course, Hindenburg earns money with it. But this is just plain capitlism in a nutshell. They are not a charity that gets paid by the community. Even the people at hindeburg research want to have a wage or return on their investments.\n\nHindenburg research are the copper collectors of Wall Street. Normal people think they are leeches, useless or do fraudulent activities while in reality doing something useful for everyone to profit off.",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkadh6r/",
                  "created": 1724816442,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lk7a1jo",
          "score": 8,
          "body": ">I'm surprised this is legal. \n\nYou are surprised publishing factual statements and interviews with ex-employees is legal? Where are you from, North Korea?",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7a1jo/",
          "created": 1724778001,
          "depth": 1,
          "replies": [
            {
              "id": "lk838zz",
              "score": 1,
              "body": "No one said publishing factual statements is the issue. The question becomes what is their motivation to publish the facts. They are not a news agency, they profit off of the movement of the stock. You have to question if their motivation manipulates their reports and who has oversight to what they publish. Do you take everything you read on the internet as factual?",
              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk838zz/",
              "created": 1724787120,
              "depth": 2,
              "replies": [
                {
                  "id": "lk93a3l",
                  "score": 8,
                  "body": "I mean, people make bullish statements about companies where they are long the stock all the time, and nobody questions whether that is legal. Why is it different if people make bearish statements when they are short the stock?",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk93a3l/",
                  "created": 1724798887,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkceqra",
                      "score": 1,
                      "body": "THIS!!!",
                      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkceqra/",
                      "created": 1724854625,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lk7gj9x",
          "score": 1,
          "body": "If someone that is long posts a positive review of their product or positive news, is that market manipulation?",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7gj9x/",
          "created": 1724780034,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk9u27u",
      "score": 2,
      "body": "They killed icahn …and  not just companies like mvis     This will be interesting to watch",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk9u27u/",
      "created": 1724808597,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkbzuy9",
      "score": 2,
      "body": "Smci was a joke prior to this piece. There is little reason to invest in them",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkbzuy9/",
      "created": 1724849399,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkd1rmk",
      "score": 2,
      "body": "Hindenburg is an appropriate name, ngl.",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkd1rmk/",
      "created": 1724861712,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll2sc7m",
      "score": 2,
      "body": "I guess Warren Buffet was right. \n\nNothing else matters if integrity is missing",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/ll2sc7m/",
      "created": 1725238804,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk9fzwp",
      "score": 3,
      "body": "Hindenburg claims were proven true in 90% of the cases and SMCI stock was delisted earlier.",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk9fzwp/",
      "created": 1724803432,
      "depth": 0,
      "replies": [
        {
          "id": "lk9pfbn",
          "score": 6,
          "body": "Most of what was said was just things from the past, and then what companies they sell to - resales their products for... maybe the family things are an issue, but im personally not sure, i guess not disclosing it? The quote about \"40% didnt work, until we made sure they were plugged in then they all worked\" seemed silly... i mean correct me if im wrong. And aren't they highly audited these days as well?",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk9pfbn/",
          "created": 1724806845,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkabwi3",
          "score": 1,
          "body": "SMCI was a small cap stock then. If they're smart, they should have risen to the level of paying Congress to look the other way. Regulators are the enemies of small businesses and the friends of the largest corporations.",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkabwi3/",
          "created": 1724815742,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk7c2kq",
      "score": 1,
      "body": "1. Be influencial.\n\n2. Write some bullshit and buy puts\n\n3. Release the bullshit, wait for market open and close the positions, and immediately buy calls.\n\n4. ??? Infinite money",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7c2kq/",
      "created": 1724778642,
      "depth": 0,
      "replies": [
        {
          "id": "lk7swrm",
          "score": 21,
          "body": "Try it. \n\nIf you keep writing bullshit, you won’t be influential for long. Or become influential in the first place.",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk7swrm/",
          "created": 1724783883,
          "depth": 1,
          "replies": [
            {
              "id": "lk83mcv",
              "score": 1,
              "body": "Meanwhile Trump is on the road to become president in the US again.\n\nYou can go far bullshitting.",
              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk83mcv/",
              "created": 1724787239,
              "depth": 2,
              "replies": [
                {
                  "id": "lk8jlvm",
                  "score": 6,
                  "body": "Touché.",
                  "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk8jlvm/",
                  "created": 1724792334,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lk8401h",
              "score": -2,
              "body": "Jim Kramer called and wants you to SELL SELL SELL",
              "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk8401h/",
              "created": 1724787359,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lk8lryx",
          "score": 3,
          "body": "5. The subject of the report threatens to swiftly, and with ferocity, take legal action against the author and seek damages for these outrageous, unfounded lies.\n\n6. The lawsuit never comes because:\n i) The allegations are true\nii) Filing a lawsuit opens them up to discovery, and then the shit will really hit the fan",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk8lryx/",
          "created": 1724793046,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkctncn",
      "score": 2,
      "body": "SEC should investigate the credibility of Hindenburg Research.  They take short positions and release fake reports to cause market havoc. They should disclose the time of their short purchases before the report is made public and not afterward. There is something fishy here. Gary Gensler investigate Hindenburg Research and arrest Nathan Anderson ASAP.",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkctncn/",
      "created": 1724859221,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkch1d3",
      "score": 1,
      "body": "Well as EY started in FY24. I wonder whether EY has found it out or not.",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkch1d3/",
      "created": 1724855349,
      "depth": 0,
      "replies": [
        {
          "id": "luta9jd",
          "score": 1,
          "body": "Turns out, they did.",
          "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/luta9jd/",
          "created": 1730436821,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkgg0uc",
      "score": 1,
      "body": "Whiskey Tango Foxtrot",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lkgg0uc/",
      "created": 1724907926,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp1ozck",
      "score": 1,
      "body": "[https://www.reuters.com/technology/us-justice-department-probes-super-micro-computer-wsj-reports-2024-09-26/](https://www.reuters.com/technology/us-justice-department-probes-super-micro-computer-wsj-reports-2024-09-26/)\n\nwell",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lp1ozck/",
      "created": 1727369758,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk9xykx",
      "score": 1,
      "body": "The way to go is buy when it drops. I’m up 50% in FLNC after these idiots report last year 😇",
      "permalink": "/r/stocks/comments/1f2j5ss/hindenburg_research_super_micro_smci_fresh/lk9xykx/",
      "created": 1724810056,
      "depth": 0,
      "replies": []
    }
  ]
}