{
  "title": "Intel board member quit after differences over chipmaker's revival plan",
  "score": 413,
  "selftext": "The sudden resignation of a high-profile Intel board member came after differences with CEO Pat Gelsinger and other directors over what the director considered the U.S. company's bloated workforce, risk-averse culture and lagging artificial intelligence strategy, according to three sources familiar with the matter.\n\nLip-Bu Tan, a semiconductor industry veteran, had said he was leaving the board because of a personal decision to \"reprioritize various commitments\" and that he remained \"supportive of the company and its important work,\" in a regulatory filing on Thursday.\n\nThe former CEO of chip-software company Cadence Design joined Intel's board two years ago as part of a plan to restore Intel's place as the leading global chipmaker. The board expanded Tan's responsibilities in October 2023, authorizing him to oversee manufacturing operations.\n\nOver time, Tan grew frustrated by the company's large workforce, its approach to contract manufacturing and Intel's risk-averse and bureaucratic culture, according to the sources, who were not authorized to speak publicly. \n\nThe circumstances around Tan's exit have not previously been reported. The departure of the industry veteran, who is well-regarded by investors, over Intel's strategy illustrates the uncertainty of its turnaround efforts.\n\nTan leaves as the company endures one of the bleakest periods in its five-decade history that has left it vulnerable to a potential activist shareholder attack, former executives said. Intel has hired investment bank Morgan Stanley to prepare a defense, according to sources familiar with the matter, confirming an earlier report.\n\nIntel, headquartered in California, declined to comment. Tan's venture capital firm, Walden Catalyst, did not respond to a request for comment.\n\nTan's exit leaves a vacuum of chip-industry technical and business acumen on the board, which is populated by leaders in academia and finance, and former senior executives from the medical, tech and aerospace industries, say investors and semiconductor industry insiders.\n\nFormer Intel executives told Reuters the company began preparing for a potential activist threat months ago. Reuters could not independently confirm if any shareholders were preparing an approach.\n\nThis month, Intel paused its dividend that it had been paying for decades when it reported results and plans to reduce capital spending on factory construction. The next day, investors wiped more than $30 billion from its market value, or more than a quarter of its worth.\n\nIntel's struggles are occurring against the backdrop of aggressive investment and sales from rivals swept up by the surge of interest in artificial intelligence. The AI boom turned graphics chipmaker Nvidia into a $3-trillion market-cap company. Intel passed on an opportunity in 2018 to take as much as a 30% stake in ChatGPT-maker OpenAI, Reuters previously reported.\n\nIntel acquired at least two AI startups, among more than four efforts since 2010 to build a blockbuster AI chip, according to former executives. Even though its Habana acquisition yielded promising AI chips, its senior leaders left to form a rival effort in Israel, hurting Intel's program, two sources said.\n\nTo cut costs, Intel announced in August layoffs of more than 15% of its workforce, its second round of cuts in two years. Intel had nearly 125,300 employees globally according to its August financial results.\n\nThe layoff plan was one source of tension between Tan and the board, according to sources. Tan wanted specific cuts, including middle managers who do not contribute to Intel's engineering efforts.\n\nGelsinger, who took over in 2021 as part of a turnaround plan, added at least 20,000 employees to Intel's payroll by 2022.\n\nTo Tan and some former Intel executives, the workforce appeared bloated. Teams on some projects were as much as five times larger than others doing comparable work at rivals such as Advanced Micro Devices, according to two sources. One former executive said Intel should have cut double the number it announced in August years ago.\n\nTan has told people he believed Intel was overrun by bureaucratic layers of middle managers who impeded progress at Intel's server and desktop chips divisions and the cuts should have focused on these people.\n\nIntel's workforce, which is larger than those of Nvidia and Taiwan Semiconductor Manufacturing Co combined, has led to a complacent and uncompetitive culture, far from the \"only-the-paranoid-survive\" ethos of Intel co-founder Andy Grove, former Intel executives said.\n\nIntel's turnaround plan relies on building its foundry business, which helps other companies manufacture chips, similar to TSMC. But the company has not disclosed a big customer and has said the business is not expected to turn a profit until 2027.\n\nAn attempt last year to break into contract-manufacturing through a $5.4-billion purchase of Israel-based chip manufacturer Tower Semiconductor was scuttled after China blocked the deal. Intel would have obtained an organization dedicated to contract chipmaking, something Intel has never done successfully.\n\nWithout Tower, Intel, historically a maker of its own chips, lacks the expertise to work with external customers, which it has struggled to attract, according to four sources familiar with Intel's manufacturing business.\n\nTan grew frustrated as the board did not follow his recommendations over how to make the manufacturing business more customer-centric and to remove unnecessary bureaucracy, a person close to Tan said.\n\nIntel has continued to build new factories in Ohio, Arizona and across Europe without naming new customers.\n\nhttps://m.economictimes.com/tech/technology/intel-board-member-quit-after-differences-over-chipmakers-revival-plan/amp_articleshow/112843092.cms",
  "link_flair_text": "Company News",
  "id": "1f2ji5j",
  "num_comments": 109,
  "created_utc": 1724771447,
  "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/",
  "comments": [
    {
      "id": "lk75whs",
      "score": 149,
      "body": "Not a great article for shareholders. But something seems off. Your telling me the board, CFO, and CEO don't think firing middle managers and being customer centric is the right approach?\n\n\nThere's more depth to the story then what's being told IMO",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk75whs/",
      "created": 1724776698,
      "depth": 0,
      "replies": [
        {
          "id": "lk7iu06",
          "score": 86,
          "body": "The board is full of non-tech people, of like different industries. Sounds to me so much conflicting opinions on how to turn things around.\n\n\nI don't think it's about customer-centric, but what they think is customer-centric is different per individual. So there is no greater consensus.\n\n\nI have been in a startup with board members full of academia. Terrible. Lofty and idealistic people. That might work in research fields, but in engineering, it's shooting yourself in the foot many many times.",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7iu06/",
          "created": 1724780753,
          "depth": 1,
          "replies": [
            {
              "id": "lke168u",
              "score": 3,
              "body": "Once a tech company loses its tech focused leadership it’s downhill.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lke168u/",
              "created": 1724872774,
              "depth": 2,
              "replies": [
                {
                  "id": "lkh0ypa",
                  "score": 2,
                  "body": "Check. See Boeing.",
                  "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lkh0ypa/",
                  "created": 1724921119,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lk7j4dq",
          "score": 6,
          "body": "It’s strange too since that’s been the go to cuts this year all over for tech companies",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7j4dq/",
          "created": 1724780842,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkcm455",
          "score": 2,
          "body": "You gonna trust the word of an angry board member that quit at face value?\n\n\nYou really think this board member only is targeting \"middle managers\" in his suggestion? Lol",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lkcm455/",
          "created": 1724856932,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkgspeg",
          "score": 1,
          "body": "A friend that works software QA there said they stopped paying for enough equipment for them to do their job so they with having to scrounge for equipment. Upper management blames the Infrastructure Reduction Act which while it might hurt a lot of businesses, but I doubt that is the real reason in this case. ",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lkgspeg/",
          "created": 1724915598,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lk8xdiq",
          "score": -2,
          "body": "They wanted Grandma's $700K",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8xdiq/",
          "created": 1724796884,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk6sd1z",
      "score": 159,
      "body": "Maybe the Intel Grandma guy can fill the open position.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk6sd1z/",
      "created": 1724772373,
      "depth": 0,
      "replies": [
        {
          "id": "lk7550f",
          "score": 69,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7550f/",
          "created": 1724776452,
          "depth": 1,
          "replies": [
            {
              "id": "lk7m9au",
              "score": 22,
              "body": "#####Just couple of days back I mentioned this on WSB.       \nI work in BayArea in big tech company (Over $100B in Rev).       \n\nIntel is in shambles, Intel was a pioneer (no doubt). It was led by Engineers where Engineers had more control in 90s and early 2000s. Then came MBA grads who brought the culture of *Lets milk the cow by pushing 1% perf increase* and people were buying their shit even till 2013-14. MBA Grads started feeling that they dont need Engineers and started kicking them out*    \n\nWell go back and see Intel lays off in thousands every year (yups pick any year and they would have laid off atleast 1000 employees).    \n\nThe company is in such a bad shape that now almost all good engineers are gone. MBA grads left now with no idea what to do. \n\n1) Company is stopping dividends.       \n2) Company is not giving any cash bonus to their employees (they are giving RSUs). Basically the internal buying of Intel which you see is Intel doing buy back and giving it to their employees (instead of cash). Company is trying to save cash desperately.       \n\n######Even if TSMC stops tomorrow, Intel doesn't have enough good quality engineers left anymore. No amount of money is gonna save them. Pat got billions from US Govt (my tax dollars) and has not shown anything in real (except promises and PPTs).     \n\nIntel would have been obliterated long back. below points just prolonged their life a bit.   \n\n1) Pandemic Boom - When chips, laptops, etc were selling like cakes. Intel also rode on the wave.     \n\n2) US Govt Funds - Intel took billions on thr name of Natln Security to invest in local fabs only to pause work here and there.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7m9au/",
              "created": 1724781811,
              "depth": 2,
              "replies": [
                {
                  "id": "lk7psz8",
                  "score": 15,
                  "body": "Not sure I agree with your statement about Intel lacking good engineers, maybe manufacturing engineers, yes, but it's a work of art that they managed to actually make 10nm (Intel 7) CPUs competitive against AMD that was manufactured on more advanced TSMC silicon",
                  "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7psz8/",
                  "created": 1724782920,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lk86ke3",
                      "score": 1,
                      "body": "It wont stand for long. Intel takes 10yrs to come up with something which is barely competitive. AMD will just breeze through it in next iteration.    \n\nThe problem lies in the underlying architecture which Intel can not afford to change now. AMD ticked it right with Ryzen back in 2015. I work in semi space I know how toast Intel is.",
                      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk86ke3/",
                      "created": 1724788165,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lk8kz02",
                          "score": 10,
                          "body": "AMD definitely took a gamble (and lost a lot of revenue) with changing from the Athelon to Bulldozer  multi-threaded focused chip design, but that willingness to design a whole new chip architecture from the ground up resulted in Ryzen.\n\nYou're right, Intel can't afford to do that now, and the engineering/design knowledge to do so will only become harder as more senior design staff retire or get laid off for being too expensive.\n\nMBA managers need to realize engineers and designers are not interchangeable, and throwing more people at the problem is not the solution.",
                          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8kz02/",
                          "created": 1724792778,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lk8n4a3",
                              "score": 11,
                              "body": "Yups, you nailed it.    \n\nIntel is laying of very Sr Engineering folks (these are not your 20-25yrs frwsh college grads). They laid off Principal Architects, Chip Architects, many senior folks who were getting paid very high (over $400K) and companies try to do cost cutting rather than realizing the impact of it.     \n\nMany of these folks moved to AMD, Amazon, Google and what not. I have friends who work in these positions and keep 1st hand info of where the talent is moving. Intel is drained of talent, Partners (and Customers arw worried if they buy Intel chips can Intel even provide proper support for next 5yrs). Enterprise deals are locked in for 5-10yrs and customers look at 'Sellers health as well'. First hand info coming that many customers are worried with Intel's next 7-10yr survival and if they buy $20M of chips they might get stuck.    \n\nIt is not about making fastest chip on the block. AMD is increasing their ER and Intel is burning cash pile super fast and customers are losing trust. Wait till Nov 2024, You might hear something big coming up in favor of AMD.     \n\nIntel will just end up like Cisco, IBM, GE. *A company pioneered by engineers and ruined by MBA grads*, All time high for these stocks can never come again.  \n\n#####I know America loves these companies but data and facts should not be mixed with emotions.",
                              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8n4a3/",
                              "created": 1724793490,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lk8r6mo",
                  "score": 0,
                  "body": "This is the truth. Intel is done. There’s no coming back from this. AMD and TSM are just going to slightly ramp up production to take over when intel go bankrupt shorty",
                  "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8r6mo/",
                  "created": 1724794848,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkjp0f7",
                      "score": 2,
                      "body": "Man all these redditors commenting that they are so sure it's over for Intel are making me think it's now finally a good buying opportunity.",
                      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lkjp0f7/",
                      "created": 1724956912,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lk7kttd",
              "score": 1,
              "body": "> At the rate things are going, $700k will be enough for a hostile takeover within the decade\n\nI would happily take over the company for $700k if a bank would let me lol. Backed by the acquired INTC shares obviously.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7kttd/",
              "created": 1724781366,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lk781d0",
      "score": 63,
      "body": "“Risk-averse and bureaucratic culture” is right. Intel used to be the top dog, and now they’re in a death spiral. On the grand stage of chips they’ve essentially reverted to a start up (tons of cash/availability to cash, and needing to develop a new tech/process). Inertia is massive and the company needs to shed some weight in order to start maneuvering like more of a start up if they want to stand a chance.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk781d0/",
      "created": 1724777372,
      "depth": 0,
      "replies": [
        {
          "id": "lk7nnoc",
          "score": 28,
          "body": "So I'm going to take this a slightly different direction.\n\nReal Mistakes Intel has made\n\n1. Looking into Holographic DUV rather than going all in on EUV. This is what caused them to lose their market position. This was the result of bean counters hoping the cheaper process would be good enough, but while it worked the yield rates were too low causing it to become uneconomically viable and forcing intel to not shrink their chips for multiple generations to maintain economic viability.\n2. Some bug/oversight causing 13th & 14th gen chips to damage themselves slowly with overvoltage issues. They say they have it under control now with the new microcode update. Only time will tell if that is true.\n\nMistakes INVESTORS are worried about that we don't know the outcome of yet\n\n1. Massive investments into new fabs without a clear roadmap, clientele, etc who will use their contracting services. This makes their balance sheet look like shit and if they don't get some big clients this will be a gigantic waste of money.\n2. Their mistakes and anti-consumer approaches are degrading a core customer base in the server sector. AMD is also going after the server market more aggressively. This puts their long term market position in jeopardy.\n3. They are making a lot of long term bets on things like GPU's that are hemmoraging money. While I believe this is probably best for them in the long term; investors want their money this quarter and these types of plays are just not what they want to see.\n\nReasons to be optimistic\n\n1. Their current chips have honestly caught up to AMD. The 14th gen that aren't killing themselves match or exceed the top AMD chips in a wide variety of tasks. 7800X3D is overall best gaming GPU but after that there is a long list of great performance/$ cpu's from intel.\n2. The 9000 series from AMD is overall a bit of a dud. VERY little benefit over the 7000 series which a large part of the 14th gen already was beating. The 7800X3D still best for consumers and while most of the benefits for the 9000 series is for servers and heavey multi-threaded workloads the jump isn't particularly impressive and well below what we normally expect for a generational leap. If 15th generation even an average boost compared to 14th gen it's VERY likely intel takes a clear lead in the market.\n\nMy take. Intel is making multiple long term plays and people are getting super ancy because they have had 2 major mistakes in the last decade. These are really risky gambles with hundreds of billions of dollars and if even 1 of these turns out to be a complete failure it will be a huge issue for the company. By end of 2025 first service fabs will be online, battlemage gpu's will be out, and we will know if 15th gen is better than 9000 series or if they also stumble like AMD on this generational update.\n\nGiven the massive hits in their recent stock, there likely is a lot of upside potential IF they pull it off. The idea 'they are risk adverse' to me doesn't really track with their current heavy investment strategy. The culture might be 'risk adverse' but they are playing with fire here. Messing up and having another micro-code issue is something they CAN'T afford. AMD's messups are giving them an opportunity to regain their footing and we won't know how this plays out until probably end of next year.\n\nI expect the stock to go down or stay put until we see how these bets pay off and any investment in INTEL is just betting on this stuff working out. Only project that has me super worried for them is the contract fabs. It's REALLY not clear who they would be getting contract work from. Unless they get an Nvidia, Qualcomm, etc style client I honestly DON'T know how they can justify the cost and I just don't see any of those companies leaving TSMC in a serious capacity. There just aren't many customers in the world that can even use this service and stealing them from TSMC won't be easy.",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7nnoc/",
          "created": 1724782249,
          "depth": 1,
          "replies": [
            {
              "id": "lk84nrq",
              "score": 3,
              "body": "The 9000 series being better for enterprise/Linux is huge, its just going to lead to AMD taking more of intel enterprise marketshare which is where the real money is.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk84nrq/",
              "created": 1724787565,
              "depth": 2,
              "replies": [
                {
                  "id": "lk85f4s",
                  "score": 3,
                  "body": "The 9000 series is better than 14th gen in those tasks, 9000 series though is meant to be compared to Intel 15th gen which will come out later this year.",
                  "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk85f4s/",
                  "created": 1724787803,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkatct3",
              "score": 1,
              "body": "to add to your last point, there's Samsung who is the only viable second option. Intel has to beat them as well. It's David vs two Goliaths.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lkatct3/",
              "created": 1724824923,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lk7frcv",
          "score": 18,
          "body": "I feel like Microsoft made a comeback after a similar rut. Perhaps Intel can too. I've got 3 shares though, so I'm probably thinking wishfully.",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7frcv/",
          "created": 1724779793,
          "depth": 1,
          "replies": [
            {
              "id": "lk7izgq",
              "score": 12,
              "body": "Making physical things versus software makes it harder, but I hope so",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7izgq/",
              "created": 1724780800,
              "depth": 2,
              "replies": [
                {
                  "id": "lk7kvof",
                  "score": 3,
                  "body": "I think being the king of high performance chips for decades was not good for them. Apple moving into arm was a wake up call. It's kind of sad because the last time they tried a big swing, AMD ate their lunch and dictated their own next generation architecture. They are all in on backwards compatibility, but I wonder if there isn't opportunity beyond that product line. Who knows.",
                  "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7kvof/",
                  "created": 1724781382,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lk7hri5",
              "score": 7,
              "body": "i sold the 3 shares I had. Lost $30 but I think it was worth it 😅",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7hri5/",
              "created": 1724780420,
              "depth": 2,
              "replies": [
                {
                  "id": "lk7ihac",
                  "score": 3,
                  "body": "\"A bird in hand..\" as they say",
                  "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7ihac/",
                  "created": 1724780644,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lk8xfnr",
              "score": 2,
              "body": "Microsoft is the reason QQQ beats most hedge funds, lol.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8xfnr/",
              "created": 1724796903,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lk8rbus",
              "score": 0,
              "body": "You should sell them. Intel is done and they are never coming back mate. Look at the stock chart and how well AMD is doing. They’ll likely be bankrupt within the next year",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8rbus/",
              "created": 1724794896,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lk7aldh",
      "score": 14,
      "body": "Nana is fuming.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7aldh/",
      "created": 1724778174,
      "depth": 0,
      "replies": [
        {
          "id": "lk7jr75",
          "score": 3,
          "body": "She has taken a top demoness position in hell to vent her wrath.",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7jr75/",
          "created": 1724781037,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk6thu2",
      "score": 58,
      "body": "I completely agree with this guy, I don't blame him for leaving. Intel has failed to reinvent itself because it won't make the hard choices it needs to in order to bring about the changes that are needed to make Intel a success in the ai transition.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk6thu2/",
      "created": 1724772733,
      "depth": 0,
      "replies": [
        {
          "id": "lk7muer",
          "score": 25,
          "body": "I'm starting to think learning how the workforce sentiment is very important. I had friend about 8 yrs ago who left INTEL after being completely dedicated to the company; his reasoning was that it was way too bureaucratic, too many middle managment to get anything done; it was slow and boring and difficult to innovate. I guess maybe glassdoor here could be valuable tool?",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7muer/",
          "created": 1724781995,
          "depth": 1,
          "replies": [
            {
              "id": "lk86bzx",
              "score": 13,
              "body": "This is well known in the Software Engineering circles too. When i was graduating back in 2014 with a Masters in Comp Science- i was specifically told( by my college seniors) to avoid being a FTE at Intel and Cisco ( unless you are literally jobless). Their reasons being “You wont learn much and the pay is so less- its simply not worth your time and youth and energy”. I did what they said and went to join Qualcomm as a SWE (still low pay for a SWE but learnt a ton)",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk86bzx/",
              "created": 1724788090,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lk7q25j",
          "score": -2,
          "body": ">changes that are needed to make Intel a success in the ai transition.\n\nAI hype is dying bestie, it'd be the most Intel thing to do to heavily invest in it now",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7q25j/",
          "created": 1724782999,
          "depth": 1,
          "replies": [
            {
              "id": "lk7r2ob",
              "score": 6,
              "body": "AMD is investing in AI as we speak, they just made an AI related acquisition.\n\nThe AI boom will take several years by all reports. It could go into the early 2030's\n\nI imagine Nvidia is also investing further in AI so they don't fall behind AMD.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7r2ob/",
              "created": 1724783309,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lk78usy",
      "score": 11,
      "body": "Not a great sign for grandma.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk78usy/",
      "created": 1724777629,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk71viz",
      "score": 36,
      "body": "This should be taken with a grain of salt. Pat Gelsinger himself was in the C-Suite position when they legendary fired 1000 managers in 2006. He has very good knowledge of internal processes and how fast Intel can get bloated, it's not the first time in this company's history. The bigger problem was once Pat came into play he was not focused on efficiency but solving the current issues with brute force. Meaning throwing as much money and people at it as possible. The issue that came into play that he slightly miscalculated how far Intel was actually behind. His famous philosophy back then was that by each generational cycle the competition came out Intel already offers 2. We can really see this in the current roadmap we're Intel comes out with new products in way under 12 months in each space.  When AMD and TSMC doesn't get their act together Intel will leapfrog them in 2025. This isn't the first time Intel has done this in its history. The issue now is that Intel is a long term play and in a currently not favorable position. Wall Street does not like that. They want fast money, fast quarterly results and don't care about anything else really. Now with the recent news about activist investors iam quite sure this news is fabricated by activist investors who manipulate the media in the background to gain shareholders favor. Don't fall for it. Intel wants to protect themselves from activist investors because they would try to split the company apart for the short term gain. If they would enter Intel is done. \n\nI really hope Pat will live long enough to see how what incredible work he has done. In 2025 we will see a very competitive Intel and in 2026 current Wallstreet critics will be very very silent. \n\nJust remember the fights Jensen had with Wallstreet back then. Now they love him.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk71viz/",
      "created": 1724775408,
      "depth": 0,
      "replies": [
        {
          "id": "lk7bfgv",
          "score": 18,
          "body": "You hope Pat lives until 2026? Is there any reason to think he won't?",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7bfgv/",
          "created": 1724778439,
          "depth": 1,
          "replies": [
            {
              "id": "lk7rpj5",
              "score": 7,
              "body": "The guy is only 63 - you people are talking about him as if he's 90 haha.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7rpj5/",
              "created": 1724783506,
              "depth": 2,
              "replies": [
                {
                  "id": "lk7v6u2",
                  "score": 9,
                  "body": "They're talking like someone's put a hit on him if he fails to turn Intel around by 2025!\n\nHey Toni, do ya know something that we don't?",
                  "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7v6u2/",
                  "created": 1724784597,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lk76jmr",
          "score": 12,
          "body": "It's the typical cycle of when things aren't going well all bad news coverage is 100x worse than normal. The same was the case for Tesla in 2017. Pretty sure most people on this sub wouldn't dare to buy them back in 2017, due to the constant \"bad\" news cycling around.\n\nI agree with your idea that Intel will be fine performance wise around 2025 and might be ahead by 2026. Anyone actually reading up on the roadmap and the innovations that are coming with 20A and 18A would have a similar thought. Hell just look at Sierra Forest, which is effectively on par with AMD in the most important segment of data centers.",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk76jmr/",
          "created": 1724776900,
          "depth": 1,
          "replies": [
            {
              "id": "lk7lskw",
              "score": 4,
              "body": "> innovations that are coming with 20A and 18A\n\nTechnology-wise this actually comparable to TSMC's 3nm process, at least if TSMC is to be believed.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7lskw/",
              "created": 1724781665,
              "depth": 2,
              "replies": [
                {
                  "id": "lk83ql3",
                  "score": 5,
                  "body": "18a is 2nm",
                  "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk83ql3/",
                  "created": 1724787275,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lk7i4jt",
          "score": 11,
          "body": "After everything we’ve seen from intel, you’re getting that in 2025 they’ll leapfrog AMD? This is not how the CPU market works at all where they plan 4 years.",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7i4jt/",
          "created": 1724780535,
          "depth": 1,
          "replies": [
            {
              "id": "lk7kv34",
              "score": 4,
              "body": "Clearwater Forest, Diamond Rapids and Panther Lake will have severe consequences for AMD. Intel will have a superior node by then.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7kv34/",
              "created": 1724781377,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lk7m1av",
              "score": 7,
              "body": "Intel is on the cusp of a new microarchitecture release which will become mature by the time 2026 rolls around. So it's not necessarily a wrong calculation.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7m1av/",
              "created": 1724781741,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lk8rt9y",
              "score": -1,
              "body": "Exactly. They’ll be gone bust long before then. They’re currently getting no new orders in apparently and are just losing market share every month to Taiwan.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8rt9y/",
              "created": 1724795058,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lk7337s",
          "score": 3,
          "body": "I'm with a company that's doing that now. Getting split apart and sold. Shit is depressing. I don't even know how activist get money from that because the stock price dropped every time something was sold.",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7337s/",
          "created": 1724775792,
          "depth": 1,
          "replies": [
            {
              "id": "lk7bvbj",
              "score": 9,
              "body": "Depending on the deal, the money from spin offs can go directly to the share holders.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7bvbj/",
              "created": 1724778578,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lk7h26f",
          "score": 1,
          "body": "Remindme! 1 year",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7h26f/",
          "created": 1724780199,
          "depth": 1,
          "replies": [
            {
              "id": "lk7h7my",
              "score": 1,
              "body": "I will be messaging you in 1 year on [**2025-08-27 17:36:39 UTC**](http://www.wolframalpha.com/input/?i=2025-08-27%2017:36:39%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7h26f/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1f2ji5j%2Fintel_board_member_quit_after_differences_over%2Flk7h26f%2F%5D%0A%0ARemindMe%21%202025-08-27%2017%3A36%3A39%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201f2ji5j)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7h7my/",
              "created": 1724780247,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lk94tay",
          "score": 1,
          "body": "> When AMD and TSMC doesn't get their act together Intel will leapfrog them in 2025.\n\n?????",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk94tay/",
          "created": 1724799416,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lka6brr",
          "score": 1,
          "body": "Second this.\n\nIntel is not done for by a long shot, they have quite some runway left and a well filled pipeline of high end products.\n\nWhat they need is some big orders to fill their fabs and hit economical run rates. Getting those orders is a matter of executing well, but also a matter of politics and lobbying. And guess what Intel excels in, exactly that.\n\nExpect a good CPU launch in 2025, showing superior performance to AMD, that will be the trigger to get a few large orders and that gets the ball rolling.\n\nIntel will be fine in a few years, unless activist investors do get a gold and sell it all for parts to make a few quick bucks. Then everyone is fucked.",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lka6brr/",
          "created": 1724813355,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk7arys",
      "score": 9,
      "body": "Look, if Intel is at $10 in 3 years time and a bit closer to actually being realistically able to turn around, I might even consider it. But right now it's just hot garbage, and it will likely remain that for years.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7arys/",
      "created": 1724778232,
      "depth": 0,
      "replies": [
        {
          "id": "lk844oo",
          "score": 15,
          "body": "You get the cheap prices when things look their worst, not when they look better. 😂",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk844oo/",
          "created": 1724787399,
          "depth": 1,
          "replies": [
            {
              "id": "lk84fzz",
              "score": -5,
              "body": "Duh, obviously",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk84fzz/",
              "created": 1724787498,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lk8s2zh",
          "score": 2,
          "body": "Exactly - I have a price alert set for 8 usd as it could be worth a gamble at that price",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8s2zh/",
          "created": 1724795145,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk7d2kt",
      "score": 5,
      "body": "A board member, or some independent operations auditor, needs to take a month and go undercover boss to figure out what the hell all the deficiencies are. I absolutely agree with Tan that bureaucracy is causing innovation problems, how could it not? Tech can't be run like a fucking conglomerate selling cat food, you need to get down and dirty. That starts with getting out of your office and interacting with lower level management and employees. \n\nPinpoint the operational deficiencies yourself and eliminate them. Don't take the word of some manager who is telling you some shit because he's afraid his job will be cut next, cause after all these layoffs and stock dips I guarantee that shit is happening. Executives have lost the plot entirely at Intel, get people in there who think creatively, not some suit with an MBA who doesn't know shit about engineering.\n\nAlso, fuck your manufacturing business, it sucks, it failed, spin it off into a new organization.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7d2kt/",
      "created": 1724778955,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk7ndsw",
      "score": 7,
      "body": "How anyone would still want this ceo leading anything is comical",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7ndsw/",
      "created": 1724782163,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk7527e",
      "score": 8,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7527e/",
      "created": 1724776427,
      "depth": 0,
      "replies": [
        {
          "id": "lk7ka7f",
          "score": 3,
          "body": "Every single time I see it!!!!!",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7ka7f/",
          "created": 1724781198,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk8suip",
      "score": 4,
      "body": "I worked at intel as my first job - learned a lot because I was new! Fast forward five or so years, it’s been interesting to see how the company operates affect its outlook.\n\nI received a lot of really bad career advice there. Many managers tended to say they landed in management because they lacked technical expertise, and it’s a “natural” switch between two career paths. Unfortunately this results in a lot of management lacking the skills need to lead a team successfully long term. Compound that with manager promotions to directors, and you’ve got a bunch of technically incompetent senior management. \n\nUnsurprising they fell behind.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8suip/",
      "created": 1724795395,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk7bvy1",
      "score": 15,
      "body": "If I’ve learned anything from Reddit, it’s that this negative sentiment means this stock is going to gain 100% in the next year.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7bvy1/",
      "created": 1724778583,
      "depth": 0,
      "replies": [
        {
          "id": "lk7dvk3",
          "score": 8,
          "body": "It all depends on if they can turn around and how aggressively they commit to it.   I don't think Intel is a lost cause yet, and the potential is there to explode out of the gates with the right decision making in 2 years and regain their position. Or they muddle about and go nowhere.\n\n\nRight now is about as good a time to get into Intel if you feel they can turn it around and are willing to take the risk.  That said, they could also nuke themselves into oblivion if they can't.  Hard to say, really.",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7dvk3/",
          "created": 1724779208,
          "depth": 1,
          "replies": [
            {
              "id": "lk8rjyw",
              "score": 0,
              "body": "I have friends working in the industry and they say that intel is done and will likely be bankrupt within the next year or two. They are getting no new orders and AMD can easily take their market share without much ramp up if they go bust \n\nGet out now",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8rjyw/",
              "created": 1724794972,
              "depth": 2,
              "replies": [
                {
                  "id": "lk8s2nh",
                  "score": 3,
                  "body": "I'm not in it, and I doubt the rumor, to be blunt. They are in a bad way, but a company that does $12 billion in revenue per quarter and 29 billion in cash and equivalents doesn't go bankrupt over night or even in a year. Like I said, I'm not in it nor am I going to be. Just point out that someone thinks Intel can turn around, and has reason to believe it, this is a good price to get in. \n\n\nOr it could die off in some years, and it's a bad price. It's the quintessential risk-reward dichotomy.  ",
                  "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8s2nh/",
                  "created": 1724795142,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lka5anx",
                  "score": 1,
                  "body": "Yeah sure, all they need to do is stop investing heavily in their fabs and they are making billions in profit. They won't go bankrupt at all, worst case is that they shrink and sell off the foundry & fabs with a hefty loss and become a design + software company that is still bigger than AMD.\n\nYour friends are tiny fish in a large ocean of what is a $60B company.",
                  "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lka5anx/",
                  "created": 1724812931,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lk9mq1n",
          "score": 2,
          "body": "People were saying the same thing when it was around $40.00 and look where we are now. This was a stock that Reddit actually got right.",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk9mq1n/",
          "created": 1724805862,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lk7hrz7",
          "score": 1,
          "body": "Yes, this is fake news lul",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7hrz7/",
          "created": 1724780425,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lk8t2id",
          "score": 1,
          "body": "If anything, Reddit loves INTC because American exceptionalism.",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8t2id/",
          "created": 1724795468,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk8dbdy",
      "score": 5,
      "body": "It’s to the point that they need to consider a real radical restructuring. Follow the AMD playbook and split the company in two. An IP engineering and design services company and a Fab company. Spin off this company or the fab company. You can unlock some value with this type of transaction. Rename the Fab company with fresh management and have a mass layoff.  I think this is the only way the Fab company succeeds because Intel is not trusted any longer. Lack of trust in the industry is their core issue now.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8dbdy/",
      "created": 1724790300,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk6vkfm",
      "score": 5,
      "body": "Sounds similar to why Jim Keller left",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk6vkfm/",
      "created": 1724773396,
      "depth": 0,
      "replies": [
        {
          "id": "lk6wu7l",
          "score": 10,
          "body": "He was fired.",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk6wu7l/",
          "created": 1724773799,
          "depth": 1,
          "replies": [
            {
              "id": "lk78u4t",
              "score": 18,
              "body": "Jim Keller being fired because he pushed back against the bureaucratic nightmare is maybe an even worse signal. Not only is the organization unwilling to change, its so unwilling to change it will fire those who oppose it.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk78u4t/",
              "created": 1724777622,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lk7l0wo",
              "score": 2,
              "body": "This is not true. He said in an interview his job was done he was hired for.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7l0wo/",
              "created": 1724781426,
              "depth": 2,
              "replies": [
                {
                  "id": "lk7lma3",
                  "score": 8,
                  "body": "Any top person \"unexpectedly leaving a company\" will give a politically correct answer in way it doesn't affect the reputation of a company or the person (\"i am leaving to work on xyz\"). You just have to read between the lines.",
                  "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7lma3/",
                  "created": 1724781611,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lk7m1d2",
                      "score": 1,
                      "body": "Jim does not give a f*** about politically correct corporate talk",
                      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7m1d2/",
                      "created": 1724781742,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lk7geek",
      "score": 2,
      "body": "Why don't they just buy back some stocks and make quadcore cpus, that was doing wonders before?",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7geek/",
      "created": 1724779992,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk7kd5z",
      "score": 2,
      "body": "Perhaps INTC is now too big to succeed",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7kd5z/",
      "created": 1724781223,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk7qzho",
      "score": 2,
      "body": "kind of what we sense from the outside, a lumbering stupid behemoth.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7qzho/",
      "created": 1724783281,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk82qon",
      "score": 2,
      "body": "And I almost commited 100% of capital to Intel, big oof.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk82qon/",
      "created": 1724786961,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk8g08f",
      "score": 2,
      "body": "The dude left and gave a public statement but then turns around and says all of this to a reporter but still won’t comment publicly on this?",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8g08f/",
      "created": 1724791171,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk98qqm",
      "score": 2,
      "body": "a good news to tsmc.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk98qqm/",
      "created": 1724800805,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk9p9qn",
      "score": 2,
      "body": "*spinning sounds from within coffin intensifies*",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk9p9qn/",
      "created": 1724806789,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk6t8p4",
      "score": 6,
      "body": "Pat was the CEO of VMware it seems he did a good job. He was also an intel engineer. He probably knows what engineers are going through. Intel released arc, battlemage  is coming. Fabs being built. They were behind on AI race. It seems in 2017 they hired Raja Kadouri to help with gpu division so they knew they needed a good gpu. Obviously these things take time to mature. New ASML machines being delivered. I am waiting for lunar lake launch to see how much power efficient those chips are.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk6t8p4/",
      "created": 1724772651,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk809ui",
      "score": 4,
      "body": "they need to fire the CEO and have a turnaround plan, so that the stock can finally come back",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk809ui/",
      "created": 1724786192,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk70kxm",
      "score": 3,
      "body": "Intel bad",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk70kxm/",
      "created": 1724774998,
      "depth": 0,
      "replies": [
        {
          "id": "lk7r0nv",
          "score": 1,
          "body": "upvotes to the left",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7r0nv/",
          "created": 1724783291,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lk798g4",
      "score": 2,
      "body": "Things are slowly looking up, I believe they are reaching the end of the layoffs in some places with a large amount of employees taking early retirement packages so the amount of layoffs is small. I think Intel will continue upwards from now, but who knows they are still on thin ice.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk798g4/",
      "created": 1724777746,
      "depth": 0,
      "replies": [
        {
          "id": "lk8rzd1",
          "score": 1,
          "body": "You’re deluded if you think this. US semis are no longer competitive in any way and intel will likely be bust within the next couple of years. They have huge debt and no new orders. \n\nTaiwan is the future for semis.",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8rzd1/",
          "created": 1724795112,
          "depth": 1,
          "replies": [
            {
              "id": "lk8ysm1",
              "score": 1,
              "body": "Lol what a take.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8ysm1/",
              "created": 1724797347,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lk8sjhd",
              "score": 0,
              "body": "Not if Taiwan is invaded, keeping majority production on a small island is not good.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8sjhd/",
              "created": 1724795294,
              "depth": 2,
              "replies": [
                {
                  "id": "lk8vhn8",
                  "score": 2,
                  "body": "That’s highly unlikely and if it happens the world will be at war so it won’t matter at all anymore",
                  "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8vhn8/",
                  "created": 1724796264,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lk9a6hv",
                      "score": 0,
                      "body": "The US has backed down and is no longer certain on defending, and now the US is blocking Taiwan from purchasing certain weapons. I wouldn't call it unlikely.",
                      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk9a6hv/",
                      "created": 1724801318,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkivvp9",
                          "score": 2,
                          "body": "China attacking Taiwan would bring the world to a stand still, no matter what the US does. The Chinese economy and the global economy are almost like conjoined twins.",
                          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lkivvp9/",
                          "created": 1724948081,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lk8mili",
      "score": 1,
      "body": "Intel is the Boeing of semiconductors /s. \nToo big to fail but they are trying a lot",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk8mili/",
      "created": 1724793290,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk98jtg",
      "score": 1,
      "body": ">Tan grew frustrated as the board did not follow his recommendations over how to make the manufacturing business more customer-centric and to remove unnecessary bureaucracy, a person close to Tan said.\n\nIMO this is the worst part. Intel board hired a respected industrial veteran to help shape their IDM2.0 strategy, and refuse to implement his suggestions. Which signals \n\n(a) they're still playing company politics even in such critical time and \n\n(b) they learned nothing from their past failure since bureaucracy is why IDM1.0 failed in 2018 \n\n(c) If they cannot switch company culture to be external-customer-centric, there is 0% change to pull off IDM2.0",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk98jtg/",
      "created": 1724800737,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkaenbl",
      "score": 1,
      "body": "Intel is like a ship with a hole in the bottom, leaking water, and Gelsinger’s job is to get the ship pointed in the right direction.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lkaenbl/",
      "created": 1724816977,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkb2l48",
      "score": 1,
      "body": "Scanning the article and the comment section. Not a single mention to the massive screw-up with the 13th/14th generation chips and the ineptitude handling that situation towards customers. What gives ?",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lkb2l48/",
      "created": 1724831025,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkes5n7",
      "score": 1,
      "body": "INTC is the tech industry equivalent to BA of the airline industry. Until either activist investors come in or the CEO steps down it's going to continue to be a shit show. They still make a bunch of money but they are not actually innovative anymore. Too focused on trying to profit now without making any real new products or services.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lkes5n7/",
      "created": 1724884353,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk7cgj2",
      "score": 1,
      "body": "Yes spend more time to defend against activist attack than to actually do some real work",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7cgj2/",
      "created": 1724778764,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk7ufdi",
      "score": 0,
      "body": "> added at least 20 000 employees\n\n\nIn comparison Nvidia has a total of 29 000 employees",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk7ufdi/",
      "created": 1724784361,
      "depth": 0,
      "replies": [
        {
          "id": "lk84g61",
          "score": 4,
          "body": "They don’t manufacture anything.",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk84g61/",
          "created": 1724787500,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkddkih",
      "score": 0,
      "body": "The beatings will continue at Intel until the right people are at the helm. Intel is a great long play if you are patient enough.",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lkddkih/",
      "created": 1724865378,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk6qbzj",
      "score": -3,
      "body": "He is Tan. \nhttps://www.reddit.com/r/wallstreetbets/s/OcjkuXlKH8\n\nEdit: Added /s",
      "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk6qbzj/",
      "created": 1724771726,
      "depth": 0,
      "replies": [
        {
          "id": "lk6t706",
          "score": 3,
          "body": "So you are Tan?\n\nThat links to your post from a month ago.",
          "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk6t706/",
          "created": 1724772636,
          "depth": 1,
          "replies": [
            {
              "id": "lk6tfmg",
              "score": 0,
              "body": "/s. Added to the main comment 😀. Poor Tan.",
              "permalink": "/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/lk6tfmg/",
              "created": 1724772713,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "stockTickers": {
    "post_summary": "A high-profile Intel board member resigned due to disagreements over the company's strategy and workforce management.",
    "companies": [
      "Intel",
      "Cadence Design",
      "Morgan Stanley",
      "Nvidia",
      "Taiwan Semiconductor Manufacturing Co",
      "Tower Semiconductor"
    ],
    "tickers": [
      "INTC",
      "MS",
      "NVDA",
      "TSM"
    ],
    "main_ticker": [
      "INTC"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Intel board member Lip-Bu Tan resigned due to strategic disagreements with CEO Pat Gelsinger, particularly over Intel's workforce size, risk-averse culture, and AI strategy.",
    "stock_recommendations": "There are no stock buying or selling recommendations in the post.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "The sentiment is neutral as the post primarily discusses the internal issues and strategic disagreements at Intel without any stock recommendations.",
    "sentiment": "neutral"
  }
}