{
  "title": "Eli Lilly Halves Zepbound Price In New Version Of Weight-Loss Drug",
  "score": 43,
  "selftext": "Eli Lilly and Company ( LLY ) has launched a new dosage form of its weight-loss drug Zepbound at roughly half the price of its traditional price, aiming to reach more patients who don't have health insurance while also fighting off generics.\n\nEli Lilly will offer 2.5 mg and 5 mg single-dose Zepbound through its Web site at a monthly cost of $399 and $549, respectively. By comparison, the list price without insurance and discounts is about $1,000 per month.\n\n\n\nPatients will need to self-inject using the new Zepbound syringe. The current version uses a single-dose auto-injector pen, which allows patients to inject directly under the skin with the touch of a button.\n\n\n\nEli Lilly says the vials are easier to manufacture than auto-injector pens, so they will increase the availability of Zepbound. While the lower cost may drive down Lilly's average Zepbound sales price in the short term, the additional sales of the vials “could have a positive impact on Lilly's sales results.”\n\nLilly's announcement on Zepbound's cardiovascular benefits comes on the heels of a recent study that found that a group of obese patients using Lilly's Mounjaro (the core ingredient in Tirzepatide), a drug that combines weight loss with diabetes treatment, had a more favorable outcome than a group using Novo Nordisk's Ozempic (the core ingredient in Ozempic), a drug that combines both weight loss and diabetes treatment. Ozempic (Semaglutide), a Novo Nordisk drug that also combines weight loss and diabetes treatment, showed significantly more weight loss than the group of obese patients using Ozempic (Semaglutide), a Novo Nordisk drug that also combines weight loss and diabetes treatment.\n\nA Goldman Sachs forecast shows that the global anti-obesity drug market could grow to around $130 billion in annual sales by 2030, compared with just $6 billion earlier in 2023. The World Obesity Federation (WOF) predicts that by 2035, more than 4 billion people (more than half the size of the world's population) could be suffering from varying degrees of obesity.",
  "link_flair_text": "Company News",
  "id": "1f2k3zb",
  "num_comments": 11,
  "created_utc": 1724772943,
  "permalink": "/r/stocks/comments/1f2k3zb/eli_lilly_halves_zepbound_price_in_new_version_of/",
  "comments": [
    {
      "id": "lk72e1g",
      "score": 21,
      "body": "Big Pharma trying to set up direct to consumer businesses is interesting, I saw Pfizer announced something too (haven’t read details yet). Seems like their reaction to so many tech/billionaires circling and trying to disrupt the old models.",
      "permalink": "/r/stocks/comments/1f2k3zb/eli_lilly_halves_zepbound_price_in_new_version_of/lk72e1g/",
      "created": 1724775570,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk752aa",
      "score": 23,
      "body": "$HIMS is having a pretty negative reaction to this.",
      "permalink": "/r/stocks/comments/1f2k3zb/eli_lilly_halves_zepbound_price_in_new_version_of/lk752aa/",
      "created": 1724776427,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk7mx13",
      "score": 11,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f2k3zb/eli_lilly_halves_zepbound_price_in_new_version_of/lk7mx13/",
      "created": 1724782017,
      "depth": 0,
      "replies": [
        {
          "id": "lk83q92",
          "score": 1,
          "body": "That's wild. The grey market has it for about 20 dollars for 5mg.  If you know where to look.",
          "permalink": "/r/stocks/comments/1f2k3zb/eli_lilly_halves_zepbound_price_in_new_version_of/lk83q92/",
          "created": 1724787272,
          "depth": 1,
          "replies": [
            {
              "id": "lk9x31y",
              "score": 0,
              "body": "The grey market?",
              "permalink": "/r/stocks/comments/1f2k3zb/eli_lilly_halves_zepbound_price_in_new_version_of/lk9x31y/",
              "created": 1724809729,
              "depth": 2,
              "replies": [
                {
                  "id": "lka03dm",
                  "score": 1,
                  "body": "Grey market goods are goods sold outside the authorized distribution channels by entities which may have no relationship with the producer of the goods. This form of parallel import frequently occurs when the price of an item is significantly higher in one country than another.\n\nIt may not be illegal in the country that's manufacturing it but it is in the distribution country.",
                  "permalink": "/r/stocks/comments/1f2k3zb/eli_lilly_halves_zepbound_price_in_new_version_of/lka03dm/",
                  "created": 1724810869,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkbxvsp",
                      "score": 4,
                      "body": "Yes unregulated distribution of a cold-chain reliant injectable long-term acting peptide drug is most definitely a safe and trustworthy way to lose weight. I'd honestly rather heroin.\n\n\nThis ain't street drugs you can test, and once it's in you there's no removing it without a full blood transfusion (or super complicated filtration process to replace your serum albumin).",
                      "permalink": "/r/stocks/comments/1f2k3zb/eli_lilly_halves_zepbound_price_in_new_version_of/lkbxvsp/",
                      "created": 1724848630,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkc1dev",
                          "score": 2,
                          "body": "To each his own. I'm looking to become more percent lead, mercury, and asbestos so for me it's perfect.",
                          "permalink": "/r/stocks/comments/1f2k3zb/eli_lilly_halves_zepbound_price_in_new_version_of/lkc1dev/",
                          "created": 1724849967,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lk7dbem",
      "score": 0,
      "body": "The devil has no new tricks",
      "permalink": "/r/stocks/comments/1f2k3zb/eli_lilly_halves_zepbound_price_in_new_version_of/lk7dbem/",
      "created": 1724779033,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk7i6tz",
      "score": 0,
      "body": "begun the six pack price wars have",
      "permalink": "/r/stocks/comments/1f2k3zb/eli_lilly_halves_zepbound_price_in_new_version_of/lk7i6tz/",
      "created": 1724780554,
      "depth": 0,
      "replies": []
    }
  ]
}