{
  "title": "What do you think about uranium etfs now",
  "score": 52,
  "selftext": "I've heard that many people are bullish about uranium recently, mainly because the demand is much larger than the supply.\nsince I don't really understand the sector I thought about buying an etf like URNM, what do you guys think about uranium in the coming years? And is it a good time to buy now?",
  "link_flair_text": "Industry Question",
  "id": "1f359zu",
  "num_comments": 55,
  "created_utc": 1724834908,
  "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/",
  "comments": [
    {
      "id": "lkb85hd",
      "score": 1,
      "body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkb85hd/",
      "created": 1724834909,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkc7tps",
      "score": 16,
      "body": "Hi everyone,\n\nA major event happened Friday with important instant (in upcoming high season in the uranium sector) impact on the uranium market:\n\nOn Friday Kazatomprom announced \\~17% cut in the previously hoped uranium production 2025 from Kazakhstan + hinting on additional cuts for 2026 and beyond, because they announced they would ask the government to reduce existing subsoil use agreements of a couple existing uranium mines, meaning reducing the annual production range of those mines.\n\n**Problem is that:**\n\na) Kazakhstan is the Saudi-Arabia of uranium. Kazakhstan produces around 45% of world uranium today. So a cut of 17% is huge.\n\nb) The production of 2025-2028 was already fully allocated to clients! Meaning that clients will get less than was agreed upon or Kazatomprom & JV partners will have to buy uranium from others through the spotmarket. But from whom exactly?\n\n**All the major uranium producers and a couple smaller uranium producers are selling more uranium to clients than they produce (They are all short uranium)**. Cause: Many utilities have been flexing up uranium supply through existing LT contracts that had that option integrated in the contract, forcing producers to supply more uranium. But those uranium producers aren't able increase their production that way.\n\nc) The biggest uranium supplier of uranium for the spotmarket is Uranium One. And 100% of uranium of Uranium One comes from? ... well from Kazakhstan!\n\nImportant to know here is that uranium demand is price INelastic!\n\nUtilities don't care if they have to buy uranium at 80 or 150 USD/lb, as long as they get enough uranium and ON TIME\n\nConclusion:\n\nKazatomprom, Cameco, Orano, CGN, ..., and a couple smaller uranium producers are all selling more uranium to clients than they produce. Meaning that they will all together try to buy uranium through the iliquide uranium spotmarket, while the biggest uranium supplier of the spotmarket has less uranium to sell.\n\nBefore the announcement of Kazakhstan on Friday, the global uranium supply problem already looked like this:\n\nHere on page 10 you get an idea of the global uranium supply problem: [https://prod.cameco.com/sites/default/files/documents/Cameco-Investor-Presentation.pdf](https://prod.cameco.com/sites/default/files/documents/Cameco-Investor-Presentation.pdf)\n\nSprott Physical Uranium Trust (U.UN on TSX) is a fund 100% invested in physical uranium stored at specialised warehouses for uranium (only a couple places in the world). Here you are not subjected to mining related risks.\n\nSprott Physical Uranium Trust is trading at a discount to NAV at the moment. Imo, not for long anymore\n\nUranium sector ETF's:\n\n* Sprott Uranium Miners ETF (URNM): 100% invested in the uranium sector\n* Global X Uranium index ETF (HURA): 100% invested in the uranium sector\n* Global X Uranium ETF (URA): 70% invested in the uranium sector\n\nWe are at the end of the annual low season in the uranium sector. Next week we will gradually enter the high season again\n\nIn the low season in the uranium sector the activity in the uranium spotmarket is reduced to a minimum which reduces the upward pressure in the uranium spotmarket and the uranium spotprice goes back to the LT uranium price.\n\nIn the high season with an uranium sector being a sellers market (a market where the sellers have the negotiation power) the activity in the uranium spotmarket increases significantly which significantly increases the upward pressure in the uranium spotmarket.\n\nNote: I post this now (at the very end of low season in the uranium sector), and not 2,5 months later when we are well in the high season of the uranium sector.\n\n**This isn't financial advice. Please do your own due diligence before investing**\n\nCheers",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkc7tps/",
      "created": 1724852310,
      "depth": 0,
      "replies": [
        {
          "id": "lkfkyqf",
          "score": 5,
          "body": "Thanks for posting. If uranium contracts are long-term (multi years) why is there such seasonal fluctuations by tens of % in the price? Wouldn’t the long-term nature of the contracts average it out?",
          "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkfkyqf/",
          "created": 1724894518,
          "depth": 1,
          "replies": [
            {
              "id": "lkh5qxd",
              "score": 2,
              "body": "Hi, \n\nThere is a seasonality in the uranium sector due to different factors:\n\n(1) Uranium market is a very small markt with not so many participants (retail investors for instance can't buy uranium in the spotmarket for good reasons...). And those participants are on holidays at the moment, so less activity in July and August\n\n(2) The biggest uranium consumer today is still USA (although that China is going to be number one consumer a couple years from now). And in the USA the new purchase budgets always run from 1 October till 31 September, meaning that in Q4 and Q1 you typically have more buying activity in the market.\n\nSo most of the negotiation for new LT contracts also happen in Q4 and Q1 \n\n(3) The non-US utilities (producers and utilities outside the USA) know (2), and so they typically start to front run the US utilities a couple weeks earlier => September, sometimes even starting by end August\n\n(4) Starting in September, there are a couple world nuclear and uranium events, starting with the World Nuclear Symposium in London the first week of September",
              "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkh5qxd/",
              "created": 1724924217,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkgsi4z",
          "score": 1,
          "body": "UUUU is the one I’ve been following for over three years, and it is up only slightly aftermarket. It seems like nothing can make it move up. ",
          "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkgsi4z/",
          "created": 1724915469,
          "depth": 1,
          "replies": [
            {
              "id": "lkh5vnq",
              "score": 1,
              "body": "Hi, \n\nUUUU is not a pure uranium company anymore\n\nUUUU is an Uranium and REE company (and also Vanadium)\n\nCheers",
              "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkh5vnq/",
              "created": 1724924302,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkba32z",
      "score": 25,
      "body": "I'm very bullish uranium. The supply deficit isn't something that's going to be easily overcome, and the sellers know it. It's a long term contract market so the producers with lbs available are going to be locking in good revenues for the next decade plus even at current contracting prices (\\~$80/lb base reference price). It's still a good time to buy, you missed the big dip at the beginning of August but still way down from the highs. We're through the quiet summer trade period and things tend to start pushing upwards after the convention first week of September. When the spot price starts trending upwards again enthusiasm will return to the sector. If it doesn't the companies will still be making money so it'll work out eventually.\n\nIf you know nothing of the sector and don't want to get into it then URNM is probably a good bet. There's quite a lot of (imo) junk in there, but the high % holdings are very likely to do very well over the next 6-48 months. You could probably outperform by picking out 4 or 5 names from the top 10 without much work, it's a small market and few companies are actively producing at the moment. Some are years away and don't even have permits (NexGen's Arrow deposit). The US names look very well positioned to secure good contracts.",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkba32z/",
      "created": 1724836233,
      "depth": 0,
      "replies": [
        {
          "id": "lkbbd36",
          "score": 3,
          "body": "Thanks for the answer,\nWhy do you think it barely moved this year, but in the previous 2-3 years, it moved much more because of the war in Ukraine, possibly?\nAlso it's down 8% ytd, so you believe that this trend will soon break and it will start going up?",
          "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbbd36/",
          "created": 1724837112,
          "depth": 1,
          "replies": [
            {
              "id": "lkbhoat",
              "score": 18,
              "body": "Buyers have been wary because the price of uranium doubled rapidly last year. It's not a liquid market like gold or silver where oz are being traded constantly, transactions are sporadic, usually large, and often very long-term. The nuclear fuel cycle is years long from procurement of material to conversion to enrichment, and buyers will be covered ahead of time, so they can be patient if they think there has been a temporary spike and don't want to get stuck with high prices. But the sellers also know what their uranium is worth, and the lbs need to be acquired eventually or the lights go out.\n\nThe summer is always slow. Kazatomprom (20% world supply, \\~45% if you include all their joint ventures) announced their 2025 production guidance last Friday and it didn't reveal a bunch of new mines that would drive the price down. Rather they've cut guidance by 17% from earlier estimates, and their stockpiles are the lowest they've been in years. That was basically the last bit of news buyers could be holding out for. The spot price has dropped from $106 to just below $80, but the long term contract price has been rising up to $80 steadily all year. \n\nThe war in Ukraine has no relevance to the uranium thesis beyond a bit of fuss over the US banning Russian-sourced material, which mainly effects the conversion and enrichment side (they have a little in country but buy most from Kazakhstan like everyone else). Another possible reason for the slow summer with people holding Russian supply contracts waiting to see if they get waivers. If they can't they have to buy even more than they thought to replace those lost lbs.",
              "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbhoat/",
              "created": 1724841094,
              "depth": 2,
              "replies": [
                {
                  "id": "lkcua0v",
                  "score": 2,
                  "body": "You sound extremely knowledgeable in this subject. I'm heavily invested in uranium and scrap together information from this site, comments like yours, random press releases from some of the uranium companies I'm in, but have never found anything as comprehensive as your comment. Where do you piece together your information or is there a resource you recommend for doing your DD?",
                  "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkcua0v/",
                  "created": 1724859414,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkcw9xz",
                      "score": 5,
                      "body": "For the uranium market I've not come across anything better than watching Youtube interviews with Justin Huhn and Mike Alkin. Not a replacement for dd but really helpful at providing context for how things work in the industry.",
                      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkcw9xz/",
                      "created": 1724860021,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkd6z4w",
                          "score": 1,
                          "body": "Their Uranium podcasts get me hyped",
                          "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkd6z4w/",
                          "created": 1724863341,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lkfl9qb",
                  "score": 1,
                  "body": "If buyers can negotiate long term contracts wouldn’t they stock up on low years to offset the high years and if they can do this wouldn’t the supply demand be curbed to average out seasonal price variations ? Thanks for all the info you’ve already shared btw",
                  "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkfl9qb/",
                  "created": 1724894632,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkhlr6c",
                      "score": 1,
                      "body": "Sort of. Many speculators did buy heavily during the low years we've had, and some have built big companies from it (UEC for example). But the fuel cost for nuclear reactors is only 5-6% of their overall costs, so it's not something they've been worried about too much. Until this time last year there has always been the plenty of uranium on the market when they needed it. Between the uranium rush of the 70s and 80s, various disasters killing off demand, and Kazakhstan's surprise emergence as a major supplier in the last cycle, hoarding beyond what is practical for the fuel cycle hasn't been necessary. You go to market each year and buy a % of your needs for the next decade+. The massive spike in price last year came as a shock to many, and users have been flexing up supply from existing contracts whereever possible since. \n\nNow we're in a situation where we don't know when the \"low years\" are going to come again. Maybe things will ease off in 2030 if all the projects anticipated come online on schedule (unlikely in mining), but a couple of years after that some big mines are depleting and the deficit is projected to grow again.",
                      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkhlr6c/",
                      "created": 1724932593,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lkbgcme",
              "score": 3,
              "body": "Directly related to EV market and electrical demand. Once  that increases, expect nuclear plants to expand.",
              "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbgcme/",
              "created": 1724840313,
              "depth": 2,
              "replies": [
                {
                  "id": "lkbgg6k",
                  "score": 3,
                  "body": "But it increased this year by quite a bit, and uranium still went down",
                  "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbgg6k/",
                  "created": 1724840372,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkdcyjh",
                      "score": 1,
                      "body": "Problem with Nuclear Plants, always over budget and sometime can take decades to get online in North America.",
                      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkdcyjh/",
                      "created": 1724865189,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkg7zuc",
                          "score": -1,
                          "body": "Currently zero nuclear plants under construction in USA.  Typical time it takes is 20 years.\n\nThe demand thesis won’t be because of some surge in nuclear reactors opening here.\n\nHowever, other countries do have reactors under construction or approved.  \n\nThere’s a looming catalyst with respect to the ban on Russian source uranium by 2028, which accounts for about 20-25% of the market.\n\nBut how that plays out is far from predictable.  Is it already baked in?  Will their supply just go to other corrupt states, who will then just buy less from civilized states, making it effectively neutral?  Will corporate procrastination cause a squeeze even if the car crash is slow motion?",
                          "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkg7zuc/",
                          "created": 1724903841,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lkbkinu",
                      "score": 0,
                      "body": "EV sales obviously didnt demand enough electricity from thr grid. This wont happen until make 50% of all cars are EV.",
                      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbkinu/",
                      "created": 1724842631,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkg8lr1",
                          "score": 1,
                          "body": "Our grid is trash anyway and won’t be fixed as long as certain politicians have a say in things.  So any significant generation increase is not necessarily a good fit with nuclear.  Think of it like having a wonderful farm, but no rails or highways to get the crop to market.  \n\nLocalized generation that doesn’t rely on grid this could be favored, and localized means quick and cheap and easy renewable projects, like wind, solar, water.",
                          "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkg8lr1/",
                          "created": 1724904136,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lkieqcc",
                              "score": 1,
                              "body": "Nuclear tech has gone a long way. Smaller plants and reactors exist now .",
                              "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkieqcc/",
                              "created": 1724942866,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lkk2th9",
                                  "score": 2,
                                  "body": "No, it hasn’t.  I know that’s the nuclear sales industry false astroturf narrative, and I know it’s pushed harder on Reddit than anywhere, but in reality, no there are not any significant number of SMR reactors.  Nor molten salt.  Nor is fusion “right around the corner”.\n\nAnd besides, even if that were true (which it isn’t) it’s a flawed argument anyway.  It’s saying don’t worry about lack of demand, we have a few extra-small reactors that will only need tiny amounts of fuel coming.\n\nDon’t get me wrong. I’m invested in uranium.  The uranium squeeze has been and likely will continue.  But it’s because of restricted production constraining supply, and the very long lead times it would take to correct that, if the industry even would do, which they aren’t.  Demand is not rising that significantly.",
                                  "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkk2th9/",
                                  "created": 1724961228,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lkckw9d",
          "score": 1,
          "body": "\"There's quite a lot of (imo) junk in there, but the high % holdings are very likely to do very well over the next 6-48 months. You could probably outperform by picking out 4 or 5 names from the top 10 without much work\"\n\n  \nI got introduced to URNM recently and appreciate if you can list out your favorites.",
          "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkckw9d/",
          "created": 1724856555,
          "depth": 1,
          "replies": [
            {
              "id": "lkcuj8n",
              "score": 10,
              "body": "Encore Energy and Denison Mines are my favourites. They have current revenues and are positioned to advance projects without needing to go to the market for more capital (something that NexGen and UEC are likely to have to do). Kazatomprom despite all their challenges still have the best cost-per-lb and pay a good dividend. If you can tolerate more risk Global Atomic are cheap, but the situation in Niger is still developing. The junta currently in control of the country have given assurances but banks may be reluctant to support them in building their project. If you're risk averse then the physical uranium holdings (Sprott and Yellowcake) and Cameco will still do better than average imo.\n\nThe exploration companies don't appeal to me. IsoEnergy have some really good assets but aren't capable of moving them forward alone.",
              "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkcuj8n/",
              "created": 1724859491,
              "depth": 2,
              "replies": [
                {
                  "id": "lkdnwth",
                  "score": 2,
                  "body": "Thanks You so much. Will do my DD on these and see if these are for me.",
                  "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkdnwth/",
                  "created": 1724868557,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lpe7l7l",
                  "score": 1,
                  "body": "u/sunday_sassassin  Encore and Denison are both solid...holding some of them plus the Sprott Physical Uranium Trust and the URNM and URA etfs. The last month has had a really good set of bullish fundamental news (bank financings, missed production from small producers, etc). There's some uranium due diligence list at https://uraniumcatalysts.com. u/What_do_i_Know_2050",
                  "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lpe7l7l/",
                  "created": 1727556364,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lknvq78",
          "score": 1,
          "body": "A lot of Uranium comes out of Kazakstan and they had problems shipping it via the normal routes due to global conflicts, which drove the price up for a while. Demand really hasnt increased much but that's going to change as many of the major nations are touting nuclear as needed clean energy, and the data centers are racing to buy energy directly from nuclear reactors. The demand for energy is skyrocketing and there's no way solar or wind can meet the future demands. Nuclear can, so as the demand exceeds supply in coming years, the price of Uranium will rise. But, nuclear projects take a decade to get off the ground, so this is slow money, not fast money IMHO",
          "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lknvq78/",
          "created": 1725021632,
          "depth": 1,
          "replies": [
            {
              "id": "lko11jt",
              "score": 2,
              "body": "China is building them in 6 years. South Korea 7-8. What a lot of people don't realise about the industry is that fuel for reactors announced today is being purchased already. Producers are negotiating contracts for the next 10-15 years of supply.\n\nThis isn't oil or coal.",
              "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lko11jt/",
              "created": 1725023614,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkbfu1j",
      "score": 9,
      "body": "Im bullish on CCO and UEC",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbfu1j/",
      "created": 1724840001,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkbexn2",
      "score": 6,
      "body": "When it’s up, it will go up fairly fast. \n\nAny price below $30 for URA I consider a good buy. Wait for 5 years, it will at least triple.",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbexn2/",
      "created": 1724839445,
      "depth": 0,
      "replies": [
        {
          "id": "lkbf9na",
          "score": 2,
          "body": "Why URA and not URNM? Also, why do you think it went down this year?",
          "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbf9na/",
          "created": 1724839655,
          "depth": 1,
          "replies": [
            {
              "id": "lkbgt7e",
              "score": 1,
              "body": "It’s too obvious the recent URAX was launched hence a down curve on URA but I got them below 20 really cheap. \n\nThis year hasn’t finished yet so I wouldn’t make that comment. \n\nIf you are a trader then I am the wrong person to talk to. I am an investor. \n\nhttps://www.etfcentral.com/compare-etfs/URNM-vs-URA",
              "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbgt7e/",
              "created": 1724840585,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkc9xqz",
              "score": 1,
              "body": "URA is 70% invested in the uranium sector\n\nURNM is 100% invested in the uranium sector\n\nCheers",
              "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkc9xqz/",
              "created": 1724853038,
              "depth": 2,
              "replies": [
                {
                  "id": "lke9o4y",
                  "score": 1,
                  "body": "That’s all good. I really don’t care.\nIt makes no difference to me in the end.",
                  "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lke9o4y/",
                  "created": 1724878037,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkbzgsm",
      "score": 3,
      "body": "Hard to say. China is building nuclear plants. Germany closed all of theirs. The US is stagnant. Current SMR hype reminds me of the \"nuclear renaissance\" of the early 2000s when exactly two new units were built in the US. If the SMR hype is priced in and SMRs don't happen at the expected level, there is a lot of downside potential.",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbzgsm/",
      "created": 1724849247,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkbll9x",
      "score": 10,
      "body": ">since I don't really understand the sector I thought about buying\n\nThat doesn't make much sense.",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbll9x/",
      "created": 1724843184,
      "depth": 0,
      "replies": [
        {
          "id": "lke27ce",
          "score": 3,
          "body": "Why? Where else do you start lol",
          "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lke27ce/",
          "created": 1724873120,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkcqw0q",
      "score": 2,
      "body": "Uranium ETFs like URNM could benefit from growing demand and supply constraints. Timing seems favorable, but risks remain.",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkcqw0q/",
      "created": 1724858392,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkeg8eq",
      "score": 1,
      "body": "uranium is the new gold",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkeg8eq/",
      "created": 1724880393,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkbmgz9",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbmgz9/",
      "created": 1724843624,
      "depth": 0,
      "replies": [
        {
          "id": "lkbyofu",
          "score": 6,
          "body": "It was a month ago, and for the long run it probably is, bud don’t expect it to explode. Probably around + or - 5 % but still 10% yoy. Anything below of 37 is a buy",
          "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbyofu/",
          "created": 1724848941,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkbxwo7",
      "score": 1,
      "body": "The data centers (see IRM) are a load on our power grid, maybe nuclear energy can provide the source. There are many questions with the waste and concerns about catastrophic failure weighing against this power supply. It is a large gamble to expect substantial growth or demand in additional plants but the opportunity of a zero carbon emissions has merit. Holding shares of this play over time could be greatly rewarding however when and if.",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbxwo7/",
      "created": 1724848640,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkea4fd",
      "score": 1,
      "body": "I wouldnt touch UEC, they havent mined for over 10 years. All they do is buy uranium, hold and then sell. Also they diluted the stock over the years. The CEO works for another company also. Very shady",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkea4fd/",
      "created": 1724878265,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkbhtou",
      "score": 0,
      "body": "Personally I'm still waiting for a lower low to enter. There's so many positives for nuclear, but there's also many black swan negatives. I mean, if someone blows up that reactor in Ukraine, uranium stocks will dive. Kazakstan just cut production by 17%, which is why uranium is popping right now...but what if they increase production, will the stocks breakdown (I'm not a huge fan of upward moves based on changes in output... we see this a lot with oil). \n\nLove all energy plays right now (oil, renewables, nuclear)... but with a global recession on the horizon (I believe) everything energy could take a big hit.",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbhtou/",
      "created": 1724841179,
      "depth": 0,
      "replies": [
        {
          "id": "lkbjs2x",
          "score": 5,
          "body": "The reactors need fuel, it's not an optional expense that can be cut back on in a recession. The nuclear fuel cycle is years long, we could have a long recession and recovery before uranium bought today is even put into a reactor.\n\nKazatomprom are having a lot of problems at the moment. Sulphuric acid supply in the country is limited, with priority given to the agriculture industry. They're building a new plant to make more of their own, but it's being hit by delay after delay. The big Russian JV has had ramp up pushed back two years due to problems in construction and acid availability. A lot of executive turnover. As in all mining operations, you mine the easy/cheap stuff first, and every indication is that they've done that. It will take something extraordinary for them to repeat the trick of turning on some taps and flooding the world with cheap uranium, and everyone's eyes are on them as they weren't before. The company themselves have said that the world needs two new Kazatomproms to address the supply deficit. Maybe Uzbekistan come up with a decent increase. Maybe the Athabasca projects all come online on time (lol). There are (imo) far fewer bear case what-ifs in uranium than most of the other commodities markets I'm invested in (like copper, which definitely will be hammered in a global recession).",
          "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbjs2x/",
          "created": 1724842249,
          "depth": 1,
          "replies": [
            {
              "id": "lkbkdq4",
              "score": 1,
              "body": "I agree, it seems like a no brainer bull case. But, it's also hard to figure out fair market value with the current macro picture. I'm looking at cameco, but probably not for a few months. I mean, just a year ago it was 50% cheaper... and did anything really change in the past year other than uranium got hot bubbled up for whatever the reason?",
              "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbkdq4/",
              "created": 1724842562,
              "depth": 2,
              "replies": [
                {
                  "id": "lkbu62l",
                  "score": 3,
                  "body": "Cameco own Westinghouse which is a reactor build company, and are also involved in conversion/enrichment. Sentiment around new North American-based nuclear has increased dramatically in the last year, which will surely contribute to their value. Uranium was $40/lb when Cameco were trading at $25. They lag a bit in revenue due to carrying a lot of long term contracts at lower prices, but their margins are getting richer by the day in an $80/lb environment.",
                  "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbu62l/",
                  "created": 1724847120,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkc09h4",
                      "score": 1,
                      "body": "i read though that they can't meet their requirements and had to buy uranium on the spot market, meaning they actually lost money in order to fulfill their contracts. The higher the uranium price goes, when they can't meet their contracts, they have to buy it on the spot market. \n\nAnyway, I still don't fully understand the risks enough :) Then again, I'm tempted to buy Nutrien and I don't fully understand the risks with fertilizer trends.",
                      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkc09h4/",
                      "created": 1724849550,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkc5c97",
                          "score": 1,
                          "body": "They're making money overall on uranium sales, but they do buy a % on market to fulfil contracts. Their latest quarterly put purchasing at \"up to 2m lbs\" this year while production is over 22m, so they're losing money on <10% of sales while making it on the other 90%. Difficulties in Kazakhstan on the Inkai project are holding them back from targets, but those same difficulties are hampering their competition as well, which should lead to higher sale prices.",
                          "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkc5c97/",
                          "created": 1724851423,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkbb95l",
      "score": 0,
      "body": "Don't buy thematic ETFs",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbb95l/",
      "created": 1724837037,
      "depth": 0,
      "replies": [
        {
          "id": "lkbc8si",
          "score": -1,
          "body": "happy cake day",
          "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkbc8si/",
          "created": 1724837714,
          "depth": 1,
          "replies": [
            {
              "id": "lkgdkot",
              "score": 2,
              "body": "Happy yellowcake day.",
              "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkgdkot/",
              "created": 1724906610,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkc6m7v",
      "score": -1,
      "body": "I don't think about them at all.",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkc6m7v/",
      "created": 1724851881,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkds6ks",
      "score": 0,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkds6ks/",
      "created": 1724869870,
      "depth": 0,
      "replies": [
        {
          "id": "lke0ui3",
          "score": 1,
          "body": "Why that?",
          "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lke0ui3/",
          "created": 1724872658,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkfaxon",
      "score": -2,
      "body": "Do people still talk about crypto or alt coins? Is this still a thing?",
      "permalink": "/r/stocks/comments/1f359zu/what_do_you_think_about_uranium_etfs_now/lkfaxon/",
      "created": 1724890827,
      "depth": 0,
      "replies": []
    }
  ]
}