{
  "title": "NVDA can be both an amazing company with incredible growth prospects and overvalued",
  "score": 48,
  "selftext": "Most of the bullish arguments for Nvidia are 100% correct and valid. The business has grown so much, and looks destined to grow much more. The company's future is very bright. There are very few arguments against it or its future, as a business.\n\nThe only problem with NVDA, the stock, is that the price is *high.*\n\n*Phenomenaly* high.\n\nLike, so sooooo high.\n\nIt's hard to explain how high it is.\n\n[Aswath Damodaran valued it a while ago, but it's dry stuff and I think he's banned on WSB.](https://www.youtube.com/watch?v=2N0IDShsTyc)\n\nYou need to understand that valuation is a *relative* game. *Price* is half the equation. You win or lose by paying *less* than the company is worth. It works for shit companies too btw.\n\nFrom a valuation perspective, NVDA needs to grow so much *more* to be worth that price. It is for all intents and purposes impossible. It's an absurd scenario to take as base case. Again, that's just for the price to *remain* what it is.\n\nRarely are stocks so obviously overvalued. I think you regards are paying *way* too much for one of the best companies out there. But at least you'll make history :)",
  "link_flair_text": "Discussion",
  "id": "1f3aizs",
  "num_comments": 20,
  "created_utc": 1724852574,
  "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/",
  "comments": [
    {
      "id": "lkc8lc1",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 26 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkc8lc1/",
      "created": 1724852577,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkc9tv6",
      "score": 42,
      "body": "that regard sold half his nvda a year ago",
      "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkc9tv6/",
      "created": 1724853002,
      "depth": 0,
      "replies": [
        {
          "id": "lkcpnyz",
          "score": 15,
          "body": "Never accept advice from the 'poor'.",
          "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkcpnyz/",
          "created": 1724858019,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkcg23l",
          "score": 6,
          "body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkcg23l/",
          "created": 1724855039,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkcm8bb",
      "score": 24,
      "body": "AMD is much more expensive than NVDA. Not overvalued. ",
      "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkcm8bb/",
      "created": 1724856967,
      "depth": 0,
      "replies": [
        {
          "id": "lkd4fi6",
          "score": 14,
          "body": "Off the top of my head, I think AMD’s PE is like double NVDA’s. I think people look at the stock price raising astronomically and go “oVeRvAlUeD” without looking at the actual fundamentals.",
          "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkd4fi6/",
          "created": 1724862537,
          "depth": 1,
          "replies": [
            {
              "id": "lkd5bm8",
              "score": 7,
              "body": "AMD's PEG ratio is also higher. \n\n\nI think both are fantastic investments but I agree with you, people just look at explosive growth and think \"Wow, what a pricey stock, it HAS to go down if the stock price increases by 100+% in a year\" even if the revenue, say, increases by 200+% in the same period. That said, I have no idea whether NVDA will perform well today, but my gut instinct says yes. The book-to-bill ratio is still ridiculously high so I can't see why NVDA would not raise guidance significantly or fail to meet investor expectations. \n\n\nIn general, PEG ratio is a better indicator of value than PE ratio though if you have to choose one. ",
              "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkd5bm8/",
              "created": 1724862819,
              "depth": 2,
              "replies": [
                {
                  "id": "lkf1zfl",
                  "score": 1,
                  "body": "Some current PEG (price to earnings to growth) ratios:\n\nS&P 500: 1.56\n\nMicrosoft: 1.62\n\nCrowdstrike: 1.94\n\nAmazon: 2.20\n\nApple: 2.22\n\nCitigroup: 2.32\n\nMastercard: 2.38\n\nNow with how incredibly overvalued Nvidia seems to be, what do you think their PEG is? 2.6? 2.8? 3.4? 5.1? \n\nIt's 1.65. Grandpa stock levels by tech standards.\n\nWell, it was, with the newest earnings report it increased to 1.75, meaning the stock was priced about 6.1% higher than people thought was fair.\n\nNotice how the stock fell by 6% in AH after that new PEG got out",
                  "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkf1zfl/",
                  "created": 1724887674,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkdbgiq",
              "score": 1,
              "body": "The difference is that AMD's main business is CPUs, not GPUs.\n\nNvidia is already dominant in the GPU market and its future growth is dependent on the future growth of that market, which is entirely dependent on AI A) working out and B) remaining dependent on the same types of chips. These can happen, but they're big ifs.\n\nMeanwhile in the CPU market, AMD are the lesser player who after a few years of well-invested R&D on their part and a lot of bag fumbling on Intel's part, are well on their way to _becoming_ the market leader. They have the outright technologically superior product today by the metrics that matter on laptops and in the datacenter, and Intel appears increasingly unable to get its house in order as we saw by the recent 30% drop.\n\nNvidia's making bank on AI datacentre expansion but every server in every datacentre of every _kind_ needs a ton of expensive CPU hardware. AMD's market share in x86 datacentre revenue has exploded from barely 2% to over 40% in just 8 years and there's no reason to believe that won't grow to 80-90% in the next 5-10 years. Their key technical innovation is also about manufacturing costs, so their per-unit margins are 2-3x what Intel's are at the moment too.\n\nIn addition, while I'm less bullish on it, AMD have reclaimed a lot of market share in the desktop GPU space from Nvidia while they've spent the last 5 years focused on blockchain and AI. That's an extremely price-sensitive market far less interested in these massive chip dies that Nvidia's been focused on for the past few years. If Nvidia continues to focus on the datacenter and let their desktop offerings stagnate then AMD will beat them there too.\n\nLonger term too, Nvidia are building their house on sand much the same way Intel did. The key challenge in chip design isn't making a chip fast, but rather efficient. Intel's barely moved the efficiency dial on its top-end chips in years, they've only kept up on performance by throwing more power at them. From the late 90s until the mid 2010s desktop CPUs were stable around 100 watts max draw, but Intel's got chips now pushing it over 300 watts, which also means you've tripled the heat generated. This is an inconvenience on desktops, but in the datacenter or on mobile where power and heat are the biggest constraints it makes them incredibly unappealing.\n\nNvidia's doing the same thing now with its GPUs. Blackwell requiring water cooling isn't an innovation, it's a costly bandaid. People will pay anything right now because its the hot new thing and being first to market is worth it, but eventually things will stabilise, businesses will demand lower operating costs, and Nvidia will be truly between a rock and a hard place improving their power efficiency while still providing generational performance improvements. AMD haven't solved this problem or anything, but they're demonstrably ahead by those metrics largely fueled by a few key R&D gambles that took years.\n\nThere's just so much more headroom and so many less \"ifs\" on AMD's future growth prospects, so naturally a lot more of it is priced in.",
              "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkdbgiq/",
              "created": 1724864722,
              "depth": 2,
              "replies": [
                {
                  "id": "lkdtnko",
                  "score": 1,
                  "body": "You wrote a lot of words, some of them I was able to read, fewer I was able to understand. I will invest my dollars accordingly",
                  "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkdtnko/",
                  "created": 1724870324,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkctn7c",
      "score": 10,
      "body": "They are overvalued because they have a stellar track record (gaming, mining, AI) and a practical monopoly in a line of business. They dont rest on their laurels and are searching for the next biggie.",
      "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkctn7c/",
      "created": 1724859220,
      "depth": 0,
      "replies": [
        {
          "id": "lkcx4ib",
          "score": -5,
          "body": "Absolutely. And if they find the next 2 biggies, they will be 100% worth the current price. If they find 3-4 biggies, it might even be worth more! \n\nFor the shareholder that's a horrible bet to take lol",
          "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkcx4ib/",
          "created": 1724860277,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkcm87j",
      "score": 18,
      "body": ">Its hard to explain how high it is \n\nNot really, just look at the chart. Up 1,131% in 2Y so far.",
      "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkcm87j/",
      "created": 1724856966,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkd1ay0",
      "score": 3,
      "body": "Damodaran is banned here? Frankly I’d think he’d have an aneurysm from the regarded DDs posted on this sub.",
      "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkd1ay0/",
      "created": 1724861569,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkd9ult",
      "score": 3,
      "body": "The only reason you think it’s so high is because you sold it for less and now can’t personally justify a re-entry",
      "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkd9ult/",
      "created": 1724864221,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkd9hir",
      "score": 3,
      "body": "Been seeing these ‘NVDA can’t be worth this much’ posts since 2016.\n\nWhat do you do when nobody will sell you a stock for what you think it’s actually worth? \n\nI’lll tell you what you do…you never buy any of the best performing stocks.",
      "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkd9hir/",
      "created": 1724864111,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdo68g",
      "score": 2,
      "body": "That video makes no sense, bro doesn’t know the difference between cpu and gpu and a nerd and a leather jacket ",
      "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkdo68g/",
      "created": 1724868639,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lke0ty2",
      "score": 2,
      "body": "Bro stocks only go up",
      "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lke0ty2/",
      "created": 1724872653,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkefjp0",
      "score": 2,
      "body": "The current (ttm) PE (and PEG) is nothing but a GAAP accounting artifact. (They bought a lot of \"goodwill\" from Xilinx and are writing that down over years, to lower their taxes. That goes off earnings.) \n\nLook at non GAAP or fwd PE.\n\n> P/E · 44.25, 47.39 ; PEG Ratio (5yr expected), 0.62, 1.49 ; Price/Sales, 10.59, 11.61 ; Price/Book, 4.31, 4.67",
      "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkefjp0/",
      "created": 1724880163,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkhpr2x",
      "score": 1,
      "body": "Buy it not for what it is, but for what it will be\n\nor 0DTE it idgaf",
      "permalink": "/r/wallstreetbets/comments/1f3aizs/nvda_can_be_both_an_amazing_company_with/lkhpr2x/",
      "created": 1724934273,
      "depth": 0,
      "replies": []
    }
  ]
}