{
  "title": "Abercrombie & Fitch posts 21% sales gain, hikes outlook in 'uncertain environment' ",
  "score": 54,
  "selftext": "Abercrombie & Fitch’s revenue grew 21% during its fiscal second quarter as the apparel company builds on its torrid growth. \n\nThe sales gain, which follows 16% growth in the year-ago period, led the company to issue bullish guidance for the current quarter. Still, its full-year outlook was largely in line with estimates as it prepares for one fewer week this year than last. \n\nCEO Fran Horowitz – who often says good companies win in any economic environment – may be bracing for a turbulent second half of the year because for the first time in four quarters, she referenced the uncertain state of the economy in the company’s earnings release.\n\n“We delivered a strong first half of the year, and we are increasing our full-year outlook. Although we continue to operate in an increasingly uncertain environment, we remain steadfast in executing our global playbook and maintaining discipline over inventory and expenses,” said Horowitz. “We are on track and confident in our goal to deliver sustainable, profitable growth this year, while making strategic long-term investments across marketing, digital and technology and stores to enable future growth.”\n\nThe company’s shares — which were up nearly 89% this year as of Tuesday’s close — fell about 15% in early trading.\n\nHere’s how Abercrombie did compared with what Wall Street was anticipating, based on a survey of analysts by LSEG, formerly known as Refinitiv:\n\nEarnings per share: $2.50 vs. $2.22 expected\n\nRevenue: $1.13 billion vs. $1.10 billion expected\n\nThe company’s reported net income for the three-month period that ended Aug. 3 was $133 million, or $2.50 per share, compared with $57 million, or $1.10 per share, a year earlier.  \n\nSales rose to $1.13 billion, up about 21% from $935 million a year earlier. \n\nDuring the quarter, same-store sales jumped 18%, driven by better-than-expected summer and back-to-school selling. \n\nFor the current quarter, Abercrombie expects sales to rise by a low double-digit percentage, better than the 8.9% growth that LSEG analysts had expected. \n\nAbercrombie raised its full-year sales guidance from 10% growth to a 12% to 13% increase, which is roughly in line with the 12% rise that LSEG analysts had expected. \n\nThe company’s fiscal 2024 will have one fewer week than fiscal 2023, which is likely weighing on its full-year guidance. Abercrombie expects the loss of one selling week will have an $80 million impact on its holiday quarter, or 5.5 percentage points. For the full year, the company expects it to hit sales by $50 million, or 1.2 percentage points. \n\nOver the last year, Abercrombie has become known as retail’s biggest comeback story, and investors have been watching to see if the company can keep up its growth. \n\nHorowitz has looked to international markets and the company’s Hollister and Abercrombie Kids brands as growth vectors, which are already boosting sales. \n\nDuring the quarter, sales at Hollister jumped 17% while comparable sales rose 15%. In the company’s Europe, Middle East and Africa division, sales climbed 16%. \n\nCostly international expansion was one of the missteps that weighed on Abercrombie’s performance in the past, but the company is taking a different approach this time around.\n\nEarlier this month, it announced a partnership with Haddad Brands – a licensor of children’s wear – to create new distribution channels for Abercrombie Kids and grow the product line to include infant and toddler categories. \n\n“As we work to diversify A&F Co.’s channel mix and drive sustainable, profitable growth, we are thrilled to partner with Haddad Brands to build on our success and create an opportunity to grow the brand in the years ahead by engaging with new customers globally,” Horowitz said in a statement at the time. \n\nProducts from Abercrombie Kids are set to be available in Haddad Brands’ showrooms globally next month.\n\nSource: https://www.cnbc.com/2024/08/28/abercrombie-fitch-anf-earnings-q2-2024.html",
  "link_flair_text": null,
  "id": "1f3gzda",
  "num_comments": 21,
  "created_utc": 1724868307,
  "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/",
  "comments": [
    {
      "id": "lkdpk28",
      "score": 33,
      "body": "Why the fuck did the stock tank if the earnings are this good?",
      "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkdpk28/",
      "created": 1724869068,
      "depth": 0,
      "replies": [
        {
          "id": "lkdqx7x",
          "score": 25,
          "body": "“Uncertain environment” quote by CEO. Dude ranked his stock even though everything else looks good",
          "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkdqx7x/",
          "created": 1724869486,
          "depth": 1,
          "replies": [
            {
              "id": "lkg3bi4",
              "score": -7,
              "body": "I mean tbf who tf would wanna invest in a brick and mortar clothing store for teenagers?",
              "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkg3bi4/",
              "created": 1724901724,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lke8ibz",
          "score": 1,
          "body": "“Despite the strong results, CEO Fran Horowitz pointed to an “increasingly uncertain environment” as macro conditions worsen. “",
          "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lke8ibz/",
          "created": 1724875118,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkfn9hg",
          "score": 0,
          "body": "Because a clothing stock is up 52% this year. Do you think it justifies another 25% this year?",
          "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkfn9hg/",
          "created": 1724895374,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkdw6e0",
          "score": -2,
          "body": "Sell on the news. Nvda earnings report is the real market decider. If this report isn’t a home run, it’s likely the start of a bear market. So the big guys gotta decrease position size to lower risk.",
          "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkdw6e0/",
          "created": 1724871096,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkfa6kq",
          "score": -2,
          "body": "A large shareholder dumped, it’s not that hard to comprehend just hard to predict",
          "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkfa6kq/",
          "created": 1724890555,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lke1frd",
      "score": 19,
      "body": "Still up 50% YTD which is insane.",
      "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lke1frd/",
      "created": 1724872870,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdq7d4",
      "score": 9,
      "body": "I really like ANF. Strong financials and it’s becoming very popular with young people. This is not the ANF it once was, they create high quality products without ridiculous branding. I purchase from them frequently. I’m buying",
      "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkdq7d4/",
      "created": 1724869267,
      "depth": 0,
      "replies": [
        {
          "id": "lkdsi4s",
          "score": 7,
          "body": "Apparel stocks are tough to play due to the unpredictability of trends. I prefer Nike if I had to get into an apparel stock right now.",
          "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkdsi4s/",
          "created": 1724869968,
          "depth": 1,
          "replies": [
            {
              "id": "lkffek0",
              "score": 1,
              "body": "Why?",
              "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkffek0/",
              "created": 1724892459,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkdr59f",
          "score": -8,
          "body": "Nah, ANF quality has dropped since the 90s and 2000s",
          "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkdr59f/",
          "created": 1724869555,
          "depth": 1,
          "replies": [
            {
              "id": "lkg85j1",
              "score": 2,
              "body": "You are getting downvoted, but I tend to agree with you. The quality even just a decade ago was noticeably better than other mall brands. It is just on par now, but at least they have their finger on the pulse.",
              "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkg85j1/",
              "created": 1724903918,
              "depth": 2,
              "replies": [
                {
                  "id": "lkjwr7h",
                  "score": 2,
                  "body": "I used to have these paratrooper pants in the late 90s. It was so well made. Even had thermal layering inside. Pockets were well sewn and it kept me warm. Fast forward to 2017, I bought another pair. The material is so thin and within a few months, threads were coming undone and holes were left in place",
                  "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkjwr7h/",
                  "created": 1724959336,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lke2euf",
              "score": -1,
              "body": "Agreed. I worked at ANF in the mid 2000’s as a high school and college student. The quality went down hill starting around the 2010 period.",
              "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lke2euf/",
              "created": 1724873185,
              "depth": 2,
              "replies": [
                {
                  "id": "lke8ux5",
                  "score": 1,
                  "body": "I loved the t-shirts and hoodies back then, so thick and comfy. I prefer the current esthetic they're going for with less branding (I loved the loud Ts in the early 00s).",
                  "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lke8ux5/",
                  "created": 1724875248,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkf5qst",
              "score": -1,
              "body": "I agree. If you go to AnF now, the clothes look like for older people. Something parents might wear instead if college kids.",
              "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkf5qst/",
              "created": 1724888980,
              "depth": 2,
              "replies": [
                {
                  "id": "lkfb4g2",
                  "score": 5,
                  "body": "You're just not with it anymore.\n\nWhat you think parents wear are what gen z/alpha is wearing now. Same way crew socks are popular again.",
                  "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkfb4g2/",
                  "created": 1724890894,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkfd6l2",
      "score": 0,
      "body": "When did ANF become popular again? I'm 45 and had like two purchases my hole life",
      "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkfd6l2/",
      "created": 1724891646,
      "depth": 0,
      "replies": [
        {
          "id": "lkhc8ne",
          "score": 3,
          "body": "They’ve rebranded completely and have been coming back the last couple of years",
          "permalink": "/r/stocks/comments/1f3gzda/abercrombie_fitch_posts_21_sales_gain_hikes/lkhc8ne/",
          "created": 1724928050,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}