{
  "title": "Is DJT an obvious short?",
  "score": 195,
  "selftext": "The company has a $4bn market cap, but made revenues of only $3.4m, and lost $379m, over 100x it's revenue. Are Trump fanatics really enough to stop this garbage stock pretty much going to zero? Or am I missing something here because it seems like an obvious strong sell.",
  "link_flair_text": null,
  "id": "1f3gsho",
  "num_comments": 283,
  "created_utc": 1724867857,
  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/",
  "comments": [
    {
      "id": "lkdpb5w",
      "score": 496,
      "body": "The stock spiked after the debate and assassination attempt.  It would make sense to short on fundamentals, but the long term and short term prospects are driven by unpredictable political events.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdpb5w/",
      "created": 1724868992,
      "depth": 0,
      "replies": [
        {
          "id": "lkdvy58",
          "score": 149,
          "body": "At this point it's pretty predicatble.  Maybe he can try again at 82, but this shit little social media company  isn't going to make it 4 more years.",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdvy58/",
          "created": 1724871027,
          "depth": 1,
          "replies": [
            {
              "id": "lke2voy",
              "score": 112,
              "body": "it could also be a honeypot.\n\nwhen it is open to the highest bidder that wants to legally bribe a presidential candidate there's no predictability possible.\n\njust don't devote what you can't lose into this gamble",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke2voy/",
              "created": 1724873331,
              "depth": 2,
              "replies": [
                {
                  "id": "lkf6ne6",
                  "score": 42,
                  "body": "It's not even potentially a honey pot. It is. It's a wayy for foreign govts to pay a potential presidential candidate. If he wins, the stock will go through the roof until he sells it to schlubs and offloads it for something else.",
                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkf6ne6/",
                  "created": 1724889299,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkfel30",
                      "score": 18,
                      "body": "One thing to keep in mind is that his lock up period expires mid Sept, don't know the exact date, but the stock will definitely see a lot more selling pressure going into October. I guarantee he will be unloading his shares. That's another factor to consider.",
                      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfel30/",
                      "created": 1724892159,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkfyvcb",
                          "score": 7,
                          "body": "September 20th",
                          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfyvcb/",
                          "created": 1724899850,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lkfzbes",
                              "score": 6,
                              "body": "Ok, 9/20 will be D Day, Dilution day!",
                              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfzbes/",
                              "created": 1724900030,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lu71ly4",
                                  "score": 1,
                                  "body": ":)",
                                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lu71ly4/",
                                  "created": 1730131597,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lkffbvt",
                          "score": 5,
                          "body": "I think he's already passed his first lockup and that probably why it's already dropped. Oh well.",
                          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkffbvt/",
                          "created": 1724892432,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lkgodtz",
                  "score": 1,
                  "body": "Could? Lol",
                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkgodtz/",
                  "created": 1724912842,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmu98nc",
                  "score": 1,
                  "body": "Not sure if DJT’s functional utility as a publicly traded bribery vehicle is going to outlast its namesakes lockout period (which ends in about two weeks…..gulp)",
                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lmu98nc/",
                  "created": 1726180517,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lke5ety",
              "score": 17,
              "body": "lol no. He’s getting sentenced on 9/18 and it will most likely be house arrest which is a death sentence for this campaign and if he can’t pull it off at 78 he’s not going to somehow make it 82. I also think the GOP will finally say we need to change tack and move away from his losing streak. \n\nYou’re absolutely right about his shitty little tech startup. I have a 4 employee business that does more revenue than him, makes solid profits and actually has assets yet it’s not got 1/1000 the market cap / valuation that Truth social does. It’s a money laundering / bribery platform that can’t continue to lose money for more than a year or so more without it being outed.",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke5ety/",
              "created": 1724874121,
              "depth": 2,
              "replies": [
                {
                  "id": "lke6znq",
                  "score": 50,
                  "body": "You actually think that is going to happen?? Or just hope it will?",
                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke6znq/",
                  "created": 1724874616,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkedtox",
                      "score": 11,
                      "body": "I actually think he’ll get house arrest for 2-6 months. \n\nThe standard to make the misdemeanor charges become a felony was extremely high and had very specific criteria that was met unanimously. The judge gave very clear jury instructions as to what was required to meet that high bar, and the jury felt it met those exacting conditions.\n\nThe maximum possible penalty for each count is 4 years to a total combined of 20 max but he won’t get anything close to that. Given that it’s a first offense and a white collar crime, a sentence would usually be minimum security for a short term but I think he’ll get house arrest given that USSS isn’t feasible and he’s a security risk in prison etc.\n\nI also think the judge was incredibly patient during the trial with the gag order violations and endless fuckery from both Trump and his legal team to cause or provoke a mistrial but the judge didn’t bite…I think because he wanted to show that Trump had been very courtesy (and then some) knowing however he would have the ability to let justice be served at sentencing. Trump has also broken the gag order terms multiple times since and the judge hasn’t come down on him yet. \n\nThats what makes me think he’ll actually get something material in terms of a sentence, and it could well be made worse when Trump is asked if he would like to address the court prior to his sentence being handed down. If Trump had any brains left, and his lawyers have any sense, he will choose not to comment but if he does comment, it could make the sentence 10 times worse / longer because it’s all at the judges discretion at that point. There is no way Trump is going to stand up there and say “I’m sorry, please have mercy” so his best option is to STFU and day nothing, which the judge could also well take offense to.\n\nI will be both honestly amazed and disturbed if Trump gets nothing more than a fine and/or suspended sentence. \n\nThe only saving grace in that situation would be he’s still guilty of 34 felony counts and if any one of the other cases catches up with him, it would no longer be first offense and he’d get serous time for either of those cases as they are much more serious.",
                      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkedtox/",
                      "created": 1724879586,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkf42n2",
                          "score": 5,
                          "body": "Will have so many delays he will be president or out before the case is finished",
                          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkf42n2/",
                          "created": 1724888396,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lkf8kw9",
                              "score": 2,
                              "body": "What delays? He can be remanded on the spot, and file his appeal while under house arrest. There really aren’t any more days now with this case. He can try to beg for a postponed sentencing but I think the judge has already given enough leniency by delaying it by 6 weeks.",
                              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkf8kw9/",
                              "created": 1724889983,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lkeeduj",
                      "score": -8,
                      "body": "Lots of hope. This sub, like many other subs is left as hell. They can’t take advantage like neutral traders exactly from such events. Politics is shit.",
                      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkeeduj/",
                      "created": 1724879772,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lkfv0z6",
                  "score": 1,
                  "body": "Nah he will only get fined and maybe some community service hours (haha)",
                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfv0z6/",
                  "created": 1724898318,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkfynpd",
                      "score": 7,
                      "body": "I dunno. 34 felony counts? He’ll have to show remorse and ask for mercy to get community service and that ain’t happening 😂",
                      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfynpd/",
                      "created": 1724899764,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lpfb8n2",
                  "score": 1,
                  "body": "vanish touch wrong badge ripe oatmeal childlike illegal merciful literate\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lpfb8n2/",
                  "created": 1727571613,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpfzwjq",
                      "score": 1,
                      "body": "Judge made a great move; sentence him after he’s lost the election. No immunity. As much as I would have loved it before, it means gloves are off with zero presidential protection.\n\nAnd DJT has lost $7bn in value since my post 😂",
                      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lpfzwjq/",
                      "created": 1727582257,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpjb95n",
                          "score": 1,
                          "body": "rotten price screw punch person lush jar worthless insurance saw\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lpjb95n/",
                          "created": 1727637104,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpk8c6o",
                              "score": 1,
                              "body": "I think if Trump gets elected he’s free for the rest of his natural life (not least because I’ve never met a living morbidly obese >82 year old).\n\nIf he doesn’t get elected he’s toast. The courts protected him from anything done while president but not outside of that. \n\nIt’s only Nov 26, so he’s either free and clear by winning, or he’s going to get sentenced.",
                              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lpk8c6o/",
                              "created": 1727647767,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lplxujj",
                              "score": 1,
                              "body": "> they'll finally get him.\n\nIt’s amazing, right? The rich can and should be able to get away with whatever they want. They are better people than the rest of us. ",
                              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lplxujj/",
                              "created": 1727673921,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lkq4091",
              "score": 1,
              "body": "He won't care I guess, since he will have made $2b with it.",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkq4091/",
              "created": 1725047811,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkdzplf",
          "score": 27,
          "body": "Most of the shares are held by people that did favors, he owes for services,  probably Russian oligarchs, but mostly Trump. They're all going to be able to sell in September. None of them have any vested interest in the stock doing well and Trump is always desperate for cash. \n\nThis is going to tank like a rock.  I'm sure they'll pump it one more time before the sell off, but it'll come. \n\nThis has been easy money lately and I have far dated puts to short this garbage all the way to the bottom.",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdzplf/",
          "created": 1724872242,
          "depth": 1,
          "replies": [
            {
              "id": "lke2if6",
              "score": 13,
              "body": "Believe me when I say this: Good Luck!\n\nTo me it feels too much like a meme stock, but to each his own.",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke2if6/",
              "created": 1724873216,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lke3mwj",
              "score": 5,
              "body": "I hope you win. You're braver than me",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke3mwj/",
              "created": 1724873570,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkerxw0",
              "score": 1,
              "body": "Do you have a source or means of finding that a significant number of shares become available to sell in September?",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkerxw0/",
              "created": 1724884280,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkdqnrr",
      "score": 163,
      "body": "It's so obvious it's practically not worth doing. Short interest and put premiums are through the roof.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdqnrr/",
      "created": 1724869406,
      "depth": 0,
      "replies": [
        {
          "id": "lkdu15j",
          "score": 32,
          "body": "Yeah I looked yesterday and prems were between like $3-7 depending the exp.",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdu15j/",
          "created": 1724870440,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkfiqj1",
          "score": 10,
          "body": "Yeah it’s not cheap. IV is so high it needs a lot of movement for those farther dated strikes. I bought $60k worth of puts when it was somewhere around $24.  I’m up but only up $25k, tough when you consider the risk.",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfiqj1/",
          "created": 1724893685,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkjc1pu",
          "score": 1,
          "body": "Ya I looked at the options chain last month and the put premiums were absolutely astronomical.  I imagine the short interest is the same.",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkjc1pu/",
          "created": 1724952947,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkdq53v",
      "score": 101,
      "body": "Stay away",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdq53v/",
      "created": 1724869248,
      "depth": 0,
      "replies": [
        {
          "id": "lke1tb1",
          "score": 58,
          "body": "This. It is a giant meme stock that is worthless which is the most dangerous type of stock to short.",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke1tb1/",
          "created": 1724872999,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkdqszu",
      "score": 39,
      "body": "So obvious that the premiums included are not worth the bet.  I checked when it was like $39 and to short it in a December close it would have had to go near 0 to be profitable.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdqszu/",
      "created": 1724869449,
      "depth": 0,
      "replies": [
        {
          "id": "lkmweiq",
          "score": 2,
          "body": "I'm thinking the company will be OTC before 15-JAN-2025. Load up on $2.50 strike Put options. They're like $0.20 right now and could be worth well over $1 IMO.",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkmweiq/",
          "created": 1725001906,
          "depth": 1,
          "replies": [
            {
              "id": "lojhx39",
              "score": 1,
              "body": "Yeah that’s more my strategy. I also seen out the money 2026 puts too at the lowest strike price. Grabbed some of those. I wish I would’ve educated myself more on premiums but the fills were pretty friendly.",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lojhx39/",
              "created": 1727106474,
              "depth": 2,
              "replies": [
                {
                  "id": "lomks7i",
                  "score": 2,
                  "body": "Dude I'm with you. I swooped some jan2025 and jan2026 $2.50 puts at like .20 ea last week. lol come jan theyll be atleast $1+",
                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lomks7i/",
                  "created": 1727143063,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkdr4p1",
      "score": 70,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdr4p1/",
      "created": 1724869550,
      "depth": 0,
      "replies": [
        {
          "id": "lkdte2n",
          "score": 14,
          "body": "I honestly think they are sh1t rcoins by another name",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdte2n/",
          "created": 1724870242,
          "depth": 1,
          "replies": [
            {
              "id": "lkfx859",
              "score": 1,
              "body": "I had the same thought",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfx859/",
              "created": 1724899186,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkdvcgt",
          "score": 3,
          "body": "Well i wish I'd have known FFIE was a meme stock. Took a 95% hit on that. Luckily it was only $250 lmao.",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdvcgt/",
          "created": 1724870843,
          "depth": 1,
          "replies": [
            {
              "id": "lkdy18m",
              "score": 10,
              "body": "Did you... really not know that?",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdy18m/",
              "created": 1724871667,
              "depth": 2,
              "replies": [
                {
                  "id": "lkj09yb",
                  "score": 1,
                  "body": "Nope. I did zero research. 🤣 It’s like 1/10000th of my portfolio. And one of several electric car stocks. The one other loser I have is Tesla.",
                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkj09yb/",
                  "created": 1724949405,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkel7ib",
              "score": 3,
              "body": "How did you find out about it? Let me guess: some social media grifter on twitter/youtube/tiktok. And you invested in it without doing any actual research on what the company does or how their business is doing. You bought it because it was a meme even if you don't know it.",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkel7ib/",
              "created": 1724882037,
              "depth": 2,
              "replies": [
                {
                  "id": "lkoi87j",
                  "score": 1,
                  "body": "I actually don’t remember but assume it was after I took my sleeping pill and just surfing trending stocks in a half awake state before bed. And figured, $250 is throwaway money. 🤣",
                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkoi87j/",
                  "created": 1725029374,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkdooaf",
      "score": 75,
      "body": "It's obvious garbage and money laundering and I would stay miles away from it.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdooaf/",
      "created": 1724868796,
      "depth": 0,
      "replies": [
        {
          "id": "lkgg3yr",
          "score": 6,
          "body": "Trump's lockup period ends Sept 20. Regardless of the ridiculous premiums for puts, I might throw something at it just to gamble on whether or not he yanks his ~55-60% of the company. The whole thing was probably set up for exactly that purpose after all.",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkgg3yr/",
          "created": 1724907972,
          "depth": 1,
          "replies": [
            {
              "id": "lkmwnwi",
              "score": 4,
              "body": "He's gotta pay those legal cost's somehow. You think he'd rather sell Mag a Largo? That company is going the same place every other company he bought went. Bankrupt. At least he didn't stiff the local construction workers and labor unions this time. LOL",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkmwnwi/",
              "created": 1725002075,
              "depth": 2,
              "replies": [
                {
                  "id": "lmu9ut1",
                  "score": 2,
                  "body": "Why not just take out a second mortgage on Mar a Lago and collateralize it with his shares if he needed liquidity immediately?\n\nAlternatively - and now that I think about it, this method would (probably) result in a greater cash windfall while bearing much less price and legal risk - why not just send multiple emails to his campaign distribution list asking for donations? \n\nHave to think that method involves muuuuuuch less paperwork and is absent any SEC / class action legal liability….",
                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lmu9ut1/",
                  "created": 1726180752,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmw1smq",
                      "score": 2,
                      "body": "..Problem is I think there's already a 2nd mortgage on ALL of his properties, and EVEN A 3RD ON SOME!! I guess desperate times call for desperate measures. $600 Mil in lawsuits doesn't help much either. See, my Mom actually was right for once.. It doesn't pay to be an asshole. LOL!",
                      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lmw1smq/",
                      "created": 1726208214,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkdr563",
      "score": 86,
      "body": "My client called and wanted to put 10k in it when it was $45. He’s a major MAGA. I told him no and I’d only buy it if he signed a form that it was against my recommendation. But I’ve learned to give a little bone, so I was like “let’s just do $2k, are you okay with losing 2k?” And he said sure. He called yesterday and was like “you know I pay you to make me money but I guess in this case help keep me from losing”. So we finally sold. He said he feels like Trump defrauded him.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdr563/",
      "created": 1724869554,
      "depth": 0,
      "replies": [
        {
          "id": "lkdx7mg",
          "score": 49,
          "body": "He will still vote for Trump though",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdx7mg/",
          "created": 1724871415,
          "depth": 1,
          "replies": [
            {
              "id": "lkdxz6q",
              "score": 40,
              "body": "Oh he will. He said that Trump is a business man and some business just fail. You can’t with these people",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdxz6q/",
              "created": 1724871649,
              "depth": 2,
              "replies": [
                {
                  "id": "lke5bxq",
                  "score": 11,
                  "body": "Some businesses do… in trumps case it’s “most”",
                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke5bxq/",
                  "created": 1724874098,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkipdz4",
                  "score": 1,
                  "body": "Snake oil salesmen existed because people kept buying snake oil :D.\n\n Calling him a business man is like putting lipstick on a pig and calling it a business man.",
                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkipdz4/",
                  "created": 1724946119,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lppltpl",
                  "score": 1,
                  "body": "Trump’s daddy left him half a billion dollars of buildings.  I wouldn’t call that being a businessman.  I’d call him a spoiled little asshole who couldn’t run a real business if his life depended on it. If he hadn’t been born into wealth he’d have a mustache and be luring children into his van. ",
                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lppltpl/",
                  "created": 1727730041,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkdv0p3",
          "score": 19,
          "body": "The Trumper, it's not personal until it's personal.",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdv0p3/",
          "created": 1724870742,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lke09tv",
      "score": 11,
      "body": "It’s a scam.\n\nI think Trump will launder money through this to himself but he’s proving himself too unstable to invest in.\n\nAnother example that ETTD.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke09tv/",
      "created": 1724872447,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdmyrf",
      "score": 21,
      "body": "It is such an obvious short that it is almost impossible to do so. If he loses the election, the stock has no value at all. If he wins, it has value for funneling him money, but not at current valuations.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdmyrf/",
      "created": 1724868264,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lke5zhg",
      "score": 7,
      "body": "The business is practically worthless. However corrupt figures are using it to push money to him for future favors. Like many said, its near exclusively a money laundering scheme.\n\nProblem is these people have a lot of money and can keep the stock floating a long time. My guess is they will keep propping it up until Trump sells his shares, which he most assuredly will because, again, the business is near worthless.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke5zhg/",
      "created": 1724874295,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lked81l",
      "score": 7,
      "body": "I considered actually shorting it. But after a few trial paper trades, realized that the MAGA crowd is going to remain unreasonable longer than I can remain solvent.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lked81l/",
      "created": 1724879387,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lke3dq0",
      "score": 5,
      "body": "Depends how much the Saudi's and Russians want to spend as it approaches the end of the lockout period. If things look good for Trump, they will spend a lot.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke3dq0/",
      "created": 1724873488,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lke3eg6",
      "score": 6,
      "body": "The lower it goes, the cheaper it becomes for foreign entities to feed more money to Trump when he's allowed to sell again. I wouldn't touch this stock ever, in any way. ",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke3eg6/",
      "created": 1724873495,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdstes",
      "score": 9,
      "body": "imagine shorting when it was 20 last time before it spiked to 60. you would have gotten margin called and liquidated and your portfolio wiped out. it can 100% happen again",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdstes/",
      "created": 1724870065,
      "depth": 0,
      "replies": [
        {
          "id": "lkeuppk",
          "score": 7,
          "body": "Long dated puts don't get margin called. I wouldn't short shares. Owning puts with 2025 expiry is pretty low risk.",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkeuppk/",
          "created": 1724885209,
          "depth": 1,
          "replies": [
            {
              "id": "lkfj3o1",
              "score": 1,
              "body": "the IV on 2025 puts are nearly 200%. not low risk at all\n\nif trump wins the election, the puts will expire worthless",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfj3o1/",
              "created": 1724893821,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrnp70u",
              "score": 1,
              "body": "low risk huh?",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lrnp70u/",
              "created": 1728784224,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lke2xxh",
          "score": 3,
          "body": "he gave a random speech and it went up 15% and his assassination attempt caused it to go up 30% in a day even though there was no change in company performance. \n\nOP your logic that company performance should dictate stock price is correct. Unfortunately this is one of many exceptions",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke2xxh/",
          "created": 1724873350,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lke73f5",
      "score": 6,
      "body": "It's not for Trump fanatics. The whole point is to give the ultra rich a way to bribe Trump legally.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke73f5/",
      "created": 1724874650,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkgaw1i",
      "score": 6,
      "body": "This stock is fuelled by fanatical fuckheads.  I would stay away from it as it is too speculative in how it will go",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkgaw1i/",
      "created": 1724905249,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdoo29",
      "score": 28,
      "body": "It’s a proxy for voter intention. If it goes up, trump is more likely to win if it goes down, Harris is. \n\nIn real life, the stock is worth maybe 3 cents.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdoo29/",
      "created": 1724868794,
      "depth": 0,
      "replies": [
        {
          "id": "lkdqfgp",
          "score": 3,
          "body": "They better pay be 3 cents for me to buy this stock.",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdqfgp/",
          "created": 1724869335,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkdqs57",
          "score": 5,
          "body": "But why does the stocks value reflect the likelihood of Trump getting elected? His political position doesn't affect the intrinsic value of the company, and it is fundamentally a failing business, overvalued by maybe 80-120 times",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdqs57/",
          "created": 1724869442,
          "depth": 1,
          "replies": [
            {
              "id": "lkdupx9",
              "score": 18,
              "body": "Remember when Trump used the presidency and the oval office like it was an advertisement space? The market remembers lmao. \n\nIt's valuation is tied to his \"brand\". As long as there's even a chance he wins then his donors will keep it inflated to stay in his good graces. \n\nIf he loses then I don't think there's a snowballs chance in hell it doesn't get delisted after crashing to sub $1",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdupx9/",
              "created": 1724870652,
              "depth": 2,
              "replies": [
                {
                  "id": "lke1gr0",
                  "score": 7,
                  "body": "and for fucking beans at that. BEANS",
                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke1gr0/",
                  "created": 1724872880,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkdso19",
              "score": 26,
              "body": "Large investors that want to get favor with him can buy the stock to drive up the price, and therefore his net worth. It's a back door bribe. But if they don't think he has a chance of winning there's no reason to hold or buy the stock and it's going to crash.",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdso19/",
              "created": 1724870019,
              "depth": 2,
              "replies": [
                {
                  "id": "lkduh11",
                  "score": 6,
                  "body": "Also he will be able to sell his shares soon and there's no way he can pass up a quick cash grab like this",
                  "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkduh11/",
                  "created": 1724870575,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkdupbr",
                      "score": 6,
                      "body": "I wouldn't be at all surprised if he secretly/illegally sold them months ago when it was $50",
                      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdupbr/",
                      "created": 1724870647,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkdv0m0",
                          "score": 12,
                          "body": "What's one more trial at this point?",
                          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdv0m0/",
                          "created": 1724870742,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lkdu1uh",
              "score": 1,
              "body": "Meth is a hell of a drug.",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdu1uh/",
              "created": 1724870446,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkdttv1",
      "score": 3,
      "body": "The stock is volatile and I think the short interest could be killer the months leading up to the election \n\nBuying puts where you have a more steadily defined risk isn’t a bad idea though. Gotta be hefty premiums though, I bet the Beta is huge",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdttv1/",
      "created": 1724870378,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdujno",
      "score": 3,
      "body": "I’ve been setting up vertical put spreads - bought 25 put and sold a 15, for instance - and have been doing that on and off for a while now. Have made a few grand.  What everyone has said about the dangers of a cult stock is right.  But I’ve limited myself and know exactly what I’ll risk and gain from each one.  (And fuck these sham companies - this one is truly just for laundering)",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdujno/",
      "created": 1724870597,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkedf3s",
      "score": 4,
      "body": "I said the same thing the last time this was brought up here.\n\nI think the company is worth between $50 and $60.\n\nSo if you want to know the appropriate share price, just divide that by the number of shares outstanding.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkedf3s/",
      "created": 1724879452,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkebj82",
      "score": 7,
      "body": "You are asking Reddit, a predominant left leaning message board, their thoughts on DJT?",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkebj82/",
      "created": 1724878802,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdrgg8",
      "score": 3,
      "body": "you missed the short when it was over 60",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdrgg8/",
      "created": 1724869650,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdrgvb",
      "score": 3,
      "body": "Yes, the company is dirtier than garbage.  However, shorting is risky due to orange man running for the hot seat.  I would buy long dated puts and watch it slowly burn. \n\n  \nKeep in mind that their lockout period expires sometime in September. So, a lot of insiders are likely to get out putting even more downward pressure on the price.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdrgvb/",
      "created": 1724869654,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdslg8",
      "score": 3,
      "body": "Priced in, just don't touch it.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdslg8/",
      "created": 1724869997,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lke55km",
      "score": 3,
      "body": "Don't mess with meme stonks.  You'll lose your shirt.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke55km/",
      "created": 1724874043,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lke6j0m",
      "score": 3,
      "body": "Yeah maga people will keep the stock from going to 0. To sell their stock is to admit Trump is not doing well. But it could get close to 0.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke6j0m/",
      "created": 1724874465,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdt0go",
      "score": 5,
      "body": "I wouldn’t buy or short. It’s not a straight forward stock that trades on fundamentals. This is a meme.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdt0go/",
      "created": 1724870126,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdsy79",
      "score": 3,
      "body": "What if there's a yuuuuge short squeeze?  A big, beautiful short squeeze?",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdsy79/",
      "created": 1724870107,
      "depth": 0,
      "replies": [
        {
          "id": "lke6xyh",
          "score": 3,
          "body": "We have the best short squeezes, everybody keeps telling me. This will be the bigliest short squeeze the world has ever seen. We’ve never seen anything like it, it’s incredible.",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke6xyh/",
          "created": 1724874600,
          "depth": 1,
          "replies": [
            {
              "id": "lkf5uyh",
              "score": 6,
              "body": "A big, tough Saudi man came up to me, in tears, and he was wearing a very manly robe, not like a dress that Ivanka would wear, which would show off her unbelievable legs and ass, which I would totally smash if she wasn't my daughter, but totally would if she waa my step daughter, but the robe was not sexy at all, instead very manly, and he said, with tears running down his cheeks \"Sir, Mr President...we can do the most beautiful, yugest short squeeze. Just say the word.\" And naturally when he said short squeeze, i thought he had been talking with Stormy, and was talking about my beautiful, gorgeous and perfectly right sized mushroom penis. But he stood there, crying and hugging me while my mushroom stump gave America a grand salute....",
              "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkf5uyh/",
              "created": 1724889022,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkdrh3r",
      "score": 2,
      "body": "It's hard to borrow & option premiums are through the roof. Best bet is call credit spreads - if abythung",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdrh3r/",
      "created": 1724869656,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdv1rm",
      "score": 2,
      "body": "You never know what Trump supporters are capable of. If Trump tells his supporters to pump it, they will pump it.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdv1rm/",
      "created": 1724870752,
      "depth": 0,
      "replies": [
        {
          "id": "lkdxqc9",
          "score": 4,
          "body": "They've gotta be running out of money at this point, don't they? What with all the sneakers and trading cards they've had to buy.",
          "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdxqc9/",
          "created": 1724871573,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkdz7yq",
      "score": 2,
      "body": "Never do business in any with such an obvious crook. And…you never know. Do something with a real company",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdz7yq/",
      "created": 1724872042,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lke38bn",
      "score": 2,
      "body": "It’s a scheme. Don’t go near it. Enough people short it and they’ll have the Saudis pump it. Be careful.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke38bn/",
      "created": 1724873441,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkeczwm",
      "score": 2,
      "body": "The stock is fundamentally worthless and will go bankrupt.  The problem is picking when.  A lot depends on the election, if he loses this company will die soon after.  If he wins, it will drag on for a lot longer.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkeczwm/",
      "created": 1724879311,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkf9x5h",
      "score": 2,
      "body": "Yes. Letting Trump back on Twitter (X) pretty much killed this stock. If Trump doesn’t post there(Truth Social) who’s there to follow?",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkf9x5h/",
      "created": 1724890462,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkfaimy",
      "score": 2,
      "body": "Yes, in that it's a poopy piece of shite.\n\nNo, in that it's underlying asset is highly divorced from reality. It's the pig on LSD problem, no way to know where it's gonna run.\n\nSmart money stays away.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfaimy/",
      "created": 1724890675,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkg4fzh",
      "score": 2,
      "body": "X is going to buy it.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkg4fzh/",
      "created": 1724902220,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkmwqri",
      "score": 2,
      "body": "\n\nHe's gotta pay those legal cost's somehow. You think he'd rather sell Mag a Largo? That company(DJT) is going the same place every other company he bought went... Bankrupt!! At least he didn't stiff the local construction workers and labor unions this time. LOL",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkmwqri/",
      "created": 1725002127,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llhsn5z",
      "score": 2,
      "body": "Donald in general is worth shorting. Everything the man touches turns to Sxxt.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/llhsn5z/",
      "created": 1725469451,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr0vp3m",
      "score": 2,
      "body": "The past 2 days is why you dont go all in on \"obvious\" plays",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lr0vp3m/",
      "created": 1728434373,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdp92g",
      "score": 3,
      "body": "It is the world's only purpose built meme stock.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdp92g/",
      "created": 1724868974,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkekhaj",
      "score": 3,
      "body": "People buying this stock are the same people buying trumps shoes hats and cologne.\n\nHes praying on everyone's stupidity. \n\nIt's a rug pull just like his reputation.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkekhaj/",
      "created": 1724881801,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdrrs6",
      "score": 1,
      "body": "Read about $HLF.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdrrs6/",
      "created": 1724869745,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdt73p",
      "score": 1,
      "body": "The time to have asked that question was 3 months ago when it was at $60. Although you can take a chance to the single digits the company's supposed divest or something in September and Trumps back on Twitter so he doesn't use that other shit social.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdt73p/",
      "created": 1724870183,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdtsf1",
      "score": 1,
      "body": "Stay away. It's too irrational and meme-y. Your short can be burned by something that's not logical.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdtsf1/",
      "created": 1724870366,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdurft",
      "score": 1,
      "body": "Nope. Wait until you see what happens around the lockup period end. At some point next year if it’s still around? Sure. It’s way too ripe for manipulation both of the political wealth transfer sort and the to-the-moon short squeeze sort.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdurft/",
      "created": 1724870665,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdvisw",
      "score": 1,
      "body": "Too late. You’re about 6 months too late. Not saying it’s not gonna go down more but the premium you’ll pay is large to bet on it now.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdvisw/",
      "created": 1724870897,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdvmfb",
      "score": 1,
      "body": "Priced in",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdvmfb/",
      "created": 1724870927,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdxjz0",
      "score": 1,
      "body": "Yes. How do I short stocks on fidelity?",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdxjz0/",
      "created": 1724871520,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdyw1r",
      "score": 1,
      "body": "As I general rule:  If it doesn’t trade on a fundamental valuation, it doesn’t make sense to short it on fundamental valuation. \n\nIf you do want to short it, you need to think about trading catalysts and what actually drives the price.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdyw1r/",
      "created": 1724871938,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkdz4es",
      "score": 1,
      "body": "Just keep buying….It’s going to be Huuuuuge!",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkdz4es/",
      "created": 1724872011,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lke62q3",
      "score": 1,
      "body": "Meme stock. Have fun lol.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke62q3/",
      "created": 1724874323,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lke6h3c",
      "score": 1,
      "body": "Another meme stock. Be careful.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lke6h3c/",
      "created": 1724874448,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkeg8e2",
      "score": 1,
      "body": "Looks like a fantastic idea. This isn’t any more or less dangerous than trying to short an index fund.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkeg8e2/",
      "created": 1724880393,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkehrdf",
      "score": 1,
      "body": "I read somewhere that to be listed on the exchanges the entity in question has to post a profit within x-amount of time. I'm sort of curious if at a certain point it has to be delisted right?",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkehrdf/",
      "created": 1724880904,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkeigzb",
      "score": 1,
      "body": "Meme stock about to implode , especially when he sells all his shares.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkeigzb/",
      "created": 1724881142,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkejl4u",
      "score": 1,
      "body": "I thought it couldn’t really be shorted, nobody on the other side",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkejl4u/",
      "created": 1724881511,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkekgqy",
      "score": 1,
      "body": "Simple business and economics classes will tell you that any business that has a cost to revenue ratio of 2:1 will eventually go bankrupt, specifically once it gets too low with cash on hand. DJT has a ratio of 100:1. If it makes it to January 1st, 2025, I'll be impressed. Don't even bother shorting it, the company is worth nothing, and will file for bankruptcy, like all Trump businesses.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkekgqy/",
      "created": 1724881796,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkeqnfi",
      "score": 1,
      "body": "That was the play after the debate or attempt on him. It’s already come back down to earth. Big gains are gone now unless you’re bullish",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkeqnfi/",
      "created": 1724883844,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkercsb",
      "score": 1,
      "body": "If you think it’s an obvious short, you’ve never shorted before. \n\nNo, you can blow up your portfolio even if the stock goes to 0.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkercsb/",
      "created": 1724884082,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkes1vv",
      "score": 1,
      "body": "Wait til it goes up to $30 then short",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkes1vv/",
      "created": 1724884318,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkes45p",
      "score": 1,
      "body": "It's too volatile, trades on sentiment, you may as well choose your favorite crypto token, it's a similar setup. In the long run is it likely a major short? Yes, but you have no idea how far you can be ran in before then. Also if by some insane chance he does win the election, or rig it, whichever, A short would be downright painful",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkes45p/",
      "created": 1724884340,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkeuakl",
      "score": 1,
      "body": "Premiums are very high as others have said.\n\n\nBut my puts are up 30% and I'm still holding.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkeuakl/",
      "created": 1724885066,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkevb2d",
      "score": 1,
      "body": "Yes but it's super expensive to borrow.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkevb2d/",
      "created": 1724885405,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkex3th",
      "score": 1,
      "body": "I wouldn't touch any of that shit. Way too unpredictable and entirely reliant on US politics.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkex3th/",
      "created": 1724886009,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkexaju",
      "score": 1,
      "body": "Trump will sell when he has a chance next month. POS stock that has no revenue and lost over $300 million..If dark money wants to try and turn this into a meme stock good luck.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkexaju/",
      "created": 1724886072,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkf1670",
      "score": 1,
      "body": "It has been red every day in the last month.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkf1670/",
      "created": 1724887398,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkf3v9y",
      "score": 1,
      "body": "Too late to the party if you can't buy any cheap put options. A big thing have been the price to short or to buy a put have been too high, even more at this lower stock price amount even if many thinks it's worth zero",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkf3v9y/",
      "created": 1724888324,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkfhunn",
      "score": 1,
      "body": "Short after the big red candle after a price+volume spike I guess. But it scares me too",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfhunn/",
      "created": 1724893355,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkfj6j5",
      "score": 1,
      "body": "With the debate and election coming up, there will be spikes so you are playing a dangerous game.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfj6j5/",
      "created": 1724893850,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkfjoho",
      "score": 1,
      "body": "This is one of those cult stocks that do not follow fundamentals",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfjoho/",
      "created": 1724894037,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkfmooz",
      "score": 1,
      "body": "Good luck finding shares available to short. The current borrow rate is 17% and there are no shares left.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfmooz/",
      "created": 1724895157,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkfp2or",
      "score": 1,
      "body": "No one knows anything",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfp2or/",
      "created": 1724896054,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkfui7k",
      "score": 1,
      "body": "The only value is the stock’s association with Trump. If he even hints that he will sell, the stock price will drop like a rock. 🪨",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfui7k/",
      "created": 1724898115,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkfx6io",
      "score": 1,
      "body": "Yes",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfx6io/",
      "created": 1724899167,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkfywlu",
      "score": 1,
      "body": "I’m buying a March 2025 call every week until it runs again. I think that it will run back up over $30 when we get closer to the election, it may even go back to $50.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkfywlu/",
      "created": 1724899864,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkg2ccj",
      "score": 1,
      "body": "Can't the board vote to let him start exercising his shares Friday morning, the stock price has stayed above $12.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkg2ccj/",
      "created": 1724901297,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkgc96b",
      "score": 1,
      "body": "Is it recommended to invest in this stock?",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkgc96b/",
      "created": 1724905933,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkguj1i",
      "score": 1,
      "body": "markets can stay irrational longer than you can stay solvent. best to grab some popcorn and watch this one from the sidelines champ",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkguj1i/",
      "created": 1724916794,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkh8aoc",
      "score": 1,
      "body": "Don't forget Trumps lock out period expires next month. I wouldn't be at all surprised to see him sell his shares to make a quick buck before they become more worthless",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkh8aoc/",
      "created": 1724925788,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkhqabg",
      "score": 1,
      "body": "Shorting a company 75% off the high is a great way to go broke.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkhqabg/",
      "created": 1724934491,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkhvpqx",
      "score": 1,
      "body": "I have been wanting to do so, but not sure how to structure.  If he loses the election, he's done for good, which means $DJT is absolutely worthless, less than $0.  If someone is confident that he's going to lose, then it would make sense to buy puts dated for around the election.  Anyone care to offer some strategies that could be good options?",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkhvpqx/",
      "created": 1724936573,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkhy9vr",
      "score": 1,
      "body": "Buy a shitload of put options on it. Every single business he didn’t inherit and started himself failed. Every single one of them. This will be no exception. Everything that man has touched over the last forty years has turned into a steaming pile of garbage, and that’s a business statement only, I’m keeping politics out of this.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkhy9vr/",
      "created": 1724937478,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkig9cc",
      "score": 1,
      "body": "Watch for any spikes and short those. Long term this one is pretty volatile, November will decide if we put the final nail on this coffin imo.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkig9cc/",
      "created": 1724943337,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkik22z",
      "score": 1,
      "body": "No, due to volatility and borrowing costs.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkik22z/",
      "created": 1724944497,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkiopsw",
      "score": 1,
      "body": "It's the most obvious short. Because of that, there will be sooo many people that  will get crushed. Some will make good money but there will be massive levels of manipulation going on until the ticket files bankruptcy.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkiopsw/",
      "created": 1724945917,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lklwx9i",
      "score": 1,
      "body": "It is dangerous to evaluate a meme-like stock with actual fundamentals. If you want to speculate on collapse, safer bet is to buy a deep in the money put option that expires well after the Presidential election. That will limit your list to cost of option. Short would have unlimited loss if Trump wins and stock soars.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lklwx9i/",
      "created": 1724984032,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkm1viq",
      "score": 1,
      "body": "I'm pretty sure the shares cost a lot to borrow. So you're basically just gambling on how long the stock takes to go down.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkm1viq/",
      "created": 1724986032,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkmx8nq",
      "score": 1,
      "body": "I shorted it awhile back , jumped on the bandwagon before it got too low \nMade a tidy profit on maga money",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkmx8nq/",
      "created": 1725002455,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkorprw",
      "score": 1,
      "body": "No.  This is a complete gamble",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkorprw/",
      "created": 1725032322,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkys5pf",
      "score": 1,
      "body": "It’s long vol is what it is.",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lkys5pf/",
      "created": 1725184043,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqz04yv",
      "score": 1,
      "body": "Trump is going to win and this stock will continue to rise until nov 6 then I will dump it more and more people are waking up yes it’s a meme stock but like other meme stocks they skyrocket and then they’re done and I believe this will too even if they assassinate him it will skyrocket that’s the only way he doesn’t win and if they cheat again which I think they’ll try I don’t think they’ll get away with this time Trump will be the president this stock will shoot up and then dump it",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lqz04yv/",
      "created": 1728409570,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqz0d3u",
      "score": 1,
      "body": "With all that money these guys have you don’t think they can pay Market  makers make the stock shoot up ha ha Ha think again I got a lot of power I wouldn’t be surprised if Pelosi has a ton of it secretly",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lqz0d3u/",
      "created": 1728409644,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvfgqlo",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1f3gsho/is_djt_an_obvious_short/lvfgqlo/",
      "created": 1730760984,
      "depth": 0,
      "replies": []
    }
  ]
}