{
  "title": "Nvidia reports 122% revenue growth on surging demand for data center chips",
  "score": 2452,
  "selftext": "Nvidia reported earnings after the bell that beat Wall Street expectations for earnings and guidance, and provided stronger-than-expected guidance for the current quarter.\n\nNvidia shares fell nearly 4% in extended trading.\n\nHere are the results.\n\nEarnings per share: 68 cents adjusted versus 64 cents per share expected by LSEG.\n\nRevenue: $30.04 billion versus $28.7 billion expected by LSEG.\n\nNvidia said it expected about $32.5 billion in current quarter revenue, versus $31.77 billion expected by analysts, according to StreetAccount.\n\nNvidia is the primary beneficiary of the ongoing artificial intelligence boom. Its market value has expanded more than nine times since the end of 2022 and was up 34% since the company’s last earnings report.  \n\nNvidia said it approved $50 billion in share buybacks.\n\nSource: https://www.cnbc.com/2024/08/28/nvidia-nvda-earnings-report-q2-2025.html",
  "link_flair_text": null,
  "id": "1f3judv",
  "num_comments": 603,
  "created_utc": 1724876861,
  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/",
  "comments": [
    {
      "id": "lkea5nw",
      "score": 828,
      "body": "Stock price down because these are Earth shattering results but not universe shattering results.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkea5nw/",
      "created": 1724878281,
      "depth": 0,
      "replies": [
        {
          "id": "lkgfqxx",
          "score": 98,
          "body": "If the results don’t have me bleeding from the eyes after opening the ark of the covenant I don’t want it",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkgfqxx/",
          "created": 1724907775,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkelvqo",
          "score": 107,
          "body": "Or the stock price is just up, based on everyone taking out loans to become ‘easy millionaires’. Spike didn’t happen, so all that money needs to go back to paying down the margin debt.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkelvqo/",
          "created": 1724882256,
          "depth": 1,
          "replies": [
            {
              "id": "lkhnj8n",
              "score": 10,
              "body": "don't be surprised if the price is up by closing bell.  logic has no place in the stock market.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkhnj8n/",
              "created": 1724933355,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkgjcfs",
          "score": 24,
          "body": "People don’t understand this was already priced in. Stock is went up almost 50% in a month. This is just a slight pull back. NVDA will be $150+ in 3 months. Remind me! 3 months",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkgjcfs/",
          "created": 1724909785,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lke9nrc",
      "score": 1290,
      "body": "Shareholders really set themselves up for infinite money and now got mad by making up unreal expectations.\n\nThose numbers are unreal in any other circumstance.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9nrc/",
      "created": 1724878032,
      "depth": 0,
      "replies": [
        {
          "id": "lkethe4",
          "score": 636,
          "body": "I really don't understand how expectations work anymore. NVDA somehow misses expectations by not exceeding expectations enough.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkethe4/",
          "created": 1724884796,
          "depth": 1,
          "replies": [
            {
              "id": "lkf0pmw",
              "score": 178,
              "body": "\"No one exceeds his potential, it would mean that we didn't accurately gauge potential in the first place.\"",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkf0pmw/",
              "created": 1724887241,
              "depth": 2,
              "replies": [
                {
                  "id": "lkfarg1",
                  "score": 29,
                  "body": "Gattaca quote?",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfarg1/",
                  "created": 1724890764,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkfayjx",
                      "score": 53,
                      "body": "I never saved anything for the swim back!",
                      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfayjx/",
                      "created": 1724890835,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lkfwk9b",
                      "score": 6,
                      "body": "what a non flashy sct fi",
                      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfwk9b/",
                      "created": 1724898919,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lkfcip0",
                  "score": 9,
                  "body": "Unexpected gattaca?",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfcip0/",
                  "created": 1724891405,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkgi6se",
                  "score": 4,
                  "body": "Ah yeah the exact shit every manager pulls when it's time to discuss wages.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkgi6se/",
                  "created": 1724909123,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkeu2ip",
              "score": 77,
              "body": "It’s just odds if we know their going to beat expectations by a lot they have to beat by even a bigger margin since the stock already moved up because of the prediction",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeu2ip/",
              "created": 1724884992,
              "depth": 2,
              "replies": [
                {
                  "id": "lkfrh4t",
                  "score": 24,
                  "body": "NVDA's revenues are still statistically going up in a straight line, which beat estimates, but hit my expectations. I liked that they're getting growth everywhere, especially autos, since this is a bad time for other autoparts suppliers. The gained on gaming graphics cards when AMD lost. They beat and raised on sovereign AI demand and projected demand, so that's scaling right now. I think Jensen's tone was overly defensive/annoyed on the conference call, but a lot of the questions felt overly speculative to me, who is biased. It sounds reasonable to me that the Blackwell rollout and scale up is impacting free cash flow and giving a paltry slap to margins. Rolling out a new architecture is an expensive process. Maybe some people are worried about what the yield will be and how that will impact expenses, but yield variability is table stakes for semiconductor stocks. Maybe people are worried that a small buyback signals danger, but what is NVDA supposed to do with the cash if they feel they are already scaling their technology sustainably? For me, it just means I own more.\n\nI wouldn't have guessed this result, and it smarts a little, but I like to remind myself that NVDA is WALL ST's favorite ST trading vehicle and a lot of the float is owned by hedge funds that dip in and out. It's PE goes up and down. Right now, I think its PE is lower than its 5-year average. \n\nOf course, exactly one year ago, NVDA had an earnings report and raised guidance that looked pretty darn good to me, and the market and NVDA pulled back until around November, back when $50 a share was the adjusted high.\n\nI'd like to see what happens tomorrow when there is actual daily volume, as options activity can move stuff a lot more after hours than during the trading day. I don't know what I missed on the call that amounted to a bear narrative. I think it's the expectation that costly problems can occur when you are scaling a new architecture. Redoing a phase mask in response to testing isn't great, but it seems like a par for the course expense. Demand still looks good. Hedge funds can play their games.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfrh4t/",
                  "created": 1724896951,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkgtk3c",
                      "score": 8,
                      "body": ">  I think Jensen's tone was overly defensive/annoyed on the conference call, but a lot of the questions felt overly speculative to me, who is biased.\n\n*Matt Ramsay*:\n\n> But what I'm having discussions about is with like the percentage of folks that you see that are spending all of this money and looking to sort of push the frontier toward AGI convergence and, as you just said, a new plateau in capability, and they're going to spend regardless to get to that level of capability because it opens up so many doors for the industry and for their company versus customers that are really, really focused today on capex versus ROI. I don't know if that distinction makes sense. I'm just trying to get a sense of how you're seeing the priorities of people that are putting the dollars in the ground on this new technology and what their priorities are and their time frames are for that investment.\n\n*Jensen Huang*: \n\n> The people who are investing in NVIDIA infrastructure are getting returns on it right away. It's the best ROI infrastructure, computing infrastructure investment you can make today. And so, one way to think through it, probably the most -- the easiest way to think through it is just go back to first principles.\n\n> You have $1 trillion worth of general-purpose computing infrastructure. And the question is, do you want to build more of that or not? And for every $1 billion worth of Juniper CPU-based infrastructure that you stand up, you probably **rent it** for less than $1 billion. And so, because it's commoditized, there's already $1 trillion on the ground. What's the point of getting more? And so, the people who are clamoring to get this infrastructure, one, when they build out Hopper-based infrastructure and soon, Blackwell-based infrastructure, they start **saving money**.\n\n> That's a tremendous return on investment. And the reason why they start **saving money** is because data processing **saves money**, and data processing is probably just a giant part of it already. And so, recommender systems **save money**, so on and so forth, OK? And so, you start **saving money**. The second thing is everything you stand up are going to **get rented** because so many companies are being founded to create generative AI.\n\n> And so, your capacity **gets rented** right away and the return on investment of that is really good. And then the third reason is your own business. Do you want to either create the next frontier yourself or your own Internet services benefit from a next-generation ad system or a next-generation recommender system or a next-generation search system? So, for your own services, for your own stores, for your own user-generated content, social media platforms, for your own services, generative AI is also a fast ROI. And so, there's a lot of ways you could think through it.\n\n> But at the core, it's because it is the best computing infrastructure you could put in the ground today. The world of general-purpose computing is shifting to accelerated computing. The world of human-engineered software is moving to generative AI software. If you were to build infrastructure to modernize your cloud and your data centers, build it with accelerated computing NVIDIA.\n\nWhich really translates to:\n\n\"We have no idea how you are going to make money with AI other than renting out the excess capacity. You are going to save money if you switch from general purpose compute to tensor multiplication compute, so that we can make money. All we're doing is selling you shovels, whether you're digging gold or your own grave is your problem. Do like startups or something, IDK.\"",
                      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkgtk3c/",
                      "created": 1724916152,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lkfbx3w",
              "score": 45,
              "body": "This is how expectations have always worked. The expectations aren't the expectations, really it's the expectations around the expectations that are the true expectations.\n\nIf you're not expecting that, expect to be surprised by the reaction to results vis a vis expectations.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfbx3w/",
              "created": 1724891187,
              "depth": 2,
              "replies": [
                {
                  "id": "lkfzd3m",
                  "score": 20,
                  "body": "Also reddit is clueless about the type of actual actors. \n\n-- Analysts who research and estimate these numbers (and gets touted in the media) but don't trade at all.\n\n-- Wall Street Traders who typically gauge market sentiment and trade accordingly.\n\n-- Institutional investors who are looking for their own signals of buy/sell (irrespective of estimates)\n\n-- Retail Traders who literally have garbage knowledge of estimates, the actual players, their motivations and signals they are looking for\n\n-- Media, who knows Retail traders are gullible to headlines like meeting and beating estimates and promptly make that as a headline\n\nIf you are really are playing the beating estimates retail game, you are already a loser",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfzd3m/",
                  "created": 1724900049,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkff6zh",
              "score": 21,
              "body": "It’s actually pretty easy. They have a P/E ratio higher than 70. Apple and Google trade at half that and are pretty good at printing money \n\n\nTo keep that up they’d literally have to double quarter over quarter and not year over year. \n\n\nIf they’re going to make loads of money at the rate of Apple then their stock price is going to need to drop by 50%. It just doesn’t make any sense except luring people into a so called stock that will just infinitely go up\n\n\nI think some investors did think they could double quarter over quarter  and that’s what they went all in",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkff6zh/",
              "created": 1724892383,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkffgam",
              "score": 3,
              "body": "The problem is the investors are buying the stocks as if the expected earnings are guaranteed, creating a situation where the stock doesn’t follow fundamentals",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkffgam/",
              "created": 1724892477,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkes7hq",
          "score": 81,
          "body": "It’s AH, not even premarket, or tomorrow’s trading lol. None of this reaction is even real yet and people are throwing in the towel.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkes7hq/",
          "created": 1724884370,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkeasfz",
      "score": 284,
      "body": "RIP to people holding options, premiums were way overpriced and now calls or puts will get IV crushed tomorrow",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeasfz/",
      "created": 1724878534,
      "depth": 0,
      "replies": [
        {
          "id": "lkehdwz",
          "score": 99,
          "body": "So sellers win?",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkehdwz/",
          "created": 1724880781,
          "depth": 1,
          "replies": [
            {
              "id": "lkeu9pq",
              "score": 48,
              "body": "You make less buts it’s honest work",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeu9pq/",
              "created": 1724885058,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkest07",
              "score": 44,
              "body": "It was a good day",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkest07/",
              "created": 1724884569,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkeqzaj",
              "score": 19,
              "body": "Always",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeqzaj/",
              "created": 1724883956,
              "depth": 2,
              "replies": [
                {
                  "id": "lkezd08",
                  "score": 11,
                  "body": "Always? Do you remember spring of 2023?",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkezd08/",
                  "created": 1724886779,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkgerxc",
              "score": 2,
              "body": "Thetagang strikes again",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkgerxc/",
              "created": 1724907249,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lketvmd",
          "score": 14,
          "body": "There's also premarket tomorrow.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lketvmd/",
          "created": 1724884927,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkf8q7c",
          "score": 12,
          "body": "Tomorrow police will have to do mayor checks at the Golden gate or the Verrazzano bridge",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkf8q7c/",
          "created": 1724890036,
          "depth": 1,
          "replies": [
            {
              "id": "lkfhrox",
              "score": 11,
              "body": "I too would rather jump than end up in staten island",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfhrox/",
              "created": 1724893325,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lke9b3b",
      "score": 454,
      "body": "dayummmmmmm! This is all looking nice PLUS a $50 billion in share buybacks?! They are confident. Love to see it!",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9b3b/",
      "created": 1724877043,
      "depth": 0,
      "replies": [
        {
          "id": "lkea54v",
          "score": 255,
          "body": "Their balance sheet is almost comical. $35B cash, $14B A/R, $6B inventory, $5B Property plant and equipment. \n\nWhat else can you do with it, eh?",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkea54v/",
          "created": 1724878274,
          "depth": 1,
          "replies": [
            {
              "id": "lked1yd",
              "score": 20,
              "body": "Acquisitions!",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lked1yd/",
              "created": 1724879330,
              "depth": 2,
              "replies": [
                {
                  "id": "lkf3juc",
                  "score": 5,
                  "body": "Not that they didn't try...",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkf3juc/",
                  "created": 1724888213,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkebs23",
              "score": 132,
              "body": "Lower card prices ? :p",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkebs23/",
              "created": 1724878888,
              "depth": 2,
              "replies": [
                {
                  "id": "lkeca4t",
                  "score": 216,
                  "body": "As a consumer: YES!\n\nAs an investor: NO!\n\n*The duality of man*",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeca4t/",
                  "created": 1724879064,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lked0h9",
                      "score": 124,
                      "body": "As an investor, I buy high.  As a consumer, I buy high.  At least I'm consistent.",
                      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lked0h9/",
                      "created": 1724879316,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkeh936",
                          "score": 12,
                          "body": "Love to see it",
                          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeh936/",
                          "created": 1724880735,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lkep02j",
                      "score": 25,
                      "body": "This is how I can afford my gaming hobby. I invest in nvidia and then give them the money they earned me. Tide goes in, Tide goes out, You can't explain that!",
                      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkep02j/",
                      "created": 1724883290,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lkeofhl",
                      "score": 18,
                      "body": "I buy the stock to be able to afford the cards… circle of life",
                      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeofhl/",
                      "created": 1724883099,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkepypg",
                          "score": 7,
                          "body": "Ah, a fellow savvy investor",
                          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkepypg/",
                          "created": 1724883613,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lkeqh1h",
                      "score": 10,
                      "body": "The new GPU costs more than the entire PC I built 8 years ago. ![gif](emote|free_emotes_pack|feels_bad_man)",
                      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeqh1h/",
                      "created": 1724883784,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lkerp7u",
                  "score": 4,
                  "body": "[https://imgur.com/a/W036Gw0](https://imgur.com/a/W036Gw0)",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkerp7u/",
                  "created": 1724884199,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkepvz0",
              "score": 12,
              "body": "This bastarda should go and purchase Intel, arm or Intel.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkepvz0/",
              "created": 1724883587,
              "depth": 2,
              "replies": [
                {
                  "id": "lkevbv2",
                  "score": 20,
                  "body": "They tried to buy ARM already. ",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkevbv2/",
                  "created": 1724885413,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkfqbl0",
                  "score": 3,
                  "body": "They would if they could but they can't cause they tried and were blocked.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfqbl0/",
                  "created": 1724896520,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkebs63",
              "score": 4,
              "body": "Dividends, no?",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkebs63/",
              "created": 1724878889,
              "depth": 2,
              "replies": [
                {
                  "id": "lkecf5i",
                  "score": 31,
                  "body": "They pay a (tiny) dividend, but buybacks give much more flexibility and are more tax efficient.  \n\nThe US culture of sticky, rising dividends doesn’t mesh well with the boom / bust of the semi industry.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkecf5i/",
                  "created": 1724879112,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkfjoc8",
          "score": 22,
          "body": "$50B buybacks at this valuation is poor capital use. Invest that money in more R&D, some acquisition or increase the dividend (which is a ridiculous $0.01 per share)",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfjoc8/",
          "created": 1724894035,
          "depth": 1,
          "replies": [
            {
              "id": "lkfqqua",
              "score": 36,
              "body": "They're restricted from acquisitions. They tried to buy ARM but didn't get regulatory approval.\n\nR&D spend is already as high as it should be.\n\nThe dividend should be increased but that's about the only viable option in your little list there.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfqqua/",
              "created": 1724896679,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkfm2fr",
              "score": 14,
              "body": "Buybacks are tax efficient though, and they're already balls deep in R&D. The timing of buybacks isn't decided yet.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfm2fr/",
              "created": 1724894927,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkfjvsp",
          "score": 18,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfjvsp/",
          "created": 1724894113,
          "depth": 1,
          "replies": [
            {
              "id": "lkfs3et",
              "score": 11,
              "body": "Tells me they lack obvious investments",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfs3et/",
              "created": 1724897186,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lke9omu",
      "score": 76,
      "body": "Great googly moogly",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9omu/",
      "created": 1724878044,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lke9bvs",
      "score": 185,
      "body": "It beats handsomely however there is a hint of slowing down in its impressive growth rate.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9bvs/",
      "created": 1724877279,
      "depth": 0,
      "replies": [
        {
          "id": "lkeat6g",
          "score": 204,
          "body": "It has to slow down at some point. It's impossible to grow exponentially indefinitely.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeat6g/",
          "created": 1724878541,
          "depth": 1,
          "replies": [
            {
              "id": "lkfm4mo",
              "score": 46,
              "body": "Nvidia announces they will be building a Dyson sphere to power their cloud compute platform.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfm4mo/",
              "created": 1724894949,
              "depth": 2,
              "replies": [
                {
                  "id": "lkfzezh",
                  "score": 11,
                  "body": "And stock still goes down 10-15% because of perfectionists.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfzezh/",
                  "created": 1724900070,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkeo506",
              "score": 79,
              "body": "How dare you say that!",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeo506/",
              "created": 1724883001,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkeqpft",
              "score": 16,
              "body": "Thats false though. Inflation already grows exponentially. 1.02^x for 2% inflation",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeqpft/",
              "created": 1724883863,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkeembd",
          "score": 42,
          "body": "I mean the stock will obviously slow down eventually. Historically NVIDIA has had highly cyclical earnings.\n\nTheir biggest companies are basically saying on their earnings calls right now that it's less risky to over-invest in AI/servers for AI services than to under invest. Which means that at some point there's inevitably going to be a glut in the market when demand slows/etc., and all that over-investment fueling their growth today will work against them tomorrow.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeembd/",
          "created": 1724879852,
          "depth": 1,
          "replies": [
            {
              "id": "lkf2o6v",
              "score": 16,
              "body": "Very accurate take. Microsoft, Google, Meta, Amazon, and Tesla make up 50% of their revenue with Microsoft alone making up 20%. In the next few quarters those companies needs to show that the billions they spent is providing some form of return, otherwise they would be a significant cut back on their spendings.\n\nHopefully AI will not be a repeat of the dot-com bubble. Intel and Cisco grew massively in a very similar fashion between 1997 and 2000. After the bubble burst, neither company reach those ATH prices again.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkf2o6v/",
              "created": 1724887908,
              "depth": 2,
              "replies": [
                {
                  "id": "lkfepn9",
                  "score": 12,
                  "body": "I think Cisco is the best example because their networking equipment had huge demand until companies realised they didn't need it anymore. If big tech realise AI is not so easy to make profit from, they'll buy less chips – that's in addition to any competition that may arise in that time.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfepn9/",
                  "created": 1724892206,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkfdvkp",
              "score": 9,
              "body": "If AI pans out commercially it could be a long time before they slow down.\n\nThe spoils go to the biggest brain and you can make your brain bigger by just adding more cards.\n\nAI is not like the internet where eventually every office has a network drop. There is no theoretical limit bounding how much processing these things need.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfdvkp/",
              "created": 1724891899,
              "depth": 2,
              "replies": [
                {
                  "id": "lkg4fqo",
                  "score": 4,
                  "body": ">There is no theoretical limit bounding how much processing these things need.\n\nActually there is a different limit, the availability of excess grid capacity to power these primary data center hubs. These new AI focused data centers have far more dense compute than even typical large data centers and are already starting to put a severe strain on local utilities. \n\nIf that trend continues/accelerates, driving up local customer rates along the way, look for the government to get more involved. The discussions are already happening in DC in the US, which is by far the largest data center market on Earth currently and it's not close.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkg4fqo/",
                  "created": 1724902216,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lke9rr9",
          "score": 29,
          "body": "This is exactly why it’s selling after hours.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9rr9/",
          "created": 1724878088,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lke9c14",
          "score": 26,
          "body": "Law of large numbers.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9c14/",
          "created": 1724877325,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lke9v6v",
          "score": 14,
          "body": "They also provided guidance beyond expectations.. so..",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9v6v/",
          "created": 1724878139,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkhikgd",
          "score": 2,
          "body": "Decelerating growth rate (still like 100+% yoy) but accelerating FCF. I think the kind of investor has been changing for NVDA, but the decade long story is still going strong.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkhikgd/",
          "created": 1724931184,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lke9nva",
      "score": 162,
      "body": "That balance sheet is beautiful. I’m not sure there’s a more financially sound company out there. \n\nGrowth is slowing as expected but still at high rates. Overall the earnings seem pretty good but we’ll find out more on the conference call.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9nva/",
      "created": 1724878033,
      "depth": 0,
      "replies": [
        {
          "id": "lkf7yk7",
          "score": 43,
          "body": "It’s funny…this was Intels balance sheet just 10-12 years ago.\n\nBack in Intel’s heyday they stacked cash on top of cash and now it’s the only reason the company is able to spend like Mag7 right now despite their declining market position.\n\nSad story. Used to be a great company.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkf7yk7/",
          "created": 1724889762,
          "depth": 1,
          "replies": [
            {
              "id": "lkfhdew",
              "score": 16,
              "body": "Yeah. A strong balance sheet doesn’t promise future success, but it helps big time.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfhdew/",
              "created": 1724893181,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkg3arx",
              "score": 7,
              "body": "Not from a tech standpoint. Intel was straight up coasting 10 years ago and they released an architecture that actually performed worse than the previous one in a lot of cases.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkg3arx/",
              "created": 1724901715,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkfeaui",
              "score": 17,
              "body": "Which is kinda the danger here. Nothing is guaranteed with NVDA. Could still go up but it's more likely that you won't see huge outperformance from here.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfeaui/",
              "created": 1724892055,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkebyb5",
          "score": 83,
          "body": "8% for a $3Tn company is insanity.  Maybe if a few people jump off the crazy (expectations) train, we'll see less volatility finally.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkebyb5/",
          "created": 1724878948,
          "depth": 1,
          "replies": [
            {
              "id": "lker5ch",
              "score": 38,
              "body": "8% if QoQ. For a company that just did $30 billion in a quarter, that’s pretty good.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lker5ch/",
              "created": 1724884012,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkf8toa",
              "score": 23,
              "body": "8% of 3Tn is exactly equal to AMD's mkt cap  ![gif](emote|free_emotes_pack|joy)  \n\nThis should give people an idea of its scale. A day's price move equals gulping down entire market cap of its nearest competitor.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkf8toa/",
              "created": 1724890070,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkeecu6",
          "score": 14,
          "body": "What’s beautiful about the balance sheet - please elaborate :)",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeecu6/",
          "created": 1724879763,
          "depth": 1,
          "replies": [
            {
              "id": "lkez5at",
              "score": 23,
              "body": "$34B cash, $14B AR, 27B is total liabilities, $0 short term debt. Find me a company that can settle ALL of it's liabilities today with cash to spare. 55% net income...",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkez5at/",
              "created": 1724886706,
              "depth": 2,
              "replies": [
                {
                  "id": "lkfaw3p",
                  "score": 30,
                  "body": "Have you heard of Apple?",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfaw3p/",
                  "created": 1724890811,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkfgeq6",
                      "score": 13,
                      "body": "How about GOOGL with $100B cash",
                      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfgeq6/",
                      "created": 1724892826,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lkfh28q",
                      "score": 4,
                      "body": "Apple has 133 billion of liabilities and 25 billion of cash. They have a good balance sheet but not this clean.",
                      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfh28q/",
                      "created": 1724893068,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lkfe2kp",
                  "score": 20,
                  "body": "Like, all of big tech? Lol.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfe2kp/",
                  "created": 1724891970,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lke9bmb",
      "score": 202,
      "body": "Down 5.16% after hours.   Man, expectations must of have been HIGH.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9bmb/",
      "created": 1724877193,
      "depth": 0,
      "replies": [
        {
          "id": "lkea7ms",
          "score": 107,
          "body": "Reality is growth is slowing very rapidly. The numbers still look big YoY but they just guided for 8% QoQ growth which is a big slow down looking forward.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkea7ms/",
          "created": 1724878305,
          "depth": 1,
          "replies": [
            {
              "id": "lkenmq1",
              "score": 27,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkenmq1/",
              "created": 1724882832,
              "depth": 2,
              "replies": [
                {
                  "id": "lkff0ui",
                  "score": 9,
                  "body": ">The buyback announcement just seems weird\n\nI would've thought it makes more sense to hold the cash for now, particularly as their market cap has exploded and might not sustain that forever.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkff0ui/",
                  "created": 1724892320,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkfk7vb",
                  "score": 3,
                  "body": "Unless theres some massive AI breakthrough that changes everything but theres no way to predict that",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfk7vb/",
                  "created": 1724894238,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkeaoc9",
              "score": 57,
              "body": "It's impossible to have 122% YoY growth indefinitely. There is such a thing as market saturation.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeaoc9/",
              "created": 1724878492,
              "depth": 2,
              "replies": [
                {
                  "id": "lkearzn",
                  "score": 44,
                  "body": "Yea I agree. Although you’d be hard pressed to convince some Nvidia investors of that.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkearzn/",
                  "created": 1724878529,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkecqug",
                  "score": 6,
                  "body": "No actually if you go back as early as one or two quarters ago people were expecting them to continue doing that because \"supply is still restrained\"",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkecqug/",
                  "created": 1724879225,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkee1ap",
                  "score": 6,
                  "body": "Everyone knows that. What we are betting on is the WHEN that saturation is coming. If they kept up exponential growth for 4 more Qs , then you could expect stock exploding more. But you can’t justify that with just higher than average growth etc. \nThen when saturated, we can bet on if it’s just a short term fad or infrastructure buildout followed by the demand drop off like CISCO and the internet in 2000s. Or is it something long term and actually useful for companies",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkee1ap/",
                  "created": 1724879657,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkebqgh",
                  "score": 8,
                  "body": "The stock prices in unlimited growth though.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkebqgh/",
                  "created": 1724878872,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkednoi",
                  "score": 2,
                  "body": "It’s not a market saturation issue. It’s a supply issue. Nvidia is selling everything they make however CoWoS and HBM capacity constraints are limiting them from making more. If those bottlenecks were alleviated growth would still be great.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkednoi/",
                  "created": 1724879532,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkesnwm",
                  "score": 2,
                  "body": "Then why would you pay like 40x revenue?",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkesnwm/",
                  "created": 1724884522,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkedgre",
                  "score": 7,
                  "body": "Yeah but AI is at the \"Apple II\" level of where it will eventually be.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkedgre/",
                  "created": 1724879468,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkeewo2",
                      "score": 12,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeewo2/",
                      "created": 1724879948,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkehian",
                          "score": 25,
                          "body": "Have you played with chatgpt 4o? \n\nIt's extremely good at solving lots of business issues, charting, financial work, invoicing, etc. \n\nI literally sat down with it the other day and built a linear regression on sales data to true-up retail prices for lenses, in about 15 minutes. It's really insane what it can do, but people have to start using it like a super smart friend that can figure shit out properly if you explain what you want properly. It'll get there.",
                          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkehian/",
                          "created": 1724880821,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lkff6p5",
                              "score": 5,
                              "body": "Have you seen how badly people use Google?",
                              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkff6p5/",
                              "created": 1724892379,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lkep77n",
                              "score": 6,
                              "body": "More than half the problem is being able to ask the proper question in the proper way to get the \"right\" answer. That means you must be the smart one. Which leaves me out anyway.",
                              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkep77n/",
                              "created": 1724883357,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lkepohu",
                                  "score": 15,
                                  "body": "For fun, go try chatgpt 4o, grab some excel sheet of data you're interested in, upload it and just start asking it questions about the data. You might need to tell it to \"look at column D\" and so on a bit, but holy shit it can do amazing things. \n\n\"Graph the top 10 most profitable items and predict their trajectory in 6 months\"\n\nIt's going to change a lot of things.\n\nHell, if you have access to a Linux system, send it a link to a website with a login and tell it to write you a script that can login, and output the raw web code to the screen.\n\nThen copy and paste the output and literally say \"it gave me this. Now I want to be able to pull down (whatever you're interested in)\" and it'll update the code step by step. These are just simple examples.\n\nEdit: Another thing, I was able to take pictures of a board game, upload the pictures, and have it learn how to play World In Flames. I uploaded the rule books, then took pictures of the board state with my fucking phone and after some teaching it was able to play the game! Nuts. I would tell it to reference pages in the rulebook and stuff. It's just insane. But this is going to take a while for people to start opening up with using it.",
                                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkepohu/",
                                  "created": 1724883517,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lkeqe9g",
                                      "score": 5,
                                      "body": "Thanks for the advice! I appreciate the help.",
                                      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeqe9g/",
                                      "created": 1724883758,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lkebz47",
              "score": 7,
              "body": "That’s 32% YOY if you annualize it. It’s pretty damn good for 30b a quarter revenue.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkebz47/",
              "created": 1724878956,
              "depth": 2,
              "replies": [
                {
                  "id": "lkecmqi",
                  "score": 18,
                  "body": "What you’re paying for that growth matters. \n\nThere are also a lot of other risks to their profit margins in the medium term. Namely, the majority of data center sales are to 5-6 companies that are investing loads of cash to replace their dependence on Nvidia. Every big tech is developing their own AI accelerator. Google uses their own TPU. Amazon has their Trainium and Inferentia chips. Microsoft has their Maia chip. Meta has their MTIA chip. Tesla has Dojo. Apple has their own silicon for on-device. Then you have AMD coming on strong with their GPUs and companies like Groq that are improving on inferencing costs over Nvidia with their LPU. \n\nNvidia’s biggest customers are also their biggest competitors who also have the deepest pockets in the world. And nvidia is only a chip designer they don’t actually make anything. So every other big tech can pay TSMC to make their chip designs.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkecmqi/",
                  "created": 1724879185,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkeemvi",
                      "score": 6,
                      "body": "Google started using their TPUs internally in 2015....seems weird after 9 years they're still not good enough to replace their needs. Maybe they can do it in another 9 years but who knows what life will be like by than.",
                      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeemvi/",
                      "created": 1724879857,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkeetoq",
                          "score": 8,
                          "body": "Google actually uses TPU for all their own training needs. They buy GPUs for people who want to rent them on Google Cloud.",
                          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeetoq/",
                          "created": 1724879920,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lkefyv8",
                          "score": 4,
                          "body": "In case you wondering here's their technical blog explaining how they use TPU for their own needs.\n\n[https://blog.google/technology/ai/google-gemini-ai/](https://blog.google/technology/ai/google-gemini-ai/)\n\n>We trained Gemini 1.0 at scale on our AI-optimized infrastructure using Google’s in-house designed [Tensor Processing Units](https://cloud.google.com/tpu?hl=en) (TPUs) v4 and v5e. And we designed it to be our most reliable and scalable model to train, and our most efficient to serve.\n\n>On TPUs, Gemini runs significantly faster than earlier, smaller and less-capable models. These custom-designed AI accelerators have been at the heart of Google's AI-powered products that serve billions of users like Search, YouTube, Gmail, Google Maps, Google Play and Android. They’ve also enabled companies around the world to train large-scale AI models cost-efficiently.\n\n>Today, we’re announcing the most powerful, efficient and scalable TPU system to date, [Cloud TPU v5p](https://cloud.google.com/blog/products/ai-machine-learning/introducing-cloud-tpu-v5p-and-ai-hypercomputer), designed for training cutting-edge AI models. This next generation TPU will accelerate Gemini’s development and help developers and enterprise customers train large-scale generative AI models faster, allowing new products and capabilities to reach customers sooner.",
                          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkefyv8/",
                          "created": 1724880305,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lkeirwe",
                          "score": 5,
                          "body": "Google does all their stuff on TPUs.   Anthropics and now Apple also are using.\n\nThey only rent the Nvidia hardware to Google Cloud customers where the company has standardize on Nvidia.\n\nOtherwise everyone uses the TPUs.",
                          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeirwe/",
                          "created": 1724881244,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lke9n56",
          "score": 39,
          "body": "They actually beat expectations",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9n56/",
          "created": 1724878023,
          "depth": 1,
          "replies": [
            {
              "id": "lkeae80",
              "score": 49,
              "body": "The expectations to beat the expectations must be really high..../s",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeae80/",
              "created": 1724878383,
              "depth": 2,
              "replies": [
                {
                  "id": "lkeaz97",
                  "score": 11,
                  "body": "max recursion depth exceeded",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeaz97/",
                  "created": 1724878603,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkeoerh",
                  "score": 3,
                  "body": "I don't think the /s was necessary",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeoerh/",
                  "created": 1724883092,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkeanbz",
              "score": 12,
              "body": "They beat public expectations but not whisper expectations",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeanbz/",
              "created": 1724878481,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkea18u",
              "score": 10,
              "body": "Yes but the guy is probably referring to the expectations of the wider market, not the experts. It shows how clownish the market has become. Makes me question what even the point of analysts making expectations anymore. The market basically goes \"oh they have to beat expectations by a huge margin for me to be satisfied\" which of course is unrealistic. Oh well, I will just buy more for a lower price.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkea18u/",
              "created": 1724878224,
              "depth": 2,
              "replies": [
                {
                  "id": "lkebuum",
                  "score": 5,
                  "body": "Anybody relying on retail investor sentiment is crazy.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkebuum/",
                  "created": 1724878915,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkegctk",
                      "score": 3,
                      "body": "For a company at $3T market cap, opinions of retail investors don't matter I think.",
                      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkegctk/",
                      "created": 1724880434,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lkedy2m",
              "score": 3,
              "body": "They didnt beat expectations of expectations… that’s why",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkedy2m/",
              "created": 1724879627,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkeb0vr",
              "score": 3,
              "body": "I really don’t understand our stock market 🫠",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeb0vr/",
              "created": 1724878619,
              "depth": 2,
              "replies": [
                {
                  "id": "lkebrjo",
                  "score": 14,
                  "body": "NVDA has beat earnings consistently.  So, people expect that. Everyone was confident they would beat.\n\nThey beat by the forecasted amount, but they didn't beat the expected amount.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkebrjo/",
                  "created": 1724878883,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkefs23",
              "score": 2,
              "body": "They beat expectations by the least amount in 6 quarters. So yeah expectations were higher given the track record that they would beat said expectations by a wider margin.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkefs23/",
              "created": 1724880241,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkei04r",
          "score": 18,
          "body": "Wouldn’t be surprised if it’s green soon after open tomorrow",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkei04r/",
          "created": 1724880987,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkecbuk",
          "score": 3,
          "body": "They are expected to beat next quarter sales expectations by 10% every quarter. Analysts expected 31.8b and they guided 32.5b. beating reporting quarter expectation is already assumed.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkecbuk/",
          "created": 1724879081,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lke9q9x",
          "score": 2,
          "body": "Yeah I think some were expecting 32Bn in rev",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9q9x/",
          "created": 1724878065,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkeaetq",
      "score": 74,
      "body": "Good news: beat again, margins still 74-75%, $50b buyback plan, guided higher for next quarter which they’ll surely beat again \n\nBad news: they barely beat lofty expectations (by 4 cents EPS). Bar keeps getting higher \n\nOverall thoughts are minimal stock movement is good news and stock will gradually move higher until next ER. Other tech stocks will continue to benefit. Ignore AH volatility, won’t make a difference in coming days",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeaetq/",
      "created": 1724878391,
      "depth": 0,
      "replies": [
        {
          "id": "lkebnjt",
          "score": 22,
          "body": "World no 1 company and they don’t have projects to fund 50 billion? Given its 3 trillion valuation… buy back is negligible.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkebnjt/",
          "created": 1724878843,
          "depth": 1,
          "replies": [
            {
              "id": "lket1q0",
              "score": 20,
              "body": "The 50B buyback doesn't have a time limit, it could be over the next 10 years if needed.  \nThey could also take the opportunity to repurchase stock when there's a dip.  \nAlso keep in mind that whenever they give stock grants to employees, they're creating shares, so the buyback is also about compensating for this share creation.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lket1q0/",
              "created": 1724884650,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkee359",
              "score": 18,
              "body": "Better than pissing money away on things like autonomous driving and metaverse",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkee359/",
              "created": 1724879674,
              "depth": 2,
              "replies": [
                {
                  "id": "lkeh77e",
                  "score": 40,
                  "body": "Research and innovation doesn't work this way. We don't have a foolproof way to invent things without wasting resources. If we did, innovation wouldn't be so difficult.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeh77e/",
                  "created": 1724880718,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkeazvf",
          "score": 3,
          "body": "Thank you 🙏",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeazvf/",
          "created": 1724878609,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkelm9k",
      "score": 14,
      "body": "Well, I was hoping to get a short-term win at my cost basis of around $119 (could have already, heh), but now I'm certainly just holding given the tumbling down. If anything, I'll add more.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkelm9k/",
      "created": 1724882170,
      "depth": 0,
      "replies": [
        {
          "id": "lkexgs9",
          "score": 3,
          "body": "I bought in at $80. If it goes back to that level despite its growth story still being in tact, I will load up more for sure.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkexgs9/",
          "created": 1724886131,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lke9aog",
      "score": 37,
      "body": "Jesus christ.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9aog/",
      "created": 1724876934,
      "depth": 0,
      "replies": [
        {
          "id": "lkea7tu",
          "score": 44,
          "body": "It’s Jensen Bourne!",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkea7tu/",
          "created": 1724878307,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkeebzz",
      "score": 32,
      "body": "Beat guidance by more than a billion but still down.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeebzz/",
      "created": 1724879755,
      "depth": 0,
      "replies": [
        {
          "id": "lkfg6ut",
          "score": 14,
          "body": "That's the difference between market expectations and analyst expectations.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfg6ut/",
          "created": 1724892747,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lke9bq6",
      "score": 42,
      "body": "Down 5%. Seems like the market is underwhelmed.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9bq6/",
      "created": 1724877229,
      "depth": 0,
      "replies": [
        {
          "id": "lkeacaz",
          "score": 115,
          "body": "Nvidia - \"Hey, the revenue expectation was $28 billion, we did $30 billion!\"  \nMarket - \"Fuck you, why didn't you do $100 billion?\"",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeacaz/",
          "created": 1724878361,
          "depth": 1,
          "replies": [
            {
              "id": "lkeb1dk",
              "score": 100,
              "body": "Is the market Asian parents?",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeb1dk/",
              "created": 1724878624,
              "depth": 2,
              "replies": [
                {
                  "id": "lkecdo9",
                  "score": 27,
                  "body": "Little Timmy did 100 billion. He’s five",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkecdo9/",
                  "created": 1724879098,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkedt06",
                      "score": 15,
                      "body": "Emotional damage.",
                      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkedt06/",
                      "created": 1724879580,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lkeepwe",
              "score": 5,
              "body": "TIL the market is my Asian dad",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeepwe/",
              "created": 1724879885,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkedy5i",
          "score": 8,
          "body": "The market mostly does not want to pay out all those 130 call options.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkedy5i/",
          "created": 1724879628,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkebc8v",
          "score": 20,
          "body": "Because crazy growth was *already* priced in. Beating estimates isn't where the price *was.* The price already reflected obliterating estimates.\n\nYou don't beat estimates and then say \"well okay, a PE of 75 isn't outrageous, let's keep buying until we get a PE of 125.\"  A PE of 75 is already huge. It's expecting massive, abnormal growth.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkebc8v/",
          "created": 1724878734,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lke9c1z",
          "score": 2,
          "body": "Now 3.61% Now 3.82%- quite volatile\n\nNow down 0.86%.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9c1z/",
          "created": 1724877333,
          "depth": 1,
          "replies": [
            {
              "id": "lkenbar",
              "score": 2,
              "body": "Reached -8.50% just now. 2 more hours to go...",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkenbar/",
              "created": 1724882729,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lket4oo",
          "score": 2,
          "body": "People are trying to make sense of the reaction - news flash: the market is irrational. You are reading tea leaves to explain why when the reality is that the market’s gunna market. Long term this is beautiful.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lket4oo/",
          "created": 1724884677,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkebgq1",
      "score": 58,
      "body": "Market acting like entitled fat teenager who didn't get enough fries with his Mcdonalds menu",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkebgq1/",
      "created": 1724878777,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkeobip",
      "score": 6,
      "body": "I’m honestly confused if this is a good buy or bad buy right now",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeobip/",
      "created": 1724883062,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkect5r",
      "score": 11,
      "body": "Down so they can iv crush everyone options never win nowadays",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkect5r/",
      "created": 1724879247,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkfv22l",
      "score": 5,
      "body": "Imagine thinking 78% growth down to 76% is so terrible it warrants a 8% sell off.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfv22l/",
      "created": 1724898330,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkemmks",
      "score": 12,
      "body": "These earnings really disappoint me. I was expecting 5000% revenue growth. Time to sell.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkemmks/",
      "created": 1724882500,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkgcqmw",
      "score": 4,
      "body": "They made 30 billions in revenue...let that sink in.\n\nHow much did other companies make?",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkgcqmw/",
      "created": 1724906182,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkgwsp1",
      "score": 4,
      "body": "The reason the shares fell 4% is likely due to hedging and derisking from institutions ahead of the earnings, not due to crazy unrealistic expectations. We are likely going to see the price play yoyo at market opening and stabilise around 130.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkgwsp1/",
      "created": 1724918332,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkhiagk",
      "score": 3,
      "body": "Incredible report once again. People are complaining about deceleration in revenue growth are, in my opinion, willfully turning a blind to the acceleration in FCF. $50B buyback and next gen computer requirements will continue to be a decades long driver. I think this is a multi-decade story and view this selling as an opportunity to buy.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkhiagk/",
      "created": 1724931055,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lke9sde",
      "score": 7,
      "body": "In NVDA’s valuation, this is meet at the best",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9sde/",
      "created": 1724878097,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lke9buh",
      "score": 3,
      "body": "Anything mentioned in the MD&A re: Blackwell delays?",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9buh/",
      "created": 1724877268,
      "depth": 0,
      "replies": [
        {
          "id": "lke9dak",
          "score": 11,
          "body": "They said they expect a few billion in revenue from Blackwell in Q4.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9dak/",
          "created": 1724877778,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lke9mzf",
          "score": 4,
          "body": "They said there will be a few bil in rev from it in Q4, but some changes will need to be made for producing Blackwell. I believe that's what panicked everyone and caused it to go down.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9mzf/",
          "created": 1724878020,
          "depth": 1,
          "replies": [
            {
              "id": "lkeyftv",
              "score": 3,
              "body": "That could not have been the cause for it to dip since it dipped before the call.\nIt probably dipped because people expected NVIDIA to beat expectations even more (as stupid as that sounds). \nI am not worried since one big reason for slowing growth is the bottleneck of production. As long as demand keeps being high, NVIDIA will eventually get the cash.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeyftv/",
              "created": 1724886464,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkejap0",
      "score": 3,
      "body": "Blow-Out returns when compared to quarter year over year, and from last quarter. But everybody looks at expected 019 returns.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkejap0/",
      "created": 1724881416,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkeqioz",
      "score": 3,
      "body": "How to check which institutions sell?",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeqioz/",
      "created": 1724883799,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkfdu8f",
      "score": 3,
      "body": "Im buying more, after hours.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfdu8f/",
      "created": 1724891885,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkfztns",
      "score": 3,
      "body": "Lol. This explains why so many Semiconductor stocks were down today. Classic Wall Street.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkfztns/",
      "created": 1724900239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkg1hcc",
      "score": 3,
      "body": "Growing inventory by 2 billion and 50% increase in accounts receivable but yeah “demand outstrips supply”",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkg1hcc/",
      "created": 1724900929,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkgvlud",
      "score": 3,
      "body": "This is a tech stock, and volatility comes with the territory. Nvidia’s valuation has skyrocketed, and while it’s the clear winner in the AI gold rush, remember Warren Buffett’s old rule: price is what you pay, value is what you get.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkgvlud/",
      "created": 1724917525,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkieiwo",
      "score": 3,
      "body": "At this point I'd rather buy NVIDIA stock, at least I can buy that.\n\nProbably won't be able to buy their gpus anymore.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkieiwo/",
      "created": 1724942803,
      "depth": 0,
      "replies": [
        {
          "id": "lkieudt",
          "score": 2,
          "body": "I know right",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkieudt/",
          "created": 1724942900,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkjhhzg",
      "score": 3,
      "body": "Insane, nvidia is doing impressive stuff",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkjhhzg/",
      "created": 1724954592,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkjhrdc",
      "score": 3,
      "body": "Makes zero sense. Good report. 50 Billion stock buyback. I wonder how much of this is people that have had it in their portfolio for a decade and made money and are now taking gains and diversifying into blue chip dividend stocks like every boomer I know that bought 5-10k worth of NVDA in 2016 and didn’t even know what they did. Take a look at any stock in your portfolio today. Say you bought 5K of proctor and Gamble. If in 15 years somehow they invent the next big thing and it’s now worth $800,000? What would you do… take your gains. I’ve got 20 positions similar to a 2016 NVDA position and if anything at all happens to one of those companies and it becomes 75% of my portfolio by accident…. I’m riding off into the sunset and diversifying.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkjhrdc/",
      "created": 1724954672,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkek7ma",
      "score": 21,
      "body": "Stock down 6% in AH at the moment. This is ridiculous. The company beats the estimates, but not enough according to whoever was expecting/wanted more than the estimates. \n\nIt's such nonsense. Long and hold. 140 by year end.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkek7ma/",
      "created": 1724881715,
      "depth": 0,
      "replies": [
        {
          "id": "lkex0br",
          "score": 4,
          "body": "While the numbers alone might suggest that selling is justified (considering the current valuation), relying solely on quantitative analysis would be shortsighted. It’s essential to consider why NVIDIA garnered such enthusiasm in the first place: they hold a monopoly on a critical component in a rapidly expanding market, with substantial investments from nearly every major player across various industries. The demand for their products currently exceeds supply, and their highly anticipated flagship product has yet to be released. Given these factors, the stock still appears undervalued.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkex0br/",
          "created": 1724885977,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkej857",
      "score": 5,
      "body": "Revenue will be chill the next 2 quarters until Blackwell is sold and a money well is created in the market.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkej857/",
      "created": 1724881393,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkeyxkl",
      "score": 5,
      "body": "10-2 year is above 0. Money is fleeing to safety. We hit the point where good news is bad news and bad news is bad news",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeyxkl/",
      "created": 1724886633,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lke9c3s",
      "score": 11,
      "body": "Growth peaked",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9c3s/",
      "created": 1724877352,
      "depth": 0,
      "replies": [
        {
          "id": "lke9gug",
          "score": 24,
          "body": "I mean… guiding 8% QoQ growth is nothing to sneeze at.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9gug/",
          "created": 1724877925,
          "depth": 1,
          "replies": [
            {
              "id": "lkea883",
              "score": 11,
              "body": "Most dudes would kill for 8% growth.",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkea883/",
              "created": 1724878312,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkeb0tl",
              "score": 6,
              "body": "Not great for a company with a PE over 35",
              "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeb0tl/",
              "created": 1724878619,
              "depth": 2,
              "replies": [
                {
                  "id": "lkebuwj",
                  "score": 17,
                  "body": "8% quarterly is 36% annualized.  Even without any margin improvement, a 35x trailing would be a 25x forward multiple.",
                  "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkebuwj/",
                  "created": 1724878915,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lketfbi",
                      "score": 2,
                      "body": "It isn’t 36% annualized. Growth has slowed massively",
                      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lketfbi/",
                      "created": 1724884777,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lkeeuwf",
          "score": 2,
          "body": "No it’s the second derivative that may have peaked.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeeuwf/",
          "created": 1724879932,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkeajhy",
          "score": 3,
          "body": "The hype peaked.",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeajhy/",
          "created": 1724878441,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkg2omn",
      "score": 2,
      "body": "..and the stock went down. \n\nCrazy times.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkg2omn/",
      "created": 1724901445,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkg8fbs",
      "score": 2,
      "body": "Buy the rumor sell the new - happened. It may take a breather for a few days before surging again. Don’t lose sleep over it.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkg8fbs/",
      "created": 1724904050,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkgbke2",
      "score": 2,
      "body": "Are there any nvda shorters here? I see the price to earnings is like 75. How is that not overvalued?",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkgbke2/",
      "created": 1724905587,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkgo88w",
      "score": 2,
      "body": "I’m not sure if the price drop is because some expectations were missed, or rather because investors are happy with the performance, have reached the set goals for NVIDIA and are selling, potentially because they don’t expect the price to massively increase again in the coming period (i.e. put money elsewhere in anticipation of better returns).",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkgo88w/",
      "created": 1724912745,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkgw089",
      "score": 2,
      "body": "How do they keep doing it, lol.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkgw089/",
      "created": 1724917795,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkgz4fj",
      "score": 2,
      "body": "Its funny how you people think you're betting by the shareholders opinion in reality is youre betting against Option traders. Options alone probably exceeds overall share cap so if call options through the roof they will short the stock what ever it costs.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkgz4fj/",
      "created": 1724919894,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkholm3",
      "score": 2,
      "body": "People weren’t buying Nvidia like crazy because of revenue growth or fundamentals.\nThey bought because they thought they could quickly double their money.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkholm3/",
      "created": 1724933797,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkhvbc3",
      "score": 2,
      "body": "So... stock is going to get crushed even more when US floors open today?",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkhvbc3/",
      "created": 1724936426,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkiazkk",
      "score": 2,
      "body": "Stock is cheaper today, literally and valuation wise, than yesterday. Why are you people not buying?! Get greedy when people get fearful!",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkiazkk/",
      "created": 1724941703,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkj0aju",
      "score": 2,
      "body": "Why doesn't Nvidia make a CPU?",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkj0aju/",
      "created": 1724949410,
      "depth": 0,
      "replies": [
        {
          "id": "lkjnm4h",
          "score": 2,
          "body": "They did but not much",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkjnm4h/",
          "created": 1724956474,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkkdga2",
      "score": 2,
      "body": "And the price dropped 8%! Some days you can't win.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkkdga2/",
      "created": 1724964464,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkexnk2",
      "score": 5,
      "body": "The fucking company is cranking money like mad and no one ever able to catch up for a long while given they have all these stupid money throwing at them. The company is doing extremely well. \n\nIf you get mad and selling you are the one footing the bills.",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkexnk2/",
      "created": 1724886195,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkea3gh",
      "score": 4,
      "body": "Down to 120.06 @ 3:50CT wtf",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkea3gh/",
      "created": 1724878252,
      "depth": 0,
      "replies": [
        {
          "id": "lkeozum",
          "score": 4,
          "body": "More to come 📉 puts got the dub today",
          "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkeozum/",
          "created": 1724883288,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lke9fss",
      "score": 5,
      "body": "I’m hard",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lke9fss/",
      "created": 1724877903,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkezmn7",
      "score": 3,
      "body": "exactly what I expected to happen. beat, dump, piss off retail\n\n  \nLOL",
      "permalink": "/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/lkezmn7/",
      "created": 1724886871,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "Nvidia reports 122% revenue growth with strong earnings and guidance, despite a 4% share drop in extended trading.",
    "companies": [
      "NVIDIA"
    ],
    "tickers": [
      "NVDA"
    ],
    "main_ticker": [
      "NVDA"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Nvidia reported strong earnings and guidance, and announced a $50 billion share buyback.",
    "stock_recommendations": "The user is implicitly supporting Nvidia through the mention of share buybacks.",
    "is_recommending_stock_buying_or_selling": true,
    "buy_or_sell": "buy",
    "sentiment_summary": "There is positive sentiment because the post highlights strong earnings, guidance, and a significant share buyback by Nvidia.",
    "sentiment": "positive"
  }
}