{
  "title": "10-2 year treasury yield curve first time positive since 5th July 2022",
  "score": 116,
  "selftext": "In advance: I know that predicting the market is impossible. Just want to point out that (almost) every single time the 10-2 year yield curve went negative (for example 1980, 1982, 2001, 2008, \"2020\") a recession occured after it showed an positive upwards trend. Of course the market changes and, as mentioned, is unpredictable. Maybe everything goes smoothly and nothing happens, maybe not. From my point of perspective Americas macroeconomics are a little worrying in some areas, but only time will tell.\n\nNonetheless, what's your view on this? Don't care and carry on, or is there more behind it? I won't neccessarily change my trading strategy, but I might reduce my overall investment per week so I get to spend more during lower prices.\n\nHere's a yield chart if you're curious: https://fred.stlouisfed.org/series/T10Y2Y\n\n\n\n",
  "link_flair_text": "Broad market news",
  "id": "1f3x82a",
  "num_comments": 44,
  "created_utc": 1724919744,
  "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/",
  "comments": [
    {
      "id": "lkhjs3u",
      "score": 70,
      "body": "There’s that Peter Lynch line - more money has been lost anticipating crashes than in the crashes themselves. \n\nThe thing with the 10-2 inverted yield curve is the timeframe a recession occurs after it goes back positive - sometimes months, sometimes a year or two - how are you going to time that? And then how do you time getting back in? \n\nIf you were investing, and particularly on this sub, during the 2022 bear market you’d know many people tried to time their index investments and got absolutely fucked. At first it was ‘100% recession’ and then it was ‘generational lows’ before finally ‘decade long bear market, I’ll buy when SPY reaches 2000’. The mantra then was ‘don’t fight the fed’ which essentially meant not to buy in until the fed reduce interest rates - which would mean missing out on that almost 2 year rally and buying in now! These same investment echo chambers of peak fear happen in every bear market/recession/mild correction. \n\nEveryone thinks they can time the market despite overwhelming evidence that not only can they not, but it really isn’t worth trying. \n\nA recession is normal. A bear market is normal. The trick is, if you are not close to retirement, to *increase* your contributions during major downturns and *NOT* sell.",
      "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkhjs3u/",
      "created": 1724931728,
      "depth": 0,
      "replies": [
        {
          "id": "lkil5xx",
          "score": 12,
          "body": "you don't need to worry about the yield curve un-inverting. It's when the Fed cuts that the timeline is pretty short, usually around 1-4 months after the first cut the recession occurred. This happens because the Fed cuts around the time the economy starts to weaken/decelerate. And when you decelerate something slow moving like a train, there's no telling if you will stop at the station or go past it. Everyone's calm now, but the moment you get nonfarm payroll under 150k again, everyone's gonna start yelling fire again.\n\nI never understood the recession talk occurring in 2022. The Fed barely got rates to above 3% by the end of 2022. 2.5% was considered \"neutral\", but neutral was probably closer to 3.5-4%. The 3 month/10 year curve, the actual recession indicator, didn't even invert until Nov 2022. There was no way we were gonna get a recession that early.",
          "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkil5xx/",
          "created": 1724944835,
          "depth": 1,
          "replies": [
            {
              "id": "lkinjta",
              "score": 2,
              "body": "I mean some people argue we did get a recession as we had two quarters of negative GDP, others say you can’t have a recession with full employment even if GDP is negative. The real lesson here is that recession’s are only ever realised in hindsight. By the time a recession is called the market has already bottom. \n\nAnd as you basically said yourself - the Fed cutting doesn’t *cause* a recession rather, in the past, it has *correlated* with a recession ie the recession was coming anyway regardless of if the Fed was going to cut or not. Will it be different this time? Who knows. But the real point is - who cares?",
              "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkinjta/",
              "created": 1724945561,
              "depth": 2,
              "replies": [
                {
                  "id": "lkiqc36",
                  "score": 7,
                  "body": "No the market bottoms 3-6 months before the END of a recession, anticipating a recovery. Most of the stock market drop during recessions, occurred around the start of a recession. Everyone's anticipating earnings to grow X% in the next 12 months or so. If a recession was to start and those companies revise down their future earnings to -X%, it's not a surprise to see investors reacting negatively to it. You're not gonna know when it ended until months after, but you're definitely gonna know if you're in it. The Fed's gonna cut 50-75bps every meeting, companies are gonna slash down earnings guidance pretty hard.\n\nThe reason why the 2 negative GDP quarters wasn't a recession was due to trade deficit bringing down real GDP. Consumer spending was still strong, which made up 70% of US GDP, and consumer spending is what gonna affect company sales and stock prices.\n\nYeah in the past recessions were probably coming anyways. But no one knew when. Well shortly after the Fed cut would be when it's most likely to occur.",
                  "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkiqc36/",
                  "created": 1724946404,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkiu7me",
                      "score": 0,
                      "body": "I don’t think you’ve ever actually been invested in a recession as much of what you say is misguided. In your bog standard recession most investors have no idea when it starts, when it bottoms or when it ends. When a recession is officially announced it is always in hindsight and usually at or around a market bottom. Every metric you are mentioning about companies slashing earnings and guidance all happened in 2022 and quite dramatically too but guess what - no recession. 99% of Reddit were convinced in 2022 that we were in, or about to have, a recession but guess what - no recession. This assertion that ‘you’ll know’ is false just with a cursory look at history. \n\nHowever - having said all this - you are missing my point. Which is who the fuck cares? Nobody should be making investment decisions based on recession predictions. So all this conjecture is useless.",
                      "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkiu7me/",
                      "created": 1724947568,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkjak7r",
                          "score": 1,
                          "body": "So you're saying no investor knew we were in a recession in 2008, 2001? Internet wasn't that common back then but people definitely knew.\n\nWho's doing these \"recessions announcement\"? NBER? Of course NBER is gonna wait before announcing the recession. They only announce once so they wanna get the months correct. They didn't announce the COVID recession until June 2020. Are you saying investors had no clue we had a recession before June 2020?\n\nIn 2022, it was pretty obvious that we had a rolling recession. Manufacturing went down first while services was still hot, and expected to be hot for a while due to pent up demand after lockdown. So only earnings in certain sectors were revised down. In aggregate, SP500 earnings was basically flat in 2022, around $220. What wasn't known was whenever the service industry does tip over, if that will ultimately lead to a full recession or not. And by the way, the recession probability surveyed by CNBC was only around 55%, not guaranteed like you're implying with your \"99% of Reddit\". And that recession probability had heavy weights on Europe entering a recession, which it didn't, due to the extremely mild European winter in 2022. And also, the Fed was still raising rates by 75 bps each meeting in 2022 because the economy was doing too hot, so not exactly sure why you'd think we were in a recession at that time. They were concerned about the Fed overdoing it and recession would come in the future, but not actually starting in 2022.\n\nNobody makes decisions based on recessions? You realize DCF requires you to estimate future revenue right? What about investing in cyclical industries like banking or auto or semiconductor? Oh yeah definitely don't need to worry about recessions at all.",
                          "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkjak7r/",
                          "created": 1724952498,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lkjhck5",
                              "score": 0,
                              "body": "What DCF have you ever seen that uses recession numbers? How on earth are you going to predict company earnings in a recession? If you use recession numbers to do a DCF no company is *ever* a buy until you’re in a recession. That’s the stupidest thing I’ve ever heard. Recessions by their nature are unpredictable and, here’s the important part, temporary. \n\nAh kid - just trust me, keep investing, keep invested and don’t worry about predicting recessions. It’s obvious you’ve never invested through one nor been in a bear market. Take my advice and you’ll be better off for it. \n\nAlso of note you mentioned it yourself - June 2020 recession announced, three months AFTER the market actually bottomed.",
                              "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkjhck5/",
                              "created": 1724954545,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lkiohgu",
          "score": 3,
          "body": "10-4 about the 10-2",
          "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkiohgu/",
          "created": 1724945847,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkmfczo",
          "score": 1,
          "body": "Great advice.  I retire next June. What would you suggest?",
          "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkmfczo/",
          "created": 1724992066,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lki9xhs",
          "score": 1,
          "body": "This was me in 2022 lol. If your timeframe is long enough, you shouldn’t be waiting out to max your 401k.",
          "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lki9xhs/",
          "created": 1724941370,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkies19",
          "score": 0,
          "body": "Words of wisdom. Every investing sub needs to have this as a pinned post",
          "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkies19/",
          "created": 1724942881,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkhafya",
      "score": 9,
      "body": "What is 10-2year treasury yield curve?  \nI am new in this community and wanna learn a lot of stock related things.",
      "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkhafya/",
      "created": 1724927053,
      "depth": 0,
      "replies": [
        {
          "id": "lkhpx51",
          "score": 30,
          "body": "The 10-2 year treasury yield is the correlation between the 10-year treasury (long term bonds) and the 2-year treasury (short term bonds). The yield is the interest output that each note yields. \n\nIn a normal economy, the 10-year will yield a higher interest rate. A higher premium has to be paid out to hold the money longer. \n\nIf the curve becomes inverted, it means the shorter term treasuries are paying a higher premium than the longer term. In the past, when this happens, it is an indicator that the economy is slowing or that a recession may be coming.\n\nIf you click on the link that OP provided and set the view to max, you can see where the yield curve inverts, and the economic episodes that followed those inversions. \n\nAny other questions?",
          "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkhpx51/",
          "created": 1724934342,
          "depth": 1,
          "replies": [
            {
              "id": "lkmj5y7",
              "score": 2,
              "body": "This is very well explained.",
              "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkmj5y7/",
              "created": 1724994043,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkmk6r8",
              "score": 1,
              "body": "would that not just be a function of Fed interest rates then? I guess some of it would be speculation, but for example (especially today) now that we are approaching Fed interest rate cuts I imagine logically that those short term bonds would/should have higher rates as they are closer to what the current interest rates are compared to the longer term bonds as they are pricing in an economy with lower interest rates",
              "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkmk6r8/",
              "created": 1724994601,
              "depth": 2,
              "replies": [
                {
                  "id": "lkn1khp",
                  "score": 1,
                  "body": "what is fed interest",
                  "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkn1khp/",
                  "created": 1725005310,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkn1bob",
              "score": 1,
              "body": "So its kind of like an indicator for economy ,i see.Can you name some genuine content creators  who can give me info of stocks from beginner level",
              "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkn1bob/",
              "created": 1725005148,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkh4rp6",
      "score": 31,
      "body": "It means short term yields are falling which generally equates to the economy cooling which is what a recession is. In some senses, the point of raising high rates to cool the economy is purposefully creating a recession. \n\nThis is where we’re at, once rate cuts start, the economy will pick back up, but the rate cuts have already been priced in to the stock market.",
      "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkh4rp6/",
      "created": 1724923583,
      "depth": 0,
      "replies": [
        {
          "id": "lkhappf",
          "score": 15,
          "body": "A recession is negative growth not necessarily the same as slowing growth (which happens in a cooling economy). \n\nWhether rate cuts will occur depends on the conditions that make them possible (especially inflation). Generally there has been a global downturn and if China continues the way it has gone that could get worse…\n\nBut it’s in no way said that a recession looms or is inevitable.",
          "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkhappf/",
          "created": 1724927207,
          "depth": 1,
          "replies": [
            {
              "id": "lkk74j7",
              "score": 2,
              "body": "Agreed, personally I don’t think there are signals for a true recession given the economy has been cooling steadily, so this recession isn’t textbook. Seems like a soft landing, but then again the Middle east and Eurasian tensions and global politics could fully blow up the markets if large scale war breaks out and people panic. \n\nWho knows? Historically the right approach is to maintain course with a diversified portfolio, and move into a more conservative portfolio nearing retirement, and I think that will always stay true regardless of inflation or rate cuts.",
              "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkk74j7/",
              "created": 1724962533,
              "depth": 2,
              "replies": [
                {
                  "id": "lkkeupx",
                  "score": 1,
                  "body": "That’s it.",
                  "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkkeupx/",
                  "created": 1724964891,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkj2dfq",
      "score": 19,
      "body": "There are so many recessionary signals right now that I just cannot fathom we come out unscathed. \n\n-Yield curve un-inversion\n\n-Unemployment is accelerating upwards\n\n-Sahm rule officially triggered\n\n-Full time employees is negative YoY\n\n-The feds 3M / 10Y recession indicator shows we’re at 56% odds being in a recession right now. It was 70% in May\n\n-Many crucial companies are issuing lower forward guidance \n\n-China (especially), Germany, Canada, etc are all experiencing terrible economies\n\n-Tech jobs are nonexistent right now\n\n-The fed is now concerned about the labor market more than inflation\n\n-Commercial real estate is in absolute shambles\n\nAnd so on and so on. I just can’t see how there can be so many signals that have always been true in the past for recessions just suddenly stop working.",
      "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkj2dfq/",
      "created": 1724950034,
      "depth": 0,
      "replies": [
        {
          "id": "lkj87dc",
          "score": 6,
          "body": "Counterpoint: BuT mUh NvIDiA sToNkS!!!!",
          "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkj87dc/",
          "created": 1724951784,
          "depth": 1,
          "replies": [
            {
              "id": "lkk2803",
              "score": 3,
              "body": "Down 5% today lol, I'm actually really surprised the market is up against NVDA",
              "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkk2803/",
              "created": 1724961048,
              "depth": 2,
              "replies": [
                {
                  "id": "lkkoz81",
                  "score": 1,
                  "body": "6.38%, *so far*",
                  "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkkoz81/",
                  "created": 1724968119,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkqsx3w",
          "score": 1,
          "body": "and stock valuations sky high.....shiller PE 36\n\n[https://www.multpl.com/shiller-pe](https://www.multpl.com/shiller-pe)",
          "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkqsx3w/",
          "created": 1725056153,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkikaps",
      "score": 4,
      "body": "I could be alone here but a majority of the market feels absurdly overbought. The stack of cards is gonna hit a gust of wind at some points.",
      "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkikaps/",
      "created": 1724944571,
      "depth": 0,
      "replies": [
        {
          "id": "lkqtbof",
          "score": 1,
          "body": "Going to be an interesting rest of the year as we march towards December where tax loss harvesting starts to make sense. Also election uncertainty will be gone.",
          "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkqtbof/",
          "created": 1725056300,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkhe607",
      "score": 3,
      "body": "Good post, missing/mediocre follow-up discussion unfortunately \n\n\nGonna get my stop-losses set up in place, I haven’t made much this year (~3%), so at the very least I’ll just retain what I’ve put in. If nothing happens, they’ll just expire. If something does happen: my 403(b)‘s gonna take a hit, but it is what it is lol. I’ve been slacking on setting up a Roth IRA, if shtf then I know what I’m doing!",
      "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkhe607/",
      "created": 1724929055,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkj4bmp",
      "score": 2,
      "body": "> every single time the 10-2 year yield curve went negative a recession occurred after it showed a positive uptrend \n\nSure, but that’s the equivalent of saying that anytime ANYTHING happens, a recession has occurred in the future. Because recessions will always occur every handful of years. It’s a meaningless statistic. Sometimes it takes a year or more for the recession to follow the positive uptrend. Is it really a causative factor at that point? No, it isn’t. But people still love to force a square peg into a circle hole and claim it fits.",
      "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkj4bmp/",
      "created": 1724950615,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkh777g",
      "score": 8,
      "body": "Absolutely nothing to worry about. Everything is fine. Everything will be fine. There's no inflation. Job growth is strong. GDP is strong. NVIDIA is strong. China is weak. China is a big fat loser. Load up. (btw, I'm being sarcastic as fuck, but in this sub everything I just said will get upvoted massively).",
      "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkh777g/",
      "created": 1724925131,
      "depth": 0,
      "replies": [
        {
          "id": "lkhexhk",
          "score": 10,
          "body": "So confused whether to upvote or downvote. Was down until the last sentence…. ya got me.",
          "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkhexhk/",
          "created": 1724929438,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkh39k9",
      "score": 4,
      "body": "Don't know enough to give a qualified opinion. Don't care enough to get one.",
      "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkh39k9/",
      "created": 1724922614,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkl3ngr",
      "score": 1,
      "body": "RIP",
      "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkl3ngr/",
      "created": 1724973201,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkwuple",
      "score": 1,
      "body": "So what, nothing happened in 22",
      "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkwuple/",
      "created": 1725148506,
      "depth": 0,
      "replies": [
        {
          "id": "lkwuukz",
          "score": 1,
          "body": "Every month “this singular indicator means we are crashing tommorrow” learn to be above fear mongering traders",
          "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkwuukz/",
          "created": 1725148559,
          "depth": 1,
          "replies": [
            {
              "id": "lkwuvs7",
              "score": 1,
              "body": "Every single month",
              "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkwuvs7/",
              "created": 1725148571,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkya4t4",
          "score": 1,
          "body": "My posts purpose was to be informative only. It's up to you how you interpret this. However, fact is that recessions are part of the economy and occur regularly. They simply correct/balance/reset the economy. Regarding this single indicator... again, until now it happened to foreshadow a recession *almost* every time. Quick reminder: it's not the negative yield curve that causes a recession. It just shows how money flows to secure treasury bonds. 2022? Uncertaincy, inflation etc played a critical role during the decline. In this case the curve was not inverted beforehand, but that doesn't really matter. Lets say 100 recessions occured and only 40 of them had a negative curve. However, the last 40 times the curve went negative a recession happened. Therefore, a negative curve indeed shows a strong correlation *if* it happens to be negative. If not then there's still the possibility for a recession. More interesting are the times where the curve went negative, but no recession happened. That was the case a few times, but it's more rare. So yeah lets see what will happen this time...",
          "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lkya4t4/",
          "created": 1725172148,
          "depth": 1,
          "replies": [
            {
              "id": "lml38kh",
              "score": 1,
              "body": "“Almost” except every time it didn’t, single indicator readings are pointless unless paired with a good overall hypothesis and more indicators/information",
              "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lml38kh/",
              "created": 1726052248,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lki40n7",
      "score": 0,
      "body": "The Sahm rule is on its way to be like the yield curve too.",
      "permalink": "/r/stocks/comments/1f3x82a/102_year_treasury_yield_curve_first_time_positive/lki40n7/",
      "created": 1724939444,
      "depth": 0,
      "replies": []
    }
  ]
}