{
  "title": "Dollar General shares crater 20% as retailer cuts outlook, blaming ‘financially constrained’ customers",
  "score": 583,
  "selftext": "Dollar General shares tumbled on Thursday after the discount retailer slashed its sales and profit guidance for the full year, suggesting its lower-income customers are struggling in this economy.\n\nShares of the retailer which caters to more rural areas tumbled 20% in premarket trading following the earnings report.\n\nThe company now expects fiscal 2024 same-store sales to be up 1.0% to 1.6%, lower than prior outlook for a 2% to 2.7% increase. Earnings per share for the year is expected to be in the range of just $5.50 to $6.20, versus the prior forecast of $6.80 to $7.55 per share.\n\n“While we believe the softer sales trends are partially attributable to a core customer who feels financially constrained, we know the importance of controlling what we can control,” said CEO Todd Vasos in a statement.\n\nDollar General also reported disappointing numbers for the latest quarter. EPS of $1.70 per share came in below an LSEG estimate of $1.79 per share, while revenue of $10.21 billion was also lower than the analyst expectation of $10.37 billion.\n\nCompetitor Dollar Tree was falling in sympathy, off by more than 6% in early trading.\n\nSource: [https://www.cnbc.com/2024/08/29/dollar-general-shares-crater-20percent-as-retailer-cuts-outlook-blaming-financially-constrained-customers.html](https://www.cnbc.com/2024/08/29/dollar-general-shares-crater-20percent-as-retailer-cuts-outlook-blaming-financially-constrained-customers.html)",
  "link_flair_text": "Company News",
  "id": "1f413tp",
  "num_comments": 208,
  "created_utc": 1724934414,
  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/",
  "comments": [
    {
      "id": "lkhsju8",
      "score": 140,
      "body": "Dollar General is oftentimes more expensive then Walmart, etc. No point in shopping there. When a Dollar Tree is merged with a Dollar General we don’t go there as many DT items become much more expensive.\n\nEdit: got my dollar stores messed up with the merge line.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhsju8/",
      "created": 1724935392,
      "depth": 0,
      "replies": [
        {
          "id": "lkilto3",
          "score": 82,
          "body": "Dollar General has a specific niche. \n\nSmall towns with nothing else and gaps between larger stores. \n\nThey are typically priced higher than Wal-Mart, but there's 2 DGs on either route I can take home from work and Zero other stores besides gas stations, without a detour. \n\nThey can charge more because there's no competition, so you're getting convenience store prices not bulk store prices. As long as they're cheaper than the gas station, then they're a better option.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkilto3/",
          "created": 1724945034,
          "depth": 1,
          "replies": [
            {
              "id": "lkiwh4p",
              "score": 36,
              "body": "This, the Jon Oliver piece about how poorly it runs is what's at the forefront of people's mind, but that's just a symptom of a business plan that's failing. Dollar General is a convenience store that's larger than most other convenience stores, so there's more offered, but it can't compete where larger stores like Walmart exist. They also can't exist in compact and crowded city spaces like a typical corner store can store so you end up getting the middle-ground that you mention. \n\nThe company subsists because they're *branded* as a Dollar Store. Now that people recognize that their prices don't align with something like the Dollar Tree, it gets to be a frustrating shopping experience, rather than a convenient one(which people are usually willing to pay for if needed).",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkiwh4p/",
              "created": 1724948262,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lklaj49",
              "score": 16,
              "body": "DG is all about exploiting food desserts.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lklaj49/",
              "created": 1724975701,
              "depth": 2,
              "replies": [
                {
                  "id": "lkrbd9i",
                  "score": 1,
                  "body": "Yes, this.",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkrbd9i/",
                  "created": 1725063023,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkky7kg",
              "score": 15,
              "body": "I live in NC, about 30 minutes from a major city.  The two closest stores to me are a dollar general and a second dollar general.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkky7kg/",
              "created": 1724971272,
              "depth": 2,
              "replies": [
                {
                  "id": "lkl8ve7",
                  "score": 17,
                  "body": "Do you have a favorite",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkl8ve7/",
                  "created": 1724975093,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkj1rwt",
          "score": 20,
          "body": "Just want to point out, Dollar Tree and Family Dollar (DLTR) merged sometime back and are rolling out the combo stores. Dollar General (DG), who reported earnings today, are their primary competition but has a distinct focus on rural markets, whereas DLTR is more focused on low to middle income urban and suburban markets",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj1rwt/",
          "created": 1724949854,
          "depth": 1,
          "replies": [
            {
              "id": "lkj5r77",
              "score": 3,
              "body": " I did totally get my dollar stores messed up with that merge line. Surprised you were the first to catch it. That being said I do a lot of traveling (job and lifestyle choice) and seems that often there is a more reasonably priced option within striking distance and when we go back to visit places we have seen DGs spring up within as little as 10 minutes away from big box stores such as Walmart, etc. so I don't know if they are trying to expand beyond their niche or the places they've had them in are growing and new competition is arising.   \n  \nThanks for catching that.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj5r77/",
              "created": 1724951046,
              "depth": 2,
              "replies": [
                {
                  "id": "lkjngws",
                  "score": 3,
                  "body": "It’s super easy to confuse these three companies.  Regarding locations popping up close to other major stores, I think DG is at a point where all the places their model truly thrives already have a location, so they’ve ended up expanding into areas where their value proposition is less clear.  They really need to pivot from expanding the store count to improving and growing revenue in their existing store base.  DTRL is closing a number of stores and I wouldn’t be surprised if DG needs to prune their store count a bit as well.",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjngws/",
                  "created": 1724956429,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkj48hd",
          "score": 9,
          "body": "Dollar Trees wouldn't merge with Dollar General, two different companies. \n\nYou will see them combined with Family Dollars - Dollar Tree bought Family Dollar about 5 years back. \n\nUsually the Dollar tree stuff stays the same price and they just add a bunch of 5 and 10 dollar items.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj48hd/",
          "created": 1724950589,
          "depth": 1,
          "replies": [
            {
              "id": "lkj7qz9",
              "score": 3,
              "body": "Yeah, thank you! Caught that due to another comment and edited to reflect that mistake. The inventory/choices for the DT section is much smaller than what you'd typically see in a DT only. It seems like they basically push out those items and add more expensive options from what I've seen (can't say whether they are the exact same item or not). We avoid them for that reason. No cheap options of what we would typically be going there for.\n\nAgain, thank you for the correction.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj7qz9/",
              "created": 1724951647,
              "depth": 2,
              "replies": [
                {
                  "id": "lkkuxgl",
                  "score": 1,
                  "body": "Yes it's a matter of footprint, most dollar trees are small to begin with and you lose a third of the floor space to the be stuff. Was always cramped and overstocked as it was. They don't actually change the price of the DT product, but by it's nature a lot of stuff at DT was smaller or temporary besides on cc closeouts and volume, so much of that, especially seasonal, probably does get replaced.\n\nSome of the larger ones tho really make it work. I imagine they'll shift towards larger stores in general and everything with be a combination",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkkuxgl/",
                  "created": 1724970126,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkhr9o6",
      "score": 387,
      "body": "Stepping into a Dollar General store is a poor customer experience, to state the obvious. But, sure let's blame the consumer here.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhr9o6/",
      "created": 1724934889,
      "depth": 0,
      "replies": [
        {
          "id": "lkhuioi",
          "score": 108,
          "body": "There was a new one built near me like a year ago. The plaza is nice, the outside is nice, yet somehow the inside already looks like complete shit - seemed like the inside was a disaster day one and I don’t just mean messy with product everywhere. The building itself must have cost a good amount, good quality, but cheap’d out on literally everything inside - shit fixtures, bad lighting, bad counters, bad everything. I’ll drive the extra 5 minutes even for a single <$5 transaction just to avoid the place.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhuioi/",
          "created": 1724936133,
          "depth": 1,
          "replies": [
            {
              "id": "lkhwy2x",
              "score": 61,
              "body": "Old one, middle of the rural hood, less than three minutes from me. Understaffed. Never clean. Self-checkout perpetually broken. I had to leave in the middle of the line the last time I went because it was one lady serving like 30 people in line. I felt like I was doing her a favor. Spent more by going to Walgreens but my God it was night and day, even saw a few stragglers who also noped out of that hot mess. \n\nI hate DG. They killed my hometown. Sucked it dry so that no little general store/hardware could survive on Main Street anymore. This is a town of ~1,000 people.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhwy2x/",
              "created": 1724937017,
              "depth": 2,
              "replies": [
                {
                  "id": "lkj3vra",
                  "score": 28,
                  "body": "> I hate DG. They killed my hometown. Sucked it dry so that no little general store/hardware could survive on Main Street anymore. This is a town of ~1,000 people.\n\nIt seems like that's their model. Move in, offer lower prices to drive all the small guys out of business, then once the competition is gone, cut costs by getting rid of most of the staff so the experience becomes miserable, but competitors stay away because they know DG can drive them out easily again if they want to.",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj3vra/",
                  "created": 1724950485,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkju9pj",
                      "score": 12,
                      "body": "John Oliver did a good segment on them a few months ago, this does seem like their business model. Often stores would just have one emplyee working",
                      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkju9pj/",
                      "created": 1724958547,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lkjyes5",
                      "score": 4,
                      "body": "While this is somewhat true, the small town I vacation in with family has had a small general store that has long survived since dollar general came into town. The local country general store just continued to offer more products, better service, and had overall better cleanliness, so people kept going. \n\nThe sad reality is many of these towns that lose their general store to dollar general probably were not towns economically stable enough to support anything other than the kind of thing dollar general provides.",
                      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjyes5/",
                      "created": 1724959862,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lkkpajc",
                  "score": 1,
                  "body": "I think they announced a couple months ago that they were getting rid of self checkouts. Im sure the sign is bogus, Ive seen it also they just dont wanna deal with it",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkkpajc/",
                  "created": 1724968222,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkkguy1",
              "score": 2,
              "body": "I’m an electrician who wired in a new DG. DG builds as cheap and quick as possible - they done care about the quality. \n\nThe crew who poured concrete at my location follows the new DG builds around and that’s all they do. They like it because it’s guaranteed work and DG likes it because they know what DG wants and can do the work consistently & quickly. Thing is, they didn’t put rebar in the concrete… Not even 2 years after they poured the parking lot, massive chunks where the 4 corners of cuts were, were caving in. DG’s solution is to come dump a bit of asphalt in the new hole to somewhat fill the hole. Then, move on.\n\nThey also used cheap lights for the entire building that hang off of 2 wires. Any electrician knows that getting lights that hang on 2 wires to hang in a straight line is near impossible. We tried and tried and tried but there’s only so much you can do. \n\nThe finished “ceiling” in their buildings is just the insulation outer covering. Essentially, a white garbage bag sheeting that holds the insulation above it is the best way I can describe it. That’s the finished ceiling. \n\nThese buildings are the cheapest of anything I’ve ever worked on.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkkguy1/",
              "created": 1724965514,
              "depth": 2,
              "replies": [
                {
                  "id": "lkl3k22",
                  "score": 1,
                  "body": "I question if anyone even bothers to do a cursory sweep of the floor before they open it to the customers.",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkl3k22/",
                  "created": 1724973167,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkj8gy4",
          "score": 17,
          "body": "At the Dollar General nearest my home, their customers are largely people who don't have their own transportation and walk to the store. Public transportation is needed for shopping at Walmart, about 15 minutes away. I went in to the Dollar General for a loaf of bread on a Sunday, not wanting to drive another 15 minutes. The loaf of plain white bread was $4.66. I was stunned and disgusted. The price for a loaf of white bread at Walmart starts at around $1.50, and is frequently cheaper still. Dollar General is taking advantage of their lower income customers who don't have an easy alternative. It's sickening. They, just like Starbucks and McDonalds, are pricing themselves out of business.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj8gy4/",
          "created": 1724951864,
          "depth": 1,
          "replies": [
            {
              "id": "lkk0e07",
              "score": 7,
              "body": "Right, that's their business model. Some - who likely haven't been there - imagine DG to be cheap because it has the word \"dollar\" in it, but it has never been cheap. They are overpriced for what they sell, and mostly thrive in rural areas and other food deserts, while tending to perform poorly when actual discount stores (Aldi, Dollar Tree, Walmart, etc.) are close by.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkk0e07/",
              "created": 1724960483,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkjxdlu",
              "score": 5,
              "body": "$4.66 for white bread is insane \n\nI hate these companies that prey on people",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjxdlu/",
              "created": 1724959533,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkktkpa",
              "score": 1,
              "body": "That is insane!",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkktkpa/",
              "created": 1724969664,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkhrrua",
          "score": 24,
          "body": "To add to this, however, I would state that Dollar General's \"cheap chic\" retail concept PopShelf is actually a great customer experience with decent product selection and good values. I believe this has been rolled out to only a few locations, with some stores actually colocated with DG stores.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhrrua/",
          "created": 1724935087,
          "depth": 1,
          "replies": [
            {
              "id": "lkj9lwu",
              "score": 5,
              "body": "Once I found out what it was, I didn’t shop there on principle. I minimize my money going to businesses that actively work towards destroying local communities.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj9lwu/",
              "created": 1724952211,
              "depth": 2,
              "replies": [
                {
                  "id": "lkjarmc",
                  "score": 2,
                  "body": "Fair",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjarmc/",
                  "created": 1724952560,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkigha3",
          "score": 11,
          "body": ">Stepping into a Dollar General store is a poor customer experience\n\n\nYeah it's not an experience a wealthy customer would ever have",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkigha3/",
          "created": 1724943404,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkhy81r",
          "score": 6,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhy81r/",
          "created": 1724937460,
          "depth": 1,
          "replies": [
            {
              "id": "lkhzhkt",
              "score": 1,
              "body": "Some good points. I did notice the newer stores are improved.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhzhkt/",
              "created": 1724937901,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lki368r",
          "score": 4,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki368r/",
          "created": 1724939163,
          "depth": 1,
          "replies": [
            {
              "id": "lki3gnc",
              "score": 3,
              "body": "Good point, probably not the best wording on my part!",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki3gnc/",
              "created": 1724939259,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkk404q",
          "score": 2,
          "body": "It's more that Dollar General's are the only store in rural areas. They've predatorily ousted most mom and pops out of their target areas and basically have a monopoly on groceries to their consumers.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkk404q/",
          "created": 1724961585,
          "depth": 1,
          "replies": [
            {
              "id": "lkk4e86",
              "score": 1,
              "body": "Good point",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkk4e86/",
              "created": 1724961702,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkjxz58",
          "score": 1,
          "body": "Is it possible Temu and Amazon is starting to take a lot of low income shoppers??",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjxz58/",
          "created": 1724959724,
          "depth": 1,
          "replies": [
            {
              "id": "lkjy8rd",
              "score": 2,
              "body": "I think Walmart is winning when it comes to basics. Yes, Temu definitely eats into household goods.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjy8rd/",
              "created": 1724959809,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkjz6t2",
          "score": 1,
          "body": "There's one near me that is closed more often than it is open. When they're open there's inventory in boxes in every aisle making it impossible to move around. I'm surprised either management hasn't change or hasn't been shut down completely. They're basically paying rent to be closed.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjz6t2/",
          "created": 1724960110,
          "depth": 1,
          "replies": [
            {
              "id": "lkjzwrc",
              "score": 1,
              "body": "Crazy. They have 20,000 locations. Dollar Tree also has so many locations, I think I drive by about three or four every day.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjzwrc/",
              "created": 1724960336,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkkfa9e",
          "score": 1,
          "body": "Dollar General's c-suite/executive board are practicing the \n\n    \"Narcissist Prayer\" to a T.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkkfa9e/",
          "created": 1724965025,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkhqyyh",
      "score": 279,
      "body": "DG problem is not the customer, its the stores and workers. Stores are mostly impassable most of the time, and the workers are usually one step above a meth head. \n\nI would spend more there if it could get in and see stuff. Always boxed inventory stacked in the aisles.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhqyyh/",
      "created": 1724934768,
      "depth": 0,
      "replies": [
        {
          "id": "lki2m0c",
          "score": 108,
          "body": "DG strength isn't it's superior customer experiences or even it's pricing, it's their ability to have a location spring up in small towns that nobody else can even hope to compete in",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki2m0c/",
          "created": 1724938975,
          "depth": 1,
          "replies": [
            {
              "id": "lkiuglr",
              "score": 20,
              "body": "You mean 3 or 4 locations in a town of 1200 people. Its wild.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkiuglr/",
              "created": 1724947645,
              "depth": 2,
              "replies": [
                {
                  "id": "lkmi17e",
                  "score": 1,
                  "body": "I remember reading how much it costs them to open a new location and it was in the hundreds of thousands of dollars compared to Walmarts millions of dollars for a new location. The one in my town opened in the closed down family video and didn't even bother to repaint. \n\nStill think its outlook is poor though.",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkmi17e/",
                  "created": 1724993441,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lknesc6",
                      "score": 2,
                      "body": "Its really bizarre out here in small town TN. I can be driving from my small town to another small town. In front of me, are 5 cars going slow. Without fail, 4 of them will turn into a DG in the middle of nowhere. Everyone I know that shops there complains about it and hates it, and yet they STILL return day after day. I went into one once, and that was more than enough.",
                      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lknesc6/",
                      "created": 1725013788,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lkiwk2e",
              "score": 6,
              "body": "…and it’s an all out assault. I can get to 3 Dollar Generals in five minutes.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkiwk2e/",
              "created": 1724948286,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkisk7i",
              "score": 9,
              "body": "> to have a location spring up in small towns that nobody else can even hope to compete in\n\nYes, I joke about them, but frankly, I am grateful for them. The nearest \"supermarket\" is 45 minute one way. The DG near me started selling fresh fruit and vegetables and its a godsend. It would make life difficult if they closed down.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkisk7i/",
              "created": 1724947067,
              "depth": 2,
              "replies": [
                {
                  "id": "lkjxnck",
                  "score": 5,
                  "body": "They killed the supermarket in the town I grew up in.  It was always a marginal business, but DG came in with market dumping prices to drive the market into the ground.  The market owners warned everyone that they would have to close if they continued to shop at DG and sure enough they did.\nNow the prices are higher and people have to drive 20 miles to a market half as good as the original, or 30 miles to a decent one.",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjxnck/",
                  "created": 1724959619,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkk0p2q",
                      "score": 1,
                      "body": "its 45 miles for me, if I don't go to DG, which has been okay. Family Dollar is across the street, but its pretty much the same without any fresh produce.",
                      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkk0p2q/",
                      "created": 1724960579,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lkmdp67",
                  "score": 1,
                  "body": "I've never lived in a rural area.  The idea of driving 45 minutes for any staple is nuts to me.  I live in a not bad, but definitely not great part of Chicago.  My neighborhood has a decent number of half-way houses and the like.  Thinking that the down on their luck folks in my neighborhood are much better off because at least they can walk to an Aldi is kinda nuts to me.",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkmdp67/",
                  "created": 1724991253,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkmf09q",
                      "score": 1,
                      "body": "There are reasons to live in a rural area. I never have to worry about crime. Maybe some wild horses try and eat my Russian Olive trees, lol. Property taxes on my 4.6 acres is $500 per year. Water is 20 gpm from a well, septic for sewer, so utilities are low also. I am an hour east of Carson City, NV so we don't get the high heat like Las Vegas does. Typically a breeze comes up every day from the Washoe Zephyr, so I can use a swamp cooler rather than an expensive AC. When it snows the couple of days a year, it usually melts within a day or two.\n\nhttps://ibb.co/6Jyytfw\nhttps://ibb.co/gS7N77F\nhttps://ibb.co/q1nXpLN",
                      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkmf09q/",
                      "created": 1724991893,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lki3xt9",
              "score": 19,
              "body": "I get that, but If I would rather skip the store to drive further for a better experience, thats a problem which cuts into the bottom line.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki3xt9/",
              "created": 1724939418,
              "depth": 2,
              "replies": [
                {
                  "id": "lki4zsr",
                  "score": 12,
                  "body": "Bold of you to assume the majority of their consumer base has a car",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki4zsr/",
                  "created": 1724939767,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lki81ld",
                      "score": 37,
                      "body": "I don’t recall ever seeing a dollar general in a walkable neighborhood served by transit.",
                      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki81ld/",
                      "created": 1724940770,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkiaxee",
                          "score": 2,
                          "body": "I lived outside of Augusta, GA for a bit and never saw that either. I was more poking fun at the freeway-side foot traffic of the deep south.",
                          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkiaxee/",
                          "created": 1724941684,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lkj2ult",
                          "score": 1,
                          "body": "I mean that's unusual, here in the Northeast they're in all the same neighborhoods as family dollar and Dollar tree. They basically took over for corner stores",
                          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj2ult/",
                          "created": 1724950177,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lkkzkmt",
                              "score": 1,
                              "body": "TIL…. \n\nOut west where all we have is sprawl and strip mall developments they are in strip malls.  In rural areas they are often a  building with a parking lot off in some random lot with not much else around.",
                              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkkzkmt/",
                              "created": 1724971753,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lkj0dgt",
                          "score": 1,
                          "body": "Come to the south, they're fuckin everywhere. I have three of them within a mile of my house in different directions.",
                          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj0dgt/",
                          "created": 1724949434,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lki5qm9",
                      "score": 24,
                      "body": "They do. Majority that shop at DG have cars. Thats already established by DG, lol.",
                      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki5qm9/",
                      "created": 1724940016,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lkiawwf",
                      "score": 9,
                      "body": "You pretty much HAVE to have a car to survive in rural areas unlike cities where a decent chunk of the population doesn't own one.",
                      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkiawwf/",
                      "created": 1724941680,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lkilol8",
                      "score": 5,
                      "body": "You can't live in rural america without a car. They aren't taking the bus or subway.",
                      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkilol8/",
                      "created": 1724944992,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkirnkp",
                          "score": 7,
                          "body": "Nah, they just hop into their shoebarus and chevrolegs and mosey on over.",
                          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkirnkp/",
                          "created": 1724946799,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lkiti6c",
              "score": 1,
              "body": "And I assume they do this by hiring meth heads?",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkiti6c/",
              "created": 1724947352,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkilnd3",
          "score": 13,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkilnd3/",
          "created": 1724944982,
          "depth": 1,
          "replies": [
            {
              "id": "lkimw85",
              "score": 3,
              "body": "Seems to be hurting their bottom line, lol.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkimw85/",
              "created": 1724945360,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkjp8iw",
              "score": 1,
              "body": "Of course they have distribution warehouses. There's TWO on Atlanta's Southside as an example.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjp8iw/",
              "created": 1724956982,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lki19xf",
          "score": 12,
          "body": "Agree..wife likes to go to dollar stores. I feel like the stores are what Kmart stores were looking like and feeling way back in the day. Kmart went bankrupt.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki19xf/",
          "created": 1724938518,
          "depth": 1,
          "replies": [
            {
              "id": "lkilf8g",
              "score": 7,
              "body": "I thought KMart was pretty great in the 80s and early 90s but maybe my memory is fuzzy ",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkilf8g/",
              "created": 1724944914,
              "depth": 2,
              "replies": [
                {
                  "id": "lkj2x3c",
                  "score": 3,
                  "body": "grab you an icee and a corn dog and go shoppin'",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj2x3c/",
                  "created": 1724950197,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkiz4yk",
          "score": 5,
          "body": "I wholeheartedly agree that their stores are a mess and an unpleasant experience, but I mostly disagree about the workers.\n\nI've shopped in A LOT of DG's all over the West and Southeast, and you do have rogue methhead occasionally, but the vast majority of their employees seemed like great, hardworking people. There are just way too few of them. Generally, it's 1-2 people in charge of taking shipments, stocking the store, operating the cash registers, and cleaning the joint. How anyone could maintain a meth habit with all those responsibilities is beyond me! \n\nI think understaffing is the direct cause of the poor shopping experience, but it's also fundamental to their business model. Not sure where they go from here, which is scary because so many rural communities rely on DG sadly.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkiz4yk/",
          "created": 1724949065,
          "depth": 1,
          "replies": [
            {
              "id": "lkj4ksu",
              "score": 3,
              "body": "In a world where WalMart delivers, DG is becoming less necessary.  WalMart is able to manage larger stores more efficiently, and give better pricing while maintaining margins.\n\nI don't buy that DG's decline is primarily struggling customers; I think those customers are spending more of their dollars at WalMart.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj4ksu/",
              "created": 1724950691,
              "depth": 2,
              "replies": [
                {
                  "id": "lkja631",
                  "score": 2,
                  "body": "As much as I hate walmart, I can’t deny that their store is at a bare minimum clean and relatively organized.",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkja631/",
                  "created": 1724952381,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkhu6qf",
          "score": 8,
          "body": "real shit we had a crack head at ours falling asleep in isle. the manger and the employees all talk on speaker phone at the registry.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhu6qf/",
          "created": 1724936009,
          "depth": 1,
          "replies": [
            {
              "id": "lkhxjef",
              "score": 21,
              "body": "Don't think their poison of choice was crack if they were falling asleep..",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhxjef/",
              "created": 1724937223,
              "depth": 2,
              "replies": [
                {
                  "id": "lkj07r8",
                  "score": 1,
                  "body": "well I cant say what they were on because I dont do drugs \n\n  \nedit after doing research it very much could of been crack \n\n\n\n As a stimulant, cocaine can cause wakefulness. In fact, one of the signs of cocaine abuse is a reduced need for **sleep**. **Sleep** deprivation may be severe, especially when someone struggles with a cocaine addiction.",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj07r8/",
                  "created": 1724949387,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkj8mss",
                  "score": 1,
                  "body": "It can definitely happen if they're withdrawing",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj8mss/",
                  "created": 1724951914,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lki38zp",
          "score": 17,
          "body": "Redditors will cry about how it’s unfair that people with criminal records have a hard time getting jobs, then complain about it when they see one get a job",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki38zp/",
          "created": 1724939188,
          "depth": 1,
          "replies": [
            {
              "id": "lki44ri",
              "score": 6,
              "body": "Criminal record =\\= meth head nor vis versa",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki44ri/",
              "created": 1724939482,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lki3kqx",
              "score": 2,
              "body": "Where do you see me complaining about that? Im just saying what it seems the typical worker is. I don't care if you are felon, as long as you do your job and don't give me shit when buying a coke.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki3kqx/",
              "created": 1724939297,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkilmnx",
              "score": 1,
              "body": "Having a criminal record sounds like pretty good motivation to do your job well and attempt to improve your standing in life rather than take it so nonchalantly you eventually get fired and then go commit a crime again but what do I know",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkilmnx/",
              "created": 1724944976,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkhwspu",
          "score": 12,
          "body": "What if I told you that when you charge $0.10 for a toothbrush, there's not a ton of extra cash to pay above minimum wage.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhwspu/",
          "created": 1724936965,
          "depth": 1,
          "replies": [
            {
              "id": "lkhxsrf",
              "score": 6,
              "body": "I thought they were a 1$??? \n\nI guess paying min wages has its consequences.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhxsrf/",
              "created": 1724937312,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lki2nfj",
          "score": 1,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki2nfj/",
          "created": 1724938989,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkibhdy",
          "score": 1,
          "body": "I'm with this guy. I'd rather pay two dollars more for a gallon of milk at the gas station 1 block down then to walk into the cesspool of DG.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkibhdy/",
          "created": 1724941857,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkio9oc",
          "score": 1,
          "body": "Omg, they are all meth heads and they act like they know your whole family ",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkio9oc/",
          "created": 1724945782,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkisv3b",
          "score": 1,
          "body": "> the workers are usually one step above a meth head.\n\nThey pay so low, I am not surprised that you always see new workers there almost every shopping trip there.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkisv3b/",
          "created": 1724947157,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkht64p",
      "score": 44,
      "body": "It’s wild how they don’t even have the staff to check people out and actually you know get revenue but sure it’s the customers",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkht64p/",
      "created": 1724935628,
      "depth": 0,
      "replies": [
        {
          "id": "lkilney",
          "score": 12,
          "body": "They have staff - they are all just outside smoking",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkilney/",
          "created": 1724944982,
          "depth": 1,
          "replies": [
            {
              "id": "lkj5v36",
              "score": 2,
              "body": "Stores near me have one person working the whole store, a permanently closed self checkout, and a rubber duck to squeeze when I want to pay for my items.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj5v36/",
              "created": 1724951079,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lki3e9n",
      "score": 23,
      "body": "I thought the general consensus was that these types of stores would thrive when consumers are \"financially constrained.\" Are Walmart customers not feeling the same financial burdens? That stock is at an ATH. \n\nI'd like to see what data DG has to support the idea that sales are down because consumers don't have as much to spend. The CEO says \"we know the importance of controlling what we can control,\" but I'd argue not controlling what they can control is their exact problem. Over and over again I see the sentiment about their stores is that they are understaffed by underpaid workers who have zero incentive to do their job well. Products are not shelved properly and customers feel unsafe.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki3e9n/",
      "created": 1724939237,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkhu8b1",
      "score": 51,
      "body": "The stores are dogshit tbh. Nothing is ever stocked. Boxes everywhere. Nobody at the counter most of the time. \n\nMeanwhile Walmart and Costco are hitting ATH consistently",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhu8b1/",
      "created": 1724936026,
      "depth": 0,
      "replies": [
        {
          "id": "lki595d",
          "score": 27,
          "body": "It's 100% a staffing issue. There's one employee that has to do everything at the locations near me. No Self checkout either, so every couple minutes they have to come back from stocking shelves or cleaning something up to go to the register. The store looks exactly what you'd think it would look like without someone dedicated to stocking shelves and sweeping the floor.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki595d/",
          "created": 1724939854,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lki4snn",
      "score": 14,
      "body": "My former neighbor was a DG store manager. He rarely had more than 1 other employee in the store with him during the day. Many days he would be the only person in the store from open to close. Corporate would not send him any relief at all and he often worked open to close seven days a week. Rampant theft and employees working one shift and never coming back. \n\nHe ended up having a stress induced heart attack one morning in the parking lot before opening. While recovering at home his DM kept calling him harassing him about not going back to work sooner. He ended up resigning.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki4snn/",
      "created": 1724939701,
      "depth": 0,
      "replies": [
        {
          "id": "lkj5y89",
          "score": 6,
          "body": "I managed a competing Dollar Tree for a decade. Looking back on it, I don't know why I believed that any of it was ok. My DM checks in to see if I want to come back with an opening comes up, and the idea of working 60 plus hours a week often until 9 or 10 at night and basically every weekend and holidays with maybe 1 other person in the building, plus unloading trucks, gives me fucking hives. \n\nI took a substantial pay cut getting out of retail management, and I don't regret a second of it. 3 day weekend coming up and I'll never have to wake up worrying about who's calling in today.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj5y89/",
          "created": 1724951106,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkhsp4s",
      "score": 11,
      "body": "When I first started investing shares were like 250! Dang",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhsp4s/",
      "created": 1724935449,
      "depth": 0,
      "replies": [
        {
          "id": "lkig95d",
          "score": 3,
          "body": "Holy crap you bought at 3.0413*10^498",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkig95d/",
          "created": 1724943336,
          "depth": 1,
          "replies": [
            {
              "id": "lkkgi32",
              "score": 3,
              "body": "/r/unexpectedfactorial",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkkgi32/",
              "created": 1724965402,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkjmir1",
              "score": 1,
              "body": "Haha that joke took a while",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjmir1/",
              "created": 1724956135,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkqxj1x",
              "score": 1,
              "body": "I didn't buy any thankfully I just remember",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkqxj1x/",
              "created": 1725057829,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkhuf0a",
      "score": 27,
      "body": "\"financially constrained\" lmfao.  More like their stores are stinky, understaffed, and a complete mess inventory wise",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhuf0a/",
      "created": 1724936095,
      "depth": 0,
      "replies": [
        {
          "id": "lkibz1b",
          "score": 8,
          "body": "True, but that is the only store in a lot of small towns across America. My wife and I have a running joke that a town isn’t really a town unless it has a sonic and a dollar general.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkibz1b/",
          "created": 1724942012,
          "depth": 1,
          "replies": [
            {
              "id": "lkimf5w",
              "score": 5,
              "body": "Sonic? Usually a subway. Subway has tons of small locations. \n\nIn my area it's usually Casey's gas stations. A bigger Casey's will have pizza (pretty decent, the breakfast pizzas are the best) and sandwiches. \n\nDG covers the rest.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkimf5w/",
              "created": 1724945215,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkht7uh",
      "score": 17,
      "body": "Didn’t they just have a massive fine from OSHA that also enacted new required policy changes that pretty much defeat the Dollar General “experience”. They had to hire more employees, remove a lot of their moveable standalone shelve units, reduce inventory and hire more training staff. The fine was due to nationwide life safety violations due to all the inventory they stock blocking exits and fire extinguishers.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkht7uh/",
      "created": 1724935647,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lki579e",
      "score": 11,
      "body": "What is DG leadership drinking? Isn’t DG and walmart stores the ones “financially constrained” customers go to? Has dollar general become Nordstrom?",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki579e/",
      "created": 1724939836,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkiv7er",
      "score": 5,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkiv7er/",
      "created": 1724947876,
      "depth": 0,
      "replies": [
        {
          "id": "lkj31ff",
          "score": 2,
          "body": "Poor people think they’re getting a good deal",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj31ff/",
          "created": 1724950235,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkhtzu8",
      "score": 8,
      "body": "“Financially constrained customers “ is the ultimate excuse for every poor performance nowadays.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhtzu8/",
      "created": 1724935939,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkhw5yl",
      "score": 13,
      "body": "I’m baffled why anyone falls for these pirate stores. Just order off amazon at that point, or find the nearest Aldi (100x better). DG is basically a Walgreens without the pharmacy.\n\nMother****ers sell 4 rolls of TP for $5 and claim they’re the bargain store. Meanwhile you get 36 rolls for $25 at Walmart. That’s like 11 more rolls for the same money.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhw5yl/",
      "created": 1724936737,
      "depth": 0,
      "replies": [
        {
          "id": "lkhyixc",
          "score": 3,
          "body": "Those extra rolls will exponentially increase ones hospital bill though.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhyixc/",
          "created": 1724937565,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lki3rbn",
          "score": 3,
          "body": "I buy soda and snacks from DG, and that's it.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki3rbn/",
          "created": 1724939358,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lki4nd6",
          "score": 2,
          "body": "The nearest Aldi to me is 2hrs and 8 minutes away. I know people in my town don't like them too much (including me . I hate it) . But we're rural so it's either there or Walmart. And sometimes when you just want one or two items it's just easier and quicker. I have seen so.e people get whole basketfulls of stuff and I will admit, I don't understand that. Because at that point, it's way cheaper to go to Walmart or order off Amazon",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki4nd6/",
          "created": 1724939653,
          "depth": 1,
          "replies": [
            {
              "id": "lki8coj",
              "score": 5,
              "body": "Well, they prey on rural neighborhoods with no options. Great scam.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki8coj/",
              "created": 1724940868,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkhx5w6",
      "score": 11,
      "body": "To say the headline differently. DG shares crater as customers choose places that actually staff their stores. The shift in business model to reduce headcount to as close to 0 as possible is staring to cost the business.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhx5w6/",
      "created": 1724937093,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkiaq12",
      "score": 3,
      "body": "Amazon and Temu are going to put DG under. The stores are so poorly run and margins are slipping due to the higher cost of everything. They don't have the economy of scale anymore in this higher cost environment. They do not sell any high margin products that can offset the higher cost of everything else.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkiaq12/",
      "created": 1724941619,
      "depth": 0,
      "replies": [
        {
          "id": "lkiu6to",
          "score": 4,
          "body": "Dollar general type purchases aren't things you think about buying snd wait 10 days to get",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkiu6to/",
          "created": 1724947562,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkigo2v",
      "score": 3,
      "body": "Weakness is only at the very low end consumers. I mean this is expected. They are always the first to crack.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkigo2v/",
      "created": 1724943461,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkiosak",
      "score": 4,
      "body": "A lot of dollar stores have terrible presentation and appearance. Product is everywhere and not stacked neatly. It's not that much of a discount from going to Walmart or Target or Aldi or your discount grocery store. \n\nThe value proposition of shopping there is low. If they start investing in their stores then they might start attracting shoppers again.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkiosak/",
      "created": 1724945938,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkhssy6",
      "score": 10,
      "body": "lol if you are DG complaining about your customers struggling you have a huge problem.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhssy6/",
      "created": 1724935490,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkhxcg6",
      "score": 7,
      "body": "Tale of 2 cities. Lower end consumer getting destroyed while higher end doing well buying premium items and fancy things for their dogs(i.e. Chewy). The hollowing out of the middle class continues.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhxcg6/",
      "created": 1724937157,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkielpv",
      "score": 3,
      "body": "Surface level, it feels that Target and Walmart continued to win customers back over these stores by offering decent prices but a vastly superior shopping experience.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkielpv/",
      "created": 1724942828,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lki7v1s",
      "score": 2,
      "body": ">financially constrained customers\n\nIf people can’t afford to shop at dollar general then our economy is in shambles.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki7v1s/",
      "created": 1724940712,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lki8f15",
      "score": 2,
      "body": "shouldn't a weaker economy be a GOOD thing for companies like dollar general, since people who wouldn't normally go there would be more apt to go there?",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki8f15/",
      "created": 1724940889,
      "depth": 0,
      "replies": [
        {
          "id": "lkjjh89",
          "score": 2,
          "body": "Only if they aren't run like crap.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjjh89/",
          "created": 1724955196,
          "depth": 1,
          "replies": [
            {
              "id": "lkjjzrz",
              "score": 1,
              "body": "> Only if they aren't run like crap.\n\neven then, in economically difficult times, customers tend to be willing to put up with a lot more shit to get cheap prices.",
              "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjjzrz/",
              "created": 1724955355,
              "depth": 2,
              "replies": [
                {
                  "id": "lkjkaxu",
                  "score": 2,
                  "body": "They aren't cheaper, that's the problem. They aren't even trying to be competitive in any way.",
                  "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjkaxu/",
                  "created": 1724955450,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkici5z",
      "score": 2,
      "body": "glad i sold at 150.... disgrace\n\nfire everyone and hire a new management",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkici5z/",
      "created": 1724942179,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkio0xs",
      "score": 2,
      "body": "OH THE POOR CANT AFFORD THEIR GROCERIES AND NOW ITS TRICKLE UP ECONOMICS? damn.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkio0xs/",
      "created": 1724945708,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkmahds",
      "score": 2,
      "body": "Where I’m from they have very reasonable prices. However, the quality of service at these stores is absolutely atrocious",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkmahds/",
      "created": 1724989744,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkodjpj",
      "score": 2,
      "body": "Everyone on reddit hates it so might be an interesting investment. I look at what happened last time it dropped after earnings and think this might make a small money LEAPS play interesting. \n\nIf these guys can figure out margins and even get within a sniff of where they were before 2020, this could be an interesting investment at this price. \n\nI don't love the product and would probably want something a bit lower but if it keeps dropping and someone sits in the high 60s in a few months, that I could get into especially if the cash flow keeps flowing and they can get back into buybacks.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkodjpj/",
      "created": 1725027887,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkhz85d",
      "score": 2,
      "body": "Didn't they get into a ton of lawsuits for not accurately pricing their items? And it turns out they sell stuff more expensive than target or Walmart? Probably has nothing to do with it.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhz85d/",
      "created": 1724937810,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lki8xpi",
      "score": 3,
      "body": "Strange, the Commerce Department just revised Q2 GDP upward based on strong consumer spending. It sounds like consumers aren't spending at DG.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki8xpi/",
      "created": 1724941055,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkhrs21",
      "score": 1,
      "body": "When you can't afford to shop at the DG, then you're basically one rung above being homeless. Who would have ever thought that in the year 2024 this is what the world would be like. You'd think we'd be flying hovercrafts, cancer would be cured, and we'd all have eyes like cats and could see in the dark thanks to genetic splicing. \n\nBut nope, people can't even afford to buy garbage.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhrs21/",
      "created": 1724935090,
      "depth": 0,
      "replies": [
        {
          "id": "lkhtskk",
          "score": 9,
          "body": "It’s an excuse. The stores are garbage and poorly run.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhtskk/",
          "created": 1724935864,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkhuf5c",
          "score": 1,
          "body": "genetic splicing dont hear that too often.",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhuf5c/",
          "created": 1724936097,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkhtvaa",
      "score": 2,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhtvaa/",
      "created": 1724935892,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkhubdo",
      "score": 2,
      "body": "Trash food. Go to a grocery store.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhubdo/",
      "created": 1724936058,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lki3njx",
      "score": 2,
      "body": "FYI, the DG on W. Ogeechee St. in Sylvania, Georgia is the cleanest, best organized DG I have ever been in. It is all about the manager and employees who want to do their best.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki3njx/",
      "created": 1724939323,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkhvvl9",
      "score": 3,
      "body": "Oh boy can’t wait we must be close, financially strained consumers can’t go to dollar general anymore",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkhvvl9/",
      "created": 1724936631,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lki61ft",
      "score": 1,
      "body": "they over built, there is like 10 stores within 5 Mile radius around me, cancer shit ",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lki61ft/",
      "created": 1724940115,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkic7u6",
      "score": 1,
      "body": "As someone who used to work at DG, the turnover rate on workers is probably crazy. Not a fun job, with what I was being paid and the workload of running a store with one other person, I sure as hell wasn’t putting a standout performance 😹",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkic7u6/",
      "created": 1724942089,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkid54q",
      "score": 1,
      "body": "I was sure for a min that his was a post from r/economicCollapse",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkid54q/",
      "created": 1724942379,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkihlrc",
      "score": 1,
      "body": "Hm",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkihlrc/",
      "created": 1724943748,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkirfux",
      "score": 1,
      "body": "Those consumers are still waiting for all that wealth to trickle down.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkirfux/",
      "created": 1724946736,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkirxik",
      "score": 1,
      "body": "And for all those saying that customer service sucks you are right.  But that is what you get when you treat your overworked employees like shit.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkirxik/",
      "created": 1724946881,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkivgub",
      "score": 1,
      "body": "Uh aren’t financial constraints supposed to drive consumers to choose you as a retailer? ",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkivgub/",
      "created": 1724947956,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkivlrw",
      "score": 1,
      "body": "It might just be customers getting more savvy and realizing it’s more expensive to shop at dollar stores. Jon Stewart has an episode on this where they reveal it’s actually more expensive to buy cheap  single individual items vs bulk items.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkivlrw/",
      "created": 1724947998,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkiz1p2",
      "score": 1,
      "body": "Damn.  I generally buy puts on these guys and got burned basically every time.  This time I didn’t and… bad choice.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkiz1p2/",
      "created": 1724949037,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkj1zal",
      "score": 1,
      "body": "If it drops then its customers fault, if it goes up then CEO and VPs are too good at making policies for company.!",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj1zal/",
      "created": 1724949915,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkj2sie",
      "score": 1,
      "body": "There's one near me I went to sometimes. The line always took forever. They had a self-checkout for like 2 weeks then shut it down.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj2sie/",
      "created": 1724950159,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkj3h2n",
      "score": 1,
      "body": "It means that with higher interest rates plus shrinkflation, the poor gets poorer much faster than the rich, hence the lower niche consumer spending shrinks. Coupled with online competition, it paints a weaker picture until early 2025.\n\ntldr: Good buying opportunities but wait for recovery of economy first. Not bottom yet.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj3h2n/",
      "created": 1724950364,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkj7vbq",
      "score": 1,
      "body": "But nearly everting else is green on the “strong data”\n\nThis market is nuts.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj7vbq/",
      "created": 1724951683,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkj98cj",
      "score": 1,
      "body": "I love how these C- Suite executives always blame the consumer. When was the last time their CEO actually walked into one of their stores? As other have said, every DG I’ve been to in my community is a fucking dumpster fire.\n\nAs a consumer I’d rather take my spending elsewhere. Not a store filled with unopened boxes in the isles and a skeleton crew of 1 person.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkj98cj/",
      "created": 1724952097,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkjh5p0",
      "score": 1,
      "body": "Would anyone actually buy this stock after the 25-30% dip?  Place was nice when it opened, ran out competitors, raised their prices, closed their self checkouts, place is now a POS 1-2 years after opening.\n\n… not to mention at times needing to stand in line for 10 minutes to get something “quick”.  Very poor customer experience.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjh5p0/",
      "created": 1724954486,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkjhkfb",
      "score": 1,
      "body": "They’re supposed to be the ones relishing in cost consciousness amongst consumers. They backed themselves into this issue",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjhkfb/",
      "created": 1724954614,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkjjc01",
      "score": 1,
      "body": "it's the customer's fault that they can't pay your inflated prices? I know it's probably not your fault that your costs and therefore the prices you have to charge to your customers are also going up, but to blame customers for your shitty finances is a pretty shitty thing to do",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjjc01/",
      "created": 1724955151,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkk7nzw",
      "score": 1,
      "body": "Can you say raised prices too far too fast?  Of course their customers are strapped.  Time to come back in line with real price expectation.  Yep, chip prices need to be realistic - potatoes and rice don't cost that much and neither to the flavorings.  Gas hasn't gone up that far either.  So, why are prices at DG so high?  Doh!!!!  Looks like CFO may have to sell his house on the ICW this year.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkk7nzw/",
      "created": 1724962699,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkk8v8s",
      "score": 1,
      "body": "Well good. I hope this parasitic company shrivels up and dies.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkk8v8s/",
      "created": 1724963061,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkk911r",
      "score": 1,
      "body": "Imagine not be able to afford bootleg hot Cheetos.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkk911r/",
      "created": 1724963111,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkklj6a",
      "score": 1,
      "body": "Every company wants to blame “financially constrained” consumers while acting like they haven’t hiked the price of goods and services far beyond recognized inflation levels in the span of 3 years.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkklj6a/",
      "created": 1724967001,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkkp2ks",
      "score": 1,
      "body": "Their customers are financially constrained, yes. That’s exactly what dollar general is for.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkkp2ks/",
      "created": 1724968149,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkktehh",
      "score": 1,
      "body": "Yea, sure it's the customers that's the problem. You can walk into these stores, the isle are full of boxed up goods. It's like a Ghetto Don Quixote. Coupled with the rising prices, it's just completely avoidable store.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkktehh/",
      "created": 1724969604,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkl1m8j",
      "score": 1,
      "body": "Their stores are literally a scam, Id never go into one. There was a video report on how they never update the price tags on items, because they only staff one person to run the whole store, and people unknowingly overpay for products they buy.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkl1m8j/",
      "created": 1724972476,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lklh8sz",
      "score": 1,
      "body": "10b in revenue and only 375 million in profit. Wtf dumpster fire",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lklh8sz/",
      "created": 1724978168,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lklwpd1",
      "score": 1,
      "body": "Definitely higher prices and more often than not pricing is wrong. But yes lets blame the peasants.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lklwpd1/",
      "created": 1724983947,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lklzoug",
      "score": 1,
      "body": "!RemindMe 6 months",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lklzoug/",
      "created": 1724985142,
      "depth": 0,
      "replies": [
        {
          "id": "lklztq8",
          "score": 1,
          "body": "I will be messaging you in 6 months on [**2025-02-28 02:32:22 UTC**](http://www.wolframalpha.com/input/?i=2025-02-28%2002:32:22%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lklzoug/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1f413tp%2Fdollar_general_shares_crater_20_as_retailer_cuts%2Flklzoug%2F%5D%0A%0ARemindMe%21%202025-02-28%2002%3A32%3A22%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201f413tp)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lklztq8/",
          "created": 1724985198,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkm5l6u",
      "score": 1,
      "body": "Lol so you're saying the poor are really poor? Like beyond poor! Is this Biden economics or build back better at work? \n\nIt's pretty sad when the current administration champions the dollar general crowd and they are struggling. \n\nImagine 8 more years of this folks. That's a 7th of your life spent struggling.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkm5l6u/",
      "created": 1724987591,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkmj0q3",
      "score": 1,
      "body": "That’s what happens when you prey on poor people. Then price gouge them non stop whilst still praying on them.\n\nThey run out of money.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkmj0q3/",
      "created": 1724993966,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkmlnxf",
      "score": 1,
      "body": "I think it's safe to assume that DG's customer base is hurting in this economic environment, post-Covid. It can recover, but be smart about it, or at least smarter more times than they've been dumb since $200+ per share.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkmlnxf/",
      "created": 1724995426,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkn4spw",
      "score": 1,
      "body": "Ay e if our wages abruptly went up 10-20% every year, I think these businesses wil fullyl realize what it feels like.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkn4spw/",
      "created": 1725007451,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkqwf0z",
      "score": 1,
      "body": "When in doubt blame the customer.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkqwf0z/",
      "created": 1725057423,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkzxjyn",
      "score": 1,
      "body": "Scapegoat/Consumer Blaming is crazy. DG has too many locations and is competing with DT and FD stores. They need to cut back financially instead of worrying about targeted consumers' personal finance.",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkzxjyn/",
      "created": 1725202938,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkiqs87",
      "score": 1,
      "body": "I stopped in a dollar general, for the first time in years, on vacation recently just to grab a soccer ball.. no isle was clean.. I couldnt even find what I was looking for.. and the employee was openly making suicide jokes with a coworker.... \n\nOn the way out there was a crew of tweakers to add an extra \"don't come back\" onto the experience",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkiqs87/",
      "created": 1724946539,
      "depth": 0,
      "replies": [
        {
          "id": "lkitz6b",
          "score": 1,
          "body": "My dollar general is spotless but its a newer store our dollar generals are dumps",
          "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkitz6b/",
          "created": 1724947496,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkjcfoj",
      "score": 1,
      "body": "When people can’t even afford the Dollar Store…",
      "permalink": "/r/stocks/comments/1f413tp/dollar_general_shares_crater_20_as_retailer_cuts/lkjcfoj/",
      "created": 1724953062,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "Dollar General shares dropped by 20% after the company lowered its sales and profit forecasts.",
    "companies": [
      "Dollar General",
      "Dollar Tree"
    ],
    "tickers": [
      "DG",
      "DLTR"
    ],
    "main_ticker": [
      "DG"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Dollar General shares dropped 20% after the retailer reduced its sales and profit forecast, claiming that its customers are financially constrained.",
    "stock_recommendations": "The user is indirectly suggesting a negative outlook on Dollar General stock but does not explicitly recommend selling.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": "none",
    "sentiment_summary": "There is negative sentiment surrounding Dollar General's financial performance and outlook due to reduced earnings forecasts and financial struggles of its customer base.",
    "sentiment": "negative"
  }
}