{
  "title": "Best Buy shares jump on profit beat and guidance hike ",
  "score": 30,
  "selftext": "Best Buy raised its fiscal-year profit guidance Thursday after exceeding earnings and revenue expectations for the most recent quarter.\n\nThe retailer now expects to see full-year adjusted earnings per share in the range of $6.10 to $6.35, up from a prior range of $5.75 to $6.20. The company, however, lowered the top end of its guidance ranges for both full-year revenue and comparable sales.\n\n“As we look to the back half of the year, we expect our industry to continue to show increasing stabilization,” Best Buy CFO Matt Bilunas said in the company’s press release.\n\nShares of Best Buy jumped more than 14% in premarket trading Thursday.\n\nHere’s how the consumer electronics retailer did for the period ended August 3 compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:\n\nEarnings per share: $1.34 vs. $1.16 expected\n\nRevenue: $9.29 billion vs. $9.24 billion expected\n\nThe company reported net income for the quarter of $291 million, or $1.34 per share, compared with $274 million, or $1.25 per share, a year earlier. \n\nNet sales in the quarter dropped to $9.29 billion from $9.58 billion during the same period a year earlier.\n\nComparable sales declined 2.3% during the quarter, compared with a 6.2% decline a year earlier.\n\nBest Buy has been in the midst of an attempted turnaround in response to a two-year sales slump. Discretionary merchandise retailers across the board have struggled with softer consumer demand in the wake of unusually high sales throughout the Covid pandemic and as consumers pullback due to high inflation.\n\nAs the much-awaited replacement cycle of pandemic-era tech purchases starts trickling in, the retailer is hoping to cash in through marketing and operational initiatives. Best Buy said in July that it would add trained sales teams to three key parts of its stores — computing, appliance, and home theater — and kick off a marketing campaign that includes YouTube videos to draw consumer interest.\n\nThe company was also betting on a wave of new tech gadget debuts, such as a collection of new iPads launched by Apple in May and artificial intelligence-enabled laptops touted by Microsoft, to drive sales.\n\nThe company on Thursday posted comparable sales growth of 6% in the domestic tablet and computing categories. However, that was “more than offset” by declines in appliances, home theater and gaming, executives said.\n\n“We capitalized on demand driven by our customers’ desire to replace or upgrade their products, combined with new innovation,” CEO Corie Barry said during the company’s earnings call. “We see a consumer who is seeking value in sales events and one who is also willing to spend on high-price-point products when they need to or when there is new, compelling technology.”\n\nBarry said AI could continue to boost sales across categories over the next few years.\n\n“We believe we are just at the beginning of the impact of AI on tech innovation and customer demand,” she said.\n\nSource: https://www.cnbc.com/2024/08/29/best-buy-bby-earnings-q2-2025.html",
  "link_flair_text": null,
  "id": "1f41rqr",
  "num_comments": 7,
  "created_utc": 1724936385,
  "permalink": "/r/stocks/comments/1f41rqr/best_buy_shares_jump_on_profit_beat_and_guidance/",
  "comments": [
    {
      "id": "lkivrgw",
      "score": 5,
      "body": "Interesting analysis on overall pandemic influence to sales patterns.  \n\n\nOf course they just had to add some brainless little comment about AI there at the end.  ",
      "permalink": "/r/stocks/comments/1f41rqr/best_buy_shares_jump_on_profit_beat_and_guidance/lkivrgw/",
      "created": 1724948046,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkid6of",
      "score": 6,
      "body": "Anyone have a take on Best Buy’s long term potential? I don’t see their brick and motor model staying viable in the long run, maybe another shelf life of 10 years at most. How are they going to adapt?",
      "permalink": "/r/stocks/comments/1f41rqr/best_buy_shares_jump_on_profit_beat_and_guidance/lkid6of/",
      "created": 1724942392,
      "depth": 0,
      "replies": [
        {
          "id": "lkju88v",
          "score": 5,
          "body": "It's always going to be the more focused alternative to hitting up Walmart or Target to buy a new phone, laptop, or TV. Long as their employees are more active than say Circuit City's were in actually helping customers and targeting sales goals, they should be fine.",
          "permalink": "/r/stocks/comments/1f41rqr/best_buy_shares_jump_on_profit_beat_and_guidance/lkju88v/",
          "created": 1724958535,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkj18g8",
          "score": 2,
          "body": "It's 2024 if they haven't closed already from econ sites then they would be fine plus not much competition from brick and motor tech stores",
          "permalink": "/r/stocks/comments/1f41rqr/best_buy_shares_jump_on_profit_beat_and_guidance/lkj18g8/",
          "created": 1724949691,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkiwzhq",
      "score": 1,
      "body": ">Domestic revenue of $8.62 billion decreased 3.0% versus last year primarily driven by a comparable sales decline of 2.3%.\n>\n>From a merchandising perspective, the largest drivers of the comparable sales decline on a weighted basis were appliances, home theater and gaming. These drivers were partially offset by growth in the tablets, computing and services categories.\n\n\nFrom the letter.",
      "permalink": "/r/stocks/comments/1f41rqr/best_buy_shares_jump_on_profit_beat_and_guidance/lkiwzhq/",
      "created": 1724948413,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkp7vsa",
      "score": 1,
      "body": "Best Buy's recent earnings report reflects a strategic pivot in response to [market conditions](https://publicsaascompanies.com). The increase in profit guidance, despite a decline in comparable sales, highlights the company's ability to adapt.\nTheir focus on new technology launches and enhancing in-store experiences could attract consumers looking for value. Additionally, the integration of AI in their operations may not only streamline processes but also enhance customer engagement, potentially driving sales in the long term. Best Buy's efforts to stabilize its business model amidst a challenging retail environment are commendable, and investors should watch how these initiatives unfold.",
      "permalink": "/r/stocks/comments/1f41rqr/best_buy_shares_jump_on_profit_beat_and_guidance/lkp7vsa/",
      "created": 1725037407,
      "depth": 0,
      "replies": []
    }
  ]
}