{
  "title": "American Eagle saw profits grow nearly 60% as costs come down ",
  "score": 138,
  "selftext": "American Eagle missed Wall Street’s sales targets for a second quarter in a row on Thursday, but profits grew by nearly 60% thanks in part to lower product costs. \n\nShares fell more than 5% in premarket trading Thursday.\n\nHere’s how the apparel company did in its second fiscal quarter compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:\n\nEarnings per share: 39 cents vs. 38 cents expected \n\nRevenue: $1.29 billion vs. $1.31 billion expected \n\nThe company’s reported net income for the three-month period that ended Aug. 3 was $77.3 million, or 39 cents per share, compared with $48.6 million, or 25 cents per share, a year earlier. \n\nSales rose to $1.29 billion, up about 8% from $1.2 billion a year earlier. That sales gain would have been slimmer had it not been for a calendar shift, which positively impacted second-quarter sales by $55 million.\n\nDuring the quarter, American Eagle’s intimates line Aerie saw revenue grow 9% while its namesake brand grew by 8%. \n\nAmerican Eagle’s gross margin came in at 38.6% — 0.9 percentage points higher than the prior year and in line with what analysts had expected. The gross margin expansion was led by “favorable product costs,” indicating American Eagle spent less to make its assortment during the quarter. It’s unclear if it lowered prices as a result.\n\nThe longtime mall brand issued a better-than-expected outlook for the current quarter but its forecast was lower than anticipated for the full year, indicating the company is still bracing for a turbulent second half. \n\nFor the current quarter, American Eagle expects comparable sales to grow between 3% and 4%, which is better than the 2.8% growth that analysts had expected the company to forecast, according to StreetAccount. \n\nThe retailer is expecting total revenue to be flat to up slightly for the third quarter — in line with expectations, according to LSEG.\n\nFor the year, the company expects comparable sales to increase approximately 4%, with total revenue up 2% to 3%, shy of what analysts had expected. Wall Street was expecting its full-year comparable sales forecast to be up 4.2% and overall sales to be up 3.5%, according to StreetAccount and LSEG.\n\nIn May, Finance Chief Mike Mathias told CNBC that American Eagle is maintaining a “cautious” view for the back half of the year as it awaits interest rate decisions from the Federal Reserve and prepares for “noise” around the upcoming presidential election. \n\nLike other retailers contending with slowing demand for discretionary items, American Eagle has looked to cut costs and boost efficiencies so it can protect profits, even if sales are sluggish. Earlier this year, it unveiled a new strategy to grow profits and is working to boost sales by 3% to 5% each year over the next three years and get its operating margin to about 10%.\n\nDuring the quarter, American Eagle made some strides in achieving that goal. It posted an operating income of $101 million, an increase of 55%, while its operating margin grew 2.4 percentage points to 7.8%. Operating income would have been lower had it not been for the calendar shift, which positively impacted the metric by $20 million. \n\nSource: https://www.cnbc.com/2024/08/29/american-eagle-aeo-earnings-q2-2024.html",
  "link_flair_text": null,
  "id": "1f422hg",
  "num_comments": 27,
  "created_utc": 1724937169,
  "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/",
  "comments": [
    {
      "id": "lki05y8",
      "score": 77,
      "body": "All of there products are made in China, Vietnam and Mexico.",
      "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lki05y8/",
      "created": 1724938133,
      "depth": 0,
      "replies": [
        {
          "id": "lki2lq5",
          "score": 69,
          "body": "Yep wouldn’t be very American if they weren’t made on the back of underpaid pseudoslave labor.",
          "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lki2lq5/",
          "created": 1724938973,
          "depth": 1,
          "replies": [
            {
              "id": "lkiknrg",
              "score": 6,
              "body": "Or actual slave labor, historically.",
              "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkiknrg/",
              "created": 1724944681,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkje0e6",
              "score": -2,
              "body": "Underpaid compared to rates in America but not in their respective countries",
              "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkje0e6/",
              "created": 1724953538,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkloybi",
          "score": 5,
          "body": "We must bring value to our shareholders!\n\n Outsource! Outsource! Outsource!",
          "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkloybi/",
          "created": 1724980994,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkmnb64",
          "score": 1,
          "body": "Mostly china, and it’s always so disappointing how shitty the quality is",
          "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkmnb64/",
          "created": 1724996363,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lki2j0z",
      "score": 78,
      "body": "this just means they switched to sketchier factories that likely employ sweat shop labor. sad",
      "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lki2j0z/",
      "created": 1724938947,
      "depth": 0,
      "replies": [
        {
          "id": "lki2zgx",
          "score": 25,
          "body": "I had kinda just assumed most of the fast fashion brands had already made that switch.",
          "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lki2zgx/",
          "created": 1724939101,
          "depth": 1,
          "replies": [
            {
              "id": "lki49wk",
              "score": 8,
              "body": "feel like mostly anything fashion wise is.",
              "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lki49wk/",
              "created": 1724939529,
              "depth": 2,
              "replies": [
                {
                  "id": "lki5m11",
                  "score": 4,
                  "body": "Yeah, at least for the publicly traded companies. You can still find smaller private brands that still try and make a good long lasting product. Although they usually only do that until they get big enough to be publicly traded, and then start doing the cost cutting following everyone else.",
                  "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lki5m11/",
                  "created": 1724939975,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkik915",
          "score": 6,
          "body": "And they will never ever pass along those savings to the consumer. But expanses? Absolutely pass those along to the consumer.",
          "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkik915/",
          "created": 1724944557,
          "depth": 1,
          "replies": [
            {
              "id": "lkiqpoe",
              "score": 3,
              "body": "anyone considering buying fast fashion who can afford something better should watch Nocebo. it’s barbaric that companies are even legally allowed to source from suppliers that operate this way for the American market. it should be banned",
              "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkiqpoe/",
              "created": 1724946518,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkilt8p",
              "score": -3,
              "body": "When your competitors are able to offer their product for cheaper than you could due to cheaper manufacturing overseas to take your customers, and your response is to do the same, aren't those cost savings passed down to customers?",
              "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkilt8p/",
              "created": 1724945030,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkiwmmn",
      "score": 23,
      "body": "The materials they use for clothes also went from cotton to some cheap polyester \n\nAnd this is happening to a lot of other brands as well. Things are just shittier these days",
      "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkiwmmn/",
      "created": 1724948307,
      "depth": 0,
      "replies": [
        {
          "id": "lkji5qp",
          "score": 14,
          "body": "I used to SWEAR by American Eagle Jeans - they were like the ideal slightly overweight millenial man's jeans. Now they tear in various places after just a few months :(",
          "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkji5qp/",
          "created": 1724954792,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkjqs2e",
          "score": 3,
          "body": "I have an older pair of AE shorts. Those things feel so durable. I recently ordered a pair and they feel like a gust of wind could unravel them.",
          "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkjqs2e/",
          "created": 1724957460,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkjio0f",
      "score": 16,
      "body": "So they're making shittier clothes and selling them at the same or inflated prices?",
      "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkjio0f/",
      "created": 1724954947,
      "depth": 0,
      "replies": [
        {
          "id": "lklzeo3",
          "score": 4,
          "body": "Oldest trick in the book",
          "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lklzeo3/",
          "created": 1724985025,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkiiv88",
      "score": 5,
      "body": "I used to love this brand during high school and early college but to me Abercrombie is in the same market tier and has had an amazing rebound without sacrificing quality.",
      "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkiiv88/",
      "created": 1724944138,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lklzcng",
      "score": 6,
      "body": "Chinese Eagle ",
      "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lklzcng/",
      "created": 1724985003,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkjyx1y",
      "score": 4,
      "body": "Cutting cost means that their clothes will probably only last for about three washes now.",
      "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkjyx1y/",
      "created": 1724960024,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkntk1v",
      "score": 2,
      "body": "I love the clothing companies posts because it always reminds me redditors a) rarely go outside b) can’t dress themselves outside of graphic cartoon tees and gym shorts.",
      "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkntk1v/",
      "created": 1725020771,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkiu7g0",
      "score": -2,
      "body": "Gen Alpha saw what brands their Millennial parents had in their closet and decided that's what they needed next, now that JNCO's and mid/late 90's clothing is in fashion",
      "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkiu7g0/",
      "created": 1724947567,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkiu2il",
      "score": -3,
      "body": "I didn't even know they were still in business.  I figured they died when malls died.",
      "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/lkiu2il/",
      "created": 1724947525,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llah4uw",
      "score": 1,
      "body": "Clothes are a scam dry some leaves and glue.",
      "permalink": "/r/stocks/comments/1f422hg/american_eagle_saw_profits_grow_nearly_60_as/llah4uw/",
      "created": 1725363636,
      "depth": 0,
      "replies": []
    }
  ]
}