{
  "title": "Apple, Nvidia in talks to join OpenAI funding round, media reports say",
  "score": 148,
  "selftext": "Source is [WSJ](https://archive.ph/6xB7b) & [Bloomberg](https://archive.ph/Tr024) via [Reuters](https://www.reuters.com/technology/apple-talks-join-openai-funding-round-wsj-reports-2024-08-29/). \n\n>The Wall Street Journal first reported on Apple's interest, citing sources, while Bloomberg News reported on Nvidia's potential involvement.\nThe news comes a day after the Journal reported that venture capital firm Thrive Capital would invest around $1 billion in OpenAI, leading the funding round.\n\n> Apple and OpenAI not immediately respond to Reuters requests for comment, while Thrive Capital, Nvidia and Microsoft declined comment.\nOpenAI has become increasingly important to Apple's artificial intelligence strategy, with the iPhone maker bringing the AI firm's chatbot, ChatGPT, to Apple devices in June as part of \"Apple Intelligence.\"\n\n>Apple was also reported to gain an observer role on OpenAI's board.\n\n>Microsoft (MSFT.O), opens new tab, OpenAI's largest strategic investor with over $10 billion invested, is also expected to participate in the funding round, according to the WSJ report.\n\n>The exact investment amounts from Apple, Microsoft and Nvidia remain undisclosed.\nOpenAI's high valuation is a result of the AI arms race it sparked with the launch of ChatGPT in late 2022, prompting companies across industries to invest billions in the technology to stay ahead of the competition and capture market share.\n\n(Note on Archive links: I provide them because I don't have access to Bloomberg/WSJ. One caveat is these are *archived* therefore if there's updates on the article it might not be reflected)",
  "link_flair_text": "Industry Discussion",
  "id": "1f4by79",
  "num_comments": 63,
  "created_utc": 1724961652,
  "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/",
  "comments": [
    {
      "id": "lkm1mgy",
      "score": 21,
      "body": "The investing amount seems really small. I'm seeing about $3b is the goal from OpenAI. There's an AI goldrush and companies with large balance sheets would rather invest a tiny amount to have eyes in the development process. Nonetheless, a $1b investment from Apple or Nvidia would be less than 1% of the OpenAI valuation.",
      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkm1mgy/",
      "created": 1724985930,
      "depth": 0,
      "replies": [
        {
          "id": "lkmb7aj",
          "score": 7,
          "body": "On a podcast I was half-listening to they said Apple can become a valuable distribution channel -- it will be an app that's bundled automatically with Apple and therefore every new Apple user will experience and get hooked on it.\n\nAs for Nvidia, I assume they will contribute not just monetarily but also by offering lots of free resources.",
          "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkmb7aj/",
          "created": 1724990074,
          "depth": 1,
          "replies": [
            {
              "id": "lkuaklf",
              "score": 1,
              "body": "Personally, I don’t see how any bundling or defaulting can survive the recent Google decision?\n\nWhy should OpenAI, and by extension Microsoft, get to abuse their market power by tying up with Apple while Google is shut out? It doesn’t make sense.",
              "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkuaklf/",
              "created": 1725116480,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkn2x3c",
              "score": 1,
              "body": "And the majority of the world will use Android and Google's AI. Google will win.",
              "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkn2x3c/",
              "created": 1725006203,
              "depth": 2,
              "replies": [
                {
                  "id": "lknxv7x",
                  "score": 2,
                  "body": "I think you're under estimating the brand value of ChatGPT. ChatGPT will always be associated with AI whenever people hear it, it's name is the closest thing to a synonym for AI of all the AI brands out there today.\n\nNot to mention Google's many screw ups with their AI products have no doubt caused some brand destruction of their AI products. People simply have a way higher standard for Google's AI products, and are much more willing to overlook it when ChatGPT hallucinates.\n\nAlso being on a bunch of devices doesn't mean that you'll win the market, or people will think that you're the superior product. Just look at Siri, which is so hated that reportedly not even other divisions at Apple want to use it in their Apple products. It doesn't matter that there's 1.5 billion iPhones worldwide with Siri pre-installed.",
                  "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lknxv7x/",
                  "created": 1725022447,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkqkfto",
                      "score": 3,
                      "body": "People will always associate Skype with video calls and Nokia with phones",
                      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkqkfto/",
                      "created": 1725053213,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lko9usc",
                      "score": 0,
                      "body": "I guess we'll see what's the better product at the end of the day. I hope they're both good because competition is good for you and me.\n\nBut what your wrote is ridiculous and I think you're just trolling.",
                      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lko9usc/",
                      "created": 1725026677,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lkpsgqz",
              "score": 0,
              "body": "An app that’s bundled? It’s already on the App Store. It’s one of the most downloaded apps. Wouldn’t change much to be bundled nor would it be safe for privacy.",
              "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkpsgqz/",
              "created": 1725044012,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkl0pnb",
      "score": 85,
      "body": "Just to be clear, Google is going to zero because OpenAI is going to magically replace 25+ years of consumer and advertiser behavior after raising $20B and deploying like 500 or whatever people at creating the Google killer.\n\nAt the same time, Google is also going to zero because it is an unstoppable monopoly who owns search so hard that any agreements they have with anyone amount to violations of the Sherman Act?\n\nThese two concepts are as mutually exclusive as they can get. What it feels like is literally any news about Google basically tanks the shares. I'll bet they could win their appeal and the FTC would completely back off and the fucking stock would drop 7%.",
      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkl0pnb/",
      "created": 1724972156,
      "depth": 0,
      "replies": [
        {
          "id": "lklc0o2",
          "score": 12,
          "body": "First stock to go double 0 obviously. 007",
          "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lklc0o2/",
          "created": 1724976246,
          "depth": 1,
          "replies": [
            {
              "id": "lklwmpe",
              "score": 21,
              "body": "It is honestly impressive. The idea that you can just snap your fingers and CRAWL THE ENTIRE FUCKING INTERNET to make a relevant search engine against a company that figured out how to do it profitably at an unimaginable scale and proved that for decades along with convincing every single other business that EXISTS to advertise on their platform and then built tools to allow those businesses to help themselves when creating their revenue stream is a truly mind-boggling moat.\n\nIn the trial transcript, Microsoft literally offered to just give Apple Bing for free and they declined because it is so shit compared to Google. I feel like the PR team at Microsoft needs to win a medal or something for the sales job into the financial press that they did starting in November 2022.",
              "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lklwmpe/",
              "created": 1724983918,
              "depth": 2,
              "replies": [
                {
                  "id": "lkm93fx",
                  "score": 8,
                  "body": "I agree in principle with what you’re saying, in that Google is a giant with a deep and wide moat and it won’t be easy to dethrone them. However, they’re an ad company and have never really been able to make anything else pay the bills. That leaves them seeming, to me, to be a little more vulnerable than a company like Apple that is making money on hardware sales as well as a myriad of services, or a company like Microsoft that can also say the same. \n\nApple and Microsoft make a profit on things people like, generally speaking — smart devices, cloud services, etc.\n\nGoogle makes a profit by creating a necessary product and injecting something people hate into it — ads. Something people are always trying to find a way around. Something people are always trying to block.",
                  "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkm93fx/",
                  "created": 1724989116,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkn0g80",
                      "score": 8,
                      "body": "That's just not true though about not able to find anything else, other revenue grows every year as a % of revenue.\n\n[https://www.statista.com/statistics/1093781/distribution-of-googles-revenues-by-segment/](https://www.statista.com/statistics/1093781/distribution-of-googles-revenues-by-segment/)\n\n  \n[https://www.doofinder.com/en/statistics/google-revenue-breakdown](https://www.doofinder.com/en/statistics/google-revenue-breakdown)\n\nIf you remove Google Search altogether it would still be an absolutely massive company.\n\nThe problem is that it looks like they can't find other revenue because search & ads have never stopped compounding at a fantastic rate.",
                      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkn0g80/",
                      "created": 1725004568,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkpdnpf",
                          "score": 1,
                          "body": "> That's just not true though about not able to find anything else, other revenue grows every year as a % of revenue.\n\n... According to your link, since 2017 their ad revenues have gone from making up 87% of their revenue, to making up 78% of their revenue.\n\nYes, I was aware that some of their services have been slowly growing but they are still *overwhelmingly* an ad company, 4/5ths of their revenue comes from ads.\n\nThey've been trying to find other cash cows. I'd say they still can't make anything else pay the bills.\n\nContrast this with Apple. Everyone thinks Apple = iPhone, but the iPhone makes up less than half of their revenues.",
                          "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkpdnpf/",
                          "created": 1725039247,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lkqqz0e",
                              "score": 1,
                              "body": "You didn't follow my point about baseline. When something makes up a huge portion, it either needs to decline for the \"other\" to replace it, or the \"other\" has to grow at a much faster rate.\n\nThe fact it's shrinking is extremely positive considering search has never stopped growing. There are 70 billion alone on other and cloud. To put that in perspective, it's basically twice the size of Eli Lilly. Would you say a business twice as big as Eli Lilly is struggling when it's growing 20-30%?",
                              "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkqqz0e/",
                              "created": 1725055457,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "llfcaoo",
                          "score": 1,
                          "body": "Just checked the articles, thanks. Still looks like way too much revenue is tied to ads. Any change - and you know it can happen fast - would shrink those numbers dry",
                          "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/llfcaoo/",
                          "created": 1725428857,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lkmawc6",
                      "score": 7,
                      "body": "> never really been able to make anything else pay the bills\n\nI think they might make progress with youtube, cloud, self-driving cars, and maybe android. But I get what you're saying.",
                      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkmawc6/",
                      "created": 1724989934,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkmb5af",
                          "score": 6,
                          "body": "YouTube revenue is driven by ads, or getting people to pay for the ads to go away lol. With cloud yeah they could maybe grow their arsenal",
                          "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkmb5af/",
                          "created": 1724990048,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "llarlse",
                              "score": 1,
                              "body": "#cost of running YouTube = $5bn\n#Ad revenue from YouTube = $3.5bn\n\nReason why Google do not care = it improves its search engine",
                              "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/llarlse/",
                              "created": 1725368208,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lkmbojs",
                              "score": 1,
                              "body": "> getting people to pay for the ads to go away lol\n\nIt is getting impossible I finally bit the bullet and bought their stupid package rofl.",
                              "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkmbojs/",
                              "created": 1724990298,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lkn2npg",
                      "score": 3,
                      "body": "But what they did to ads is phenomenal. They made them taylored. So instead of seeing an ad from a pharmaceutical or gambling company, I get to see an ad for something I'm interested in. Everyone wins. Plus, I know Google will never sell my data as it's so valuable to them.",
                      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkn2npg/",
                      "created": 1725006032,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lko5opj",
                      "score": 1,
                      "body": "Apple is a phone company. \n\nAsk Nokia, Palm, Research in Motion, or Motorola how fragile that market is? BlackBerry was the king shit daddy there for a good while and seemed secure as the premiere device for everyone serious, then got beaten. There hasn’t been meaningful innovation there in several cycles and at this point, Apple’s top line is starting to show signs of limited growth. Also, they are about to lose $20B of free money annually, so R&D budgets are going to be constrained. Meanwhile, Google is gonna save $20B annually and everyone will use Google anyway. \n\nMicrosoft hasn’t convinced a new business to use their stack since probably 2006. Individuals who work for companies choose Apple and the servers new companies run are AWS running Node or Python. Nobody is affirmatively choosing to pay big licensing fees to Microsoft for an unstable DB platform or an application layer when open source options are available and highly competitive.",
                      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lko5opj/",
                      "created": 1725025267,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkpe5n7",
                          "score": 3,
                          "body": "> Apple is a phone company.\n\nAs of Q3 2024, the iPhone makes up less than half of their revenues. Even if you subtract the 20B from annual services revenue, the iPhone is still less than half of their revenues. iPad, Mac, wearables and services make up more than iPhone.",
                          "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkpe5n7/",
                          "created": 1725039406,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lkylp5g",
                              "score": 1,
                              "body": "However the lack of 18 billion in donations from Google will have a direct 16 billion dollar impact on their bottom line, since it's an absolute number taken away from their earnings.\n\nConsidering that they earned something like 95 billion after taxes last year, all that this loss of revenue does is completely reprice the business. Their visible margins become lower so their ROCE, ROE and other ratios get impacted.",
                              "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkylp5g/",
                              "created": 1725179708,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ll0j8hr",
                                  "score": 1,
                                  "body": "yeah, it's almost an entire quarter's operating income. however the fact that the market hasn't completely repriced their business.. makes me think something is missing",
                                  "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/ll0j8hr/",
                                  "created": 1725210042,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ll0luol",
                                      "score": 1,
                                      "body": "Apple has been aggressively buying back their outstanding shares and also the market is expecting a big jump in earnings from services.\n\nThe other thing is that the Google situation is currently uncertain, because appeals and a long drawn process to avoid major damage is possible at this stage.\n\nHaving said all that, you and I both know it's just because the market always looks irrational in the short term and big investors will only offload their positions when you and I least expect it.",
                                      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/ll0luol/",
                                      "created": 1725210890,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "lkq7dt4",
                              "score": 0,
                              "body": "Literally all of the wearables and service revenue flows forth from the iPhone. Why would anyone buy AirPods if the iPhone did not exist? \n\nApple is purely a consumer goods company, they have no penetration into anything other than iPhones are cool looking. If iPhone went away tomorrow, just like Blackberry did, Apple is fucked. Just as fucked as Google would be if search went away, which it will not because Google search literally drives all business across the entire planet. If Google search went away, a non-zero number of people would die on an operating table somewhere. iPhone has no such attachment.",
                              "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkq7dt4/",
                              "created": 1725048916,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lkr12gm",
                                  "score": 2,
                                  "body": "> Literally all of the wearables and service revenue flows forth from the iPhone. Why would anyone buy AirPods if the iPhone did not exist?\n\nyeah, that's a good point lol. I can't argue with you there. in that senes, they're still very reliant on the iPhone.\n\nalthough I'd say you're exaggerating a little -- not *all* services revenue flows from iPhone. people use iCloud on Mac and iPad too",
                                  "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkr12gm/",
                                  "created": 1725059133,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lkskh51",
                                      "score": 1,
                                      "body": "Sure, but the overwhelming majority of photos are taken on iPhones. Cloud storage is absolutely a commodity at this point. Your laptop has enough onboard hard drive to handle most of what you do, especially if you’re using cloud based office solutions. \n\n  \nApple would still be a huge company without the iPhone, but nowhere near the $3T behemoth it currently is. I view their moat as much narrower than Google’s because consumer taste is fickle. Hell, the Motorola Razr was the hottest phone on the planet in 2006, the year that the verb “Google” was added to the dictionary.",
                                      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkskh51/",
                                      "created": 1725083720,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lkydfij",
                  "score": 1,
                  "body": "No, Apple declined Bing because Google offered to pay them up to $18bn each year to feature Google as the primary search Engine.\n\nIf you pay me to use your product, that sure as hell beats receiving that product for free.",
                  "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkydfij/",
                  "created": 1725174234,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkzehoq",
                      "score": 1,
                      "body": "You’re not comprehending. Microsoft offered to give Apple Bing entirely and let Apple make money from it (or not). Literally Microsoft offered 100% of Bing’s revenue and it was turned down. \n\nSatya Nadella then ran like a little bitch to the teacher on the playground and cried his crocodile tears about it being Google’s Internet, as though MSFT is not itself a monopolist.",
                      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkzehoq/",
                      "created": 1725196094,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkzibqy",
                          "score": 1,
                          "body": "Because revenue from bing was uncertain while Google was giving much more money than what they would have made from Bing. Google owning 90%+ of the search market is no joke.",
                          "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkzibqy/",
                          "created": 1725197603,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lkzwre0",
                              "score": 1,
                              "body": "I’m not sure I understand your point? Microsoft makes an inferior product, has difficulty selling it to Apple. Google didn’t threaten those negotiations, nor did they implore Apple to do anything beyond compare their options on a level playing field. \n\nGoogle owns 90% of search because they make the best search engine. Making the best product is not abuse of market position, and if the deal with Apple is anti-competitive, then basically any tie up between any of the Magnificent 7 companies is anti-competitive because they are al monopolists in some way.",
                              "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkzwre0/",
                              "created": 1725202666,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ll0atj0",
                                  "score": 1,
                                  "body": "The point is that Apple considers the Google deal to be more valuable than growing Bing's share for Microsoft.",
                                  "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/ll0atj0/",
                                  "created": 1725207287,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lkogmqp",
          "score": 1,
          "body": "At this point, it's a dead stock for a while while still being a good company. \n\n\nIt didn't rebound well with the Nasdaq this month and now that index feels like it's in distribution mode before it goes lower, so the odds of it at least testing the 2021 bull market highs again are high.",
          "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkogmqp/",
          "created": 1725028872,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkm7mao",
          "score": -3,
          "body": "FTC will fine google a historic 100 million. After Brin stops laughing Google proceeds to strangle all competition",
          "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkm7mao/",
          "created": 1724988459,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkl0u7b",
      "score": 31,
      "body": "Google lucked out buying deepmind when they did, now their competitors can only partially invest and have zero control/ownership while google does everything in house.",
      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkl0u7b/",
      "created": 1724972200,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkmjwyv",
      "score": 6,
      "body": "More jackets for Jensen.",
      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkmjwyv/",
      "created": 1724994452,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkmr047",
      "score": 4,
      "body": "What’s Apple gaining with the investment?\n\nNvidia can continue selling their chips to one of their best customers and Microsoft has a incentive by selling cloud services.",
      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkmr047/",
      "created": 1724998527,
      "depth": 0,
      "replies": [
        {
          "id": "lknmef8",
          "score": 2,
          "body": "> What’s Apple gaining with the investment?\n\nFinally turning Siri into something useful?",
          "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lknmef8/",
          "created": 1725017725,
          "depth": 1,
          "replies": [
            {
              "id": "lknq0rn",
              "score": 1,
              "body": "But that’s what they have already announced 1-2 months ago. Even without investing in them, ChatGPT would be available on iOS.",
              "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lknq0rn/",
              "created": 1725019298,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkpsrrd",
              "score": 1,
              "body": "Siri still shit today. Meanwhile Gemini Live is better.",
              "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkpsrrd/",
              "created": 1725044110,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lktsa81",
      "score": 2,
      "body": "as someone who knows a thing or two about AI, OpenAI is the last place I’d wanna work with. They’re unprofessional and getting less innovative by the day. Their new AI model (4o and 4o mini), was hyped as an upgrade, but it’s actually worse than the old one. And that Sora project they’re all excited about? It’s no better than the free and open-source LunaAI, which only took a few months to make. Seriously, LunaAI is just as good and it didn’t take forever to develop. OpenAI doesn’t have any fresh ideas either, just rehashing and upgrading their existing models. It’s pretty disappointing. I sold half my NVDA shares after hearing this crappy news.",
      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lktsa81/",
      "created": 1725109754,
      "depth": 0,
      "replies": [
        {
          "id": "ll1fpxi",
          "score": 1,
          "body": "Only half? I shorted at 140 to 120, then stayed away from it because the earnings pullback was almost guaranteed (too high expectations, volatility concerns from the carry trade fiasco), then bought at 117 (14,000 shares) and sold recently at 120 due to lack of faith. I'm a former senior se and have some experience in ML, I do believe LLMs are great and they're gonna lead to operational efficiency gains and some limited revenue avenues but I seriously don't think the cash flow will ever lead up to the ridiculous market caps they've cultivated.",
          "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/ll1fpxi/",
          "created": 1725220934,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lknky7e",
      "score": 1,
      "body": "I would like the join",
      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lknky7e/",
      "created": 1725017042,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkk8v99",
      "score": -6,
      "body": "Will this affect Microsoft in any way?",
      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkk8v99/",
      "created": 1724963061,
      "depth": 0,
      "replies": [
        {
          "id": "lkkp2ek",
          "score": 18,
          "body": "It literally says in the post\n\n>Microsoft (MSFT.O), opens new tab, OpenAI's largest strategic investor with over $10 billion invested, is also expected to participate in the funding round, according to the WSJ report.",
          "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkkp2ek/",
          "created": 1724968148,
          "depth": 1,
          "replies": [
            {
              "id": "lkkqldv",
              "score": 5,
              "body": "I read that, I’m curious how this will affect their current 49% equity.",
              "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkkqldv/",
              "created": 1724968651,
              "depth": 2,
              "replies": [
                {
                  "id": "lklzy3e",
                  "score": 6,
                  "body": "MS owns 49% of OpenAI?????????????\n\nBRB dumping my 401k into MS.",
                  "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lklzy3e/",
                  "created": 1724985247,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkmj7k5",
                  "score": 2,
                  "body": "Wrong. MSFT owns rights to 49% of profit pre actual AI. The rights stop when advanced AI is developed. MSFT does NOT own equity. So OpenAI can kick MSFT any time their board feels like declaring it.",
                  "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkmj7k5/",
                  "created": 1724994068,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lknubou",
                      "score": 1,
                      "body": "IF advanced AI is developed. OpenAI still cant get past the Raspberry problem after all the investment so far.",
                      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lknubou/",
                      "created": 1725021081,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lktyx3g",
                          "score": 1,
                          "body": "Can you explain the raspberry problem? I did a quick Google and I'm not seeing it referenced.",
                          "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lktyx3g/",
                          "created": 1725112344,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lkkamoz",
          "score": 1,
          "body": "Microsoft is rumoured to be in this investment round as well.",
          "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkkamoz/",
          "created": 1724963602,
          "depth": 1,
          "replies": [
            {
              "id": "lkl54bb",
              "score": 2,
              "body": "This would tip them over 50% ownership though?",
              "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkl54bb/",
              "created": 1724973729,
              "depth": 2,
              "replies": [
                {
                  "id": "lkl97sv",
                  "score": 5,
                  "body": "Open AI governance is super complicated which will make their IPO a bit difficult for investors to digest. Microsoft is an investor in an Open AI holding company with capped revenues that is owned by the Open AI charity. It is mad confusing \nhttps://www.ft.com/content/458b162d-c97a-4464-8afc-72d65afb28ed",
                  "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkl97sv/",
                  "created": 1724975218,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lklwtos",
                      "score": 1,
                      "body": "Eventually I think this will all come to grief. They lost Ilya, it is only a matter of time now.",
                      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lklwtos/",
                      "created": 1724983993,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lknwcff",
                      "score": 1,
                      "body": "Enron governance was also super complicated!",
                      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lknwcff/",
                      "created": 1725021870,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lkmk6ju",
                      "score": 1,
                      "body": "If MS owns 49% at 13 billion, how does Nvidia and Apple investing 100 billion work?",
                      "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkmk6ju/",
                      "created": 1724994598,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lkmvwjz",
                  "score": 4,
                  "body": "msft doesn't own shit, they just have a right of 49% of profits for a limited period, if there are profits at all.",
                  "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lkmvwjz/",
                  "created": 1725001585,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lknfeyi",
                  "score": 1,
                  "body": "MS isn‘t owning a part of OpenAI. They have the 49% right to some profits, but only to a certain degree.",
                  "permalink": "/r/stocks/comments/1f4by79/apple_nvidia_in_talks_to_join_openai_funding/lknfeyi/",
                  "created": 1725014150,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}