{
  "title": "Deep dive into Lululemon - Outsmarting Nike and Adidas",
  "score": 82,
  "selftext": "**1.0 Introduction**\n\nAt first glance, Lululemon seems like an apparel company that somehow continues to do well, despite selling overpriced products. \n\nHowever, there’s a lot more than that. I’ll argue it should be a case study in every business school, as it continues to outsmart giants like Nike and Adidas.\n\nLululemon has been growing its revenue at an average rate **above 20% annually** for a decade, significantly higher than Nike’s 6%, and the disappointing 3% of Adidas.\n\nNot only is Lululemon increasing its market share, but it is significantly more profitable than its competitors.\n\n**Last decade's operating margin:**\n\nNike: 13%\n\nAdidas: 7%\n\nLululemon: 20%\n\n***How is this possible?***\n\n\n\n**2.0 Its secret formula - Ignoring the rules**\n\nThe big companies out there spend millions on celebrity endorsements. This approach brings exposure quickly but is very expensive.\n\n**Nike** has Michael Jordan, Tiger Woods, and Rafael Nadal.\n\n**Adidas** has Lionel Messi, David Beckham, and James Harden.\n\n**Under Armour** has Dwayne Johnson, Tom Brady, and Steph Curry.\n\n\n\n**What about Lululemon?** Well, there’s no celebrity.\n\nLululemon took a different approach. Instead of paying millions to celebrities, it partners with **micro-influencers**, **yoga teachers**, and **fitness instructors**, who are largely unknown. These people live more ordinary lives and one can easily connect with them.\n\nThey’re known as “**brand ambassadors**“ and they get to host Lululemon events. In return for promoting the brand, they get:\n\n* Free Lululemon apparel;\n* Priority access to new products; and\n* Featured on Lululemon’s social media and website, which generates more traffic for them and helps them build/grow their business and audience.\n\nNike spends 9% of its revenue on marketing, Adidas spends 11%, and Lululemon spends less than **5%!**\n\nNot only this approach is cheaper, but it also allows for thousands of communities to be formed, that are likely to stay together. The outcome is clear: **Stronger, deeper, emotional relationships are formed**, that are not purely transactional.\n\nThis is the company’s **MOAT** - Creating a cult-like following.\n\nIn addition, there are larger outdoor events, 10k runs, sweat games, etc.\n\n\n\n**3.0 Too Expensive Products - So What?**\n\nThe company’s products are **significantly more expensive** than the competition. They capitalized on the increase in demand for athletic, stylish, yet versatile clothing that eventually became known as “**athleisure**“.\n\nThere is no doubt that the products come with exceptional quality, thanks to a combination of innovative fabrics and superior design. In addition, there is free hemming that comes with a Lululemon membership. This service ensures that the product purchased fits the customer.\n\nCombining all of this, with the community aspect above, allows the company to charge a premium price for its products.\n\nThe two main competitors in the U.S. are now **Alo Yoga** and **Vuori** and there are plenty of copycats. This is being perceived as the biggest risk, yet, the company continues to grow and deliver.\n\n**Is the demand for its products going to decrease?**\n\nHistory has taught us that there will be demand for premium brands, especially in the fashion industry. From Dior and Louis Vuitton to Rolex and Balenciaga, all of them face copycats. Yet, they are still around and doing well.\n\nFor that reason, I do believe Lululemon will continue to grow in the years to come, especially given the fact that the company’s international expansion has just started (\\~80% of the revenue comes from the Americas).\n\nIn addition, the younger generations have a more favorable view of Lululemon. The company will only benefit from this trend over time.\n\n  \n**4.0 Historical Financial Performance**\n\nOver the last twelve months, the company's revenue was almost $10b, with an operating margin of 22%.\n\nAs mentioned at the very beginning, the company’s margins are significantly above its competitors. There are two main reasons for that:\n\n1. **Advertising** - which was already covered above\n2. **Selling directly to consumers** - Over 90**%** of all the sales are online, or through the company-operated stores. This means in most cases, there is **no 3rd party in between collecting a fee**.\n\nAs the company is profitable and generates lots of free cash flow, it is worth having a look at the other side of the equation. Where does the cash go?\n\n1. **Capex** - In order to grow, the company has to reinvest in opening new stores.\n2. **Share buybacks** - The number of shares outstanding is down \\~10% over the last decade.\n\n  \n**5.0 Past Mistakes**\n\nBefore I move to the topic of valuation, two management decisions can be labeled as mistakes:\n\n1. In June 2020, Lululemon acquired Mirror for \\~$500m. Fast forward to Q4-2022, and the business has now almost been entirely written off. The in-house fitness company that created an interactive workout platform featuring live and on-demand classes did not do as well as expected post the pandemic.\n2. The share price of the company went up significantly on a few occasions, and the management decided to continue buying back shares. I do think above a certain point, share buybacks destroy shareholders’ value, and this point has been crossed way too many times.\n\n  \n**6.0 Valuation**\n\nMy assumptions are as follows:\n\n**Revenue**: To double over the next decade (\\~7% annualized growth)\n\n**Operating margin:** To remain at the current level of 22%.\n\nBased on my assumptions, the fair value of the company is $33.6b **($269/share)**, not that far from today’s share price of $259.\n\nHere’s how the valuation (per share) changes if you have different assumptions than mine regarding the revenue growth & the operating margin:\n\n|Revenue / Operating margin|20%|22%|24%|\n|:-|:-|:-|:-|\n|75% ($17.5b)|$217|$242|$266|\n|102% ($20.2b)|$241|$269|$297|\n|125% ($22.5b)|$263|$294|$325|\n\nI hope you enjoyed this post, feel free to share your thoughts.",
  "link_flair_text": "Company Analysis",
  "id": "1f4fac3",
  "num_comments": 35,
  "created_utc": 1724970101,
  "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/",
  "comments": [
    {
      "id": "lkkz65u",
      "score": 86,
      "body": "Fair analysis but there are larger systemic problems with LULU that warrant caution, even after dropping from ~$500.  \n\nTo maintain margin, it would appear that LULU has sacrificed their quality standards and the changes are being noticed and posted on social media.   Instead of bringing back the quality they once had, LULU reduced their warranty from lifetime to one year.  People who pay that much for a pair of yoga pants absolutely notice these things and shop elsewhere- and let everyone else know as well.\n\nIn addition (and mercifully), the general “athleisure” style trend is dying.   This does not bode well for LULU one bit as LULU was the flagship of the athleisure style trend.\n\nInvest wisely!",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkkz65u/",
      "created": 1724971610,
      "depth": 0,
      "replies": [
        {
          "id": "lkme2y6",
          "score": 17,
          "body": "sdasdasda asda dsa",
          "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkme2y6/",
          "created": 1724991437,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkmgse8",
          "score": 14,
          "body": "You can pry athleisure from my cold dead hands!!\n\nVery true about LULU tho, they’ve been bad for a while and are still just going downhill in terms of quality and customer service.",
          "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkmgse8/",
          "created": 1724992795,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkn8b7l",
          "score": 2,
          "body": "A lifetime warranty on clothing was never a realistic business model. It wears down after some years of use, that is normal.",
          "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkn8b7l/",
          "created": 1725009780,
          "depth": 1,
          "replies": [
            {
              "id": "lknmbrg",
              "score": 3,
              "body": "Yes but not for everything and not everyone would use the warranty. It did enable confidence and the premium however",
              "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lknmbrg/",
              "created": 1725017692,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkrqwwn",
              "score": 2,
              "body": "Only a minority would even try to bring in their 10 years old wasted clothes as reclamation. And the store would probably honour it because it's give tremendous street cred.\n\n\n\n\nMost people aren't that cheap, even with long warranties we know things don't last forever and if the product lasted long enough (or longer the expected) I'll buy it again and happily pay a premium. That's *quality*. Lulu nowadays is the Whish equivalent of clothes, bad cut, lazy stitching and cheap materials meaning they don't last at all. And neither will LuLus customers... You can be expensive and trustworthy, or cheap and fast fashion...can't do expensive fast fashion. This stock will bleed",
              "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkrqwwn/",
              "created": 1725069246,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lklo19e",
          "score": 1,
          "body": "So much competition too. Alo and others are always going to keep nipping at their heels.",
          "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lklo19e/",
          "created": 1724980649,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lknc8fa",
      "score": 8,
      "body": "Currently, no position.   I am watching same store sales (sadly down 3% in the US but up in China).\n\nI have been out of LULU for nearly 10 months - sold at 440-450 range after a few yoga / pilates friends told me they are buying ALO gear and really did not like the LULU footwear. It is funny as I trust them as they also gave me good indications on CHEW.",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lknc8fa/",
      "created": 1725012279,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkn68xl",
      "score": 8,
      "body": "The truth is this. They are hot because its trendy now to wear yoga pants on the streets. Fashion changes. Sportswear doesn’t change much. Are they fashion brand or sports brand? Because I know for sure not going to invest in a fashion trend for the long run.",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkn68xl/",
      "created": 1725008401,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkm9vo4",
      "score": 3,
      "body": "Hopefully they don’t turn into under armor",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkm9vo4/",
      "created": 1724989469,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkkwwl4",
      "score": 4,
      "body": "Analysis seems rational. \n\nI wouldn’t know much about the valuation part you got there, but [Lululemon](https://www.capitalclimb.app/en/company/LULU) does do a great branding job and do have quite a differentiated product (for the better) in a market where is hard to differentiate and very commoditised. \n\nAre you applying a margin of safety on that intrinsic value or have you bought the stock already?",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkkwwl4/",
      "created": 1724970813,
      "depth": 0,
      "replies": [
        {
          "id": "lkkxg5g",
          "score": 5,
          "body": "I do not own any shares of Lululemon. I would definitely be interested if the share price is down below $230, which would be \\~15% margin of safety compared to the intrinsic value.",
          "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkkxg5g/",
          "created": 1724971004,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkn6nef",
      "score": 2,
      "body": "I think lululemon will do fine but I am just not that interested in their stock.",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkn6nef/",
      "created": 1725008670,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkoh6ab",
      "score": 2,
      "body": "Competition, too posh, and falling out of style, hard pass.",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkoh6ab/",
      "created": 1725029044,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lku1io7",
      "score": 2,
      "body": "My cousin was/is one of the fastest women on the planet and Lulu was one of her first to ask her to host events at their stores she packed the place out.      \n\nA few years ago she stopped with them.  The vide was off.  So those where a thing.                                  \n\nWorkout clothes will always be in fashion but note the time it takes for Lulu to go from design to the store is way way too long.  That trend is over. \n\nIf their best customer buys 24 items a year that same customer now only buys 8.  Come Dec 1st of this year they will buy 4.               \n\nThey are fragile, I'll pass - \n\nYou did great work btw.                          Your numbers are right                                       \nbut Lulu's vibe is off.",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lku1io7/",
      "created": 1725113307,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkm8ozy",
      "score": 1,
      "body": "Fashion Brands need to keep their loyal customers happy.\n\nLululemon yet consolidate their customer base and now doing weird shit like changing terms of sales and other policies...\n\nEven the richest customers will feel this sellout.",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkm8ozy/",
      "created": 1724988940,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lknjwzt",
      "score": 2,
      "body": "Enjoyable read thank you! \n\nI have built a position in Lulu over the last month. Big drop married with excellent profitability metrics has paid off for me in the past. In my opinion international growth will be the next major stock catalyst.\n\nSmall, speculative position though - it’s not quite as obvious a slam dunk as, for example (and to stay in the retail sector) Crox a year ago.",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lknjwzt/",
      "created": 1725016537,
      "depth": 0,
      "replies": [
        {
          "id": "lknkg20",
          "score": 1,
          "body": "I wish you lots of success.",
          "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lknkg20/",
          "created": 1725016800,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkpps4s",
      "score": 1,
      "body": "Lulu has Odell Beckham Jr and DK Metcalf so that part is incorrect",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkpps4s/",
      "created": 1725043142,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lks6530",
      "score": 1,
      "body": "Yeah, I dont know. I just see them as a trendy brand right now. Those dont usually stand the test of time.",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lks6530/",
      "created": 1725075935,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lktpoey",
      "score": 1,
      "body": "You can’t compare to LVMH brands. They main source of revenues is not apparel but leather goods. Apparels I feel are a very competitive market. Way more alternatives",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lktpoey/",
      "created": 1725108706,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lky7bmf",
      "score": 1,
      "body": "I think it’s more of Nike dropping the ball and making too many regarded decisions like trying to go strictly with direct sales and ghosting their retail partners.",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lky7bmf/",
      "created": 1725170396,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llluivt",
      "score": 1,
      "body": "I dont see they will be able to keep those margin up while increasing revenue.\n\nbecause: \n\n1- they already sell mostly directly through them, so if they open to 3rd party to increase revenue, they are most likely going to have a decrease on their margins.\n\n  \n2- they already have a huge selling through their website, which is quite the same as the previous one.\n\n  \n3- they might expand to other countries where they still do not operate but those countries have significantly less purchasing power, thus less margin.",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/llluivt/",
      "created": 1725531409,
      "depth": 0,
      "replies": [
        {
          "id": "llo7fk5",
          "score": 2,
          "body": "You could be right. Although, the same argument has been here for quite some time, yet, the company continues to surprise.",
          "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/llo7fk5/",
          "created": 1725562359,
          "depth": 1,
          "replies": [
            {
              "id": "llru1p6",
              "score": 1,
              "body": "I mean, I like the company as a client, tbh. However, at today's price I am more a nike buyer.",
              "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/llru1p6/",
              "created": 1725617983,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkqu5ks",
      "score": 1,
      "body": "It's Canadian, Canadian historical stocks get hammered and then a US company buys them to steal their brand and take profits until its bankrupt. Blackberry as an example.",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkqu5ks/",
      "created": 1725056600,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lklkiiq",
      "score": -3,
      "body": "When you have higher prices than your competitors, you have higher margins, who would have thought.\n\nLet's say a T shirt costs $10 to make.\n\nAdidas sells it for 20\n\nNike sells it for 30\n\nLululemon sells it for 50.",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lklkiiq/",
      "created": 1724979351,
      "depth": 0,
      "replies": [
        {
          "id": "lkmob0i",
          "score": 3,
          "body": "You think you’re arguing against the OP but you’re really just proving their point.  Even if growth slows, their margins will ensure profits keep printing to support the SP",
          "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkmob0i/",
          "created": 1724996933,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkmvypb",
          "score": 3,
          "body": "I appreciate your extensive breakdown. \n\nThe question that you need to ask is: Why can one company charge more than others?",
          "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkmvypb/",
          "created": 1725001623,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkmhdeq",
      "score": 0,
      "body": "Thanks for this new way of looking at it. Still can’t get away from it being a clothing company though.",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkmhdeq/",
      "created": 1724993096,
      "depth": 0,
      "replies": [
        {
          "id": "lkmv2gn",
          "score": 1,
          "body": "There is no doubt it is still an apparel company.",
          "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkmv2gn/",
          "created": 1725001051,
          "depth": 1,
          "replies": [
            {
              "id": "ll5qtiw",
              "score": 1,
              "body": "Yup, and the consumer is fickle, they might love Lululemon but once all their friends start wearing Alo, most of this will do so as well.",
              "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/ll5qtiw/",
              "created": 1725291007,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkl0p6u",
      "score": -6,
      "body": "Shrill",
      "permalink": "/r/stocks/comments/1f4fac3/deep_dive_into_lululemon_outsmarting_nike_and/lkl0p6u/",
      "created": 1724972151,
      "depth": 0,
      "replies": []
    }
  ]
}