{
  "title": "I think Alphabet (GOOGL) is the most undervalued stock in the stock market right now",
  "score": 844,
  "selftext": "I am 100% invested in Alphabet due to several reasons. I think we are in a similar situation to Meta when it was faced with law suits, reached 90$ last year and everybody said it would die. \n\n1. Alphabet is growing in the double digits every year since its inception. Its PE is on the way to below 20 and laughably cheap for a tech company with that growth. \n\n3. They crushed earnings and the only reason for their slump afterwards was their heavy AI spending, which they can easily cut if they see its not worth it anymore. Also comparable to Meta.\n\n2. Alphabet is a leader in innovative technologies such as autonomous driving. Tesla shot up 40% or something when Elon made another promise towards autonomous driving, while Google actually is the first mover and build up a network with hundred thousands of paying users. \n\n3. I dont think that AI will be as useful as some still expect. But in no way Google is endangered by that. I dont have more recent numbers, but in July Googles market share in the search business grew slightly, while ChatGPT declined by 12%. I think the summarised answers in Google search are already way more useful and convenient than what Bing or ChatGPT offers. \n\n4. If AI presents itself as useful Google and Meta will have the best model. People misunderstand how AI works. Its not the model which is important, its the underlying set of data. With the deal it closed with Reddit beginning of 2024, google honestly struck Gold for a really cheap price.\n\n5. Tech companies are literally what keeps the american economy and influence in the world right now alive. I think its not realistic to think that the DOJ will do anything which substancially weakens an american tech company at this point. They will probably get a slap on the wrist in a way of a (big) fine. But priced in is currently a potential break up.\n\n6. Atleast for the next earnings I expect an ad revenue \"short squeeze\" because of the really polarized american election. Way more money will be invested in ads than in previous elections, and while the sum on its own isnt that much, depending on how elastic the ad market is, it will drive up ad space for everyone involved.",
  "link_flair_text": "Company Discussion",
  "id": "1f5ivu1",
  "num_comments": 474,
  "created_utc": 1725094452,
  "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/",
  "comments": [
    {
      "id": "lkt2qpb",
      "score": 1133,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt2qpb/",
      "created": 1725095673,
      "depth": 0,
      "replies": [
        {
          "id": "lkt7o4l",
          "score": 471,
          "body": "Also, \"they can just cut AI spending\".  Clear OP knows nothing.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt7o4l/",
          "created": 1725099057,
          "depth": 1,
          "replies": [
            {
              "id": "lkt9j88",
              "score": 237,
              "body": "Well they’re clearly behind the curve, in the same way that they also missed the cloud, even when they were the most equipped company to dominate both these markets. \n\nSomething is clearly wrong with Google’s leadership and their ability to actually build profitable products that aren’t just selling ads and/or harvesting data.",
              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt9j88/",
              "created": 1725100291,
              "depth": 2,
              "replies": [
                {
                  "id": "lktaayr",
                  "score": 111,
                  "body": "They have had 90% of the ai employees for a decade before open ai came.",
                  "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktaayr/",
                  "created": 1725100794,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lktcmhv",
                      "score": 263,
                      "body": "Which begs the questions:\n\n1. How did Amazon, originally an online bookseller then ecommerce website, manage to create the largest cloud platform AWS, versus Google who at the time had the top tech engineers?\n\n2. How did Microsoft, who were considered a dinosaur company at the time, and launch Azure after GCP, manage to create a bigger cloud business than Google?\n\n3. How did openAI manage to launch products and receive tons of investment and Nvidia manage to rake in billions of profits in AI revenue if Google was in AI for a decade at least?\n\n4. How did Apple, which started as a computer company, manage to create the iPhone which generates **vastly** more profits than all of Google's devices and android combined? Especially capturing USA where profits are highest?\n\n5. How did Tiktok manage to generate massive ad revenue from nowhere? Even when Google launched Shorts and Meta launched Reels, Reels is ahead of Shorts.\n\nThe common theme I see is that Google is in every field \"first\" and has lots of top engineers yet its other companies making fat profits at Google's expense.\n\nIt's 2024 and Google's main profit source is search, which was their first product more than 2 decades ago. Their biggest weakness is their inability to become a profit leader in other spaces.\n\nLooking at the best decade, Meta's ad revenue growth is higher than Google.\n\nAmazon's ad revenue is growing faster than Google now. \n\nAlso: Youtube Live is second to Amazon Twitch, youtube music is second to Spotify, whatever paid content is on youtube is massively behind Netflix, Amazon Prime Video and Disney+. \n\nThen there's all the products they failed at and gave up.\n\nThey launched Google Plus to compete on social media front but closed down. There's a website killedbygoogle because they give up on everything.\n\nGoogle shareholders, please answer the hard questions instead of looking for confirmation bias on why Google stock should just go up. Because from the history, Google seems to the leader of coming in 2nd, or not even placing. If you asked me in 2004, about Google in 2024, I would not predict they would still be making approx. 95% of their profits from ads, and over 80% from search.",
                      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktcmhv/",
                      "created": 1725102238,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkvvfp7",
                          "score": 30,
                          "body": "\n>3. How did openAI manage to launch products and receive tons of investment and Nvidia manage to rake in billions of profits in AI revenue if Google was in AI for a decade at least?\n\nGoogle's AI (google ads algorithm) is printing billions in profit while openAI is burning through cash. \n\nThere's more to AI than chatbots, and Google is actually utilizing AI for business purposes in a way that's completely ahead of most companies",
                          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkvvfp7/",
                          "created": 1725135687,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lktdudw",
                          "score": 57,
                          "body": "Amazon was well placed to create AWS because their business is seasonal and they had spare capacity. They had to be able to keep things working in the Christmas rush, but typical demand was far below peak. So they found a way to rent out the excess.",
                          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktdudw/",
                          "created": 1725102946,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lktjh8k",
                              "score": 28,
                              "body": "While making money multiple times. They sell ads, so people visit a website that they host, in the hope that they also purchase a product from their store which in turn validates their ads. It was good business sense beyond just renting out the extra space. Tied the whole thing together.",
                              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktjh8k/",
                              "created": 1725105897,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ll0r373",
                                  "score": 3,
                                  "body": "And yet they make no money on their primary product, retail. That’s with a relatively strong US consumer (retail sales up 5% YoY).",
                                  "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/ll0r373/",
                                  "created": 1725212617,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lkulwbk",
                              "score": 1,
                              "body": "Eh? This doesn't work like you said. In the on-prem world no one is going to lease servers for a quarter (set-up, tests, operational use itself would eat up half the time). And in the cloud world either you have capacity or you don't. Futhermore, no company worth their salt would be okay saying sure we will rent out capacity only for a quarter or two instead of just expanding their capacity.",
                              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkulwbk/",
                              "created": 1725120270,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lkwpls3",
                                  "score": 10,
                                  "body": "A lot companies ARE seasonal or get random peak, they can't afford to always buy enough on-prem hardware or reserve all that cloud capacity. But luckily they don't have to reserve that cloud capacity, cloud can let them spin up capacity on demand in real time. Amazon itself needed this capability, which allowed them to invest big in AWS without fear of not getting business, since they are their own biggest customer.",
                                  "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkwpls3/",
                                  "created": 1725146550,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "lkv9vze",
                                  "score": 7,
                                  "body": "It actually does. You spin up new capacity during known peaks. But there is also a base minimum required capacity which was underutilized, and the gap was sold. The channel is much larger now though so Amazon internal usage still has an impact, but it is smaller than the beginning",
                                  "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkv9vze/",
                                  "created": 1725128350,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lktsfb9",
                          "score": 30,
                          "body": ">How did Amazon, originally an online bookseller then ecommerce website, manage to create the largest cloud platform AWS, versus Google who at the time had the top tech engineers?\n\nAmazon already created something to address the necessities for its massive retail/transactional requirements, then a more systemised, structured AWS was born out of customer-servicing, production quality/scale necessity. You think Bezos thought that AWS would make loads of money from renting out portions of the cloud hardware? It was only discovered out of luck, and Amazon for the first time became profitable.\n\nGoogle's needs were mostly internal, while searches are much lighter data in comparison, among other technical reasons. Google's focusses are just elsewhere.\n\n>How did Microsoft, who were considered a dinosaur company at the time, and launch Azure after GCP, manage to create a bigger cloud business than Google?\n\nMS was never a dinosaur company. It is still a leading, natural monopoly. Ballmer just happened to be a business-focussed leader that really tightened up MS books, compliance, etc. My guess is that Natya was able to take advantage of the streamlined books and focus more on the tech vision side of things. Plus, MS had an advantage with at least two existing services that are in every business' computers -- SharePoint and OneDrive. Crudely put, they added extra features and called it Azure (though it's definitely a lot more than that, but the point is that it's just an incremental step with big marketshare from the beginning, which Google has none of, because it's not their business).\n\n>How did openAI manage to launch products and receive tons of investment and Nvidia manage to rake in billions of profits in AI revenue if Google was in AI for a decade at least?\n\nThere were many 'AI' players. OpenAI just happened to be lucky with picking an algorithm out of many. It was literal cutting edge where business leaders have 0 idea about (e.g. Altman doesn't have a PhD in data science). They just happened to make the right bet on the right engineers who bet on the right formulas.\n\nGoogle is also not a hardware specialised company like Nvidia.\n\nThey were unlucky with Tensor. AlphaGo impact was so huge in the industry that R no longer became the programming language of choice, but became Python, and forced R to be able to run Python code (though they already ran C++ for example). That's how huge the impact was. The unlucky part was that the Python library TensorFlow had a very controversial (i.e. very bad) transition from version 1 to 2. There is a chart somewhere of package downloads over time/history, and after version 2, it just died. Now, their Tensor hardware/server business is reflected on it, because it's not growing as fast, not as many people are learning it, etc. Happened to be engineers' design decisions of the package that didn't work out socially and business-wise.\n\n>How did Apple, which started as a computer company, manage to create the iPhone which generates vastly more profits than all of Google's devices and android combined? Especially capturing USA where profits are highest?\n\niOS is a monopoly with jailed licensing, while Android is used everywhere by numerous companies around the world. We learn in economics 101 class that monopolies have profits in a simplified model world. We learn in economics 101 that monopolies have double the profits. https://en.wikipedia.org/wiki/Monopoly_profit\n\n>How did Tiktok manage to generate massive ad revenue from nowhere? Even when Google launched Shorts and Meta launched Reels, Reels is ahead of Shorts.\n\nI don't know enough about Tiktok.\n\n***\n\nRemember, Google is a company that makes money from ad-auctioning. They pretty much have a monopoly on this. Because they make so much money from it, they make all kinds of free cool stuff that just broadens its branding. They can just kill off free tier of Google Drive (Forms, Docs, Sheets, etc.) and all kinds of other things they made free that people use, including Android. They just make insane loads of stuff for potential payoffs. Android just happens to be one of them. Now they are also industry leading in cyber/software security out of necessity for themselves, for example -- a rather unknown part of their business. Guess what, Google has the absolute best track record, as in the second place is so far below Google, in terms of hacks. That doesn't mean that they're immune to hacks. They're just far better than pretty much everyone else combined.\n\nIt's the business model of the 21st century. Offer everything for free/cheap, make it popular to billions of people first, worry about making money later. It's popularised from free Google Search engine -- another monopoly. Catch up on it.",
                          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktsfb9/",
                          "created": 1725109811,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lkujgrp",
                          "score": 25,
                          "body": "1. Amazon is an amazing company and AWS was a stroke of genius, no doubt about it.\n2. MSFT knows how to sell to enterprises, has a massive customer base to sell into, and know how to be a fast-follower. GOOG had no large enterprise clients and had no cultural understanding of how to sell to and support large enterprises and it took a while for them to figure that out. In many ways GCP was a technically superior offering to Azure but minor technical differences don't win markets. I think GCP is on a much better path these days.\n3. OpenAI were more willing to take risks than Google and have an initial lead, but OpenAI still lose billions every year and their competitive moat is very unclear. Meanwhile, GOOG continue to be the powerhouse in the fundamental IP around AI and are well-positioned to deploy AI into hundreds of millions of devices and users of online services. GOOG also have access to numerous massive, proprietary data sets that a company like OpenAI will need to pay dearly for, if they can even get access to them. NVIDIA is a bad comparison, Google are not a hardware company.\n4. The iPhone is the single greatest product of all time. Pretty high bar if you expect Google to do that; all things considered Android is a very strategic and successful product.\n5. TikTok is great but YouTube is also a massive and highly strategic business.\n\nUltimately, if GOOG did any or all of the things you mentioned, they would be even more successful but would also trade at a much higher multiple. 🤷‍♂️\n\nHistorically GOOG have been bad at leveraging their tech/IP/data/etc. advantages into building high-profit new businesses. Will they eventually figure that out? To me, that is a low-downside, high-upside bet at their current multiple.",
                          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkujgrp/",
                          "created": 1725119453,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lktgj29",
                          "score": 19,
                          "body": "Amazon went the \"what do we need to be the best in this field?\" route. Then they opened up that system for others. IT is ridiculously slow in change, but when it changes people spend. I have friends in cloud IT and they say AWS/Azure (Microsoft) has brought in so much high hourly rate jobs/work that they will do that to the end of time.\n\nGoogle couldn't never compete in this because they never had to properly test their systems outside the very narrow email and search. You can see that with Microsoft, they seem to just copy AWS. They used their Windows monopoly to reel people in and the products are \"fine enough\" that companies gladly pay them that they don't need to deal with their complicated software. That is their moat.\n\nAt this point Google will just clamp down on scanning everything to train their AI models to have the best search you can talk to. There is nothing else they can do besides running Android.",
                          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktgj29/",
                          "created": 1725104410,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ll1wjbb",
                              "score": 2,
                              "body": ">Then they opened up that system for others. IT is ridiculously slow in change\n\nNot really. If you start studying something relying on specific products or languages then your knowledge might be old before you graduate. \n\nAs an example, at my current workplace I've gone through 3 different backup systems in 4 years",
                              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/ll1wjbb/",
                              "created": 1725226660,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lkturh5",
                          "score": 14,
                          "body": "Agreed on all points. I often feel tempted to invest in google and then I think about their history and have to assume they are being led by individuals with poor vision and strategy.  \n\nIt’s a company with seemingly unlimited potential and no proven capability to do anything with it.",
                          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkturh5/",
                          "created": 1725110750,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lktxkor",
                          "score": 18,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktxkor/",
                          "created": 1725111837,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lkvumkg",
                          "score": 6,
                          "body": "Google has no business leading in all of the fields you listed as Google is an Ad business. All of the services they offer create a funnel for the company to train their search algorithms and further optimise their Ad placement fees. From Maps, Google Flights, Shops, Hotels, YouTube, Search, Android, Chrome, Lens, Gemini etc are all in a bid to see what people are looking for,where and when and optimising Ad targeting. They experiment with other revenue sources from time to time(e.g. Waymo, YouTube premium, Google One, Google Cloud, Gemini etc) but it doesn’t have to compete with any of the other companies you listed when they have a different business model. An example is the 2 decade long revenue sharing agreement with iOS, Mozilla, Samsung etc to entrench Search use and perfect the Ad monopoly.\nSo no, people have it backwards. All Google tech is tuned to perfect and lockdown Ads. They shutdown products they can’t manage, get significant leverage from or scale, which is a sound business decision to me. It’s great to see them experimenting and exiting things they can’t generate shareholder returns from. But they do have some successes like Waymo, Google Cloud, YouTube etc.\nGoogle is a monster of a business and doesn’t get the credit it deserves. \n\nThey do have some issues with duplicate services, branding and scaling too soon(Google Plus, Hangouts etc), headcount bloat and political correctness . This is where Google has issues. Not the questions you listed",
                          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkvumkg/",
                          "created": 1725135408,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lkunmlg",
                          "score": 11,
                          "body": "Google is just a poorly-run company with a bad company culture and too much politics negatively affecting their operations.\n\nAll you have to do is use a few of their products for a while and you know it's a company in decline already:\n\nMy Google Home was great when I got it around 2017, now it's unusable. Doesn't even work to turn on my lights half the time.\n\nSame for my Chromecast, unavailable more often than not and rebooting it rarely works.\n\nGoogle Search has become so filled with ads, AI nonsense and censorship that it's almost impossible to find anything other than a Wikipedia article. LLMs are more useful for almost every single search.\n\nYouTube's experience has been getting much worse over time too. If you're not on Premium, you're watching ads half the time. If you are on Premium, the feed is suggesting tons of videos you're not interested in (plus shorts no matter how many times you try to remove them), often videos that are years old. Meanwhile they're not suggesting videos from channels you watch all the time.\n\nThen there's Android that hasn't gotten any better for around a decade. Given the improvements in phone performance it probably got worse too.\n\nThe only thing that's still a decent Google product these days is G-suite, and even Gmail has its problems.",
                          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkunmlg/",
                          "created": 1725120859,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lkvvauj",
                              "score": 2,
                              "body": "That’s a really brutal but spot on review of Google.  What company do you think is on the opposite end of the spectrum?",
                              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkvvauj/",
                              "created": 1725135640,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lkwlzcd",
                              "score": 2,
                              "body": "Google Home: discontinued\n\nChromecast: soon to be discontinued. \n\nYoutube: worse experience by forcing us to watch more ads, horrible recommendation algorithms\n\nGmail and G-suite: widely used but haven't really improved in over a decade\n\nI don't really know what to say, Google's still very profitable but their corporate image has been tarnished and they're seemingly just milking their existing cash cows and not really gaining traction in anything new",
                              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkwlzcd/",
                              "created": 1725145162,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lkumdo3",
                          "score": 2,
                          "body": "It’s because they have weak Product arm with not enough diverse backgrounds. Not many engineer backgrounded people make good Product people. They’re too engineering driven and it shows in the poor choices they make.\n\nThere’s a lot of shit Product people too don’t get me wrong but the good ones are amazing levers and great at keeping tech focused on building the right things.",
                          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkumdo3/",
                          "created": 1725120433,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lktfkgi",
                          "score": 2,
                          "body": " great points",
                          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktfkgi/",
                          "created": 1725103901,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lktaslq",
                      "score": 17,
                      "body": "And did a lot of stuff with DeepMind and AlphaGo which was all experimental and cool, but never managed to actually commercialize anything. \n\nThey invented cloud computing before cloud computing was a thing, but they never realized the opportunity and actually commercialize anything. \n\nAlmost all (if not all) of their successes except search came through acquisitions. Even their dominance in the advertising market is only due to a shitton of acquisitions (starting with DoubleClick a long time ago). \n\nThey’re a great engineering company, they just don’t understand how to make and commercialize great products.",
                      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktaslq/",
                      "created": 1725101110,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lkty3sp",
                  "score": 14,
                  "body": "Google's problem is marketing, ironically. Always has been.\n\nTheir cloud solution is top notch. But they don't care at all to push it.\n\nMicrosoft, oh shit. If you want their solution they will push 3 consultants to your office in no time.",
                  "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkty3sp/",
                  "created": 1725112039,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lku2fmp",
                      "score": 10,
                      "body": "Not entirely true. Microsoft is doing well because have much bigger bundle of services which they can offer.",
                      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lku2fmp/",
                      "created": 1725113637,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lkurdfi",
                      "score": 3,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkurdfi/",
                      "created": 1725122133,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkw1tc9",
                          "score": 3,
                          "body": "Why? (genuine question, having used AWS/Azure/GCP but only GCP for smaller projects in the past 5y)",
                          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkw1tc9/",
                          "created": 1725137883,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lkuu0lg",
                  "score": 4,
                  "body": "Google was making advances in AI with Deepmind  and TensorFlow, but I read  somewhere that Google was late in the game because  they were focusing on developing  ethical AI before releasing to the public.  Then comes OpenAI and triggered an AI race.  I haven't verified this information though. \nOr maybe they missed the mark as to how useful AI will become as a commodity to the public rather than integrated into their existing services. I suspect it's the latter.",
                  "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkuu0lg/",
                  "created": 1725123014,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lky1q9r",
                      "score": 3,
                      "body": "This is a misunderstanding of the market, holes tech is equivalent to Open AI. When they are are ready they have every android phone in the world to launch their AI. They immediately will be the leader in consumer facing AI. ",
                      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lky1q9r/",
                      "created": 1725167155,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lktc42e",
                  "score": 6,
                  "body": "Leaked transcript from Eric Schmidt talk last month confirms this.",
                  "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktc42e/",
                  "created": 1725101930,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkvd707",
                      "score": 7,
                      "body": "Pretty ironic since Schmidt is pretty much responsible for missing the early cloud opportunity.",
                      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkvd707/",
                      "created": 1725129481,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lktxx8p",
                      "score": 3,
                      "body": "What was in those transcripts?",
                      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktxx8p/",
                      "created": 1725111970,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lku2wtp",
                          "score": 7,
                          "body": "Amazed it’s still not been taken down\n\nhttps://gist.github.com/sleaze/bf74291b4072abadb0b4109da3da21ac",
                          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lku2wtp/",
                          "created": 1725113809,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lku3wol",
                          "score": 6,
                          "body": "> they've kind of lost the initiative to open AI and even the last leaderboard, I saw Anthropix. Claude was at the top of the list. I asked Sundar this, he didn't really give me a very sharp answer. Maybe, maybe you have a sharper or a more objective explanation for what's going on there. I'm no longer a Google employee in the spirit of full disclosure. Google decided that work life balance and going home early and working from home was more important than winning. And the startups, the reason startups work is because the people work like hell. And I'm sorry to be so blunt, but the fact of the matter is if you all leave the university and go found a company, you're not going to let people work from home and only come in one day a week. If you want to compete against the other startups with the early days of Google, Microsoft was like that.",
                          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lku3wol/",
                          "created": 1725114160,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lkv7322",
                              "score": 18,
                              "body": "Ah yes, since Sundar was unable to pilot Google to leading AI, we must blame WLB & WFH. Yes, even though Google had a huge lead ever since they had Google Assistant able to make calls that passed the Turing test in 2018, we should blame WFH/WLB. Even though people within Google have brought up the fact that a sufficiently advanced chatbot would supplant Google, we should clearly acquit upper management of all fault. Spoken like a true out of touch 0.01%-er",
                              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkv7322/",
                              "created": 1725127394,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lkuusy1",
                              "score": 4,
                              "body": "I fully believe that Google sat on AI for one very simple reason - they couldn't figure out how to monetize it.\n\nPeople don't seem to realize how much AI is already pulling away people from Google Search. \n\nIf you don't use search, you don't see ads, if you don't click ads, they don't make money. \n\nWhy would Google release an AI tool that kills their bread and butter revenue stream until their hand was forced?",
                              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkuusy1/",
                              "created": 1725123276,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lkv3bhu",
                                  "score": 2,
                                  "body": "Might be the case. One of my friends is in a relationship with one of the researchers at Deep Mind, this was years ago, around 2021. When we all met up (i’m also in tech) he talked about their ai could do, pretty much describing the LLMs we use today. He took the research very seriously, but i think unlike openAI, they just lacked a “do or die” mentality towards getting it to market.",
                                  "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkv3bhu/",
                                  "created": 1725126124,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lktaxq2",
              "score": 17,
              "body": "There was a great episode on the compound talking about whether these companies would reduce capex spending. \n\nLarry Page was quoted as saying ‘I’d rather go bankrupt then lose this AI race’. He’s not CEO but he has significant influence.",
              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktaxq2/",
              "created": 1725101202,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkvktsg",
          "score": 25,
          "body": "Also, Meta was a ridiculous 8-9 P/E at its lowest, whereas Google is a reasonable 21.\n\n\nI like Google still for the future, but it's not equatable to Meta at $90.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkvktsg/",
          "created": 1725132061,
          "depth": 1,
          "replies": [
            {
              "id": "lkx5huj",
              "score": 8,
              "body": "The same time Meta was crashing, so was Google. Or maybe it happened a few months before, but Google dropped all the way to like $88 or something in late 2022. What was their P/E then?\n\nBecause if you're going to take Meta's P/E at the bottom as a comparison, then you need to compare Apples to Apples.",
              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkx5huj/",
              "created": 1725152743,
              "depth": 2,
              "replies": [
                {
                  "id": "lkxwroy",
                  "score": 2,
                  "body": "Google PE at the bottom was like 16-17. They crashed about 40ish+% peak to trough. Meta got absolutely decimated 70ish% top to bottom",
                  "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkxwroy/",
                  "created": 1725164544,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkvs4by",
          "score": 6,
          "body": "This! It's nothing like Meta at $90 and that's coming from someone who currently owns both and bought a bunch of Meta around $100. Just look at the P/E or EV/EBITDA valuations over the last 5 years or so, Meta was at a low, Alphabet isn't close.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkvs4by/",
          "created": 1725134558,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkt6n6q",
      "score": 256,
      "body": "Not knocking your plan, but I will say that any strategy that starts with “l’m all-in on…..” immediately means it’s not what I’d call a strategy. It’s a bet. Cool, bet if you want, but know it’s a bet. Good gamblers also think about risk control.\n\nYou do you.\n\n(Google owns an unbelievable amount of data, has enormous reserves, and multiple brands that are not all well monetised. Even if it got broken up, that would probably unlock more value than it’s worth right now. They’ll pour money in to ai in to search and even if they have to hold off all comers for years they can certainly do it until they get the new version of AI/search/monetised-whatever sorted. I could get behind the logic of owing some google)",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt6n6q/",
      "created": 1725098359,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkt1hve",
      "score": 390,
      "body": "I think most people are worried about them getting broken up and I have one word to say to those people...\n\nMicrosoft.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt1hve/",
      "created": 1725094828,
      "depth": 0,
      "replies": [
        {
          "id": "lkt6b8k",
          "score": 160,
          "body": "Microsoft is much better at lobbying. Not to say Alphabet is bad at it, but Microsoft became reeaal good at it after 2001.\n\nThough I don't believe Alphabet will get broken up anyway. It's very hard to do from a technical standpoint even if politicians want it.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt6b8k/",
          "created": 1725098135,
          "depth": 1,
          "replies": [
            {
              "id": "lktb6c1",
              "score": 44,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktb6c1/",
              "created": 1725101351,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkumqy2",
          "score": 9,
          "body": "You do want to buy at the low",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkumqy2/",
          "created": 1725120560,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkvsbyt",
          "score": 6,
          "body": "Don’t forget it took 20 years of trading sideways before it took off again.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkvsbyt/",
          "created": 1725134628,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkuxcg2",
          "score": 4,
          "body": "in the long run thought that might end up better for the investors - free stock. I miss the days when google was just google and not alphabet, lean mean and nimble.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkuxcg2/",
          "created": 1725124120,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkt31tc",
          "score": 32,
          "body": "It would be beneficial if they got broken up",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt31tc/",
          "created": 1725095886,
          "depth": 1,
          "replies": [
            {
              "id": "lkt4ojs",
              "score": 16,
              "body": "Even a new CEO should pump",
              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt4ojs/",
              "created": 1725097018,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll1i5sa",
              "score": 2,
              "body": "How",
              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/ll1i5sa/",
              "created": 1725221767,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkt2279",
      "score": 405,
      "body": "There are thousands of stocks. \nAnd you unironically think that one of the biggest stocks out there with huge analyst coverage it THE MOST undervalued stock?\n\nPuh..",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt2279/",
      "created": 1725095211,
      "depth": 0,
      "replies": [
        {
          "id": "lkt2bdi",
          "score": 68,
          "body": "A friend some years ago had the same thought process about AAPL, he couldn't believe the low P/E and gave credit to the analysts and Mr. Market.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt2bdi/",
          "created": 1725095383,
          "depth": 1,
          "replies": [
            {
              "id": "lkux31m",
              "score": 23,
              "body": "Apple was undervalued years ago. In 2016 Apple was trading at a P/E ratio of 10-12. It was low and it was also way below the market which was around 23 at the time. During that time Apple had a lot of negative sentiment. This was due to large quarterly sales declines and revenue declines. People thought at the time the company hit a plateau and the growth was gone. People were negative about the iPhone 7 as people were complaining that there wasn’t much of difference between it and the 6. It also didn’t sell as much as the 6 did.",
              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkux31m/",
              "created": 1725124033,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lkt2udl",
              "score": 28,
              "body": "Apple was undervalued, but there were probably others which were more undervalued.",
              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt2udl/",
              "created": 1725095744,
              "depth": 2,
              "replies": [
                {
                  "id": "lkt7jod",
                  "score": 15,
                  "body": "but did you invest in all those “other, more undervalued” stocks?",
                  "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt7jod/",
                  "created": 1725098972,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkvlj7z",
          "score": 27,
          "body": "Buffett went throught the Moody's manuals of 20,000 companies twice to find the best value stocks.\n\nI'm sure OP did the same due dilligence to determine Alphabet was the most undervalued. Sharp insight on these subreddits - I'm definitely getting what I paid for.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkvlj7z/",
          "created": 1725132305,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkt7rq2",
          "score": 23,
          "body": "I invested in Apple in 2019, and was told the same thing. I'm still holding it till date-",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt7rq2/",
          "created": 1725099123,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lktdv1n",
          "score": 19,
          "body": "You may be taking the word “most” a bit literal. But a huge stock with massive coverage can be ridiculously undervalued. META, AAPL, MSFT, and TSLA have all been massively undervalued at some point in the last 10 years.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktdv1n/",
          "created": 1725102956,
          "depth": 1,
          "replies": [
            {
              "id": "lku65d1",
              "score": 24,
              "body": "TSLA has never been undervalued once in it’s existence",
              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lku65d1/",
              "created": 1725114949,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lktor5f",
              "score": 3,
              "body": "> But a huge stock with massive coverage can be ridiculously undervalued. \n\nYes of course. Nobody is doubting that.",
              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktor5f/",
              "created": 1725108324,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkwq5nt",
          "score": 2,
          "body": "Maybe not the most, but GOOGL is perennially undervalued for some reason. Wallstreet hates it, since they didn't hire a wallstreet firm for the IPO.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkwq5nt/",
          "created": 1725146766,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkti8nc",
      "score": 73,
      "body": "Last year Meta was dying, according to the Reddit experts, now GOOGL is also in the trash (according to the Reddit experts), makes me want to invest in it even more, people have no idea how big those companies are…",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkti8nc/",
      "created": 1725105280,
      "depth": 0,
      "replies": [
        {
          "id": "lktyj26",
          "score": 11,
          "body": "I bought after I saw the numbers from their lady earnings and the subsequent dip. I'll check back in 10 years.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktyj26/",
          "created": 1725112197,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkxpfpf",
          "score": 11,
          "body": "Don't forget that Apple was dying when it was trading around $170 (earlier this year). I am up 36% from buying when WSB was writing apple's eulogy. \"They missed the AI boat, iphones suck now, Siri is regarded, etc etc.\"",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkxpfpf/",
          "created": 1725161073,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll56wf1",
          "score": 2,
          "body": "The “Reddit Short” eh? 😜",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/ll56wf1/",
          "created": 1725284075,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkxm3ln",
          "score": 2,
          "body": "back in my days, and by that i mean 5 years ago\n\nwe don't call stock that has been 15% off from the ATH as dying, but normal correction.\n\neven funnier when people use quote \"buy when there is blood in the street\"\n\nmeanwhile blood in the street at home : SPY down 5% from ATH",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkxm3ln/",
          "created": 1725159620,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lktoczr",
      "score": 51,
      "body": "No matter what you think of this company, don't invest everything in it. There was already one guy who has invested 700k that he inherited from his grandma in Intel. And lost 200k in one day.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktoczr/",
      "created": 1725108159,
      "depth": 0,
      "replies": [
        {
          "id": "lkw1bt7",
          "score": 18,
          "body": "Okay that was also shit timing but also intel of all companies lol",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkw1bt7/",
          "created": 1725137716,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkta40s",
      "score": 31,
      "body": "If they are broken up, they worth more. The capex will not be reduced because it’s not an expansion but a maturity stage. \n\nTheir core business is saturated so you can’t expect them to sustain the growth in a long run and that’s why the institutional investors expect less in their core but expect more in their non core to slowly build a significant replacement in the future including hardware. It’s not a risk but a stagnation.\n\nMost undervalued? NO because the valuation is always built on the future earnings. Overvalued? NO because they are not facing a stagnation. You have to understand there’s not much space for them to increase the margin and almost impossible to improve cost control in R&D. It’s more resilient than most TECH because the Google search engine itself is a utility in modern era.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkta40s/",
      "created": 1725100669,
      "depth": 0,
      "replies": [
        {
          "id": "lktj9o8",
          "score": 31,
          "body": "several ways in which G can grow:\n\n* Workspace tools\n* Cloud with AI\n* Waymo and self-driving\n* Better Youtube monetisation and features\n* The whole google home ecosystem. My home is already all google: nest, surveillance cam, etc. \n* The Pixel smartphone (already gaining market share)\n* Space market (10% of spacex is theirs)",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktj9o8/",
          "created": 1725105794,
          "depth": 1,
          "replies": [
            {
              "id": "lktvcqd",
              "score": 6,
              "body": "10% of SpaceEx? Where did you hear about that?",
              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktvcqd/",
              "created": 1725110983,
              "depth": 2,
              "replies": [
                {
                  "id": "lktxtfz",
                  "score": 22,
                  "body": "It’s like 7.5%. Google it. Only cost like 1b",
                  "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktxtfz/",
                  "created": 1725111929,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lku5o8i",
                      "score": 2,
                      "body": "Wowza",
                      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lku5o8i/",
                      "created": 1725114779,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lkuxpg4",
                  "score": 2,
                  "body": "yah I they also luck on buying deep mind when the did; now amazon and apple is scrambling - this could be huge since space x is also starlink I think.",
                  "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkuxpg4/",
                  "created": 1725124240,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkt639c",
      "score": 27,
      "body": "I remember a world pre-pandemic in which a P/E ratio above 20 was *high*. Apple was below 20 for the best part of a decade -- the decade of the iPhone, I might add.\n\nIt's hard to believe we aren't in a bubble when we start talking about 20 as the floor.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt639c/",
      "created": 1725097983,
      "depth": 0,
      "replies": [
        {
          "id": "lkuao66",
          "score": 15,
          "body": "GOOG is one of the few where the PE before the pandemic was higher than after the pandemic.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkuao66/",
          "created": 1725116514,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkvsj52",
          "score": 2,
          "body": "Of course PE ratios look inflated during a massive ai capex boom. Amazon is a peak example of that and the effects on FCF are showing",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkvsj52/",
          "created": 1725134696,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkycldn",
          "score": 2,
          "body": "To be fair we're using very high P/Es to what's companies that are pretty much guaranteed to be bigger than they're now later on. All the pandemic did was accelerate a process that was already ongoing.\n\nPeople who in 2019 barely knew how to use a computer went from that to remote working, that's the kind of thing we're talking about, and all of this happened in 1-2 years instead of 10-20.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkycldn/",
          "created": 1725173704,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lktpc9b",
      "score": 8,
      "body": "OP I agree Google has great opportunity. But you missed its largest problem: Sundar. He is and has been asleep for a long time now and they missed key waves.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktpc9b/",
      "created": 1725108565,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkt5q85",
      "score": 25,
      "body": "You are spot on. I agree and want to add more if they dip into the 150’s. I think they could be the biggest company in the world in the coming decade. Holding and won’t sell a single share. And to top it off they buyback a shit ton of shares. Who knows how they reward us once all the post split shares are bought back.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt5q85/",
      "created": 1725097737,
      "depth": 0,
      "replies": [
        {
          "id": "lkuj4w5",
          "score": 2,
          "body": "spot on? 100% in one stock is a bet and saying things like \"most undervalued\" ... well did you evaluate every single company? whole post screams hyperbole",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkuj4w5/",
          "created": 1725119343,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkt72k2",
      "score": 31,
      "body": "As long as Sundar Pichai remains the CEO, the stock will remain undervalued. Fire him.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt72k2/",
      "created": 1725098652,
      "depth": 0,
      "replies": [
        {
          "id": "lkte8v2",
          "score": 16,
          "body": "I have a theory that he needs to stick around for the DoJ trial so he can be seen as a peaceful / incompetent / risk-free / all of the above CEO, in order to lessen the blow to Alphabet.\n\nWhenever a settlement is reached, he's gone and someone disruptive comes back in.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkte8v2/",
          "created": 1725103177,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lktlhn3",
      "score": 24,
      "body": "Guy selling Google and is 100% invested in Google.  Nope, not biased at all.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktlhn3/",
      "created": 1725106870,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lktoxut",
      "score": 5,
      "body": "You forgot one thing. AI models are trained on lots of data and Google has access to more data than anyone else.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktoxut/",
      "created": 1725108400,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkt36el",
      "score": 16,
      "body": "In Alphabet we trust.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt36el/",
      "created": 1725095974,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lktl38l",
      "score": 10,
      "body": "I think the best bull case is for a new management team or the management team deciding to have a \"year of efficiency\"",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktl38l/",
      "created": 1725106679,
      "depth": 0,
      "replies": [
        {
          "id": "lkxqdl9",
          "score": 3,
          "body": "Didn’t they already do that with a bunch of layoffs.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkxqdl9/",
          "created": 1725161504,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lktwj7b",
      "score": 3,
      "body": "One long term factor not discussed is the facts that Google can easily force website owners to hand over their data. \n\nMost websites rely on Google search to drive traffic, in recent months Google began using the information it scraped for AI not just search.\n\nThis leaves website owners with a dilemma, take a deal for less money and ensure their website is on Google or take a deal for more money, such as from other AI startups, but lose googles traffic.\n\nI think in the long tail of this Google wins because it’s currently able to buy oil for peanuts.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktwj7b/",
      "created": 1725111438,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkt1ppr",
      "score": 32,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt1ppr/",
      "created": 1725094975,
      "depth": 0,
      "replies": [
        {
          "id": "lku9dsj",
          "score": 11,
          "body": "On the contrary, everyone else here is going on abiut how bad GOOG is. Truth is, it's probably going to grow in line with QQQ.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lku9dsj/",
          "created": 1725116072,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkt25q0",
          "score": -1,
          "body": "I don't think you can describe it as \"jinxing\", it's more a representation of public sentiment. But nevertheless, Alphabet is currently flying very much under the radar. \n\nThats why I opened this discussion",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt25q0/",
          "created": 1725095277,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lktn0qw",
      "score": 3,
      "body": "I just saw the same post on wsb, and then it was deleted by the moderator. Unbelievable.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktn0qw/",
      "created": 1725107580,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lku42rz",
      "score": 3,
      "body": "What do guys think about the potential for waymo?\nSeems like it is expanding to new cities and gaining traction.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lku42rz/",
      "created": 1725114220,
      "depth": 0,
      "replies": [
        {
          "id": "lkyik27",
          "score": 3,
          "body": "Huge potential.    It is a trillion dollar market and Waymo is years ahead of everyone else.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkyik27/",
          "created": 1725177601,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkump9l",
      "score": 3,
      "body": "> With the deal it closed with Reddit beginning of 2024, google honestly struck Gold for a really cheap price.\n\n\nYou overestimate the value of Reddit data. And underestimate how easy it is to get for free.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkump9l/",
      "created": 1725120544,
      "depth": 0,
      "replies": [
        {
          "id": "ll5xifk",
          "score": 2,
          "body": "Reddit has made it much harder to get API calls. Ever since they noticed people scraping the data",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/ll5xifk/",
          "created": 1725293199,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkz00j4",
      "score": 3,
      "body": "After the guy that wrote long paragraph about intel I stopped reading similar posts",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkz00j4/",
      "created": 1725189099,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lktl2gu",
      "score": 8,
      "body": "Petition to merge this sub with WallStreetBets? The front page posts are already very similar.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktl2gu/",
      "created": 1725106669,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkt3dlt",
      "score": 23,
      "body": "You see, I think the exact opposite - it's one mag 7 stock that makes me nervous enough that I am thinking about getting rid of Nasdaq-100 ETF and own individual stocks instead.. I just don't want any GOOG exposure. The difference in opinions makes stock market interesting :)\n\nAs to your specific points:\n\n*They crushed earnings and the only reason for their slump afterwards was their heavy AI spending, which they can easily cut if they see its not worth it anymore. Also comparable to Meta.*\n\nWhat do you think is going to happen if they fail to deliver on AI and others will? Their golden goose is going to be gone as AI powered search/chat is going to be much better (it already is in many areas).\n\n*Alphabet is a leader in innovative technologies such as autonomous driving. Tesla shot up 40% or something when Elon made another promise towards autonomous driving, while Google actually is the first mover and build up a network with hundred thousands of paying users.*\n\nHow are they leaders if they get beaten in about every area other than search? They tried social network, got huge head start there and failed miserably. They've got a big AI division + deep mind and got beaten by OpenAI when it comes to public facing chat/AI. More and more of the Internet is getting behind walled gardens and Google doesn't own those nor has access. They regularly close services to the point it's a running meme in the industry. Their cloud offerings have worse reputation than AWS or Azure (and many smaller local competitors).\n\n*I think the summarised answers in Google search are already way more useful and convenient than what Bing or ChatGPT offers*\n\nNot sure why you have used \"already\" instead of \"still\" there. Google search keeps getting worse and less useful every year. It always starts with power users noticing and looking for alternatives. Masses move slowly but are hard to turn around once they do start moving.\n\nI see Google as a slow moving, fat, badly managed giant. They are losing to more agile competitors left and right. It's true that for now this happens in areas that don't matter that much to their main revenue stream but imo it's only matter of time till someone takes a shot at their main business.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt3dlt/",
      "created": 1725096110,
      "depth": 0,
      "replies": [
        {
          "id": "lktbamk",
          "score": 14,
          "body": "Great post. Two things stand out to me:\n\n Have to say many areas have battles that are to be decided. Some where Google has been historically strong (search), others were they enter new markets (cloud, waymo). \n\nWhat do you mean Google does not own walled gardens? Gmail, YouTube, waymo, Cloud, android. It all required a sign-in. There are probably more. All of them have at least 1b active users per month (maybe week or even day). \n\nOn badly managed, could you elaborate? I see anecdotal comments all the time, but never really substantiated. Google has a design that balances between chaotic and entrepreneurial from what I see. It's... Different. I still have not made up my mind on whether it's good or bad. Leaning towards good now, as otherwise the growth over the years would likely not have happened.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktbamk/",
          "created": 1725101426,
          "depth": 1,
          "replies": [
            {
              "id": "lkx818o",
              "score": 2,
              "body": "> I still have not made up my mind on whether it's good or bad. Leaning towards good now, as otherwise the growth over the years would likely not have happened.\n\nThe growth that Google has experienced is IN SPITE of it's awful management. Just imagine if they had a no-nonsense CEO like Hock Tan from Broadcom.",
              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkx818o/",
              "created": 1725153797,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lku196p",
          "score": 15,
          "body": "Betting against GOOG long-term is a not a great idea",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lku196p/",
          "created": 1725113210,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkt49ip",
          "score": 8,
          "body": "Still advertisers make 8$ revenue on every $ spent on Ads. Still they have a 26.4% profit margin. Imagine everything you mentioned they failed at, would run better. Crazy, isn't it?",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt49ip/",
          "created": 1725096724,
          "depth": 1,
          "replies": [
            {
              "id": "lkt4uit",
              "score": 2,
              "body": "*Still advertisers make 8$ revenue on every $ spent on Ads.*\n\nDo we know it's actually the case? Assessing ad campaigns is a notoriously hard problem. Do you happen to know a convincing analysis pointing at those numbers? I am not trying to say it's not true, I just don't know and I have heard various views about it.",
              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt4uit/",
              "created": 1725097134,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkt5xz0",
          "score": 14,
          "body": "Actually fears of Google lagging in AI is misrepresented. They are behind in front facing generative AI as you what you described. Many are harping what you said but there are different types of AI.\n\n\nGoogle is front running in 'predictive' AI. More what deepmind was designed for. For example which was used to discover new unseen materials in material science and compounds in biochemistry. That is massive for industries.\n\n\nRetail AI they can quickly catch up on.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt5xz0/",
          "created": 1725097881,
          "depth": 1,
          "replies": [
            {
              "id": "lkujwxl",
              "score": 4,
              "body": "As a pixel owner, Google is way out front in the use of AI just not overly public about it. I think it's smart to be reserved, as AI is polarizing.",
              "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkujwxl/",
              "created": 1725119602,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkt63vw",
      "score": 6,
      "body": "mgk if ur feeling frisky, going all in one a stock is like mining straight down",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt63vw/",
      "created": 1725097994,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lktpzvr",
      "score": 2,
      "body": "Wait until it gets down to $158. Save this post for later. Calling the bottom.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktpzvr/",
      "created": 1725108838,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lku52n3",
      "score": 2,
      "body": "I have not heard anyone say alphabet will die.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lku52n3/",
      "created": 1725114567,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkumyuz",
      "score": 2,
      "body": "Anthropic and apple are using their TPUs to train their large AI models. They will do well as the model sizes increase, anthropic at least are planning a $10 billion training run next year.\n\n\nIt's NVIDIA without the price multiple.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkumyuz/",
      "created": 1725120635,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkv36ri",
      "score": 2,
      "body": "Yes, I’ve been buying a lot goog and amzn.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkv36ri/",
      "created": 1725126080,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkv4r0h",
      "score": 2,
      "body": "Google is for sale if you didn’t know",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkv4r0h/",
      "created": 1725126607,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll04sfv",
      "score": 2,
      "body": "Forever stock",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/ll04sfv/",
      "created": 1725205347,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll27psa",
      "score": 2,
      "body": "This perspective overlooks some key factors. For one, Alphabet’s valuation isn’t just a simple reflection of its current earnings or growth. The market’s pricing already incorporates a lot of future expectations and risks. The high P/E ratio often associated with Alphabet could actually be a sign that investors have high hopes for its future growth, and this optimism is likely baked into the stock price.\n\nMoreover, Alphabet faces significant competitive pressures and regulatory challenges that could impact its future performance. The tech industry is notorious for its fast-moving and competitive nature, with new players constantly emerging. Additionally, the regulatory landscape is becoming more stringent, especially concerning data privacy and antitrust issues. These factors can constrain Alphabet’s operational freedom and potentially impact its profitability, complicating the argument that it’s undervalued.\n\nThen there’s the question of Alphabet’s investments in emerging technologies. While its ventures into AI, autonomous vehicles, and cloud computing are promising, they also come with considerable risks. These projects require substantial investment and time before they start delivering substantial returns. The current stock price might already reflect the high-risk, high-reward nature of these investments, which means it could be overvalued rather than undervalued if these ventures don’t pan out as hoped.\n\nFinancial health is another crucial aspect. Alphabet is indeed in a strong financial position, but its heavy reliance on advertising revenue makes it vulnerable to shifts in the market. Any downturn in the advertising sector or changes in consumer behavior could impact its earnings. This risk is an important consideration and might contribute to a more cautious investor sentiment, countering the claim of undervaluation.\n\nInvestor expectations play a significant role as well. The stock market often prices in future growth expectations rather than current performance. If Alphabet doesn’t meet these expectations or if growth slows, the stock might experience corrections. So, what might appear as undervaluation could actually be a reflection of high growth expectations rather than a genuine bargain.\n\nFinally, it’s worth considering alternative investment opportunities. Alphabet might seem undervalued when viewed in isolation, but there are other sectors and stocks that could offer better risk-adjusted returns. Investing in a variety of options might reveal more attractive opportunities depending on individual goals and risk tolerance. So, while Alphabet is certainly a significant player in the market, it’s essential to weigh these factors before concluding that it’s the most undervalued stock out there.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/ll27psa/",
      "created": 1725230759,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkt6tco",
      "score": 4,
      "body": "PE is misleading. Stock based compensation eats more than 35% of the free cash flow of the company. The price to free cash flow is around 50.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt6tco/",
      "created": 1725098476,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkt3qbz",
      "score": 4,
      "body": "Have you tried perplexity.ai for search? If you haven't, you should give it a shot (it's free). It shows how the core search revenue of alphabet is put at risk by AI.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt3qbz/",
      "created": 1725096355,
      "depth": 0,
      "replies": [
        {
          "id": "lktng9g",
          "score": 8,
          "body": "I have, they just take Google results and summarize them.\n\nI rarely use perplexity since Google released search overviews. I’d rather go straight to the source.",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktng9g/",
          "created": 1725107774,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkvt6kj",
          "score": 2,
          "body": "Ah yes perplexity … a TL;DR Google search",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkvt6kj/",
          "created": 1725134918,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lktcgfk",
          "score": 2,
          "body": "they serve totally different purposes imo. if i want to find quick answers i go perplexity but if i need to research deeper i go to google and find articles myself",
          "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktcgfk/",
          "created": 1725102137,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lktpyhh",
      "score": 3,
      "body": "Tale of 2 Indian CEO's of giant tech companies\n\nSundar Pichai is reactive constantly changing strategies based on other tech companies newest successes \n\nSatya Nadella is proactive constantly seeking new and better things to product and sell to market\n\nI'm not saying one is better than the other. Lord knows during the last 50 years there were periods were it was better to be proactive or reactive due to market conditions.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktpyhh/",
      "created": 1725108822,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkt8aif",
      "score": 2,
      "body": "Noone should be 100% invested into anything lmao",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt8aif/",
      "created": 1725099474,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkt467h",
      "score": 1,
      "body": "Regulatory risknis pricing it. The court decision mightbeat into advertising profit, is my guess.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt467h/",
      "created": 1725096661,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkt9nva",
      "score": 1,
      "body": "not sure about 100% in google but I don't disagree it's currently undervalue. I prefer meta in general though. They are so good at what earns them $$. google feels like they aren't trying hard enough on what they are good at.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkt9nva/",
      "created": 1725100376,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lktckxa",
      "score": 1,
      "body": "It's a quality company, but most undervalued? Not even close.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktckxa/",
      "created": 1725102212,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lktpaou",
      "score": 1,
      "body": "Google is great, the are a wonderful company and probably a smart investment.  But to say they are the \\*most\\* undervalued?  That's a bit aggro!",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lktpaou/",
      "created": 1725108547,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lku7ucy",
      "score": 1,
      "body": "You're fully committed to Alphabet, seeing it as undervalued due to strong growth, AI investments, and dominance in innovative tech sectors.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lku7ucy/",
      "created": 1725115544,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lku9xmh",
      "score": 1,
      "body": "Oh good it's  the monthly Google post",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lku9xmh/",
      "created": 1725116262,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkuais1",
      "score": 1,
      "body": "If you look last 5 years, the blip of yen carry trade of early August barely touches the highest high of November 2021.\n\nMaybe I’m not made to evaluate stocks by looking at graphs (only been doing this since May), but undervalued. Not sure. If we compare to MSFT maybe, but Microsoft has more variety.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkuais1/",
      "created": 1725116462,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkuieye",
      "score": 1,
      "body": "What's the difference between GOOG and GOOGL?",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkuieye/",
      "created": 1725119101,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkun4rd",
      "score": 1,
      "body": "Good play",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkun4rd/",
      "created": 1725120690,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkupvtw",
      "score": 1,
      "body": "I agree",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkupvtw/",
      "created": 1725121627,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkutxk9",
      "score": 1,
      "body": "the preface wording of this post reminds me of the nanna guy. well at least it's google.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkutxk9/",
      "created": 1725122986,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkuu1iu",
      "score": 1,
      "body": "Yes but people are more interested in Amazon, they are not so dependent on one big revenue chunk (in Google’s case their search)",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkuu1iu/",
      "created": 1725123023,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkuumto",
      "score": 1,
      "body": "great company but not cheap at this level. I'm a buyer below 120 tho",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkuumto/",
      "created": 1725123220,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkuw3lf",
      "score": 1,
      "body": "Price of a stock is not always about ratios, but on the expectations that people have. Currently AI is trending(there is a reason for it), and people tie their expectations with the companies who are investing and showing results.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkuw3lf/",
      "created": 1725123704,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkuw6mq",
      "score": 1,
      "body": "Cool\nPuts it is",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkuw6mq/",
      "created": 1725123732,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkv4g0r",
      "score": 1,
      "body": "Are you trying to convince people to buy the stock so it goes up and you can sell it?",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkv4g0r/",
      "created": 1725126504,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkv4qur",
      "score": 1,
      "body": "Just don't speculate be cause it ain't cracking one sixty five",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkv4qur/",
      "created": 1725126605,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkv6xiq",
      "score": 1,
      "body": "antitrust is the main threat, I reckon",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkv6xiq/",
      "created": 1725127342,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkv8ryw",
      "score": 1,
      "body": "Fairfax Financial is also growing double digits every year and it’s < 8x PE. Most of the income is from t-bills so it’s not subject to competitive dynamics. Plus it owns a bunch of cheap stocks some of which are even cheaper like Eurobank of which they own ~34%.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkv8ryw/",
      "created": 1725127974,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkv8vfj",
      "score": 1,
      "body": "You forgot markey does opposote of logic",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkv8vfj/",
      "created": 1725128008,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkv9fd2",
      "score": 1,
      "body": "Isn't the government considering breaking Google up?",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkv9fd2/",
      "created": 1725128193,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkvakg6",
      "score": 1,
      "body": "Well this is a ‘steaming hot’ take.\n\nGl pal, your reasons are exceptionally shallow and this is a gamble, not an observation of value.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkvakg6/",
      "created": 1725128585,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkvdb1m",
      "score": 1,
      "body": "It's in the Top 10 holdings in all the tech heavy investment funds",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkvdb1m/",
      "created": 1725129519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkvl8wk",
      "score": 1,
      "body": "GOOG is definitely not the best monetization engine in Tech, but hey the pie is big enough for nos. 1, 2, AND 3 (Goog) to make a shit ton of money. If you are the best at one major thing (search), and no. 2 or 3 in multiple other things, that's a shit ton of money dude.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkvl8wk/",
      "created": 1725132207,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkvzp88",
      "score": 1,
      "body": "lol. Take off your conflicted self interested rose glasses.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkvzp88/",
      "created": 1725137156,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkw07t9",
      "score": 1,
      "body": "Could be my confirmation bias speaking here…but Waymo. That could be the next thing.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkw07t9/",
      "created": 1725137333,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkw3z38",
      "score": 1,
      "body": "Not sure, I stopped using google to actually search anything. Just use gmail and YT nowadays.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkw3z38/",
      "created": 1725138640,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkw7kwa",
      "score": 1,
      "body": "I don't think so they are facing a cliff edge. Their business model and primary source of revenue is smoked. More and more people are utilizing AI to search the web which bypasses display advertisements. But alphabets shareholders demand ROI so when they release ai products they are half baked.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkw7kwa/",
      "created": 1725139902,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkwd73f",
      "score": 1,
      "body": "just wait till they start selling personal waymos",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkwd73f/",
      "created": 1725141885,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkwjg37",
      "score": 1,
      "body": "Could not agree more.    My favorite for the next decade is easily Google.  They are just so well positioned for what is coming.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkwjg37/",
      "created": 1725144197,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkx2a9k",
      "score": 1,
      "body": "Valuation doesn’t matter as much as the growth remaining. Can they still grow to 5T or 10T?",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkx2a9k/",
      "created": 1725151467,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkxgrjm",
      "score": 1,
      "body": "Yeah, bet on the company whose revenue is ads and has no does how they’re going to integrate AI into that model without undercutting themselves",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkxgrjm/",
      "created": 1725157417,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkxh5pv",
      "score": 1,
      "body": "So wrong",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkxh5pv/",
      "created": 1725157579,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkxifch",
      "score": 1,
      "body": "Bro 100%? Like come on, you can still invest in other stuff",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkxifch/",
      "created": 1725158094,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkxndt9",
      "score": 1,
      "body": "Even tho I agree it’s unlikely, I wonder if a break up is even a bad thing for shareholders. Wouldn’t you just get shares in several very good companies? Like YouTube on its own would be one of the most valuable media companies in the world.  Feels like the various parts could be worth more than the current whole.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkxndt9/",
      "created": 1725160165,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkxnzlo",
      "score": 1,
      "body": "Their average PE over the past 9 years is 26x, now it's 23x. It's not that undervalued.\n\nAlso there are couple of potential head winds for Google's business model. LLMs are diminishing the need for the search traffic and government is looking at curtailing their monopoly.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkxnzlo/",
      "created": 1725160430,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkxodjb",
      "score": 1,
      "body": "I agree with this take. I have been buying the dip and I’ll buy some more Tuesday",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkxodjb/",
      "created": 1725160599,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkxt4h6",
      "score": 1,
      "body": "So does my Raymond James guy. Sort of.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkxt4h6/",
      "created": 1725162779,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkxwzx6",
      "score": 1,
      "body": "I'd be more bullish if they replaced Sundar Pichai with someone else tbh.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkxwzx6/",
      "created": 1725164659,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkxx8km",
      "score": 1,
      "body": "Grandma is proud",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkxx8km/",
      "created": 1725164781,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lky0p26",
      "score": 1,
      "body": "Their CEO goes, stock rockets.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lky0p26/",
      "created": 1725166590,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lky1hbw",
      "score": 1,
      "body": "AI is the whole bet. Out entire future economy is AI and Google is still the leader in that area. ",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lky1hbw/",
      "created": 1725167020,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lky64nz",
      "score": 1,
      "body": "You don’t list any downsides. You’re not seeing clearly.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lky64nz/",
      "created": 1725169680,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkyiwq0",
      "score": 1,
      "body": "I’m actually 100% in lululemon cuz I think the same lol",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkyiwq0/",
      "created": 1725177830,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkypmbw",
      "score": 1,
      "body": "Lol where is this \"growth\" that should reflect a growth-multiple rather than a value-multiple?",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkypmbw/",
      "created": 1725182322,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkystfh",
      "score": 1,
      "body": "As far as we can see, google is simply a \"digital ads\" company with their own search engine. If they didnt buy youtube back then, they wouldnt even be close to what they are now. Besides these two ad-filled revenues, they got nothing else going for them.  \nIMHO, google is a great stock to buy if you dont know any companies in the world.  \nOverall, properly valued to overvalued.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkystfh/",
      "created": 1725184485,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkyuilk",
      "score": 1,
      "body": "Apple also",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkyuilk/",
      "created": 1725185611,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkz3s7w",
      "score": 1,
      "body": "Google is finished, puts are in order",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkz3s7w/",
      "created": 1725191202,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkz66fz",
      "score": 1,
      "body": "This post seems out of touch and written by someone who holds a lot of shares. OP would seemingly rather write a manifesto of why they were right to buy GOOG rather than consider that they may have gone too far in on a lagging company compared to other MAG7",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkz66fz/",
      "created": 1725192427,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkziqxx",
      "score": 1,
      "body": "I noticed that I have been going to chatgpt for sources instead of Google. Google is giving crap results. Google is goner at the rate it is going",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/lkziqxx/",
      "created": 1725197769,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll09dry",
      "score": 1,
      "body": "\"I am 100% invested in \" was all I needed to see to know this did not need to be read any further.",
      "permalink": "/r/stocks/comments/1f5ivu1/i_think_alphabet_googl_is_the_most_undervalued/ll09dry/",
      "created": 1725206810,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The post discusses why the author believes Alphabet (GOOGL) is currently the most undervalued stock.",
    "companies": [
      "Alphabet",
      "Meta",
      "Tesla",
      "Google"
    ],
    "tickers": [
      "GOOGL",
      "META",
      "TSLA"
    ],
    "main_ticker": [
      "GOOGL"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The user believes Alphabet (GOOGL) is undervalued and has strong growth potential due to its innovation and market position.",
    "stock_recommendations": "The user is recommending to buy GOOGL stock",
    "is_recommending_stock_buying_or_selling": true,
    "buy_or_sell": "buy",
    "sentiment_summary": "There is positive sentiment because the user is confident in Alphabet's growth and market position, recommending it as a good investment.",
    "sentiment": "positive"
  }
}