{
  "title": "So will Jumia ever become the Amazon of Africa, or something remotely close to it?",
  "score": 77,
  "selftext": "Jumia was an interesting stock back in 2020/2021, seemed like everyone was talking about it in the bull market. After seeing success stories like Mercado Libre and Sea Limited I couldn’t help but buy a few shares of Jumia around $20. The problem is that you sort of have to believe in the African growth story for the thesis to work out long term.\n\nIt seems like Africa lacks the infrastructure to handle logistics, like there are not even street addresses in some areas of Africa. Many countries have weaker financial institutions including a large unbanked population without checking accounts. And the internet penetration rates can be really low in some countries.\n\nI feel like at certain inflection point of development in emerging markets there will most likely not be a country or region that will be an exception to increasing e-commerce adoption. But even though Jumia as a first mover advantage, I’m not sure if they’ll be the company to revolutionize e-commerce in Africa if wide e-commerce adoption is even possible in Africa at the moment.\n\nDo we think that the bull thesis is still intact for Jumia. Or is it a sell?",
  "link_flair_text": "Rule 3: Low Effort",
  "id": "1f5ljwt",
  "num_comments": 75,
  "created_utc": 1725105396,
  "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/",
  "comments": [
    {
      "id": "lktqfgh",
      "score": 298,
      "body": "Amazon will become the amazon of africa",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lktqfgh/",
      "created": 1725109014,
      "depth": 0,
      "replies": [
        {
          "id": "lkts9zd",
          "score": 19,
          "body": "^ Yeap I said the same thing when my friend was telling me about this stock few years ago",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkts9zd/",
          "created": 1725109751,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lktxgcu",
          "score": 9,
          "body": "They are already in Egypt and South Africa.",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lktxgcu/",
          "created": 1725111791,
          "depth": 1,
          "replies": [
            {
              "id": "lkudqfx",
              "score": -1,
              "body": "Takealot is better than Amazon in SA.  Amazon doesn’t even sell its own products in SA, not a complete flop of an entry to the market, but close enough.",
              "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkudqfx/",
              "created": 1725117497,
              "depth": 2,
              "replies": [
                {
                  "id": "lkxesdb",
                  "score": 2,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkxesdb/",
                  "created": 1725156603,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkxp3h8",
                      "score": 2,
                      "body": "Amazon has been in SA for ages.  SA is where AWS was actually conceived and started.  \n\nThe marketplace launch was however a complete shambles.  \n\nI’ve lived in a few regions where amazon launched and died.  China notably.  \n\nWe’ll see if it improves, but the threat of Amazon will take over locally  doesn’t look like going to happen anytime soon.  Lack of amazon products for sale, people wanted to buy kindles firesticks etc,  but none of that for sale, and store is the same imported chinese fluff thats in the other marketplaces but for even higher prices.  Much fail so far.\n\nSA has a small online user base too, so getting it right from the start was important.  Now they have an uphill battle as word of mouth is essentially it sucks, don’t bother.   To remedy that will need to do some loss leading to gain back some user base.\n\nRight now it makes no sense to use the local version over US amazon.",
                      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkxp3h8/",
                      "created": 1725160920,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lktto7q",
          "score": 13,
          "body": "Hard to say that with certainty. Amazon hasn't been able to replicate it's e-commerce success in less mature markets",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lktto7q/",
          "created": 1725110312,
          "depth": 1,
          "replies": [
            {
              "id": "lkukx47",
              "score": 5,
              "body": "Isn't it doing alright in India? That's a pretty big market that I wouldn't characterize as mature.",
              "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkukx47/",
              "created": 1725119937,
              "depth": 2,
              "replies": [
                {
                  "id": "lkzb6ma",
                  "score": 5,
                  "body": "India had a very good logistics network and telecom network and acceptance of e-commerce even before Amazon ventured in.",
                  "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkzb6ma/",
                  "created": 1725194736,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkvcqj7",
                  "score": 10,
                  "body": "India and Sub-Saharan Africa are in different universes.",
                  "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkvcqj7/",
                  "created": 1725129323,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkyuede",
                      "score": 5,
                      "body": "Very true - the average gdp per capita of countries in sub-saharan Africa is double that of India.",
                      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkyuede/",
                      "created": 1725185534,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lkzk4v6",
                      "score": 1,
                      "body": "A friend that worked for Wayfair said there was a massive difference in the type of fraud they saw between the two regions. So much so it was hard for them to operate. ",
                      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkzk4v6/",
                      "created": 1725198297,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lkwqoqj",
                      "score": -4,
                      "body": "India is hopeless, sub-Saharan Africa isn't. So you're right.",
                      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkwqoqj/",
                      "created": 1725146969,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lkwsls7",
                  "score": 2,
                  "body": "They are doing decent but they face some stiff competition. They are advertising really aggressively in India to try to get more share.",
                  "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkwsls7/",
                  "created": 1725147705,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ls4hadp",
                      "score": 1,
                      "body": "Exactly this, marketshare is going to be the deciding factor and in India and Africa Amazon is lagging behind. FlipKart/Walmart dominates in India and in Africa, it’s Jumia. In fact, Amazon bought into the market in Egypt through an acquisition and still doesn’t have majority share in the region.",
                      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/ls4hadp/",
                      "created": 1729037075,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ls4bx51",
                  "score": 1,
                  "body": "I don’t know about Amazon but i know FlipKart which held 50% of the marketshare in e-commerce in India was STILL unprofitable when Walmart moved in and bought a 70% controlling interest in the company. One of the talking points for Walmart’s involvement, aside from the obvious, was help in cultivating supply-chains and logistics networks to expedite the path towards profitability. I wouldn’t be surprised if Amazon is in the same boat; they went through the same problems here in the US and the environment was far more favorable with respects to both factors.",
                  "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/ls4bx51/",
                  "created": 1729035047,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lku4mrt",
              "score": 10,
              "body": "Africa isn't worth it. South America has a competent competitor",
              "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lku4mrt/",
              "created": 1725114413,
              "depth": 2,
              "replies": [
                {
                  "id": "lkwqkjp",
                  "score": 7,
                  "body": "Insane take. Not every country in Africa is Somalia, Niger and Soudan.\n\nSeveral african country have huge GDP increases every year.\n\nThose countries will be excellent markets within the next decade.",
                  "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkwqkjp/",
                  "created": 1725146924,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkwqnwg",
                      "score": 2,
                      "body": "Yes but the GDP is lots of small items. Paying ueg sums to shit cheap items doesn't work. Ask jumia.",
                      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkwqnwg/",
                      "created": 1725146961,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkwsgze",
                          "score": -1,
                          "body": "Right now it may not work, but give it time. African nations are still fairly young. Only an illeterate fool would disregard them.\n\nPlenty of people claimed Amazon \"doesn't work\" 20 years ago.",
                          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkwsgze/",
                          "created": 1725147655,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ls4hwp2",
                  "score": 1,
                  "body": "There’s obvious potential in Africa, especially going into the next couple of years. If that weren’t the case major players like Amazon, Walmart and Alibaba wouldn’t be investing heavily into breaking into the market through buy-outs and investments. This isn’t even mentioning the uptick in investment by the US and China into infrastructure in the continent.",
                  "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/ls4hwp2/",
                  "created": 1729037307,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lktvqm9",
              "score": 2,
              "body": "*yet",
              "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lktvqm9/",
              "created": 1725111131,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll0c3vc",
              "score": 1,
              "body": "I like how a thread about Jumia turned into an Amazon in India thread. It is kinda funny sometimes how much this sub goes out of its way to not talk about stocks outside of Mag 7. I guess OP started it saying Amazon of Africa but I kinda hoped to get insight into the African market with this thread. Not India.",
              "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/ll0c3vc/",
              "created": 1725207706,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkxfkhs",
          "score": 2,
          "body": "Came here to say the same",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkxfkhs/",
          "created": 1725156929,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkux19o",
          "score": 3,
          "body": "Amazon will also be the Amazon of the Amazon",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkux19o/",
          "created": 1725124016,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkuw3et",
          "score": 2,
          "body": "Why couldn’t Amazon be the Amazon in South America?",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkuw3et/",
          "created": 1725123702,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkzjv3m",
          "score": 0,
          "body": "The anything of anything is the nothing of nothing. ",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkzjv3m/",
          "created": 1725198193,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkuhbvs",
      "score": 15,
      "body": "Years ago I saw a documentary about Chinese businessmen in an African country trying to invest in building businesses and infrastructure. He would get to the work site and see everyone just standing around and ask what the hold up was. The materials never showed up. He went down to the vendor to see what was going on. The truck didn’t have any gas or something. It was like comically frustrating to try to get anything done.",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkuhbvs/",
      "created": 1725118729,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkumrtc",
      "score": 65,
      "body": "People act like Amazon’s e-commerce business is super profitable in the first place.\nWithout AWS, Amazon is at most a $400B market cap company - less than Walmart.",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkumrtc/",
      "created": 1725120568,
      "depth": 0,
      "replies": [
        {
          "id": "lkutsfb",
          "score": 23,
          "body": "Yep. That is something that should be considered when discussing Jumia. Jumia doesn't have AWS or a movie studio to help with growth and profitably. \n\nJumia is mainly an ecommerce and fintech in an underbanked region. And a region that has massive currency devaluation going on. I cant really think of many other companies dealing with the currency devaluation Jumia is dealing with operating mainly in Africa.",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkutsfb/",
          "created": 1725122939,
          "depth": 1,
          "replies": [
            {
              "id": "lkv4221",
              "score": 5,
              "body": "Not that I think jumia has good value rn but Africa is an extremely dense region  within the cities. Like much much more dense than us or even Europe. This is really good for something like ecommerce where since it's so dense logistics is a LOT cheaper. also a lot of people here treat Africa like it's one nation. Africa is an enormous continent that is super racially, socially, and economically diverse. North Africa for example is essentially a developed nation although a lot of the population is still poor. Urban Nigeria, Ethiopia and many other countries are already rich enough to afford luxuries.",
              "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkv4221/",
              "created": 1725126375,
              "depth": 2,
              "replies": [
                {
                  "id": "lkvffza",
                  "score": 2,
                  "body": "I am aware Africa has multiple countries. My comment was about Jumia not having the similar cloud and movie/tv segments. So it isnt really a 1 to 1 comparison saying it is Amazon. My comment would have been longer if I were to elaborate the currency devaluation. Nigeria the one you mentioned was one of those countries that had that issue along with Egypt.\n\nOne thing I will add is these threads for some reason make e-commerce/retail a winner take all monopoly thing outside the US. In the US you can buy stuff online from Amazon, Walmart, Costco, Target, Ebay just to name a couple companies they can all coexist. But once this sub talks about other countries it is monopoly or bankruptcy/failure for the stock.",
                  "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkvffza/",
                  "created": 1725130235,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ls4po1w",
                      "score": 1,
                      "body": "Currency devaluation is a factor but it isn’t an existential threat, especially for a company that operates within such an expansive and variable economic landscape. It’ll result in short term dips in their stock but constant currency is more relevant when evaluating the long term success of a company, just look at Mercado Libre which similarly operates within a volatile environment with regards to currency. Completion is a factor though but Jumia has an uncontested lead in the continent according to marketshare.",
                      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/ls4po1w/",
                      "created": 1729040180,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lku6igf",
      "score": 11,
      "body": "I saw a video above this company a while back. Pretty much, no. The odds are incredibly steep. Africa is exceptionally more challenging of a market than North America. Africa is a continent of many countries all with different levels of affluence, infrastructure, and culture. One of Amazon's pillars of success is its logistics network. It's much easier to set this kind of network set up in America than Africa, and to maintain it due to geopolitical and terrorist risks. The types of products the different demographics would demand throughout the continent would be too broad to have efficiency with inventory.   \n\n\nI wouldn't bet on it.",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lku6igf/",
      "created": 1725115079,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lktpqkn",
      "score": 18,
      "body": "No.",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lktpqkn/",
      "created": 1725108730,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lku87og",
      "score": 6,
      "body": "Jumia's bull thesis is uncertain due to Africa's infrastructure challenges, making it a speculative hold.",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lku87og/",
      "created": 1725115672,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkv6llh",
      "score": 5,
      "body": "MELI has MercadoPago, and AMZN has AWS. Retail alone will not turn JMIA into MELI or AMZN. But acting like Africa is just a bunch of huts is ridiculous, and there will be massive growth there similar to China or India.",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkv6llh/",
      "created": 1725127229,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lku27dg",
      "score": 5,
      "body": "I just looked at this quarters investors presentation and there is not a single metric that conveys a feeling of growth. Revenue has been stagnant for about 4 years, they are focusing on profitability but lacking the benefit of scale, while losing customers in each of the last 5 quarters.",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lku27dg/",
      "created": 1725113554,
      "depth": 0,
      "replies": [
        {
          "id": "lku4sso",
          "score": 3,
          "body": "From the past few earnings reports, I figured out that they were trying to streamline their business: not anymore trying to grow at all costs but focusing their efforts on their core markets and activities (like they stopped their food delivery service). Currency volatility plays a role but I think any company has that challenge to deal with.",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lku4sso/",
          "created": 1725114472,
          "depth": 1,
          "replies": [
            {
              "id": "ls5j46n",
              "score": 1,
              "body": "I saw the same thing but interpreted the information differently. The amount of liquidity that Jumia has access to is a little over 90 million, an amount historically eclipsed by its annual losses so reducing said losses would need to be a priority especially in a continent that’s a development in progress making expansion costly and gradual as seen through JumiaFoods. Prioritizing efficiency and securing profitability while focusing on continued growth in marketshare and revenue in key markets ONLY and THEN diversifying and expanding into different revenue streams is the sustainable move. It’s the opposite of what Amazon did in The States but the environment is also very different. Cost efficiency, profitability and marketshare FIRST followed by gradual revenue diversification and growth after",
              "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/ls5j46n/",
              "created": 1729052481,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lky19fy",
          "score": 1,
          "body": "Saw the same thing, nothing about the financials made me really hopeful at all, a company this early having troubles growing revenue is a bit concerning too, profitability is one thing, but revenue growth is a must.",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lky19fy/",
          "created": 1725166899,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lktr4ul",
      "score": 30,
      "body": "Are you American? I only ask as most Americans tend to not have as strong a grasp on geographies and perspectives. \n\nAfrica is a continent. It is the second largest continent on the planet after Asia. Africa is three times as large as the US on a land mass basis. Expecting one company to dominate e-commerce in Africa is the same as expecting Amazon to dominate e-commerce in the North *and* South American continents, and Alibaba to dominate e-commerce in *all* of Asia. \n\nIt’s impossible. The land mass is too big, the population too undocumented and the infrastructure too variable. \n\nHowever Jumia can be successful if it just focuses on a few countries in say East Africa, rather like Sea Ltd in South East Asia. But even this will take a long time to build out logistics and even longer to churn out a profit (we’re talking a decade at least). \n\nBut the whole of Africa? Impossible.",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lktr4ul/",
      "created": 1725109298,
      "depth": 0,
      "replies": [
        {
          "id": "lku28lv",
          "score": 6,
          "body": "There is also the question of quality personell. They can get people from all over the world but long time they need people to run this locally. They can't wait for the governments to raise education levels but have to create incentives for people to learn with western levels. That is what Alibaba did, when the Jack Ma realized that modern mba, it and supply chain knowledge isn't there so he had to build own universities to train future workers.",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lku28lv/",
          "created": 1725113567,
          "depth": 1,
          "replies": [
            {
              "id": "lkz4t44",
              "score": 1,
              "body": "I don't speak for the masses as I live in a hole but...I actually think Jumia's largest challenges are quality items and a solid return policy. I have not used Jumia for any electronic devices because of the limited lack of quality assurance years (7?) ago. If Jumia can get customers to trust them, then I think it would be a massive step in the right direction.",
              "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkz4t44/",
              "created": 1725191734,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lku1m55",
          "score": 0,
          "body": "I remember looking at it years ago and stopped when I saw the headquarter was in Germany.",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lku1m55/",
          "created": 1725113342,
          "depth": 1,
          "replies": [
            {
              "id": "lku60jj",
              "score": 2,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lku60jj/",
              "created": 1725114901,
              "depth": 2,
              "replies": [
                {
                  "id": "lku7pq5",
                  "score": 6,
                  "body": "Because I think you need to be in the market where you operate to understand it, especially if the differences are so big like Europe vs Africa. All the issues they are talking about in their earning calls already existed (like missing addresses), I think if they would actually have been based in Africa they would have noticed it earlier.",
                  "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lku7pq5/",
                  "created": 1725115499,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkujuvl",
          "score": 0,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkujuvl/",
          "created": 1725119583,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkue1zf",
          "score": -1,
          "body": "Alibaba does dominate all of Asia though.   Look at who owns lazada.  Oh, it’s alibaba.  So, that’s pretty much overwhelming market share achieved in Chinese speaking countries, plus all of south east Asia.",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkue1zf/",
          "created": 1725117608,
          "depth": 1,
          "replies": [
            {
              "id": "lkuggpp",
              "score": 6,
              "body": "Um… even if you include all of China and South East Asia (which is being generous as Lazada doesn’t dominate in SEA anyway) that is still only roughly a third of Asia (by land mass, about 40% by population). \n\nSaying one company ‘dominates all of Asia’ is not just factually incorrect but laughably ludicrous.",
              "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkuggpp/",
              "created": 1725118431,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkxdpti",
      "score": 2,
      "body": "Three companies standout when reading your post:\n\nASTS - though it has a long way to go, it will make internet ubiquitous anywhere on the planet if and when it gets there.\n\nWhat3words - a company that broke the world up into 3sq m units and gave every unit an address of any three words. Mongolia uses it for their official mailing system. At least I read this years ago, not sure if it’s still true. \n\nNU bank - I’m sure Africa has or will have its own online only banking. NU bank is spreading across South America quite rapidly for many reasons. The main ones being that in rural areas many people don’t have access to banks. Also in many developing countries capital flow is much more restricted and people can’t get access to loans. I’m not sure that NU bank makes lending easier but it certainly makes having a bank account and digital transactions much easier. Most of the developing world relies on their phones for pretty much everything, so an all digital bank is pretty attractive.\n\nMost people are saying Amazon is the next Amazon, while I do agree, that it may be possible, most developing nations have high import tariffs which can sometimes cause the products available to become prohibitively expensive. I think that in the next 5 years e-commerce likely will take off in Africa, but who knows if it will be Jumia or Amazon or something else. I would personally bet that it’s much more likely to be something like alibaba or temu though.",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkxdpti/",
      "created": 1725156160,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lktsvi0",
      "score": 13,
      "body": "Money isn’t what’s holding the 3rd world back. It’s the 3rd world. No amount of foreign investment will turn any African nation into a booming economy.",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lktsvi0/",
      "created": 1725109993,
      "depth": 0,
      "replies": [
        {
          "id": "lku3wxp",
          "score": 5,
          "body": "Hans Rosling said [in his wonderful book](https://www.gapminder.org/factfulness-book/), we shouldn't see any place as developed or underdeveloped. Africa came a long way, but its never reported. Western press just looks at wars and conflict.  \nAfrica doesn't need to be on western levels. Its huge, it has its own history. Maybe having a tv in every room blasting propaganda on everybody 24/7 isn't the best way to live.  \nThere are conflicts in Africa that needs to be resolved locally. The west should stop patronizing, but it should also stop sending food or people there. That just creates more learned helplessness. There are enough jobs and enough ways to grow the continent. For example, many countries in Africa have government functions completely online. Countries like the US or Germany dream about this. There you have to get in line for some form. Africa has already working drone programs for meds, stuff and food. Because its so big you need completely different approaches.   \nThat makes companies like Jumia so interesting because it would be a completely different style of business for diversification.",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lku3wxp/",
          "created": 1725114163,
          "depth": 1,
          "replies": [
            {
              "id": "lku7e07",
              "score": 9,
              "body": "Many of these countries don’t have strong economies or exports, so there aren’t enough jobs for people. Very high unemployment. Lack of critical infrastructure. High rates of poverty. Low access to clean water, food, healthcare. Very little chance of any change because again, there isn’t an economy to support jobs. It’s a dire situation in many African cities. When you add in the war/crime, it’s bleak.",
              "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lku7e07/",
              "created": 1725115386,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ls5lnx7",
          "score": 1,
          "body": "The way investment is applied matters, i think. When you look at the product from the different styles of dispensing financial aid in Africa between the USA and China, China’s style of financing and managing infrastructure projects has yielded a significant return on investment for both countries. I think the US should be careful about just handing over money to local governments and expecting it not to be lost due to “mismanagement”.",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/ls5lnx7/",
          "created": 1729053814,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkttzjj",
          "score": -8,
          "body": "whats holding them back is foreign meddling in their affairs, just leave them the fuck alone",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkttzjj/",
          "created": 1725110440,
          "depth": 1,
          "replies": [
            {
              "id": "lktxr25",
              "score": 2,
              "body": "Foreign meddling has nothing to do with it. Look at the capital of Mali. The capital is overflowing with trash. They are their own problem.",
              "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lktxr25/",
              "created": 1725111904,
              "depth": 2,
              "replies": [
                {
                  "id": "lku2avi",
                  "score": 3,
                  "body": "coming from someone who doesn't even wash his ass after going to the bathroom. very rich",
                  "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lku2avi/",
                  "created": 1725113590,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lku2gwo",
                      "score": 0,
                      "body": "😂",
                      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lku2gwo/",
                      "created": 1725113650,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkud8mi",
      "score": 4,
      "body": "When I was at the entrance to the Bwindi National Forest in south east Uganda, far away from the next ATM or highway, the local hospital would rather order their walking aids, wheelchairs, etc. through Jumia than the national pharmacy. That’s pretty impressive. Nevertheless, it’s still a long shot to call them the Amazon of Africa.",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkud8mi/",
      "created": 1725117329,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkto3m9",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkto3m9/",
      "created": 1725108052,
      "depth": 0,
      "replies": [
        {
          "id": "lktomql",
          "score": 1,
          "body": "Your post or comment has been removed due to breaking /r/stocks rule #2 (no spam or self promotion).  \n\nWhile we encourage active discussion of stocks and investments, pushing your site/app/tool/referral/subreddit/discord is not allowed.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lktomql/",
          "created": 1725108273,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lktqzet",
      "score": 1,
      "body": "It seems like too much a bet. Both in the macro and in the micro. \n\nAfrica needs to work, [Jumia](https://capitalclimb.app/company/JMIA) needs to work. It’s hard enough investing in a good country.\n\nJust allocate your capital in another stock a smaller risk to reward ratio. There’s plenty out there.",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lktqzet/",
      "created": 1725109238,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkv5500",
      "score": 1,
      "body": "Any time someone tells me they want to buy the next Amazon, I just slap them and tell them to buy Amazon.",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkv5500/",
      "created": 1725126738,
      "depth": 0,
      "replies": [
        {
          "id": "lkvbcg6",
          "score": 1,
          "body": "It worked for me when I bought MELI at $600 a couple years ago. And SE when I bought it at $40 last year. Not saying JMIA is a buy but buying MELI and SE when those had negative sentiment worked out for me.",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkvbcg6/",
          "created": 1725128849,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkwq8oe",
      "score": 2,
      "body": "If you bought at 20$, you already made a lot of money lol",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkwq8oe/",
      "created": 1725146798,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lli36re",
      "score": 1,
      "body": "Jumia is the equivalent to a start-up business. Meli, Cpng, Se, and Baba are far less speculative and mature businesses.",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lli36re/",
      "created": 1725472777,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lku5124",
      "score": 0,
      "body": "i gave up on exotic overseas dreams bro. i live in the heart of the world empire \\[usa\\] all the money and fortunes and stocks are right here. why bother elsewhere?",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lku5124/",
      "created": 1725114553,
      "depth": 0,
      "replies": [
        {
          "id": "lkureul",
          "score": 3,
          "body": "idk, maybe because other wealthy and somewhat politically stable places exist in the world, where money is to be made (not talking about African countries), but what would you have against an investment into Switzerland or maybe even Singapore?",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkureul/",
          "created": 1725122147,
          "depth": 1,
          "replies": [
            {
              "id": "lkuz4j3",
              "score": 2,
              "body": "I should've sold on that last massive run-up.  I'm keeping a small 1k share lot in my Roth in case it ever does blowup.  Some % of your overall portfolio should be invested in some high risk.",
              "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkuz4j3/",
              "created": 1725124714,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lktxbvn",
      "score": -1,
      "body": "Why would you want one company to dominate commerce in one country or continent?",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lktxbvn/",
      "created": 1725111744,
      "depth": 0,
      "replies": [
        {
          "id": "lku6sim",
          "score": 2,
          "body": "Because you had invested in it?…",
          "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lku6sim/",
          "created": 1725115177,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkv08b7",
      "score": -2,
      "body": "no. too tribal.",
      "permalink": "/r/stocks/comments/1f5ljwt/so_will_jumia_ever_become_the_amazon_of_africa_or/lkv08b7/",
      "created": 1725125086,
      "depth": 0,
      "replies": []
    }
  ]
}