{
  "title": "What is the difference between versions of the same stock?",
  "score": 60,
  "selftext": "TLDR; How to know which s&p to invest in.\nI thought id just search up \"S&P 500\" and find it but I dont know the difference between any of the options. Cant add a photo, but on robinhood(not trying to discuss robinhood) it has all these listings (SPY, SPLG, SPYV,SPYG,SPYD, SPXL, SPXS, SPMO, SPXU, SPUS) like a bear 3x, momentum etf, ultra pro short?? I just figured the s&p would be a good first invest from like the one high school class i had on economics 3 years ago but now idk.",
  "link_flair_text": "Advice Request",
  "id": "1f672in",
  "num_comments": 47,
  "created_utc": 1725168477,
  "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/",
  "comments": [
    {
      "id": "lky6ewb",
      "score": 73,
      "body": "SPY, VOO, and IVV are the main S&P 500 ETFs (just pick the lowest fee). There are a lot of variations like SPXL which is leveraged (you make triple gains but also triple the losses). These variations are *not* tracking the S&P 500 itself, they are only based on the S&P 500.",
      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky6ewb/",
      "created": 1725169850,
      "depth": 0,
      "replies": [
        {
          "id": "lkye1yb",
          "score": 30,
          "body": "Daily leveraged gains, not leveraged long term gains, people always misunderstand this crucial distinction.\n\nIf you are a new investor do not even attempt to look into leveraged funds. They are tools for traders, not for an investor who wants to park their money into the SP500 long-term.",
          "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkye1yb/",
          "created": 1725174628,
          "depth": 1,
          "replies": [
            {
              "id": "lkygrsz",
              "score": 8,
              "body": "by the way is \"parking your money in the SP500 long term\" a bad idea? I figured it would be a safe bet and a friend i asked whos recently gotten into stocks soft-backed the choice, said it was good.",
              "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkygrsz/",
              "created": 1725176406,
              "depth": 2,
              "replies": [
                {
                  "id": "lkyhuuz",
                  "score": 9,
                  "body": "It’s a great idea, what’s a bad idea is parking it in a leveraged fund. Just stick to SPY, VOO, or VTI (if you want total market not just the SP500).\n\nLater on you can invest in individual sectors you are bullish on, and eventually individual businesses. But for the majority of people who don’t want to do that research, and actively manage their portfolio. Just put it in the SP500 or a total market fund and hold until you retire.",
                  "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkyhuuz/",
                  "created": 1725177130,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkz9amr",
                      "score": 5,
                      "body": "Totally feel free not to respond, some people dont like continuous advice but, it almost feels like not a super worth thing to invest a small amount in with just starting out then? I don't know really, I guess its just cause retirement is at minimum 25 years out which is older than me, it doesn't like feel like it will be exponential enough to actually impact my life till then if its holding that long? Or is it just a safe start bet to like dip your feet in the water type deal",
                      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkz9amr/",
                      "created": 1725193910,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkzj9mp",
                          "score": 5,
                          "body": "It’s always worth to invest what you can, first build a solid savings in a HYSA and whatever excess income that not in your 401k or going towards your living expenses, put it in a retirement account. You’ll thank yourself. Compounding is like magic.",
                          "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkzj9mp/",
                          "created": 1725197967,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ll1ef4p",
                      "score": 1,
                      "body": "Why not SPYG if you are young for 20-25 years then move it to spy/voo as you hit 50 or 55?",
                      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/ll1ef4p/",
                      "created": 1725220498,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lkyxtlm",
                  "score": 3,
                  "body": "I got advice from someone who knows alot more than me about stocks I put buy 10 bucks worth (hopefully with a couple of promotions in the job i will increase) of sp500 every pay check and will hope to do so for the next 30 years or more . I was told this is a good strategy so far a year in I'm on the up. Best of luck!",
                  "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkyxtlm/",
                  "created": 1725187764,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkyzg14",
                      "score": 5,
                      "body": "That's the best thing you can do! Doesn't matter if it's $10 or $500. The fact you are even doing it is the best thing. \n\nMy nephew just got his first job and I told him to put $10 into a high yield savings account, and $10 into VOO every paycheck. That's only $40 a month, but as long as he can start now and stick with it, he'll be well off in his future.",
                      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkyzg14/",
                      "created": 1725188760,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lkyyamn",
              "score": 4,
              "body": "I see this warning on Schwab every time I am looking at a leveraged ETF and I read up on it that they do not perform the stated 2x, 3x etc. long term bc a 'daily reset' is required.. but I still don't get it from the perspective if you believe QQQ will keep going up consistently long term, why would it be a bad idea to leave it parked in TQQQ vs QQQ?  Okay sure you may not make the advertised 3x because of the resets but you'll still make more than you would if it was parked in QQQ, right?  Obviously you lose more if you're wrong and it goes down.. I understand that I just don't get why the adjustments they make to reset make it 'higher risk' or 'unsuitable for overnight holdings', etc.. can you elaborate?",
              "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkyyamn/",
              "created": 1725188065,
              "depth": 2,
              "replies": [
                {
                  "id": "lkzkoh2",
                  "score": 5,
                  "body": "Think about it like this. Everyday the fund needs to be leveraged 2x or 3x whatever they have chosen. During an uptrend, everyday they will have to leverage even more to keep their leverage ratio true, and as long as the market keeps climbing they’ll keep profiting even more for their investors. Now imagine the opposite during a sustained downtrend, they’ll have to do the same. Say the market falls 30% they’ll be down 60% (if it was a 2x levered fund) but in reality it will be much more since everyday they’ll have to keep their leverage ratio true to the fund, and the market keeps falling. As the losses pile up, what usually happens is these funds realize they cannot cover and disband the fund. Whatever the current value of the fund is they’ll pay their investors and that’s the end of it. You’ll be stuck holding your loss even if the market recovers because the fund did not have enough cash to meet their margin requirements. But that’s just one scenario.\n\nAnother is just decay due to market volatility. Say the market goes up 1% and down 1% everyday, the fund will not stay flat like a regular fund would. To demonstrate this [check this out.](https://intrinio.com/blog/breaking-down-the-danger-of-leveraged-etfs)\n\nIt’s why it’s best to use these instruments in the short term if you are betting on a constant uptrend or downtrend, anything else and there are too many risks that outweigh the returns.\n\nSo to answer your question, yes, if you believe it will be a sustained uptrend, go for it. But understand that if you get the timing wrong, you’ll incur some major losses that could have been avoided.",
                  "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkzkoh2/",
                  "created": 1725198500,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkyyk3s",
                  "score": 3,
                  "body": "my understanding is they are unsuitable for long term holding because the losses are much more difficult to recover from - ie a 50% drop requires 100% increase. and the leveraged losses compound. we have been in a bull market since 2009 so it may be hard to believe but in a bear market you would see a tremendous drawdown",
                  "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkyyk3s/",
                  "created": 1725188227,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lkyfak7",
              "score": 2,
              "body": ">Daily leveraged gains, not leveraged long term gains, people always misunderstand this crucial distinction.\n\nThat's correct, I just didn't think I'd need to go into the details.",
              "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkyfak7/",
              "created": 1725175431,
              "depth": 2,
              "replies": [
                {
                  "id": "lkyfmdt",
                  "score": 2,
                  "body": "Just adding to what you said, because I know there are people in this sub who look at them and say “I’ll just buy this rather than SPY” without fully understanding how they work.",
                  "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkyfmdt/",
                  "created": 1725175646,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lky8fqg",
          "score": 14,
          "body": "i appreciate the legitimate answer. all the look it ups are right but also fairly difficult when not knowing what the fuck im looking at, which i can also find out eventually but the only way to get digested info is seeking wisdom",
          "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky8fqg/",
          "created": 1725171085,
          "depth": 1,
          "replies": [
            {
              "id": "ll07qfr",
              "score": 1,
              "body": "Etfdb.com + Investopedia + Etfrc.com + Testfol.io\n\nFind ETFs that interest you and read about them on ETFdb. Search any terms you don't understand on Investopedia. Compare ETFs you think you like to each other on ETFrc. Finally test ETFs against each other and make mock portfolios with them on Testfolio.\n\nTreat these 4 sites like sandboxes. Search in and play with their tools. Don't be in any hurry to generate a huge return. Ignore reddit's picks and do your own research fully once you understand why VT exists at the conceptual level. Your knowledge is further than the average reddit comment right then and there.\n\nThat's my fast track through Investing 101. If playing with those 4 sites is too complex for you without more hand holding, you're a person who should just buy VT and not try anything complicated.",
              "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/ll07qfr/",
              "created": 1725206273,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll0gpr5",
              "score": 1,
              "body": "For youtube help.  Search people like: Plainbagel, Ben Felix, LearntoInvest, and Morningstar.",
              "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/ll0gpr5/",
              "created": 1725209222,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lky787g",
          "score": 3,
          "body": "Which fee are you talking about? When I search on CS, I don’t see any fee to buy the ETF stock. Where should I be looking. \n?",
          "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky787g/",
          "created": 1725170338,
          "depth": 1,
          "replies": [
            {
              "id": "lky854z",
              "score": 7,
              "body": "Expense ratios, not transaction fees.",
              "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky854z/",
              "created": 1725170901,
              "depth": 2,
              "replies": [
                {
                  "id": "lky8qd6",
                  "score": 1,
                  "body": "Ok. In CS, for SPXL it says net expense ratio is 0.91% and gross expense ratio is 0.95%. Is that typical, good, bad?",
                  "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky8qd6/",
                  "created": 1725171268,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lky9fxt",
                      "score": 4,
                      "body": "That's high. VOO and VTI are .04%. Just do what we all do and go get those. They're the gold standards for total market and SP500, respectively.\n\nNext step, pick up and read \"The Simple Path to Wealth.\" It'll take you 2 hours, max, and explain everything you need to get started.",
                      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky9fxt/",
                      "created": 1725171716,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkya831",
                          "score": 2,
                          "body": "Thank you. I’ll do that. 👍🏼",
                          "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkya831/",
                          "created": 1725172204,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lkyahg9",
                          "score": 1,
                          "body": "You do mean this one right ?\n\nhttps://www.amazon.com/Simple-Path-Wealth-financial-independence/dp/1533667926?dplnkId=f7c0e927-3940-43fa-9683-cbc8ba5c113a&nodl=1",
                          "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkyahg9/",
                          "created": 1725172369,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lkyby2y",
                              "score": 2,
                              "body": "That's the one. It presumes your goal is to grow wealth slowly but safely over time. It'll also talk you out of the very stupid things you might try to do instead, showing you *why* they're stupid.",
                              "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkyby2y/",
                              "created": 1725173296,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lkznlkx",
                      "score": 2,
                      "body": "Be careful thinking that certain ERs are high or low.  It needs to be looked at as comparing apples to apples.  Comparing the ER of an index fund to an actively managed growth fund is not generally wise without considering return.  If a fund consistently generates a higher return then a higher ER can be warranted.  But also consider that they generally don't consistently generate a higher return than say an S&P500 index fund.  The point is that a higher ER is not necessarily bad, you need to look at the whole picture. ",
                      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkznlkx/",
                      "created": 1725199550,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lkz28e0",
          "score": 2,
          "body": "I like SPLG as well.",
          "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkz28e0/",
          "created": 1725190363,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkzj9ud",
          "score": 0,
          "body": "Buy some of each to hedge against holding company failures.",
          "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkzj9ud/",
          "created": 1725197969,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkycpu8",
      "score": 27,
      "body": "Expense ratios\n\nSPLG 0.02%, \nVOO 0.03%, \nIVV 0.03%, \n\nSo that's $2/$3 per $10,000 invested per year to manage the ETF. They're all a bargain.",
      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkycpu8/",
      "created": 1725173783,
      "depth": 0,
      "replies": [
        {
          "id": "lkyx8l5",
          "score": 5,
          "body": "also, the banks/asset managers who control them may vote differently using the shares held in the fund. assuming all the fees and expenses were the same, you would choose the fund backed by the most \"stable\" bank who u trust to vote \"properly\" with your shares. the largest funds own 6-9% of the entire us market; ie 6% of apple, 6% of microsoft, 6% of pfizer... 6% of everything",
          "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkyx8l5/",
          "created": 1725187398,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lky6ibz",
      "score": 9,
      "body": "Try searching for those listings on justetf.com 😉",
      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky6ibz/",
      "created": 1725169906,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkzooia",
      "score": 3,
      "body": "None of those are stocks, nor is S&P 500.\n\nS&P 500 is an index. A simple mathematical formula. Based on the market prices of 500 select companies and weighted by capitalization.\n\nThe rest are ETFs - exchange-traded funds. \n\n Now you have some stuff to look up.",
      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkzooia/",
      "created": 1725199932,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lky8lhp",
      "score": 7,
      "body": "You should start with the basics and read into this stuff. First of all that’s not a stock, S&P 500 is a virtual basket of stocks (=indice) and not an existing stock, it’s a tool to measure market movements. \n\nMultiple companies such as banks, fund providers, asset managers set up different products such as funds, ETFs or derivatives linked in some way to the performance of the S&P 500, these are the different products you find there and this can be completely different things performing adversely to each other.\n\nUsually you can also have different types of stocks, either when they are listed at different stock exchange or having different legal details as a holder (common shares, preferred share etc.)\n\nSumming up: it’s hard to explain this stuff short, you just have to spend a few hours reading into the basics before just buying something you don’t understand.",
      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky8lhp/",
      "created": 1725171184,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkz7pul",
      "score": 2,
      "body": "The variations of SPY like you listed are tracking different types of companies.  Small cap vs large cap stocks for example.  Or growth, or international stocks.  They all are tracking the SP 500 but different parts of it cause there’s a lot of companies in the SP500.",
      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkz7pul/",
      "created": 1725193178,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkznmwj",
      "score": 2,
      "body": "Personally I like SPY\n\nSlightly higher expense ratio but a solid dividend, and high liquidity \n\nVOO is a good second place",
      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkznmwj/",
      "created": 1725199563,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll02n17",
      "score": 2,
      "body": "S&P isn't a stock. It's an index.\n\nThe different tickers you mention are ETFs that give you exposure to the group of companies that make up the s&p.\n\nThey are with different companies and have different fees and some offer leveraged exposure, etc. Some are even weight, some allocate unevenly to different companies. \n\nIf you just want a simple, no-brainer one, then go with VOO.",
      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/ll02n17/",
      "created": 1725204650,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkzhtrw",
      "score": 1,
      "body": "You need to read.. from the source. \n\nVaries by issuer.  Nobody here has applicable general rules",
      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkzhtrw/",
      "created": 1725197408,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lky67ny",
      "score": 0,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky67ny/",
      "created": 1725169729,
      "depth": 0,
      "replies": [
        {
          "id": "lky87pg",
          "score": 11,
          "body": "Dude, shut up. We all started somewhere.",
          "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky87pg/",
          "created": 1725170945,
          "depth": 1,
          "replies": [
            {
              "id": "lky8tt9",
              "score": -1,
              "body": "Besides the lmao he is right tho. You have to start somewhere and that’s reading about investing, different asset types, market mechanics \n\nYou can read about it, hear a podcast or YouTube channel or whatever - but you have to spend a few hours of research on this stuff to at least understand differences between pure indices, stocks, funds, derivatives…",
              "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky8tt9/",
              "created": 1725171329,
              "depth": 2,
              "replies": [
                {
                  "id": "lkya0wn",
                  "score": 7,
                  "body": "And why is asking on reddit not part of 'read about it'? Nobody has to answer if nobody wants. What's the deal with 'dont ask'?\n\nThis is a legitimate way to learn things. \n\nWhats your inconvenience? Reading the title of a post you didnt want to be a part of?",
                  "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkya0wn/",
                  "created": 1725172081,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lky9t6u",
                  "score": 2,
                  "body": "Your comment was constructive. His wasn't (and clearly wasn't intended to be). That shit belongs over with the trash in WSB or Stonks.",
                  "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky9t6u/",
                  "created": 1725171947,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lky9bvh",
          "score": 2,
          "body": "read up where",
          "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky9bvh/",
          "created": 1725171648,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lky7a3s",
      "score": -11,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky7a3s/",
      "created": 1725170370,
      "depth": 0,
      "replies": [
        {
          "id": "lky8l9j",
          "score": 3,
          "body": "what am i doing here that isn't seeking out info? i alr looked it up and didnt see any mention to simplified answers that don't require prior knowledge and happen to not know what \"This ETF *offers 3x daily long leverage to the broad-based S&P 500 Index*\" means",
          "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky8l9j/",
          "created": 1725171180,
          "depth": 1,
          "replies": [
            {
              "id": "lkyybxx",
              "score": 1,
              "body": "if you arent sure, stay away from anything that says leverage. \n\nheres the breakdown since u asked:\n\nbroad based s&p index: this is the asset that most people have most of their wealth tied to. it represents ownership in a slice of corporate america: the top 500 large US companies weighted by their size. so 6% in microsoft and apple, 3% in nvda tsla google meta and berkshire, whatever share each company represents\n\nleverage: leverage involves some kind of borrowing. when you borrow money to invest, your gains are amplified. suppose you bought a house for 100K with a loan of 80K and down payment of 20K. Now the house is worth 200K. You sell it and pay off the banks 80K loan, leaving you with 120K.  The house only went up 2x but your investment went from 20 to 120, which is 6x. That's 5x leverage. Leverage is the secret to american business and the success formula for many investments. but it also works in reverse: when the investment LOSES rather than GAINS, you will be devastated. you have to be prepared to suffer an irrecoverable loss\n\n3x: gains are tripled, and so are losses. the issue is that losses are much harder to recover from-- recall that a 50% drop requires a 100% increase to get back to square one. \n\nlong: long exposure means you expect the asset to go up (long S&P means you are betting on the long term increase in the S&P). short exposure mean you expect the asset to go down (short term decrease). long involves buying assets and selling at a profit while short involves borrowing them and paying off a smaller liability later",
              "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lkyybxx/",
              "created": 1725188088,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll0qjqc",
              "score": 1,
              "body": "...etfs are just a collection of different stocks in 1 package. When you buy an etf, you are buying a portion of all stocks in that etf. the difference between all those are simply the stocks that the etf follows... this is the most basic information that you can find without even having prior knowledge",
              "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/ll0qjqc/",
              "created": 1725212436,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lky5po9",
      "score": -10,
      "body": "Who cares, just close your eyes and pick one at random for the lulz.",
      "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky5po9/",
      "created": 1725169433,
      "depth": 0,
      "replies": [
        {
          "id": "lky68m5",
          "score": 3,
          "body": "Err, no, the ones OP listed are not all S&P 500.",
          "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky68m5/",
          "created": 1725169745,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lky8t8u",
          "score": 0,
          "body": "no i think this is the right answer actually",
          "permalink": "/r/stocks/comments/1f672in/what_is_the_difference_between_versions_of_the/lky8t8u/",
          "created": 1725171319,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}