{
  "title": "Does quantitative research matter anymore for the average person?",
  "score": 46,
  "selftext": "I don't believe the market is 100 percent efficient, but it could be 99 percent. Yes, I  am making up a percent. There are so many people looking at stocks, and with the internet and computers, that I think any quantitative factor would be seen almost instantly. For your average person, I'm wondering if there is any advantage to looking at the numbers anymore. You might look at the basics in order to get a general idea of what you are buying into, but if you think you have a competitive edge, you are most likely wrong.\n\nSo if the numbers in the balance sheet and income statement are priced in, what is worth looking at? Qualitative reasons may be harder to price in. Even then, with A.I., millions or more of intelligent people looking at the market, it's still tough to have an advantage.\n\nThe more I study the market, the more I think stock picking is almost never worth  it. I still pick individual stocks for the fun of it, but I realize how tough it is to beat ETFs.\n\nEdit: To clarify, I'm not saying that market inefficiency can't be found in numbers. I'm saying that your average guy will have a tough time using numbers on reports to find those discrepancy. Yes, I'm sure the top 1 percent of the 1 percent can find price mismatches and use to their advantage. I think the market is only becoming more efficient over time due to the internet and computer technology, so it doesn't do much good for the Average person.",
  "link_flair_text": null,
  "id": "1f6auzm",
  "num_comments": 88,
  "created_utc": 1725184640,
  "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/",
  "comments": [
    {
      "id": "lkyxqec",
      "score": 43,
      "body": "Prof Dhamodaran said something about this and why he still stock picks that essentially boils down to - you have to enjoy the process. Only stock pick if, by the end of your life on your deathbed, you realise you’ve underperformed the market and you still don’t care. \n\nOtherwise yes I agree with you - if it’s *only* about the money it’s not worth it. Just go into the index.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyxqec/",
      "created": 1725187708,
      "depth": 0,
      "replies": [
        {
          "id": "lkyyhu4",
          "score": 9,
          "body": "I still do individual picks for the enjoyment of it. Although, I’ve made more returns off dumb ideas than ideas I spent  a lot of research on. ",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyyhu4/",
          "created": 1725188188,
          "depth": 1,
          "replies": [
            {
              "id": "lkz1rl8",
              "score": 17,
              "body": "My best stock pick was Nubank bought, by complete fluke and minimal DD, at $3.50 two years ago. My only real thought process was ‘Buffet bought at IPO so I’m getting a steal’. For reference I’ve never been to Brazil and have minimal knowledge about the area or even continent. \n\nMy worst stock pick was Atos which was a French company I researched for *months*, got really excited about and built a position in again 2 years ago. They’re now looking at bankruptcy and government bailout. \n\nI’ve had big wins and big losses but honestly I still don’t really know how to replicate the former and avoid the latter.",
              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz1rl8/",
              "created": 1725190106,
              "depth": 2,
              "replies": [
                {
                  "id": "lkz3jd5",
                  "score": 8,
                  "body": "Haha yep. My best return was a video game retail company that I’m not sure can be named.",
                  "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz3jd5/",
                  "created": 1725191071,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ll0anu2",
                  "score": 2,
                  "body": "I bought tsla in 2017 and 2019 simply because I believed in the idea of automation and electric.\n\nI didn’t even realize at first that like $2500 had turned into $60k.\n\nBy far the best I’ve done on a stock but I never would have put more than that into such a gamble.  Doubt something like it will happen again.",
                  "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll0anu2/",
                  "created": 1725207234,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lkz9eiu",
                  "score": -3,
                  "body": "Nubank was an easy win from the beginning for anyone know knew how things work in Latam, online banks weren't really a thing there so taking an already proven to work idea and introducing it in a new market with similar cultural values to the West was a no brainer.\n\n\nI would suggest you to be watchful for any local platforms looking for IPOs in the region, they'll all be gains IMHO, the same applies to anything related to IT, all in all it's an underdeveloped industry here. ",
                  "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz9eiu/",
                  "created": 1725193960,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkzc2zd",
                      "score": 7,
                      "body": "Everything looks easy in hindsight my friend. Your second paragraph is not good advice for very obvious reasons - just look at something like StoneCo or PagSeguro to see how Brazilian IPOs can go tits up very quickly. Even Nubank itself didn’t reach its IPO price until a few months ago - three years after its NYSE debut. \n\nAfter being in this game for almost twenty years IPOs are not the way forward and least of all emerging market ones. Stick to the index.",
                      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkzc2zd/",
                      "created": 1725195115,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ll0l7wy",
              "score": 2,
              "body": ">more returns off dumb ideas\n\nLiterally what got me into crypto. I realized that you can't pick based on quantitative reasoning long ago. That went out the window with the normalization of the internet, for better or worse. Now that everyone has all the information, what is left that makes us human? Intuition. You look at something and it makes you laugh, or smile, or otherwise associate positively to it. It doesn't have to be real. It just has to be trending. Look not into the information, but into the heart of the individual receiving that information. Right now, some AI somewhere already beat you to pricing in real market data. What that AI can't do, is factor in human emotion. The edge has shifted from quantitative to psychological.\n\nGranted, this is a short term strategy and I park long term savings mostly in ETFs. Any individual picks I do long term hold I still use \"stickiness,\" a term I use to encompass how strongly and how positively a quick psychological association would be formed by the average individual, as a metric to derive true value.",
              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll0l7wy/",
              "created": 1725210684,
              "depth": 2,
              "replies": [
                {
                  "id": "ll0ud39",
                  "score": 0,
                  "body": "I have had the same thoughts also ",
                  "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll0ud39/",
                  "created": 1725213706,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lkzyee9",
          "score": 0,
          "body": "Dont stocks like NVIDIA or the like outperform indexes? maybe not over 10 years but you can get a solid 4-5 years of better growth?",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkzyee9/",
          "created": 1725203227,
          "depth": 1,
          "replies": [
            {
              "id": "ll025o9",
              "score": 5,
              "body": "It’s easy to look back in hindsight and pick out the winners. Nvidia has easily outperformed the index over any meaningful past time period, but will it continue to do so? Over the next 4-5 years? No idea. And anyone who is telling you otherwise with any kind of certainty is either lying to you or to themselves.",
              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll025o9/",
              "created": 1725204489,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkyup66",
      "score": 29,
      "body": "Some managers have positive risk-adjusted alpha over the years and arbitrage is real. Also, leverage seems to work historically, just as being tech-heavy.\n\n\nBut Cathie Woods is a great example why inference on the individual level isn't supported by the statistics presented above.\n\n\nOn the other hand, just as sending dick picks, the low probability of success will not stop the masses from trying and for the selected few to succeed.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyup66/",
      "created": 1725185732,
      "depth": 0,
      "replies": [
        {
          "id": "lkz4z0a",
          "score": 10,
          "body": "One of the most interesting documentaries I've ever seen  was about wall street and whether all the successful people within it are actually just the probable outcome of the masses who didn't. (think the doc was 2000s sometime but from the 90s) It touched on the introduction of all those trading pads they then started to integrate, and all the older traders basically put it down to guts and an almost knowing. Which I found super interesting, as in reality even if you just had a competition of tossing a coin forever, eventually you will always thin the crowd; and more importantly there will always be that outlier. Did they have an impact? Did they really have an edge? Or were they just there by chance?\n\nI had great fun picking stocks, but if someone doing it 9/5 can't do better, why would I somehow magically be better? RNG. And I have never liked relying on that. \n\nCathie Woods was a great example, her whole thing has been fascinating to watch.",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz4z0a/",
          "created": 1725191817,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkzp55b",
          "score": 5,
          "body": "*But Cathie Woods is a great example why inference on the individual level isn't supported by the statistics presented above.*\n\nCathie Wood is a walking proof that the God himself under performs.",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkzp55b/",
          "created": 1725200094,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkzp5ud",
          "score": 5,
          "body": "After reading your comment I gained the impression that your ulterior motive behind writing your comment was to include 'sending dick picks' as elegantly as possible.",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkzp5ud/",
          "created": 1725200100,
          "depth": 1,
          "replies": [
            {
              "id": "ll1uq82",
              "score": 1,
              "body": "after reading what that guy wrote, it's inspiring me to send more dick picks and forget about trying to pick stocks. It's making me realize that sending dick picks cost me nothing with a small chance of some sort of success, but picking stocks has a fairly good chance to lose money",
              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll1uq82/",
              "created": 1725226015,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkyvfd8",
      "score": 22,
      "body": "Yes over the long run it's hard to beat ETFs with very few professional money managers doing it longer than a decade.\n\nBut for me personally there is such a thrill in researching into a company, understanding the industry and then pushing the button and seeing your thesis being validated. Hard to get that with ETFs and generally speaking the best returns are built by researching having conviction and having a decent sized concentrated position in an individual stock. \n\nFor example my 10k in Apple in 2010 has still provided me the best out sized returns and outperformed the indexes by some margin. Just gonna ignore some of my other bets such as Peloton though.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyvfd8/",
      "created": 1725186215,
      "depth": 0,
      "replies": [
        {
          "id": "lkyvuym",
          "score": 3,
          "body": "Yeah, I still have individual picks and have fun with it, but it’s tough",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyvuym/",
          "created": 1725186500,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkzoo0z",
          "score": -1,
          "body": " I agree with you. That’s why I have a mix of ETFs, individual stocks (both blue chips and growth stocks), REITs, and monthly dividend payers. I enjoy reviewing quarterly statements from the past two years, analyzing moving averages, and making informed decisions based on them. However, there have been times when we’ve wondered why a company’s stock performed poorly despite steadily increasing revenues. Sometimes, stocks don’t trade well for no apparent reason, and when they’re undervalued, I tend to scoop them up and make decent profits in the long run. Sometimes it’s worth the long wait, or I just sell it and buy another stock while keeping an eye on sideways stocks until they start to breathe nicely.",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkzoo0z/",
          "created": 1725199927,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkzq1u2",
      "score": 9,
      "body": "I agree that it’s very difficult to beat the market. But I do not agree at all that the market is that efficient. Look at Facebook and Netflix recently crash down>50% and then back x4-x5 a year later. Some of the biggest most followed companies in the market it’s absolutely ridiculous. Zero efficiency and no one has an fing clue.  AI is a backwards machine that extrapolates from past data nothing more it is very poor or non existent at determining future events. It didn’t know if Zuckerberg would pivot from metaverse and cut costs or not. It has no predictive ability on big stuff like that just looks at past trends.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkzq1u2/",
      "created": 1725200407,
      "depth": 0,
      "replies": [
        {
          "id": "ll0ay2v",
          "score": 0,
          "body": "Efficient doesn't mean an accurate predicter of the future. It just means the price represents the collective knowledge of everyone in the market. The examples you give are of the market pricing stocks based on all available data at the time. This is why beating the market means predicting the future, which is why everyone fails at it.",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll0ay2v/",
          "created": 1725207331,
          "depth": 1,
          "replies": [
            {
              "id": "ll0ist0",
              "score": 1,
              "body": "I think it’s a pretty grey area when something is “known” or possible to be known to someone looking correctly but yeah",
              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll0ist0/",
              "created": 1725209903,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll0b2zc",
      "score": 7,
      "body": "I disagree, but you are in a stock picking sub. There are many stocks that are sold at a discount for long periods of time. Plus I work somewhere with absolute idiots it's opened my eyes to how dumb a decent portion of the population is. if they are also investing the market will never be efficient. Ms. Market is known to have mood swings",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll0b2zc/",
      "created": 1725207376,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll10ypw",
      "score": 7,
      "body": "Absolutely. I would argue we have an edge over the professionals. Truth is that retail investors have always bought and sold funds based on recent performance. Legend has it that when Fidelity wanted to calculate how much the average investor in Peter Lynch's wildly successful medallion fund made they were horrified to find they had lost money. Because they sold in down years and bought back in after recovery, missing most of the gains.\n\nThis phenomenon is why Buffett stopped managing a fund and why most fund managers felt pressure to fail conventionally rather than succeed unconventionally.\n\nValue investing almost always involves buying something unfashionable that has recently fallen in price and is likely going to fall more (since we don't even try to \"time bottom\"). It is the proposition to perform poorly in the short term only to succeed in outperforming in the long term.\n\nThis has always ruined careers for fund managers.\n\nMost active managers value invested only tepidly and have largely been replaced by index funds. These effectively invest on the basis of momentum, buying what has gone up and selling what has gone down. They capture most of the long term growth of their chosen index but sacrifice a great deal of potential growth by not trying to discriminate good investments from bad ones.\n\nIf the market was 99% efficient GOOG wouldn't have been below $100 dollars a couple of years ago. BAC wouldn't have been below $30.\n\nTremendous opportunities exist in the most scrutinised stocks on Earth, precisely because they are attended to and most investors are delulu when it comes to analysis.\n\nThe market is efficient in the long term and wildly absurd in the short term. And that allows us to time arbitrage today's madness against next decade's financial probabilities.\n\nHowever if your investment analysis depends on a footnote in a filing it is too sensitive to uncertainty. We should be looking for obvious market mispricing. Where the future could be really quite poor to mediocre and still at this price investing will come out ahead of the alternatives.\n\nSo a really quite basic assessment of Owner's Earnings is all we need to decide that even if recent trends dull substantially the price is simply foolishly low and so we should buy.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll10ypw/",
      "created": 1725215938,
      "depth": 0,
      "replies": [
        {
          "id": "ll165s8",
          "score": 1,
          "body": "It’s hard to know how efficient the market is. You could be right.",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll165s8/",
          "created": 1725217695,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll1uxsj",
      "score": 5,
      "body": "The smaller the market cap, the more likely you are to find an edge. Buffet himself says this. Additionally, institutions and large organizations of people have a harder time adapting to new strategy or information than an individual; my point being that if for example you had a chemical process that has been proven to succeed patented by a pre-profit company, traditional financial institutions may still be constrained by lack of financial data to justify a large position size based on their expertise.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll1uxsj/",
      "created": 1725226089,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkyz1mp",
      "score": 10,
      "body": "Several things to consider. Yes, quantitative analysis still matters. Otherwise, what's the difference between MSFT being $3T now or if it were $300T – quantitative analysis will allow you to avoid obviously bad investments. Would you still buy MSFT if it's market cap were 100x higher (no change to earnings)? The answer should be no.\n\nThe reason why you can still pick stocks is because even though the market prices in future earnings *expectations*, it is *always* wrong and it's your job to find out where it's wrong.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyz1mp/",
      "created": 1725188521,
      "depth": 0,
      "replies": [
        {
          "id": "lkz0ona",
          "score": -3,
          "body": "But assuming the market is (close to) efficient and millions of others looking at the fundamentals of MSFT, what you are suggesting about market cap x100 without reason will simply never happen. \n\nI think for truly small cap stocks there may still be some value in analysis, although it's still doubtful. For megacaps, I'd say no.",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz0ona/",
          "created": 1725189491,
          "depth": 1,
          "replies": [
            {
              "id": "lkz1g9g",
              "score": 4,
              "body": ">what you are suggesting about market cap x100 without reason will simply never happen. \n\nWe know it does happen (usually not to that extent, but 2000 is the best example of that), which is how bubbles form. The opposite is also true such as when META went down to a PE of 8 in 2022. It's definitively known that markets are not mathematically efficient. Bubbles can and do form.",
              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz1g9g/",
              "created": 1725189927,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lkyzdm1",
          "score": -4,
          "body": "i would buy microsoft at any price. like gold or oil, shares in microsoft are worth more than the dollars used to value them. the question is, what is the price of apple?",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyzdm1/",
          "created": 1725188721,
          "depth": 1,
          "replies": [
            {
              "id": "lkyzqrx",
              "score": 7,
              "body": ">i would buy microsoft at any price.\n\nAnd that's exactly why quantitative analysis is necessary. Would you spend all your life savings on one MSFT share that will return maybe a few hundred dollars in your lifetime?",
              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyzqrx/",
              "created": 1725188939,
              "depth": 2,
              "replies": [
                {
                  "id": "lkz08ct",
                  "score": -2,
                  "body": "yes. if that situation were real, microsoft would be the leader of the S&P, and everyone would still be dumping their money in broad market index funds. \n\nin fact, the situation you describe is happening today, has been happening since 2023. the market does not care, it doesnt know any better. but i havent seen many value investors able to take advantage of that... certainly not the casual/amateur ones. even the best value investors like buffet etc owe most of their success to the megacaps and many of those werent purchased \"at the right price\" either. most just paid the premium and enjoyed the ride like the rest of us",
                  "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz08ct/",
                  "created": 1725189227,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkz19nc",
                      "score": 5,
                      "body": "If your logic applied, bubbles would never occur. The dotcom bubble demonstrates that valuations matter. It's as simple as that.\n\nAlso, the majority of Buffett's gains were not from megacaps. His outsized growth over time is mostly from the cigarette butt approach. The megacaps investing approach only happened when Berkshire was so large that you can't find enough extremely undervalued businesses to \"move the needle\".",
                      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz19nc/",
                      "created": 1725189823,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkz26pi",
                          "score": 0,
                          "body": "i know you are not wrong, but for a long term investor it should not matter. even the biggest bubbles are blip in the chart compared to the overall trend. value investing is, at its core, a short and intermediate term strategy (i know most people will disagree with that claim). \n\nif i had more conviction about valuation than passiveness, i would have sold everything in august 2023. instead, i made a major purchase in that month. i would be curious to know if anyone was making a real valuation argument for why we should keep buying at that point, yet if they took profit at that point they wouldve missed the biggest bull run in recent memory. sure it is probably a bubble but who cares? timing the entry and exit is harder than it sounds. in the end the rules of value dont apply to the biggest companies today and value investors will have to come to terms with the fact that apple and microsoft ARE the value stocks now. they have the best balance sheets, the best cash flows, the strongest business models, the best leadership, etc etc. the rest of the market has been dwarfed because of the hype sure but also because those companies arent nearly as robust. Microsoft has survived many bubbles and will continue to do so for the foreseeable future",
                          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz26pi/",
                          "created": 1725190338,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lkz2673",
                          "score": -1,
                          "body": "i know you are not wrong, but for a long term investor it should not matter. even the biggest bubbles are blip in the chart compared to the overall trend. value investing is, at its core, a short and intermediate term strategy (i know most people will disagree with that claim). \n\nif i had more conviction about valuation than passiveness, i would have sold everything in august 2023. instead, i made a major purchase in that month. i would be curious to know if anyone was making a real valuation argument for why we should keep buying at that point, yet if they took profit at that point they wouldve missed the biggest bull run in recent memory. sure it is probably a bubble but who cares? timing the entry and exit is harder than it sounds. in the end the rules of value dont apply to the biggest companies today and value investors will have to come to terms with the fact that apple and microsoft ARE the value stocks now. they have the best balance sheets, the best cash flows, the strongest business models, the best leadership, etc etc. the rest of the market has been dwarfed because of the hype sure but also because those companies arent nearly as robust. Microsoft has survived many bubbles and will continue to do so for the foreseeable future",
                          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz2673/",
                          "created": 1725190330,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lkz3rm1",
                              "score": 3,
                              "body": "Everything you mentioned applies to the market as a whole, but not to individual stocks. When you're purchasing individual stocks, you can't assume the stock will go up forever, but it's a reasonable assumption when buying the market.\n\nEven guys like Buffett's go on about buying a wonderful business at a fair price. They never say they buy a wonder business at any price.",
                              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz3rm1/",
                              "created": 1725191193,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ll1vfuz",
                  "score": 0,
                  "body": "no one expects to be rich by just buying-and-holding indefinitely. You'd need to buy-high-sell-low and turn it over and over to actually be rich.\nEven if MSFT returns a few hundred dollars in 20 years, you can't even use that few hundred dollars until you sell it, it's as if you didn't have any gains at all.  Frozen capital does no one any good.",
                  "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll1vfuz/",
                  "created": 1725226266,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkzvhky",
      "score": 4,
      "body": "this gen can only watch a 20 sec long reel so no",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkzvhky/",
      "created": 1725202235,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkyy13v",
      "score": 3,
      "body": "The average person? No, they can just buy broad index funds and chill research free",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyy13v/",
      "created": 1725187897,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkyz20m",
      "score": 6,
      "body": "Market efficiency is a lie to comfort the lazy and stupid",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyz20m/",
      "created": 1725188527,
      "depth": 0,
      "replies": [
        {
          "id": "lkyzdrm",
          "score": 2,
          "body": "We aren’t saying it’s 100 percent efficient,  but it’s tough to find price discrepancies for majority of people.",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyzdrm/",
          "created": 1725188723,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lkyzne2",
          "score": 0,
          "body": "not true, the market will always outperform if you wait long enough. perhaps not in your lifetime, but everything MUST and WILL revert to the mean. \n\nhave you seen futurama? let me ask you this-- if you were going to wake up tomorrow 2000 years in the future would you pick stocks today or buy the index? i will put the majority of my long-term wealth in the index whether i have a 30 year or 2000 year horizon.",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyzne2/",
          "created": 1725188881,
          "depth": 1,
          "replies": [
            {
              "id": "lkz3zjw",
              "score": 1,
              "body": "I retired at 40",
              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz3zjw/",
              "created": 1725191310,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkzaopf",
      "score": 4,
      "body": "Quantitative research still matters, I spotted good chances with TSLA ($200 presplit), MRNA($75), GLD (even though etf $152), PFE at $25 ahead of it. In addition, I also use technicals to spot low price (naturally lot of technical haters) for better appreciation. Recent buy is BRK-B (DCA) at $399, GLD (DCA) at $215 and AMLP (again ETF) At $44.65\n\nWithout quantitative and technical research, I do not buy any stocks.\n\nThere may be many winners that I do not spot, but whatever I pick that I wanted to ensure it is good. \n\nI can not think of buying any stock without quatitative and technical research.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkzaopf/",
      "created": 1725194523,
      "depth": 0,
      "replies": [
        {
          "id": "lkzsmk9",
          "score": 2,
          "body": "What would you say about MRNA at its current valuation?",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkzsmk9/",
          "created": 1725201276,
          "depth": 1,
          "replies": [
            {
              "id": "ll0ts6x",
              "score": 3,
              "body": "I am long on MRNA as this company has almost 30 different products under various testing. Like any pharma, it takes 5 to 7 years to make a single breakthrough. I did not DCA as I already own it at $75 range.  If MRNA touches $65 or $50, I have plans to add more.\n\nThis is my personal take, I may be right or wrong, use it with grain of salt.",
              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll0ts6x/",
              "created": 1725213513,
              "depth": 2,
              "replies": [
                {
                  "id": "ll1cvyo",
                  "score": 1,
                  "body": "Appreciate it, thanks!",
                  "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll1cvyo/",
                  "created": 1725219992,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkzotnk",
      "score": 4,
      "body": "It's funny because if efficient market hypothesis was remotely true then average person or even a chimpanzee wouldn't make any bad decisions when stock picking unless they trade very often and lose a fortune to commissions and spreads. S&P500 is a completely arbitrary benchmark, many other well known simple strategies has beaten it long term (for example NASDAQ-100 ETF).\n\nThat being said an average person is by definition average and has fewer resources, less time and less understanding so it's not reasonable to expect them to beat the market. They may have a unique insight sometimes in a given industry and there might be an edge there but those moments are going to be rare. I think most people here pick stocks because they enjoy it.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkzotnk/",
      "created": 1725199982,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll1mpg1",
      "score": 2,
      "body": "Ironically there's another recent thread on this forum regarding the possibility of the stock market being wildly overvalued yet lol. Which would seem to indicate that the \"efficient market\" hypothesis is not totally valid for current valuations at least.\n\nNot to mention some prominent people (Burry, even Musk) indicating that passive investing is distorting market valuations. Essentially rendering the EMH thesis suspect.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll1mpg1/",
      "created": 1725223300,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll29656",
      "score": 2,
      "body": "Its not worth it, at all. \n\nI buy based on CEO vibe / vision / personality. Its worked out well for me since far.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll29656/",
      "created": 1725231315,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll9orhk",
      "score": 2,
      "body": "No. There are all kinds of inefficiencies in the markets because people buy stocks based on opinions they have. if lots of people have the opinion that a stock is worth a lot and pile in, the stock price goes up. \n\nStock picking is figuring out where people are wrong, and sometimes staying out of things where people are exuberant. Buying small cap growth stocks that have been beaten down for three years when everyone is piling into the Mag 7, for example. You can get some great growth, even now that those indexes are starting to catch up, if you are willing to look at some smaller companies. But you will buy VOO because that is what the smart money is doing. \n\nThe rise in price of AMC was not due to an efficient market. The rise in price of DJT to almost $10B market cap despite still not having the yearly revenue of a burger joint and some massive draw downs on the balance sheet. \n\nThe market is not efficient in the short term. \n\nThe average guy can look at valuation of an AMC or a DJT and see that it is a bad value. At the same time, the average guy can look at the multiples on small caps and realize they are more attractive than they were several years ago, and even pick some more obvious stocks like NuBank. But just buying some of the small cap index is a good bet. There are some good value stocks our there too, priced very low, and not a bad place to invest if you think the Mag 7 is getting frothy.\n\nDoes this mean everyone should trade stocks? No. You have to know a little bit about what you are doing and be willing to put in the time - but you can definitely do better by taking advantage of market conditions than just holding an index.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll9orhk/",
      "created": 1725345772,
      "depth": 0,
      "replies": [
        {
          "id": "lla8a68",
          "score": 1,
          "body": "I agree that there are clear examples where it is obvious that the company is over valued. Most people know the meme stocks are priced crazy, but you can still make money selling while attention is there. I don’t think anyone is buying those because of fundamentals though.",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lla8a68/",
          "created": 1725358877,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lkz6qhg",
      "score": 4,
      "body": "For swing trading, I find some level of research has actually been a massive benefit. On the long term, I called PLTR's current share price a few years ago, based on company research, and was able to buy a pile of shares back when it was way lower, which netted me a nice profit.\n\n\nShort-term, I look at technicals as a filter for swings, (short float over 30% and with SMAs close to swapping over and going positive) then dig into company news with an skim over financials (SMAs indicate that there is something going on with the company worth digging into, without necessarily triggering the shorts to close their positions) before committing. If I hadn't looked at the balance sheet and news, I wouldn't have caught GOVX, which also made a nice profit. What's worth noting here, though, is that you have to catch the news before the market opens. As you said, things are found almost instantly, but it takes a few minutes or hours for the share price to react, and that's your window for profit.\n\n\nEither way, the cost wasn't priced in, ans looking at financials has been the thing that has got me the biggest returns.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz6qhg/",
      "created": 1725192703,
      "depth": 0,
      "replies": [
        {
          "id": "lkz7af8",
          "score": 2,
          "body": "I agree, it is just so hard to find moments of what you describe. When roaring kitty posted a while back for the first time in a few years, the market didn’t react instantly. I threw money on the video game retailer knowing the herd of people would jump on because of his post. My judgement worked out, and yes I agree it’s dumb, but that quick decision got me a higher return in a couple days than well researched positions. ",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz7af8/",
          "created": 1725192972,
          "depth": 1,
          "replies": [
            {
              "id": "lkz9zjj",
              "score": 2,
              "body": "These moments happen on a daily basis, but no one strategy catches them all.\n\n\nI think the trick with stock markets is patience and knowing youll only catch a fraction of these, but also being willing to adapt your strategy to current conditions. A few months ago I was making nice returns just based on public sentiment. I briefly tried just riding the coat tails of big swings that were already in motion, which didnt work out. Then the doom and gloom around Nvidia hit, so I switched up to technical analysis. Since then, I've half gone back to long-term analysis thanks to the likes of ASTS and the current surge in space companies all hitting significant milestones in their respective niche.",
              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz9zjj/",
              "created": 1725194218,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkyz41t",
      "score": 2,
      "body": "There’s definitely a lot of material out there on the EMH. You clearly already believe in it and I’m not here to try and convince you otherwise. Some practitioners I respect very much believe in the EMH.\n\nIf you truly believe in it which it sounds like you do, then why fight it and continue to trade? Clearly it’s going against your underlying beliefs and judgement.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyz41t/",
      "created": 1725188561,
      "depth": 0,
      "replies": [
        {
          "id": "lkyzlqw",
          "score": 2,
          "body": "I didn’t say it’s 100 percent efficient. Did you read the post?",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyzlqw/",
          "created": 1725188854,
          "depth": 1,
          "replies": [
            {
              "id": "lkyzq7n",
              "score": 2,
              "body": "Yes. But there’s also the “weak” and “strong” versions of the EMH. Not sure which you’re referring to, but they all still fall under the EMH. Sounds like you believe in a weak EMH, which is what I believe.",
              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyzq7n/",
              "created": 1725188930,
              "depth": 2,
              "replies": [
                {
                  "id": "lkz0e4c",
                  "score": 1,
                  "body": "I think the market will only become more efficient over time due to the internet, computer technology, and an increase in the amount of intelligent people watching the market. But, yes, war or disaster could change that this.",
                  "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz0e4c/",
                  "created": 1725189322,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkz1m3r",
                      "score": 2,
                      "body": "I think the markets are definitely more efficient now than they were previously, largely due to technology. However that does NOT mean all participants are more informed. There always has and always will be bad information and practices treated as fact. Technology magnifies that. I would say you have MORE uninformed participants now than years prior because the barrier to entry has been so low.\n\nThis creates more volatile markets which means more potential profit by the informed and confident.",
                      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz1m3r/",
                      "created": 1725190019,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lkz018c",
              "score": 1,
              "body": "In what way are you discussing “quantitative” finance though? Are you just discussing a well rounded combination of fundamental, technical and behavioral analysis, or are you talking strict quant stuff like mean reversion, curve fitting etc\n\nFact is there’s a booming arm of quant finance and they regularly beat the market. But these are phds with lots of information and fancy tools.\n\nAre you asking if you can compete with them? \n\nI think in the end you should do what makes the most sense to you. That’s the point I was making",
              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz018c/",
              "created": 1725189110,
              "depth": 2,
              "replies": [
                {
                  "id": "lkz0jyz",
                  "score": 1,
                  "body": "When I say quantitative, I’m talking only viewing the numbers on the reports. Nothing else. Everything else would be qualitative.",
                  "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz0jyz/",
                  "created": 1725189417,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkz1c0o",
                      "score": 3,
                      "body": "No offense but you’re using dated terms. Typically what you’re referring to in present day would be “Fundamental analysis”. That’s EPS, balance sheet statements, company financials, etc.\n\nOr there’s Technical Analysis which is charts and supply/demand, etc.\n\nTypically present day Quantitative data would be statistical work/analysis. Words you hear in quant analysis are standard deviations, mean reversion, models, fat tails. It’s very math heavy\n\nI would say there’s still a place for all three types. The reason we have markets is because we have a lot of people who all have differing opinions & goals. Fundamental analysis, just like other forms, is more about using past financial statements to forecast future statements. Depending how you go about forecasting and what your forecasts are create disagreements among participants which in turn leads to price discovery. \n\nOne can belief in the EMH and still use fundamental analysis. The most famous proponent of the WMH is Warren Buffet and we all know he participates in the markets as well as buys individual stocks and not just indexes",
                      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz1c0o/",
                      "created": 1725189860,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkz45or",
                          "score": 0,
                          "body": "Berkshire barely can beat the market and they have the smartest people. I think that is a sign that I am correct. Although the size of Berkshire slows the growth also.",
                          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz45or/",
                          "created": 1725191398,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lkz4dl4",
                              "score": 2,
                              "body": "Renaissance Technologies has beaten the market every year for the past few decades. They’re a quant shop. They would have a few things to say.",
                              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz4dl4/",
                              "created": 1725191510,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lkz4vnv",
                                  "score": 1,
                                  "body": "Yes, but for someone that is an average person they can’t do that. Only the very best will find price mismatches.",
                                  "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz4vnv/",
                                  "created": 1725191770,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lkz53ob",
                                      "score": 1,
                                      "body": "Ok. Like I said in the beginning, I’m not gonna try to convince you of anything. Are you looking to be convinced?\n\nDo whatever you want. Nobody’s forcing you to trade a certain way. Seems to make the most sense if you act in a way that feels natural to you.",
                                      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz53ob/",
                                      "created": 1725191883,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lkz7spa",
                                          "score": 1,
                                          "body": "My post is for the average investor, not for people with phd in math, physics, and computer science. The title of my post is do the numbers matter for the Average person not the tiny fraction of average stock market geniuses.",
                                          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz7spa/",
                                          "created": 1725193216,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkz5qsi",
      "score": 2,
      "body": "I use backtesting software that adjusts for “look ahead bias”. You can develop a strategy that outperforms in the theoretical world that continues into the real. I’d also say yes computers make processing financial data more efficient, but not everyone’s computers are looking at financial data . Between 401k purchases, indexes and non-financial data trades(technicals maybe, forced sales, withdrawals), there is plenty of volume to push the market from financial related trades causing a level of inefficiency\n\nhttps://www.reddit.com/r/quant/s/VA0nGFdPLM",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz5qsi/",
      "created": 1725192210,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkyuflj",
      "score": 1,
      "body": "In my opinion the part that is missing in your example is the gut feeling.\n\nAll the pointers and markers can be positive, but it still needs to feel right.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyuflj/",
      "created": 1725185556,
      "depth": 0,
      "replies": [
        {
          "id": "lkyxmtr",
          "score": 7,
          "body": "But that's often affected by emotion, and emotion is arguably your worst financial advisor right after influencers on social media and social media as a whole.",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyxmtr/",
          "created": 1725187646,
          "depth": 1,
          "replies": [
            {
              "id": "lkyz2c3",
              "score": 1,
              "body": "Gut feeling can definitely not stand on its own as a deciding factor and you are right that it can quickly change into emotion, which is terrible from an investing point of view.\n\nA better way for me to explain it might be that if your gut feeling disagrees with the objective stats. Then something is off. It doesn’t matter if it’s positive or negative, but stats and gut feeling need to be somewhat aligned.",
              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkyz2c3/",
              "created": 1725188533,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lkz0xin",
      "score": 1,
      "body": "Those ETFs still have stocks in them.  Being ignorant of their fundamentals and technicals can and will eventually hurt you when you don't have more money coming to keep on DCAing in.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkz0xin/",
      "created": 1725189633,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkzg42z",
      "score": 1,
      "body": "I like peleton",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkzg42z/",
      "created": 1725196734,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll0bv0s",
      "score": 1,
      "body": "you don't even make up 0.000001%.....",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/ll0bv0s/",
      "created": 1725207626,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lkzf7cw",
      "score": -2,
      "body": "HINT:  It was NEVER worth it.  The data has always supported picking the index fund.  Sorry you were late to that message.  BHB and BSB studies published in the JFA in 1980's and 1990's put the nail in the coffin for active management.  No you are not alone in having NO CLUE what I am talking about.  Most FA have no clue about the above peer reviewed published articles I am talking about.  Just like in life it pays for the consumer to do their OWN research.  No surprise Wall Street does not advertise the results of the results of this old debate before it was settled.",
      "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkzf7cw/",
      "created": 1725196375,
      "depth": 0,
      "replies": [
        {
          "id": "lkzfshb",
          "score": 1,
          "body": "Have any links to this? I’m curios about it. Guess I can google it lol. I still pick for the fun of it, but I’m mostly in etfs.",
          "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkzfshb/",
          "created": 1725196608,
          "depth": 1,
          "replies": [
            {
              "id": "lkzidol",
              "score": 2,
              "body": "You can try to articles online?  The authors are \"Beebower/ Hood/ Brinson\" for the first.  They took the top 100 pension funds in the country.  The idea is they have access to the top money managers money can buy so if ANYONE can find \"alpha\" it is these guys vs. the index.  They compared their results over the index for each asset class over the previous ?10 year period.  Found that on average they produced a NEGATIVE alpha.  Of course Wall Street didn't believe the results.\n\nSo these academic guys repeated the study \"Beebower/ Singer/ Brinson\".  That cover the NEXT 10 year period and thus published the next 10 year period.  Of course, the results were the same.  \n\nThe article was titled something like \"Determinants of Portfolio Variants\" or something like that.  Apologies if I am getting a bit off on something above as it has been a 10+ years since I last looked at the above articles and doing this off memory.  \n\nThink the Journal was something like JFA or something like that, but googling the names of the authors and the title of the paper is probably easier to find.  BTW... This ALSO one of the landmark papers that also showed:   Short term voltatility is determined by your asset allocation.  It was a very meaningful paper!",
              "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkzidol/",
              "created": 1725197625,
              "depth": 2,
              "replies": [
                {
                  "id": "lkzjvjc",
                  "score": 1,
                  "body": "I will look into this",
                  "permalink": "/r/stocks/comments/1f6auzm/does_quantitative_research_matter_anymore_for_the/lkzjvjc/",
                  "created": 1725198198,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}