{
  "title": "What do you guys think about the current PE ratio of S&P 500, which is 29.5 and well above the historical average? ",
  "score": 155,
  "selftext": "(Reposting because the original post had good discussion going on but mods deleted it for \"self-promotion\" which was strange. I assume that was for mentioning a popular podcast. Hopefully, this post stays.)\n\nHere is the chart of PE ratio - [https://www.multpl.com/s-p-500-pe-ratio](https://www.multpl.com/s-p-500-pe-ratio) . Even looking at only the past 15 years, 29.5 is very high and is only below the COVID highs - but the COVID high is artificial because the earnings dropped like a rock due to lockdowns. The only other time 29+ was reached was before the 2000 and 2008 crashes.\n\nHere is another website with forward PE estimate - [https://www.gurufocus.com/economic\\_indicators/6061/sp-500-pe-ratio-with-forward-estimate](https://www.gurufocus.com/economic_indicators/6061/sp-500-pe-ratio-with-forward-estimate) . This says a different story - forward PE estimate is apparently at 22 for 2025! I assume this means they expect earnings to bump up by 30-40%! That's the only way PE can go from 29 to 22 afaik (well unless the stock price goes down).\n\nI was looking around a bit regarding this and came across something called Shiller PE ratio - [https://www.multpl.com/shiller-pe](https://www.multpl.com/shiller-pe) - \"Price earnings ratio is based on average inflation-adjusted earnings from the previous 10 years, known as the Cyclically Adjusted PE Ratio (CAPE Ratio), Shiller PE Ratio, or PE 10\". This also looks similar to PE ratio and seems to peak just before every recession, but I don't understand it fully (for comparison with normal PE - [https://www.gurufocus.com/economic\\_indicators/57/sp-500-pe-ratio](https://www.gurufocus.com/economic_indicators/57/sp-500-pe-ratio) ). Even this says that the ratio is well well above historical average and is only comparable to 2000 levels.\n\nIs the expected growth in next few years high enough to justify the high prices? Is this time different?\n\nI'm not here claiming anything but just want to know what people think.",
  "link_flair_text": null,
  "id": "1f6lno8",
  "num_comments": 145,
  "created_utc": 1725215998,
  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/",
  "comments": [
    {
      "id": "ll1154i",
      "score": 1,
      "body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1154i/",
      "created": 1725215999,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll13lty",
      "score": 196,
      "body": "I’m not saying “this time it’s different” but you absolutely have to be looking at SP500 ex-big tech multiple versus big tech multiple because these mega cap names have become such a heavy weight and distortion of the index.\n\nWithout big tech you are looking at a much more reasonable 16x or so multiple. Not amazing but a positive equity risk premium over the 10Y treasury at the moment.\n\nAnd big tech is its own beast. Hate it or love it, investors continue to reward them for heavy reinvestment of profits into growth and they will likely continue to do so IMO.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll13lty/",
      "created": 1725216832,
      "depth": 0,
      "replies": [
        {
          "id": "ll1grwt",
          "score": 82,
          "body": "Big tech isn’t infallible but they are the best businesses that have ever existed.\n\nWorldwide reach, fortress balance sheets, their service side is mostly immune to to issues with materials/supply chains, in almost every business (e.g., our washing machines connect to the internet now), able to do buybacks, paying dividends, in a tax friendly environment, supported by the strongest government in the world, tied to retirement savings (more people own stocks than ever), it’s easier to buy stocks than ever, proven through a pandemic, recession tested, have a market of almost every consumer, decades of success, currently headed by proven leadership, often extremely strong brand recognition… unless they’re declared a monopoly, what could you even add to them?\n\nI have a hard time saying they don’t deserve an expanded multiple.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1grwt/",
          "created": 1725221300,
          "depth": 1,
          "replies": [
            {
              "id": "ll47mud",
              "score": 18,
              "body": "> Big tech isn’t infallible but they are the best businesses that have ever existed.\n\nEh, that's overblown. IBM, Cisco, Intel have been the highest capped companies on the planet and they were tech companies.\n\nOne of the things about tech is that it's very prone to disruption.\n\nToday you have the best GPUs on the planet, in 3 years it turns out there's a better paradigm for accelerating machine learning and you're done.\n\nToday you have the best search and ads engine. Tomorrow people interact directly with chatbots and little ads are seen.\n\nToday you have the smartphones people want most. Tomorrow people get rid of smartphones for smart glasses and you're nowhere.\n\nSeriously, outside of the Office suite, I just don't see anything that cannot be replaced.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll47mud/",
              "created": 1725264811,
              "depth": 2,
              "replies": [
                {
                  "id": "ll9p1if",
                  "score": 3,
                  "body": "Buddy you chose the one thing that is the most easily replaced - a million and a half alternatives to the Office suite have popped up, and many of them could easily get adopted without users batting an eye, if they could get past Microsoft’s ironclad advantage in distribution.\n\nAnd that’s the key: any of the things you mentioned doesn’t negate your advantage forever - it just means that as of “tomorrow” you’re on a clock to copy your rival’s innovation before they copy yours. So far, these big tech incumbents have been doing an incredible job of winning that game.",
                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll9p1if/",
                  "created": 1725345954,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ll1nqn1",
              "score": 14,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1nqn1/",
              "created": 1725223646,
              "depth": 2,
              "replies": [
                {
                  "id": "ll1qyc5",
                  "score": 6,
                  "body": "I was thinking this. Google has been working on AI since forever. Meta released PyTorch in 2016. Yet, they are pumping now on AI news, even tho these companies always worked on it. I don't understand what changed. We'll see I guess.",
                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1qyc5/",
                  "created": 1725224724,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll34xec",
                      "score": 4,
                      "body": "I think because when most normies are talking about AI, they really mean LLM which is just one type of AI. The algorithms Meta and Google use for their other products are just as much AI as LLM. I think it's incredibly misguided to say Google is behind on AI just because they were behind on LLM and they've already closed the gap pretty significantly with Gemini",
                      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll34xec/",
                      "created": 1725243890,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ll3j78u",
                          "score": 6,
                          "body": "To be fair a bunch of companies have been just re-branding stuff that they've already been doing for years as AI, when it's really just something different like algorithms, etc. Take Spotify for example talking about their \"AI\" that suggests songs for you, as if that's at all a new thing.\n\nSome of the stuff you're saying about Facebook and Google fall under that same category as nothing new, and not truly AI.",
                          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3j78u/",
                          "created": 1725250325,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ll4eabw",
                              "score": 2,
                              "body": "Recommendation systems are in fact a form of AI. There are different type of algorithms and approaches you can take to create a recommendation system.\n\nFirst systems weren't so profound, but there are really good search engines which work with images, videos, songs, documents, etc.\n\nA lot of people forgot what recommendation systems looked 10 or 15 years ago.",
                              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll4eabw/",
                              "created": 1725269354,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ll4dl99",
                      "score": 2,
                      "body": "They worked and the AI existed for a long time, from 1950s, but only now it got it's own shine because of 3 things.    \nFirst is big data (well organized, well stored, well diversified and easy to collect), really good software for AI development (Tensorflow, PyTorch, Keras, etc.) and of course the hardware (the GPUs, TPUs and all sorts of harware which can grasp all those information and also do the parallelization).\n\nAnd a big one is also new discoveries in AI architecture. For example the Transformer arhitecture enabled this LLM boom that we see now with ChatGPT, Gemini, etc.\n\nEverything culminated to this current point and it's not stopping.",
                      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll4dl99/",
                      "created": 1725268873,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ll26fkl",
                      "score": -2,
                      "body": "What changed is that Chinese AI companies started catching up. Now they're pumping AI news to try to make investors come or stay in USA and not go to China.",
                      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll26fkl/",
                      "created": 1725230280,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ll217f1",
              "score": 5,
              "body": "True, but all of those things make the current companies of big tech easier to attack. Newcomers to the scene DON'T have to build a supply chain, don't have to hire 300k employees, don't have to purchase massive swaths of real estate. Personally I'll be very surprised if in 10-15 years, all the same dogs are on top of the pile of big tech.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll217f1/",
              "created": 1725228352,
              "depth": 2,
              "replies": [
                {
                  "id": "ll2s0f7",
                  "score": 6,
                  "body": "10-15 years ago, Microsoft was absolutely at the top of the tech pile",
                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll2s0f7/",
                  "created": 1725238677,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll36kb8",
                      "score": 12,
                      "body": "True, but in 2009 Cisco was #14, today it's #37. In fact, Microsoft is the only stock still in the top 10 from back then, which tells me it's the exception rather than the norm.",
                      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll36kb8/",
                      "created": 1725244576,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ll58n8r",
                          "score": 5,
                          "body": "Sure, but Cisco's revenue in 2009 was 36 billion, last year it was 57 billion. A drop in rankings doesn't mean they didn't grow their business.",
                          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll58n8r/",
                          "created": 1725284733,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ll5e6gt",
                              "score": 5,
                              "body": "True, not to mention they've been paying a very real dividend, which will skew the stock price downward.\n\nMy point was to the commenter way above who had an interesting argument that big tech are the 'best businesses to ever exist', citing a few reasons that I challenged.",
                              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll5e6gt/",
                              "created": 1725286744,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ll5e6sq",
                      "score": 3,
                      "body": "Microsoft, Apple and to some extent Alphabet (Android) are the basis for all other tech since without their platforms none of the others get to exist.  Very little competition",
                      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll5e6sq/",
                      "created": 1725286747,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ll1oyto",
              "score": 2,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1oyto/",
              "created": 1725224058,
              "depth": 2,
              "replies": [
                {
                  "id": "ll1qah9",
                  "score": 11,
                  "body": "1.  I would say these businesses are better for many obvious reasons.\n\n2.  The fact that you had to go all the way back to that means these are elite companies in history.\n\nThey’re not invincible though",
                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1qah9/",
                  "created": 1725224500,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ll3k7fb",
              "score": -1,
              "body": "“Expanded multiple” is a mild way to describe a CAPE in the 99th percentile of history, exceeded only in 2000 during the very top of the dot com bubble.\n\nI’m sure there were many convincing reasons to buy stocks back then, as there were reasons to sell in 2022 & 2008.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3k7fb/",
              "created": 1725250831,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ll1570n",
          "score": 22,
          "body": "I agree with your point, but am still a bit cautious. Big tech being overvalued is a risk that will impact the whole index if things ever change.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1570n/",
          "created": 1725217369,
          "depth": 1,
          "replies": [
            {
              "id": "ll2rq6k",
              "score": -2,
              "body": "The index, sure, but not the economy too badly",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll2rq6k/",
              "created": 1725238563,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ll15yqa",
          "score": 8,
          "body": "Fair. I saw the recent Compound podcast (idk if I am allowed to link it without getting my comment removed) and they said that around 2021 people started looking at big tech as value stocks. So Meta, Google etc started going down. Then the AI hype hit the market and suddenly these big tech were \"growth\" stocks and led the rally. According to them, this almost never happens.\n\nSo you are right, the big tech is a different beast and altering the numbers.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll15yqa/",
          "created": 1725217629,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll160aw",
          "score": 7,
          "body": "Yeah. Half of Big tech is not even that expensive from a valuation perspective given the growth",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll160aw/",
          "created": 1725217644,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll4iu1i",
          "score": 2,
          "body": "Agree, according to the summary of the common points of smart investors at the end of the bull market:\n\n1. The price level has reached the highest in history.\n\nTwo. The price-to-earnings ratio is very high.\n\n3. Compared with bond yields. The dividend yield is very low.\n\nFour. A large number of margin speculative transactions\n\n5. There are many new ordinary shares issued with poor quality.\n\nWe haven't fully reached these points yet, and the market will still fluctuate upwards.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll4iu1i/",
          "created": 1725272418,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll17wd8",
          "score": 2,
          "body": "You say big tech,for me its big pharma ,look at PE of Elly,Merk, Abbvie,now,thats huge",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll17wd8/",
          "created": 1725218290,
          "depth": 1,
          "replies": [
            {
              "id": "ll34j4x",
              "score": 2,
              "body": "LLY yes. Forward PE of ABBV is 18 & MRK is 15.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll34j4x/",
              "created": 1725243725,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lldkknc",
          "score": 1,
          "body": "So basically this time it’s different?\n\nGotcha.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/lldkknc/",
          "created": 1725401461,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lm9913a",
          "score": 1,
          "body": "It’s always easier to make comparison, when you get to snip part of sample size off the data set.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/lm9913a/",
          "created": 1725878224,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll35alu",
          "score": 1,
          "body": "A forward PE of 16 without the growth of the big tech is not a cheap multiple. It should be 13-14 without the big tech growth.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll35alu/",
          "created": 1725244042,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll1i153",
      "score": 22,
      "body": "I just look at current forward PE and mentally account for seasonality.  Trailing 12 month PE is too lagged.\n\nhttps://imgur.com/PSwc519\n\nSo yeah, we're basically priced for perfection.  \n\nWhat's interesting is PE expansion is exclusive to the megacaps.  PE for small/mid caps are actually low historically.  Lot's of optimism in the megacaps due to AI.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1i153/",
      "created": 1725221722,
      "depth": 0,
      "replies": [
        {
          "id": "ll1kups",
          "score": 5,
          "body": "That's a cool plot. Forward is at 22 and current PE at 29. It requires earnings growth of 20-30% atleast. That's actually amazing that we are expecting such massive growth. And yeah, some others also pointed out that current data is being heavily biased by mega caps - which is a good argument.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1kups/",
          "created": 1725222677,
          "depth": 1,
          "replies": [
            {
              "id": "ll1qvwk",
              "score": 13,
              "body": "A huge amount of that 20-30% growth is just nvidia.  What's interesting is the other megacaps account for over half of nvidia's revenue.  There are opposing forces at work here, it's unsustainable.   FB/G/etc can't keep buying chips from nvidia at a 100% y/y growth rate unless they start seeing some actual revenue from AI.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1qvwk/",
              "created": 1725224700,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll206u0",
              "score": 0,
              "body": "Rates are coming down, growth will accelerate.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll206u0/",
              "created": 1725227982,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll11ird",
      "score": 86,
      "body": "What is the S&P 500's PE ratio relative to risk free returns? The 10-year is still well below its historical average, so I'd kind of expect PE ratios to go up. 10-year yield was almost 9% in 1990, now it's almost 4%. S&P 500 PE was \\~15 at that time, so about half (double earnings yield).\n\nI don't know if halving earnings yield is justified when risk-free returns halve, but the direction makes sense.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll11ird/",
      "created": 1725216128,
      "depth": 0,
      "replies": [
        {
          "id": "ll12o7g",
          "score": 16,
          "body": "I assume this is the relevant graph ( [https://www.gurufocus.com/economic\\_indicators/4530/shiller-excess-cape-yield-for-the-sp-500](https://www.gurufocus.com/economic_indicators/4530/shiller-excess-cape-yield-for-the-sp-500) ). It is very low and comparable to 2008 but not as bad as 2000. I am not familiar with this and could misinterpreting what's happening, but from what I see it does not add to my confidence.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll12o7g/",
          "created": 1725216515,
          "depth": 1,
          "replies": [
            {
              "id": "ll1jurf",
              "score": 5,
              "body": "A low or high ratio doesn't tell you whether stocks are a risky investment right now: it simply gives you the risk premium relative to the 10-year. Just look at 1996-2000, the ramp up to the dot-com bubble, and the ratio was worse than it is today. Even accounting for the hike between December 1998-1999, it was trending downwards. The period was a great time to invest in stocks. \n\nAs you can see by the spikiness, all three relevant factors (earnings, price, and 10-year yields) can be volatile over a short time period. Recently the 10-year went from 0.6 to 4.8 within the span of 3 years. You'll have to granularly look at each factor to determine what the ratio means.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1jurf/",
              "created": 1725222341,
              "depth": 2,
              "replies": [
                {
                  "id": "ll1o0r8",
                  "score": 3,
                  "body": "I am confused with what you are saying. How was 1998-1999 great time to invest in stocks? By 2002, the sp 500 fell to same price as 1997. In fact, Sp 500 was \\~ 1200 in Jan 1999 and after dot com crash, SP 500 didn't come back to that level until 2005. So I don't follow.",
                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1o0r8/",
                  "created": 1725223739,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll1rbfd",
                      "score": 2,
                      "body": "Valuation metrics are useful for establishing what stocks and time periods are ideal for long-term gains; these tend to be cycles that extend over decades. A high P/E ratio tells you nothing about whether a stock/index is going to move in 6, 12, 18 months; it will inform you about average returns over 10-12 years. \n\nIf we solely relied on these long-term metrics to inform our decisions, we would've missed out on the end period of the dot-com bubble, 2021, the rise of mega cap tech from November 2023. When a change in price outstrips the concurrent change in earnings, you still make money.",
                      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1rbfd/",
                      "created": 1725224846,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ll35mj8",
                          "score": 1,
                          "body": "Dot com bubble reversed prices to before the run up in 2002, 2021 reversed priced in 2022, and the run up since Nov 2023 can very well reverse again. Pointing those out only assumes you will get out at the top.",
                          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll35mj8/",
                          "created": 1725244181,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ll6ozxl",
                              "score": 1,
                              "body": "That's why you have trailing stop losses. Bluntly, if you don't utilize them while knowing these are speculative gains you deserve to lose all that alpha (and more). And it's very obvious in all three cases they are speculative gains.",
                              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll6ozxl/",
                              "created": 1725302273,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ll7dvg2",
                                  "score": 1,
                                  "body": "you're talking about TRADING. we're talking about INVESTING. trailing stop losses are only used for trading.",
                                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll7dvg2/",
                                  "created": 1725310680,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ll1mw8i",
                  "score": 3,
                  "body": "Wait, 1998-1999 was a great time to invest in stocks? Lol. 2001-2003, that was a great time.",
                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1mw8i/",
                  "created": 1725223363,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll1pf8n",
                      "score": 0,
                      "body": "It was an amazing time for trading. You would've caught the meltup in 1998 and rode it all the way to the top. It would've been a poor time for *investment* as the top wouldn't be recovered for 15 years.",
                      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1pf8n/",
                      "created": 1725224210,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ll1t740",
                          "score": 6,
                          "body": "But you said “a great time to *invest*.” To me, investing means a minimum 5 year hold.",
                          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1t740/",
                          "created": 1725225486,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ll1valw",
                              "score": 1,
                              "body": "Then modify the statement: \n\nIf you had bought stocks in 1996 the express intention of riding the euphoria, you would've made more money in a few years than long-term investors typically make in a decade. As long as you didn't conflate trading with investing - and a bubble is rationalized by turning A into B - you'd know there would be an eventual sell point.",
                              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1valw/",
                              "created": 1725226214,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ll2wkwd",
                                  "score": 3,
                                  "body": "Heh, you know how many people got out at the top? Very, very few. What I remember from 2000 was a lot of talk like “Cisco is down to $40! Back up the truck!”",
                                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll2wkwd/",
                                  "created": 1725240511,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ll6pq12",
                                      "score": 0,
                                      "body": "That's why they call it a bubble. And like in most bubbles, retail ended up holding the bag while institutions sold out ahead of time.",
                                      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll6pq12/",
                                      "created": 1725302517,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ll1jumc",
              "score": 0,
              "body": "OP, in 1970s most people were poor as fuck, especially around the world.  \nAs more people save more money than ever, there is just so many stocks to invest in. So long term expect P/E ratio to always go higher, maybe some day even reaching 100. That’s also a good thing, since especially in the past, money made money, but this is getting less and less true as time goes by, as money are getting cheaper.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1jumc/",
              "created": 1725222340,
              "depth": 2,
              "replies": [
                {
                  "id": "ll1kqe7",
                  "score": 6,
                  "body": "If people were poor, earnings should have been poor as well. Similarly, if inflation makes money cheaper then nominal earnings will also go up in concert. Therefore P/E ratios should not noticeably change. \n\nNote that people are still relatively poor when it comes to purchasing stocks: [93% of retail principal is owned by 10% of the population](https://finance.yahoo.com/news/wealthiest-10-americans-own-93-033623827.html).",
                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1kqe7/",
                  "created": 1725222636,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll1mopm",
                      "score": 2,
                      "body": "that’s not exactly true.  \n  \nImagine scenario one, where you make $50k a year and invest $1000 a year. You buy stuff for $49k, some of which are companies profits.  \n  \nScenario 2: You make $100k a year, you save $10k. So companies are making almost double of you, but your investment is 10x higher. So the ratio of invested money compared to earnings is much higher, leading to higher P/E.  \n  \nAs of 93% of stock being owned by 10% - sure, what was in the past? 93% of stock being owned by 1%? People are investing much more than they used to",
                      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1mopm/",
                      "created": 1725223293,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ll1p7z2",
                          "score": 3,
                          "body": "That's fine, but fundamentals of the company hasn't changed. Yes, PE ratio can grow if people continue to invest, but at that point it is a ponzi scheme since the actual value of the company is far less than what people are investing. Isn't that a problem?\n\nIf PE for a stable company is, say 40, then it means it would take 40 years of stable running for the total earnings to be equal to market cap. At some point, the PE becomes unreasonable.",
                          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1p7z2/",
                          "created": 1725224143,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ll3ini9",
                              "score": 3,
                              "body": "You're right. The stock market doesn't work like a lot of people seem to think on here. Here's a quote from Ben Felix on investing in technological revolution: \"A stock is a claim on a company’s future profits. Investment returns do not come from a company’s growth; they come from the relationship between a company’s future profits, and how much you, the investor, paid for those expected profits. Paying a higher price should lead to lower realized returns, all else equal. This is exactly what the historical record shows.**\"**",
                              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3ini9/",
                              "created": 1725250051,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "ll3ufyq",
                              "score": 1,
                              "body": "depends on your definition of unreasonable. Sure, everybody would want to have their investment made back in 4 years, but that’s not realistic anymore, barring some crazy good deal. Right now, you consider maybe about 15 years a good investment (P/E 20-25, since the profits are slowly growing over years it should be less than 20-25 years).  \nIn the future, people may tell you that 15 years is not realistic anymore and you’ll have to make with 40 years.  \nNot a ponzi scheme, because companies still make money, so the money returned from market is always higher than what was invested in. Just that those returns will keep getting smaller as time goes by, as it is diluted to more and more people.  \nAs you said, right now about 90% Americans don’t invest enough. Globally, it is probably closer to 95-99%. So the number of people investing serious money into the market will grow 10x in coming decades, even if you count the inflation. Companies won’t make 10x higher profits. As there will be overabundance of capital, returns will be low.",
                              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3ufyq/",
                              "created": 1725256414,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ll1s61r",
                          "score": 2,
                          "body": "> Scenario 2: You make $100k a year, you save $10k. So companies are making almost double of you, but your investment is 10x higher. So the ratio of invested money compared to earnings is much higher, leading to higher P/E.\n\nThe assumption doesn't match empirical reality. People who make more money tend to proportionally spend more as well. Beyond discretionary purchases (status becomes more important as necessities are covered) they also live in more expensive neighborhoods, pay more for exclusive schools for their kids, etc.\n\nFurthermore, this hypothesis doesn't match the recorded history of valuations. According to that logic, we should see a straightforward increase in average P/E ratios from 1880 to the present. This is not reflected in P/E or any other proxy like Tobin's Q. [Until the 2000s it resembled a sine wave](https://www.multpl.com/s-p-500-pe-ratio).\n\nThis also ignores the impact of inflation upon the perceived value of money. Your analogy only makes sense if both scenarios happen simultaneously. [If you earned $10k a year in 1950, you were significantly wealthier than someone making $100k in the present](https://www.in2013dollars.com/us/inflation/1950). Inflation also impacts business expenses and savings depending on the FFR.\n\n> As of 93% of stock being owned by 10% - sure, what was in the past? 93% of stock being owned by 1%?\n\nNo. It's a myth that stock investment was exclusively reserved for the rich. Like all market trends, it has ebbs and flows depending on how the public viewed it. It becomes popular when people assume passive investing is guaranteed profit (i.e. the 1920s, the 1990s, post-2015) and unpopular when the market is volatile or bad (i.e, the 1930s, 1970s-1980s). The public becomes enthusiastically interested in investment when they can envision the market as a bank on steroids.\n\n> People are investing much more than they used to\n\nYes, and it has nothing to do with wealth. It's about risk-free returns in other assets being poor for decades, which has shifted liquidity into risk assets for better yield. Look at Treasury rates after 2008: until 2022, everything below the 10-year was uninvestable and lost money to inflation.",
                          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1s61r/",
                          "created": 1725225135,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ll3z7ko",
                              "score": 1,
                              "body": "good arguments!  \nPeople making more money sure spends more, but they also save much more. That’s evidenced by the exact same data - 93% of stock is owned by 10% of wealthiest people. People with money spend more but also save more.  \nYou are right about difference in the past.  \nWhen you are really poor and then start to make better money, you first spend it on necessities, thus increasing companies profits and revenues. Only after the necessities are met, you start saving.  \nSo people getting out of poverty increases profits, people getting wealthier after their necessities are met are increasing valuations.  \nSince there were two world wars, people in 1880-1980 were mostly getting out of poverty. It’s still true for many countries, but there is also a huge increase in number of people that can afford to invest.  \n  \nAlso inflation was ignored, because inflation rises everything - stock price, earnings, wages, everything. So it doesn’t make sense to mix past dollars with present dollars - you have to calculate it inflation adjusted.   \n  \nIt’s not that stock markets were reserved only for wealthy. But that people didn’t have money to invest, so they could (and some did), but most didn’t.",
                              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3z7ko/",
                              "created": 1725259293,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ll6tvwi",
                                  "score": 2,
                                  "body": "> People making more money sure spends more, but they also save much more. That’s evidenced by the exact same data - 93% of stock is owned by 10% of wealthiest people. People with money spend more but also save more.\n\nAgain, this is not true. You are conflating nominal increases in the money supply (i.e. inflation) with real added value. [The personal savings rate has tanked over the last 60 years](https://fred.stlouisfed.org/series/PSAVERT), therefore currently people have *less* money to invest in the market than ever before. Most of the population in the lower 60% have their equity tied up in their homes. Meanwhile the rich invest it in assets other than stocks, making it illiquid.\n\n> So people getting out of poverty increases profits, people getting wealthier after their necessities are met are increasing valuations.\n\nAgain, not reflected in the evidence. The 1950s are regarded as the halcyon days of American economic prosperity, yet the S&P's aggregate valuation didn't break the mean until 1959. In fact, the market exhibited consistently higher P/E multiples *during the Great Depression*. Again, this is all displayed in the chart.\n\nWhy did this happen? Because during times of economic prosperity, earnings growth outstrips price growth. People spend when they're optimistic about the future and believe standards of living will continue to improve. I often see people on this subreddit fail to grasp this basic point, so they cite P/E ratios in the past as evidence that past business environments were inefficient. \n\n> Since there were two world wars, people in 1880-1980 were mostly getting out of poverty. It’s still true for many countries, but there is also a huge increase in number of people that can afford to invest.\n\nThis doesn't apply to the United States in either case. You are moving the goalpost to implicitly include international markets. \n\n> It’s not that stock markets were reserved only for wealthy. But that people didn’t have money to invest, so they could (and some did), but most didn’t.\n\nInvesting and trading are *disciplines* that require work and research, and the average person doesn't risk their money in something they don't understand how to do. Across time we predictably see influxes of ordinary people during speculative bubbles, when they believe stocks only go up and to the right. There's a reason they call it \"dumb money\".",
                                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll6tvwi/",
                                  "created": 1725303925,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ll6ybk5",
                                      "score": 1,
                                      "body": "fair points! Have a nice day",
                                      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll6ybk5/",
                                      "created": 1725305457,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ll1uc0x",
                  "score": 1,
                  "body": "Money makes money? If you look at the index this still holds true",
                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1uc0x/",
                  "created": 1725225878,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll432kz",
                      "score": 1,
                      "body": "yes, but as P/E grows, returns are getting lower, so it becomes less and less true",
                      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll432kz/",
                      "created": 1725261732,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ll1ys5e",
          "score": 3,
          "body": "10-year will never go that high if current monetary policy continues",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1ys5e/",
          "created": 1725227461,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll3jnbf",
          "score": 2,
          "body": "I think the other thing to keep in mind is that the average market PE ratio has simply been slowly trending upward overtime if you look at the 100 year chart that OP linked. Our market's PE ratio at it's lowest in the last 2 decades is at what historically was the high end of the PE ratio 100+ years ago.\n\nThe fact is a lot more people are investing in the stock market these days then in decades past, thanks to things like the 401K, etc. So that excess money is obviously going to push up the average PE ratio as well.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3jnbf/",
          "created": 1725250549,
          "depth": 1,
          "replies": [
            {
              "id": "ll3vjdr",
              "score": 1,
              "body": "That's definitely a part of it, but risk-free returns also were very low in this time. So maybe more people flocked to the S&P 500 exactly because of that. Sure, it would be \"overvalued\" compared to history, but assuming risk-free returns don't shoot upwards all of a sudden there wouldn't be a reason to assume the S&P 500 should crash.\n\nNow that I wrote that I realize how weird it is to talk about the S&P 500 being \"overvalued\" lol",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3vjdr/",
              "created": 1725257067,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "llemmii",
          "score": 2,
          "body": "I've written this elsewhere, but i think it's worth repeating here:\n\n[History shows](https://riskpremium.substack.com/p/bonds-away) that earnings yield levels relative bond yields are a good indicator for forward long-term excess returns for stocks vs bond.\n\nToday's levels fall into the \"stocks might not do much better than bonds\" bucket.\n\nI think it's also worth pointing out that 1990 had somewhat of a similar profile as what we're seeing today where expected excess returns for stocks over bonds would have been projected to be quite low. But the late 90's were an absolute mania. I think it would take something very similar over the next decade to justify expecting stocks to vastly outperform bonds. \n\nStocks would have to fall roughly 25% from here before I would comfortably say that the equity risk premium was demonstrably positive. They'd have to fall about 50% before the equity-bond yield spread reached the median level over history (as defined in the post linked above).\n\nThat's not to say I'm expecting a crash. I'm not. Things could play out any number of ways. Returns could stagnate for a couple of years such that the yield spread falls as earnings rise. Similarly, bonds could just outperform as yields fall. \n\nIn general, I think stocks will have positive returns over the next ten years, just not *that* much higher than bonds.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/llemmii/",
          "created": 1725416556,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll1m57p",
          "score": 1,
          "body": "S&P 500 earnings yield is lower than the 10 year treasury and lower than the short term t BIll, only time this happened before was late 1999/early 2000 rigth before the tech bubble crashed.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1m57p/",
          "created": 1725223111,
          "depth": 1,
          "replies": [
            {
              "id": "ll3v1uw",
              "score": 1,
              "body": "PE of 15 is an earnings yield of \\~6.6%, right? That'd be below the 10-year in 1990, too, which is at almost 9%.\n\nI didn't look at all years very detailed, but 1990 wasn't cherrypicked. I assume it's similar in the years prior, too. Though maybe the short term returns make the difference here? Didn't compare short term tbills.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3v1uw/",
              "created": 1725256773,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ll1ml0n",
          "score": 1,
          "body": "Incomparable….. the missing ingredient in PE multiple is the growth, expected growth. U probably had oil companies largest back then which where capex heavy compared to lower capex to EBITDA today along with higher growth. So compared to 9% 10yr yield and now 4% 10yr maybe PE is to low today or to high back them…. We will see",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1ml0n/",
          "created": 1725223258,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll18aaa",
      "score": 19,
      "body": "Big difference from PE between SP500 w TECH and w/o TECH. Means it can be still fair priced in an uptrend as long as the others are doing well.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll18aaa/",
      "created": 1725218422,
      "depth": 0,
      "replies": [
        {
          "id": "ll1z4od",
          "score": 3,
          "body": "And you can’t use PE to evaluate big tech right now due to insane capex cycles for ai capture",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1z4od/",
          "created": 1725227590,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll20vhs",
      "score": 6,
      "body": "It's concerning, but what is there to do about it? I'm not near retirement age, so re-balancing away from SPY most likely will not be worth it.\n\nI'd have to time both my exit AND my re-entry point into SPY. If I miss on either of those, it's likely I'd have made more money just doing nothing.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll20vhs/",
      "created": 1725228230,
      "depth": 0,
      "replies": [
        {
          "id": "ll252ph",
          "score": 8,
          "body": ">what is there to do about it?\n\nWell, one thing that you can do is pick shares that don't have a very high PE ratio. Reddit is so awestruck by S&P500 ETFs that it forgets anything else is a possibility. Also you can add bonds into your mix.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll252ph/",
          "created": 1725229779,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll41n1z",
      "score": 5,
      "body": "CAPE ratio takes into account inflation and is an average for the last 10 years. It’s much more indicative of long term trends and showing how over priced the market is based on earnings. I would say lots of people here haven’t studied much history because saying “this time its different” has been happening since the 20s. AI isn’t somehow generating record profits for anyone besides semis. The market is in for a huge correction. We are getting to 2000s level overvalued.\n\nThe problem is always how long will this wave of overvaluing continue. But the higher it goes the bigger it falls. This is why I find the common advice of just buying VOO as comical. If you spent the last 5 years amassing huge index fund positions it could easily be wiped out. Look at returns after 1980 and 2000s",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll41n1z/",
      "created": 1725260812,
      "depth": 0,
      "replies": [
        {
          "id": "lleo4yy",
          "score": 1,
          "body": "I generally agree, and I've shared my thoughts here (which i think is in-line with your view):\n\nhttps://www.reddit.com/r/stocks/s/OkNFnYLtxf\n\nOne caveat I'd add is that 2000 was a special case because bond yields hit 7%. [I like this chart](https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3b15d040-8805-40e2-8610-e86bd3729006_919x521.png) because it illustrates how bonkers 2000 actually was. A CAPE at 40 and bonds at 7% make bonds kind of a no-brainer. Today we're choosing between CAPE at 35 and bonds at 3.8%. I would say 2024 and 2000 aren't terribly comparable in regards to equity \"over valuation-ness\".",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/lleo4yy/",
          "created": 1725417148,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvy7gpq",
          "score": 1,
          "body": "I think this is incorrect. First, we are nowhere near 2000s overvaluations. Second, you have to trust the accuracy of published inflation data to trust the CAPE anyways. \n\nThirds, CAPE doesn't factor in innovation and profitability/ margin changes and look into the future, it only looks at the past productivity of a company in todays dollars by inflation adjusting old profits and comparing to the current price. This doesn't reflect the expansion potential of a company in the future at all and those giant companies are capturing pieces of everything.\n\nLook at the forward PE of the S&P - it is high but not like 10x what it should be and it's barely changed over the last 10 years. When you look at all the inflation in the system (M2 growth), margin expansion potential of companies leveraging tech and globalizing, I don't think the PE 10 does a very good job of capturing those things. Stocks felt expensive 3 years ago and they are all up like 40% and the forward PE went down! \n\nAdditionally, if you are holding off on investing like I did based on that ratio waiting for a PE 10 number that looks closer to what you think it should be, you will on average lose tons of money compared to averaging into the market. Overtime, you will always win doing this. Don't try to be smarter. Just buy and hold the S&P 500 and VTI and you will be richer than any other alternative.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/lvy7gpq/",
          "created": 1731008011,
          "depth": 1,
          "replies": [
            {
              "id": "lw1etkp",
              "score": 0,
              "body": "Yeah I have been beating the S&P for over 10 years, so I am much richer than if I had put that into VTI. 10% annualized return is comically low compared to what you can get from individual stocks.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/lw1etkp/",
              "created": 1731046971,
              "depth": 2,
              "replies": [
                {
                  "id": "lw1q7y5",
                  "score": -1,
                  "body": "If you think you did that on purpose, I am sure you work for Berkshire Hathaway!",
                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/lw1q7y5/",
                  "created": 1731053626,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lw1xbji",
                      "score": 2,
                      "body": "The pure idiocy of thinking that no one besides buffet can beat the s&p 500 is showing of how unhinged the VTI only forever crowd it.",
                      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/lw1xbji/",
                      "created": 1731058221,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lw37i2l",
                          "score": 1,
                          "body": "Buffett hasn’t beaten the S&P since 2007. \n\nI didn’t say people can’t beat it. You could easily have just sat on Tesla for 10 years and done that. \n\nBut to beat the indices over periods long enough to make it a better idea than just buying the indices is just about impossible. \n\nMath is math and your chances of beating me over 40 years is infinitesimally remote.",
                          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/lw37i2l/",
                          "created": 1731078490,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ll17u0q",
      "score": 11,
      "body": "A revision to the mean or the median would be a bit shocking to many people, mostly young people.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll17u0q/",
      "created": 1725218267,
      "depth": 0,
      "replies": [
        {
          "id": "ll1bvt8",
          "score": 12,
          "body": "Seems like it would be more shocking to all the older people whose 401ks and pensions are all heavily invested in the markets.  Young people have the luxury of time to regain their losses and actually would be getting a huge discount.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1bvt8/",
          "created": 1725219651,
          "depth": 1,
          "replies": [
            {
              "id": "ll1tp0m",
              "score": 4,
              "body": "It would be more damaging to older people but we have seen it happen in Growth stocks in 2002 and in all stocks in 2008 so we aren't under the impression that \"Stoks only go up\".",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1tp0m/",
              "created": 1725225657,
              "depth": 2,
              "replies": [
                {
                  "id": "ll2gcp8",
                  "score": 3,
                  "body": "So you mean psychologically shocking, then I can agree.  I guess I am an older person as I experienced the dot com bust and Great Recession of 2008.  I clearly remember the older folks of that time being distressed and even delaying retirement because their 401ks went down almost 50%.  Do you think the older people of our times are more prepared for a pullback of 50% of the value of their 401ks?",
                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll2gcp8/",
                  "created": 1725234087,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ll1iakp",
              "score": 4,
              "body": "If someone is about to retire with their lifetime of 401k, they won’t have losses with a correction to the mean.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1iakp/",
              "created": 1725221812,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll36wb0",
              "score": 1,
              "body": "That’s why target date funds tend to move to more stable income oriented funds as the target date approaches. It’s a fairly common CFA advice to people to move large portions of money into bonds as such as they approach retirement.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll36wb0/",
              "created": 1725244719,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ll1d3jc",
          "score": 8,
          "body": "As a young person, there’s nothing I would want more lol",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1d3jc/",
          "created": 1725220062,
          "depth": 1,
          "replies": [
            {
              "id": "ll1wgi9",
              "score": 10,
              "body": "Hope your job is iron clad then.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1wgi9/",
              "created": 1725226632,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll1t5tl",
              "score": 3,
              "body": "That is a very self aware statement and also very true.   For both the price of equities as well as the price of houses.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1t5tl/",
              "created": 1725225474,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll3ip78",
      "score": 3,
      "body": "A lot of growth being priced in with a world that is slowing in population growth",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3ip78/",
      "created": 1725250075,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll1tt5p",
      "score": 7,
      "body": "Is the forward PE not expected to be 23? If this is right, if this will be true, it sound fine enough",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1tt5p/",
      "created": 1725225696,
      "depth": 0,
      "replies": [
        {
          "id": "ll1vin1",
          "score": 7,
          "body": "Yup. But, like I said in the post, going from 29 to 23, requires \\~30% earning growth - in a year! That's almost sounds too good to be true. Look at Nvidia - they provided guidance of 8% growth in quarter so maybe \\~32% earnings growth in a year. If Nvidia barely reaches 32% growth, idk how rest 499 companies manage 30% growth. We'll see I guess.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1vin1/",
          "created": 1725226294,
          "depth": 1,
          "replies": [
            {
              "id": "lvy8gmz",
              "score": 1,
              "body": "It's not hard to grow earnings 40% when your margins are 80% and profits are 20%. You can do it with a 10% increase in sales.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/lvy8gmz/",
              "created": 1731008293,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll1yw30",
              "score": -1,
              "body": "Don't think it was there then i wrote?\n\nTime will show, most likely it will be lower, but nvidia had a huge growth the years before also.\n\nI think a big different could be if there is company that have done as BMY and made a shitty quarter with write offs",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1yw30/",
              "created": 1725227501,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll159mz",
      "score": 7,
      "body": "I thought your concerns are very real.\n\nI personally manage my  money full time, with some years of exp and great coaching, so Im picking stocks\n\nThe concern is that high PE is justified in some high growth (tech)stock, but there is a lot of overvalued individual stocks in the Sp500.\n\n\nI would be very comfortable holding a quality stock with 50 PE, but Im not as comfortable holding SPY with 30 PE",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll159mz/",
      "created": 1725217393,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll1m0ns",
      "score": 2,
      "body": "Small cap value is below historical averages, I'm heavily weighted towards SCV for that reason.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1m0ns/",
      "created": 1725223068,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3m2fq",
      "score": 2,
      "body": "This time is different",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3m2fq/",
      "created": 1725251790,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3uq97",
      "score": 2,
      "body": "Big tech is making the S&P a more volatile investment.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3uq97/",
      "created": 1725256580,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll4753x",
      "score": 2,
      "body": "There's nothing much to think.\n\nIt's indeed very very high on historical basis.\n\nBut, on the other hand, the \"new normal\" might be much higher than it has been for the previous 150 years.\n\nIf you want to make real money, you're likely better looking outside US for good bargains.\n\nBut, on the other hand, you may play it safer and still do well by keeping it on the SP500.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll4753x/",
      "created": 1725264477,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll4oh6k",
      "score": 2,
      "body": "Go look at the charts of spy when rates are lowered. Last two times, spy fell hard.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll4oh6k/",
      "created": 1725275850,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll57srh",
      "score": 2,
      "body": "It's tragic and it will drop.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll57srh/",
      "created": 1725284415,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll135rj",
      "score": 5,
      "body": "PE is not the only factor.  Prevailing interest rate will make a difference.\n\nIt might be better to look at the \"Buffet Ratio\" which measures market worth over GDP.\n\n![gif](emote|free_emotes_pack|thinking_face_hmm)",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll135rj/",
      "created": 1725216681,
      "depth": 0,
      "replies": [
        {
          "id": "ll2arb2",
          "score": 9,
          "body": "Look at Buffett himself. Hoarding cash and selling equities.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll2arb2/",
          "created": 1725231927,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll13xka",
          "score": 15,
          "body": "[https://www.gurufocus.com/economic\\_indicators/60/buffett-indicator](https://www.gurufocus.com/economic_indicators/60/buffett-indicator) - Lol. We are at all time high. Higher than 2000 and 2008. Again, ignoring COVID.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll13xka/",
          "created": 1725216942,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll16np6",
      "score": 8,
      "body": "Overvalued to shit, plain and simple, especially in the environment of elevated interest rates. If people unironically believe the mantra of 7-8% YoY growth is a possibility for the next 15 years given what’s happening in the fiscal environment, they are going to be sorely disappointed.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll16np6/",
      "created": 1725217866,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll1wbvk",
      "score": 2,
      "body": "Warren Buffett is more liquid than he has ever been.  It’s like he’s expecting a crash or something.  That will be a huge opportunity to go all in.  It’s his standard investing pattern.  He will buy and hold for years. People are greedy right now so he is fearful.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1wbvk/",
      "created": 1725226586,
      "depth": 0,
      "replies": [
        {
          "id": "ll3ee3r",
          "score": 2,
          "body": "It's the historic pattern but I owned BRK in 2020. That was a very large wasted opportunity (they mostly just did buybacks)\n\n\nThere's nothing wrong with taking profits while the market is up if they want to rebalance. They could also be trying to take advantage of the lower corporate tax rate vs what Harris wants to impose next year",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3ee3r/",
          "created": 1725248006,
          "depth": 1,
          "replies": [
            {
              "id": "ll3g7j9",
              "score": 1,
              "body": "Makes sense. I’m all in treasuries now too.  I’ll follow Buffet.  I know I won’t make as much as him but I’ll be just fine.  I don’t need that much. I’ve got a 30 year military pension.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3g7j9/",
              "created": 1725248866,
              "depth": 2,
              "replies": [
                {
                  "id": "ll3m8ds",
                  "score": 1,
                  "body": "I'm holding a lot of large cap value/defensive but when I took profits on one of my financials last month a lot of it went into a treasury ETF.\n\n\nA significant crash will hurt but we can't say for sure when that's happening. While the P/E on tech is pretty high that isn't true for all stocks",
                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3m8ds/",
                  "created": 1725251877,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll3za6s",
                      "score": 1,
                      "body": "Predicting markets is a fools errand!  However, looking at historically high stock valuations and locking in profits is smart. Thats what Buffet is doing.",
                      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3za6s/",
                      "created": 1725259338,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ll2wui0",
      "score": 1,
      "body": "The only index ETF I would own are the s&p500 equal weighted ones EQL.TO or RSP. Also I would own XIC.TO since Canada's population has grown quicker than usual but has not yet been reflected in the top firms of my country. This is most likely due to inflation which is going to result in Trudeau losing the next election. I don't believe wages will increase but rather that the cost of living (rent) will decrease and the extra cash will be spent on goods and services.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll2wui0/",
      "created": 1725240618,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3c8rb",
      "score": 1,
      "body": "I have an alternate question.  Why is the PE ratio so different on every site.  Below is WSJ, there are also yahoo, I dont' think yahoo update the EPS regularly, they just use past EPS in associate with the current price.\n\nNote during pendemic WSJ says PE ratio of nasdaq is at 40, and currently it is at 31.  So the PE ratio of nasdaq and S&P500 is much lower than before.  \n\n[https://www.wsj.com/market-data/stocks/peyields](https://www.wsj.com/market-data/stocks/peyields)",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3c8rb/",
      "created": 1725247026,
      "depth": 0,
      "replies": [
        {
          "id": "ll3dkv8",
          "score": 1,
          "body": "Huh. Didn't know that.\n\nBut regarding pandemic - that high PE was most likely because earnings dropped due to lockdown. But was then supported against collapse by the money printers around the world.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3dkv8/",
          "created": 1725247632,
          "depth": 1,
          "replies": [
            {
              "id": "ll3ix9z",
              "score": 2,
              "body": "i think qqq is at 214 at start of 2020, qqq is at 400 at the end of 2022.  it go up massively pretty much double in 2 years.  \n\n\nMore insanely is arkk go from 50 to 150 in 14 month.\n\n\ntech is having a massive bubble.  which significantly affect S&P500 since tech is half of S&P500.\n\n\nI think it's more because tech is doing insanely well during the pandemic because internet company amazon, microsoft, meta have signifantly higher usuage rate because every one is using more internet at home.  And there is chip shortage so price of semiconductor keeps going up.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll3ix9z/",
              "created": 1725250188,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll417hc",
      "score": 1,
      "body": "I'd be curious to see how much of this is driven by Amazon, Microsoft, and Nvidia, all of whom trade at very high P/E multiples for their own reasons, most of them understandable.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll417hc/",
      "created": 1725260546,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll5mofl",
      "score": 1,
      "body": "Also worth looking at [this](https://www.currentmarketvaluation.com/models/buffett-indicator.php)",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll5mofl/",
      "created": 1725289631,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll8b3df",
      "score": 1,
      "body": "It's not at 40 yet",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll8b3df/",
      "created": 1725322856,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llvngtm",
      "score": 1,
      "body": "  The dollar is being debased faster than earnings can grow. So the \"P\" is growing faster than the \"E\". The debasement is cause by increasing the money supply through QE, rate cuts and special programs. This is set to pick up pace in the coming years so PE's will continue to climb.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/llvngtm/",
      "created": 1725666759,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll1iq0n",
      "score": 1,
      "body": "Infinite growth requires speculating further and further into the future. So, it’s 29 now, but 10 years from now it will be 80.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1iq0n/",
      "created": 1725221957,
      "depth": 0,
      "replies": [
        {
          "id": "ll1l601",
          "score": 2,
          "body": "I don't follow. If companies grow infinitely, their earnings should grow proportionally and PE should remain reasonable.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1l601/",
          "created": 1725222782,
          "depth": 1,
          "replies": [
            {
              "id": "ll1s6it",
              "score": 5,
              "body": "Real Earnings are less important to stock price than predicted future earnings. Markets are forward looking and highly speculative.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1s6it/",
              "created": 1725225140,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll1ixm5",
      "score": 1,
      "body": "Nothing-more and more people are participating in the market so the price to earnings ratios will inflate",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1ixm5/",
      "created": 1725222029,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll1y2rt",
      "score": 1,
      "body": "It’s because of inflation. The dollar is devalued so equities rise",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll1y2rt/",
      "created": 1725227204,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll13hhe",
      "score": 0,
      "body": "I don't even know what pe ratio means in layman's terms",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll13hhe/",
      "created": 1725216791,
      "depth": 0,
      "replies": [
        {
          "id": "ll14hkf",
          "score": 3,
          "body": "Price to earnings. It used to be the key indicator but it doesn’t seem to apply as well to tech and other emerging industries (last 30 yrs) imo. But it still hangs over everyone and has a place in DD",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll14hkf/",
          "created": 1725217131,
          "depth": 1,
          "replies": [
            {
              "id": "ll25xi2",
              "score": 1,
              "body": "> It used to be the key indicator but it doesn’t seem to apply as well to tech and other emerging industries (last 30 yrs) imo. \n\nIt does apply. The amount of money that a company can earn is the be-all and end-all of its purpose.\nIt's just that for the companies that grow very rapidly, you don't simply use the last year's earnings - there's always a \"yes but next year their earnings will be 40% higher so this price is fine\". But it's still PE under the hood.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll25xi2/",
              "created": 1725230091,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll14vco",
              "score": 1,
              "body": "What's the ideal pe? 1?",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll14vco/",
              "created": 1725217259,
              "depth": 2,
              "replies": [
                {
                  "id": "ll15trt",
                  "score": 1,
                  "body": "It used to be anything below 20 is a solid p/e. I don’t really know anymore. But negative P/e (or some brokers just show 0 or null) isn’t a good sign (but can also not be a terrible sign either) because it means the company is not profitable. Again, biotech/tech this may not be a huge knock on a company because there’s a good chance the company is putting their profits back into R&D",
                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll15trt/",
                  "created": 1725217584,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ll14n59",
          "score": 2,
          "body": "It is ratio of price of a stock to its annual earnings per share. If it is 1 - then if you buy the stock on Jan 1, then by the end of the year you get your money back (not literally, but if the company gave out 100% dividend). So higher it is, longer it takes to reach its current valuation (so more risk). That's how I understand it.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll14n59/",
          "created": 1725217181,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll20e0z",
      "score": 0,
      "body": "Why would you expect companies to trade at a historical average?",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll20e0z/",
      "created": 1725228054,
      "depth": 0,
      "replies": [
        {
          "id": "ll21ghh",
          "score": 3,
          "body": "Because PE is ratio. Stock price is tied to its earnings. So if earnings don't increase, eventually the price has to be corrected. Of course, we all as a society could have become more risky and decide PE of 30 is a safe investment. But until that is not certain, I expect the PE ratio to remain largely around the average of 15-20. Look at Google, as soon as it started getting treated as a value company its PE reduced and is now at 23. So either entire SP 500 is going to grow at 20-30% rate (and more than Google) or they are overvalued.",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll21ghh/",
          "created": 1725228447,
          "depth": 1,
          "replies": [
            {
              "id": "ll28bna",
              "score": 3,
              "body": "You don't think the relationship between earnings and price for modern companies like, say, Nvidia which is growing EPS at 50% on high margins might be different to some historically average company growing earnings at 10% on low margins?\n\nI'm struggling to understand why you'd think that?",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll28bna/",
              "created": 1725230991,
              "depth": 2,
              "replies": [
                {
                  "id": "ll29e2k",
                  "score": 3,
                  "body": "Because I'm talking about ratio of Sp 500. It contains 500 companies and the PE ratio is their average. So it is difficult for me to believe that we have 500 companies that are expected to grow at record pace never seen in history. You are saying \"this time it is different\". You could be right and we are actually in a big boom matching dot com bubble (but with no actual bubble). I actually don't know and we'll see in time what happens. I am still investing since I know I can't time the market.",
                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll29e2k/",
                  "created": 1725231399,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll2c54b",
                      "score": 2,
                      "body": "Do you not think that companies get better over time? The quality of the contents of the S&P500 today are equivalent to 50 years ago in your eyes? Buying MSFT is the same as Kodak to you?\n\nDo you think it is easier or harder to grow earnings when margins are higher? \n\nDo you think software companies are better able to increase earnings than industrials?\n\nWhy would historic PEs be relevant?",
                      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll2c54b/",
                      "created": 1725232455,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ll2fghf",
                          "score": 2,
                          "body": "Idk why you are commenting this way. If you disagree, then tell that and state why. I posted it as a discussion as I found it interesting irrespective of what it means since we have metrics reaching historical extremes. You are arguing \"this time its different\" and that's fair. But please tell that instead of this strange \"Why would you...Do you .... You don't think ...\".\n\nBtw, the Shiller PE (CAPE) crossed 36 in April 2021. 6 months later we got 20% drop in SP 500. CAPE right now is 36.5. Things may be different now but these are more than just random numbers and it is intetersting talk about why things are the way they are.",
                          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll2fghf/",
                          "created": 1725233735,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ll2gn1p",
                              "score": 2,
                              "body": "Because just telling someone why they are wrong on the internet does not work. It just makes them double down on their incorrect reasoning.\n\nYou have to lead them to the answers and make them think they worked it out themselves. It's not particularly interesting to look at historic PE averages, they are meaningless in terms of valuing companies today in the same way you wouldn't use them to value pre-industrial companies. \n\nIf you can figure out the answers to the questions I've asked you, you'll learn why. \n\nHere's another one - do you think that the CAPE value crossing 36 in 2021 caused valuations to drop, or was there some huge change in the macroeconomic environment that shifted the risk-free rate, and consequently, valuation time horizons away from long duration assets?",
                              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll2gn1p/",
                              "created": 1725234199,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ll2is7v",
                                  "score": 2,
                                  "body": "Again - no direct answer lol. You do you and think so highly of yourself. Maybe if you actually took time to give a nice answer people of the internet might listen to you. There are so many other comments here who actually explained what could be going on within these ratios.\n\nHave a good day!",
                                  "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll2is7v/",
                                  "created": 1725235030,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ll2jyn3",
                                      "score": 0,
                                      "body": "So they explained it, and you still don't understand? Doesn't sound like it worked, does it?\n\nThe answers are there if you care to take the time to learn.",
                                      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll2jyn3/",
                                      "created": 1725235497,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ll24zf0",
      "score": 0,
      "body": "I like the stock",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll24zf0/",
      "created": 1725229747,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll29j41",
      "score": 0,
      "body": "I hear you on the PE ratios, but I think it's a bit more nuanced. The overall market's PE looks sky-high, but if you strip out the big tech giants, the picture changes quite a bit. Those mega-cap tech stocks have such a massive impact on the index because they're trading at much higher multiples due to their growth potential and reinvestment strategies.\n\nIf you look at the S&P 500 without the heavy hitters like Apple, Microsoft, Amazon, etc., the multiple drops down to a more reasonable range—around 16x. That's not exactly dirt cheap, but it's definitely more in line with historical averages and offers a better risk premium compared to the 10-year Treasury yield.\n\nBig tech is in its own league right now. Investors keep throwing money at them because they believe in the long-term growth story and are willing to pay up for it. Sure, it adds a lot of weight to the index and skews the overall PE higher, but unless sentiment shifts drastically, they’re likely to keep getting that kind of love from the market. So, yeah, the PE looks high, but there’s more to the story when you dig a little deeper.",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll29j41/",
      "created": 1725231453,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll2c0ed",
      "score": 0,
      "body": "How did the market perform from the 2000s crash until today?",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll2c0ed/",
      "created": 1725232404,
      "depth": 0,
      "replies": [
        {
          "id": "ll679di",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll679di/",
          "created": 1725296391,
          "depth": 1,
          "replies": [
            {
              "id": "ll69kwv",
              "score": 1,
              "body": "100% \n\nThat's why assett allocation is THE most important aspect of long term investing. I like the adoption of a target date style approach, bur since I'm handling myself, I'll be in 100% equity until 10-15 years before I retire at which time I'll introduce stability oriented investments gradually until I have enough stability to pull my yearly percentage for 15 years.",
              "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll69kwv/",
              "created": 1725297153,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll55nsr",
      "score": 0,
      "body": "I heard somebody asking the same question like four years ago. I don't feel like the historical average is a good metric to be keen on",
      "permalink": "/r/stocks/comments/1f6lno8/what_do_you_guys_think_about_the_current_pe_ratio/ll55nsr/",
      "created": 1725283602,
      "depth": 0,
      "replies": []
    }
  ]
}