{
  "title": "Acadia Healthcare is holding patients against their will to increase insurance payouts: NYT",
  "score": 75,
  "selftext": "Acadia Healthcare (NASDAQ:ACHC), one of the largest operators of behavioral health centers in the U.S., is holding people against their will to maximize insurance payouts, alleged a New York Times report on Sunday.\n\nIn at least 12 of the 19 states where Acadia (ACHC) operates psychiatric hospitals, dozens of patients, employees and police officers have notified authorities that the company was detaining people in ways that broke the law, the report stated, citing records.\n\nIn a statement to Seeking Alpha, the company called the report's assertions inaccurate.\n\nAccording to the report, some patients who came looking for routine mental health care found themselves sent to Acadia (ACHC) facilities and locked in.\n\nThe company used laws meant for people who pose an immediate danger to themselves to hold patients who appeared not to have met those legal standards, the report added, citing records and interviews.\n\nThe report alleged that Acadia (ACHC) held patients for financial reasons rather than medical ones.\n\nAcadia (ACHC) utilizes a number of strategies to convince insurers to pay for longer stays, the report said, citing employee interviews.\n\n\"Acadia has exaggerated patients’ symptoms. It has tweaked medication dosages, then claimed patients needed to stay longer because of the adjustment. And it has argued that patients are not well enough to leave because they did not finish a meal,\" the New York Times alleged. \"Unless the patients or their families hire lawyers, Acadia often holds them until their insurance runs out.\"\n\n\"Decisions on patient care, including how long treatment may be necessary, are never business decisions made by the Company,\" said Acadia (ACHC). \"The characterization of the few historic cases cited does not represent all facts influencing complex medical decisions made by multi-disciplinary teams led by psychiatrists.\"",
  "link_flair_text": "Discussion",
  "id": "1f6xi01",
  "num_comments": 42,
  "created_utc": 1725249475,
  "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/",
  "comments": [
    {
      "id": "ll3hhmc",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 36 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3hhmc/",
      "created": 1725249478,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3nrht",
      "score": 73,
      "body": "They aren't the only ones doing this kind of thing. Lot of rehab places act like this while being garbage at actual rehab, they're basically just insurance payment imprisonment mills.",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3nrht/",
      "created": 1725252687,
      "depth": 0,
      "replies": [
        {
          "id": "ll3ppn4",
          "score": 13,
          "body": "Came here to say exactly this",
          "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3ppn4/",
          "created": 1725253735,
          "depth": 1,
          "replies": [
            {
              "id": "ll6b91i",
              "score": 4,
              "body": "Feels like insurance/healthcare paradigm is starting to implode compounded with qualified resources issues.",
              "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll6b91i/",
              "created": 1725297704,
              "depth": 2,
              "replies": [
                {
                  "id": "ll6me5v",
                  "score": 3,
                  "body": "It's almost impressive the degree to which literally every facet of the US healthcare industry is a scam, like your job keeps you chained with insurance so you have the privilege of not paying $500 for a bandaid or $1000 for a cavity, but then oh one day you need to take advantage of these inpatient services because all your life you've heard \"help is available!!\" welp yeah that's not really what these services actually exist for but have fun figuring that out in your cage till the money runs out... then when you can't work anymore the only value you have to society is as another body in a bed to be abused by nursing homes or palliative care, like damn maybe we should just send people into the woods to not be a burden since that would objectively be more efficient and less cruel than typical US healthcare (I guess that'll be the solution when the whole system collapses and the most demonic healthcare and insurance providers will invariably get a cushy bailout since no one could have foreseen this)",
                  "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll6me5v/",
                  "created": 1725301396,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ll6bn5n",
                  "score": 1,
                  "body": "How long can insurance companies stay solvent while providers rape them",
                  "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll6bn5n/",
                  "created": 1725297833,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ll3pnuq",
      "score": 36,
      "body": "Old peoples homes have been doing this shit for decades. Then they fear monger when you try to take your loved ones home by saying \"if anything happens to them you could be found criminally negligent.\"",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3pnuq/",
      "created": 1725253708,
      "depth": 0,
      "replies": [
        {
          "id": "ll3pyyt",
          "score": 12,
          "body": "Grandma Joe always said it was a racket. A racket I tell ya.",
          "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3pyyt/",
          "created": 1725253876,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll3vfnc",
      "score": 11,
      "body": "Working in psych, I have learned that private, for profit psych hospitals are good at holding people until the insurance stops paying and not a second longer.",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3vfnc/",
      "created": 1725257004,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3hokn",
      "score": 20,
      "body": "Bullish",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3hokn/",
      "created": 1725249572,
      "depth": 0,
      "replies": [
        {
          "id": "ll3i3ew",
          "score": 14,
          "body": "Medieval psychos increasing revenue at all costs.",
          "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3i3ew/",
          "created": 1725249775,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll3t7am",
      "score": 5,
      "body": "Atrium doing similar. Except they hold babies. And drag checkout time as long as possible to bill you $300/hr room fee.",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3t7am/",
      "created": 1725255694,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3k5rf",
      "score": 4,
      "body": "Id say bearish tbh...\n\nNYT talking about you is not thaaaaat bullish...\n\nIt can be ... But I dunno... Maybe not this time?",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3k5rf/",
      "created": 1725250808,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3vavi",
      "score": 4,
      "body": "I been too a few mental homes OSU was the best but literally if you breathe wrong they will hold you longer once you there it’s at they discretion to let you go might have been because I was minor for most of those visits but it’s not just them that does that honestly",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3vavi/",
      "created": 1725256925,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll58biv",
      "score": 5,
      "body": "Fair oaks thought they could hold me in 92’. Such an insurance scam.  I was not a threat to myself or others which in nj was the main criterion for involuntary commitment.  Broke out 2x .  ",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll58biv/",
      "created": 1725284612,
      "depth": 0,
      "replies": [
        {
          "id": "ll6t6t1",
          "score": 2,
          "body": "I wonder, how does this work? In case you break out of a jail/prison, the police is going to come after you. Once you break out of a rehab, do they ask the police to bring you back by force? Or are you simply free, until the next time you somehow come back voluntarily (or a family member takes you there)?",
          "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll6t6t1/",
          "created": 1725303687,
          "depth": 1,
          "replies": [
            {
              "id": "ll6tpue",
              "score": 3,
              "body": "I was brought back by police 1 time.  The second time, I hid until my 18th birthday.",
              "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll6tpue/",
              "created": 1725303868,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll4ovaa",
      "score": 3,
      "body": "I’m surprised those facilities haven’t burned to the ground yet.",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll4ovaa/",
      "created": 1725276067,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll5l6nl",
      "score": 3,
      "body": "I work in the treatment industry. Specifically in business development. There are good programs out there BUT working for a company that is founded by investors, or owned by PE, or god forbid publicly traded makes you feel disgusting. \n\nI've seen good reputable programs get absorbed by a larger corporation, feel increased pressure to increase census from executives while cutting staff, and people literally die (suicide) as a result. \n\nIt's hard to feel good about yourself in this industry but the drive to get admissions at all costs is so normalized that most people for the most part don't think twice. The difficult part is that some programs do do good and life changing work but the entire industry hides behind that veneer. My LinkedIn is disgusting, lol. \n\nSomeone figured out that a cookie cutter group therapy model (CBT, DBT, Seeking Safety etc) run by associate therapists (new grads, not fully licensed) is incredibly profitable and they've proliferated. Especially with how normalized MH care is these days and increased reimbursements from insurance. LOTS of shitty programs out there. Very unfortunate.",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll5l6nl/",
      "created": 1725289129,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll6w992",
      "score": 2,
      "body": "The article talks about how mental facilities have become \"for-profit\" once the government pulled out which is when the problems begin. And this is the same exact case with prisons becoming private, aka \"for-profit\". Not much difference between our prison system & mental health system. And these large corporations, especially those publicly traded, will do whatever it takes to keep the $$$ rolling in.",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll6w992/",
      "created": 1725304742,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll5dqhv",
      "score": 2,
      "body": "I did some analysis on data from a major New York City area hospital.  For fun I did a simple histogram to show what TIME was the most common for someone to be let out of the hospital.  The answer was... 4:05pm\n\nWhy 4:05pm?  Because the medicare rules say that if someone is there after 4pm the hospital can bill medicare for another night's care.   So they COULD let the patients go at 11am, but they keep them there until 4:05pm. \n\nGet the government the FUCK out of healthcare.",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll5dqhv/",
      "created": 1725286587,
      "depth": 0,
      "replies": [
        {
          "id": "ll5n3tt",
          "score": 8,
          "body": " the article in the OP has nothing to do with government. we need to take the profit out of healthcare.",
          "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll5n3tt/",
          "created": 1725289777,
          "depth": 1,
          "replies": [
            {
              "id": "ll5x4ec",
              "score": 0,
              "body": "OP did not use the word \"government\".  Does NOT mean the US government isn't running large chunks of US healthcare, in a very corrupted manner.  We need to take the CORRUPTION out of US health care.  I don't care if my doctor makes a profit. I DO CARE if my tax money is stolen from me and given to a hospital that is forcing patients to stay longer so they make more money.   If the payment was coming from the sick person, they would have an incentive to demand to get out of the hospital.   Instead, the person paying (me and my tax money) is removed from the picture.  Everyone in the system grifts and games it... to extract as much as possible.   \n\nAcadia gets most of their money from the US government.   So it is a government/corruption problem.",
              "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll5x4ec/",
              "created": 1725293072,
              "depth": 2,
              "replies": [
                {
                  "id": "ll6nbry",
                  "score": 3,
                  "body": "Literally every other industrialized country on earth manages just fine compared to the US with a lot more government in their healthcare--the problem here is that it's legal for the profiteers to bribe the lawmakers, and it's legal for the lawmakers to invest in the profiteers... what possible incentive is there to improve anything?",
                  "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll6nbry/",
                  "created": 1725301712,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ll98o5h",
          "score": 1,
          "body": "This isn't an issue with the government being in healthcare, the issue is that business types are running healthcare and trying everything possible to maximize profits.  \"Getting the government out of healthcare\" won't solve anything at all, it'll just change the rules of the game a little while new monetization schemes are figured out.  At the end of the day, the core issue is greed.  Good luck trying to punish that greed if a governing body isn't allowed to do so though.",
          "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll98o5h/",
          "created": 1725336604,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll3my6b",
      "score": 1,
      "body": "more cash flow! bullish!",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3my6b/",
      "created": 1725252257,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3ndqn",
      "score": 1,
      "body": "Puts",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3ndqn/",
      "created": 1725252484,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll4qr98",
      "score": 1,
      "body": "So John Q but in reverse? Whoa! Just when i thought i had seen it all",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll4qr98/",
      "created": 1725277064,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll8awll",
      "score": 1,
      "body": "that should be illegal! how is it not?",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll8awll/",
      "created": 1725322786,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll8nxvr",
      "score": 1,
      "body": "Puts?",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll8nxvr/",
      "created": 1725327788,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llnv57x",
      "score": 1,
      "body": "Happened to me - the tech confided me in that because I was reading books in my room instead of eating snacks in the common area, it was a strike against me",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/llnv57x/",
      "created": 1725558474,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3kxqv",
      "score": 1,
      "body": "Hmm. Seems like San Francisco needs Acadia",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3kxqv/",
      "created": 1725251205,
      "depth": 0,
      "replies": [
        {
          "id": "ll3l99z",
          "score": 5,
          "body": "That would probably make it worse because once the insurance company refuses coverage. They'll just dump them on the streets traumatized.\n\nPlus they are committing insurance fraud if these allegations are accurate.",
          "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3l99z/",
          "created": 1725251368,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll3qqng",
      "score": 1,
      "body": "Should watch. I care a lot. Good movie",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3qqng/",
      "created": 1725254305,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3w5en",
      "score": 1,
      "body": "And big pharma spends 20bn$ on ads per year to sell you addictive pills that'll sort of help you with your diseases caused by the garbage food industry that also spends billions in ads to sell you their crap. Then, they tell you it's a \"you\" problem and send you to a mental hospital where they won't let you leave so they can charge more.\nIt's the circle of life and you're the eternal prisoner-cash-cow.",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3w5en/",
      "created": 1725257433,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll4xm1h",
      "score": 1,
      "body": "No f*ing way. Oh man they gonna get sued into oblivion...",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll4xm1h/",
      "created": 1725280330,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3kqjv",
      "score": 0,
      "body": "Investors do not care about company ethic, bullish",
      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3kqjv/",
      "created": 1725251102,
      "depth": 0,
      "replies": [
        {
          "id": "ll3lfn2",
          "score": 5,
          "body": "Ethics? No. But that’s a massive liability. Class action lawsuits and potential criminal charges for all involved. Bearish.",
          "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3lfn2/",
          "created": 1725251460,
          "depth": 1,
          "replies": [
            {
              "id": "ll3mf39",
              "score": -1,
              "body": "Verbal persuasion can be interpreted as medical concern or suggestion. Hard to make a case.",
              "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3mf39/",
              "created": 1725251977,
              "depth": 2,
              "replies": [
                {
                  "id": "ll3n973",
                  "score": 4,
                  "body": "Not if the insurance companies feel they are being ripped off for having to cover unnecessary treatment. The insurance fraud aspect isn't bullish. I would say even the insurance company has grounds for restitution.",
                  "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3n973/",
                  "created": 1725252416,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll3npc0",
                      "score": 2,
                      "body": "still wouldn't bet on a put. Got hit hard from BA, learnt that defamation is priced-in for some corps",
                      "permalink": "/r/wallstreetbets/comments/1f6xi01/acadia_healthcare_is_holding_patients_against/ll3npc0/",
                      "created": 1725252656,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}