{
  "title": "My best year ever",
  "score": 372,
  "selftext": "I sold a bunch of positions into cash lately to protect my gains. And wanted to take a step back and appreciate the growth this year\n\nMy biggest trades that moved the needle:\n\n- Owning GBTC, CLSK, and ETHE since mid 2023. Sold them all right before their respective ETFs got approved.\n\n- Bought March monthly SMCI calls on Feb 27, sold March 4 after SMCI popped 20% when it was announced over the weekend that it was being added to S&P500. That put position went from $1.3k to $16k. This also marked the local top you see back in March. Proceeded to degen more on AI and got chopped up, leading to 5 month consolidation valley you see\n\n- shorted $62k worth of NVDA, AMD, and QQQ Aug 1, then Japan announced some scary nothing burger and I made $45k profit. Combo of puts and shares. This lead to the recent breakout\n\nCurrent positions: \n- 65% in cash looking for dip. \n\n- 35% in shares/options of TSLL, MSTR, IBIT, CXAI, SOUN, CHPT, INBX, VINC",
  "link_flair_text": "Gain",
  "id": "1f6xj6f",
  "num_comments": 56,
  "created_utc": 1725249584,
  "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/",
  "url_overridden_by_dest": "https://i.redd.it/huw23vbskbmd1.jpeg",
  "comments": [
    {
      "id": "ll3hprj",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 11 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3hprj/",
      "created": 1725249589,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3jmhs",
      "score": 152,
      "body": "https://preview.redd.it/fnfp4y6mnbmd1.jpeg?width=1179&format=pjpg&auto=webp&s=fb85b2af719473f21b3ae2b08c2b543f5c41f5ad",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3jmhs/",
      "created": 1725250538,
      "depth": 0,
      "replies": [
        {
          "id": "ll8vdqe",
          "score": 2,
          "body": "Nice flair",
          "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll8vdqe/",
          "created": 1725330697,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll3q626",
      "score": 47,
      "body": "Now put it all down literally on SPY agent",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3q626/",
      "created": 1725253984,
      "depth": 0,
      "replies": [
        {
          "id": "ll3stmh",
          "score": 24,
          "body": "Think there’s much more upside in SPY with it being up 20% YTD already? Compare that to holding cash for risk free 5%? \n\nI’d probably prefer cash or selling super OTM puts on stocks I like to either collect ~2-5% per month in premium or buy them at very discounted prices if they crash",
          "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3stmh/",
          "created": 1725255474,
          "depth": 1,
          "replies": [
            {
              "id": "ll3tpp8",
              "score": -6,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3tpp8/",
              "created": 1725255992,
              "depth": 2,
              "replies": [
                {
                  "id": "ll3tza9",
                  "score": 14,
                  "body": "SPAXX’s 7-day yield is 4.96%.",
                  "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3tza9/",
                  "created": 1725256147,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll3w5x0",
                      "score": 8,
                      "body": "Looks like the cash in my Fidelity goes into FDRXX which is also 5.00% 7 day yield",
                      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3w5x0/",
                      "created": 1725257442,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ll3u1el",
                  "score": 5,
                  "body": "Cash gets sweeped into money markets which are yielding around 4.5-5% APR",
                  "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3u1el/",
                  "created": 1725256182,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll5n89a",
                      "score": 1,
                      "body": "If over 100k FZDXX yield is 5.16",
                      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll5n89a/",
                      "created": 1725289820,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ll3yxju",
                      "score": 1,
                      "body": "Nice, thanks",
                      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3yxju/",
                      "created": 1725259118,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ll3j86d",
      "score": 32,
      "body": "Badass my friend. Nearly half way to a milli.💪 \n\n*Que lil Wayne - a milli. Mothafucka I’m ill.",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3j86d/",
      "created": 1725250338,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3oymf",
      "score": 9,
      "body": "Nice fucking job.",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3oymf/",
      "created": 1725253326,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3yi3k",
      "score": 21,
      "body": "sometimes i just wanna have somebody tell me exactly what to invest in and not do any research 😂",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3yi3k/",
      "created": 1725258851,
      "depth": 0,
      "replies": [
        {
          "id": "ll3zbql",
          "score": 35,
          "body": "Have you heard of Nancy Pelosi and Inverse Jim Cramer? 😂",
          "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3zbql/",
          "created": 1725259364,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll4f46c",
          "score": 7,
          "body": "I mean that’s literally what financial advisors do essentially. \n\nBut you’ll never see gains like this.",
          "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll4f46c/",
          "created": 1725269931,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll5jbai",
      "score": 5,
      "body": "Why you lose those $3. 3 dollaaaaa",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll5jbai/",
      "created": 1725288505,
      "depth": 0,
      "replies": [
        {
          "id": "ll8w3fe",
          "score": 2,
          "body": "Theta decay",
          "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll8w3fe/",
          "created": 1725330990,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll43tjn",
      "score": 4,
      "body": "I only see red here mate",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll43tjn/",
      "created": 1725262231,
      "depth": 0,
      "replies": [
        {
          "id": "ll45ol7",
          "score": 2,
          "body": "You’re not wrong",
          "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll45ol7/",
          "created": 1725263489,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll4ag9x",
      "score": 5,
      "body": "Share your strategy please",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll4ag9x/",
      "created": 1725266731,
      "depth": 0,
      "replies": [
        {
          "id": "llbs7u4",
          "score": 3,
          "body": "I don’t believe any one strategy is better than another. I’ll share my indicator stack and my favorite setups at the end but I first will share something I think is far more important: Home Court Advantage\n\nI only trade in market conditions where I have “home court advantage”. Everyone trades better in certain market conditions and worse in others. But MOST people don’t think about identifying which conditions they’re better in. So they’ve been training to be professional snipers and don’t realize they’re trading in a close-range gang shoot out.\n\nDon’t be someone who trades every week of the year and expects the market to stay the same or “you’re good enough” to consistently win in all conditions. Every successful professional trader I know specializes. Maybe it’s only day trading SPX first 30-60 minutes of the day, or only trading one sector, or only trading when VIX gets above a certain level. \n\nSo my main home court is pre-earnings season. About 1 month prior to the big tech earnings season. this means I only trade about 4-6 months a year. Sometimes I skip a season too. A perfect cadence for swing trading and trade/life balance.\n\nWhy this season for me? I find that earnings are the only medium term, consistent event in stocks we can count on happening at a regular cadence. That is a very rare characteristic to have when operating in a random market. Nothing in the markets are predictable, except we KNOW earnings will bring about high volatility and attention. And the month leading up to that is always going from lower vol to higher vol conditions. This is the sweet spot I’ve found myself performing best in\n\nFind your home court. \n\nMy indicator stack is simple:\n\n- 20, 50, 200 SMA\n- TTM Squeeze indicator\n- Volume profile\n- RSI\n- MACD\n\nAgain, I believe every indicator is just a tool and one is not better than another. They’re just better for different conditions and trading styles\n\nSetups:\n\n- I like to enter trades during a time of sideways consolidation. This is identified by the Squeeze indicator. When a stock is “squeezing” sideways on multiple time frames, it’s even better. The longer the squeeze, the larger the subsequent move. The direction I take depends on my assessment of the trend and market conditions. During pre-earnings periods, it’s usually going long these days.\n\n- Fallen Angels. Finding Stocks in a LTF downward trend that for some reason gap DOWN again in total capitulation. I then wait for these to go sideways for months, and everyone has dumped in total panic and despair. They’ve forgotten about it. And then wait for the SMA’s and volume to give me a trigger to enter near the bottom and set a stop loss below the All time low. Also monitor if insiders begin to buy. \n\n- short term, basic reversal trades at key resistance or support areas. For example if a stock or index hits its 50 month or 200 week moving averages with speed. That’s usually an easy put I can sell for a relatively quick win. (Not buying calls, I’d stick to selling puts for something like that)\n\nOr another example would be shorting stocks in the same sector where several tickets are all hitting SMA resistances like AMD and NVDA did August 1st. These are MEANT to be base hits. Sometimes it’s a home run outta no where like my Aug 1st NVDA trade but normally I just expect like a 10-20% gain\n\nThat’s about it. It’s pretty boring and simple with complexities due to my personal style. \n\nI mentor a few folks as a side gig (nothing extravagant) and usually when I try to teach them my style, it doesn’t work. But it at least gives them a framework to work off of. Long term, I’m just helping them get smaller, simpler, and more specialized in their trading. When you get more specialized, your volume of trades lowers but the quality of your trades sky rockets\n\nBest of luck!",
          "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/llbs7u4/",
          "created": 1725380756,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll5qa1p",
          "score": 3,
          "body": "Gamble",
          "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll5qa1p/",
          "created": 1725290829,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll5yck3",
          "score": 5,
          "body": "You are literally better off picking options based on pure luck than you are asking for advice from anyone here",
          "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll5yck3/",
          "created": 1725293474,
          "depth": 1,
          "replies": [
            {
              "id": "ll69vtc",
              "score": 2,
              "body": "should ask the magic 8 ball at this point!",
              "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll69vtc/",
              "created": 1725297254,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll60nyp",
              "score": 1,
              "body": "I hear you but probably not",
              "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll60nyp/",
              "created": 1725294234,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll6e8m0",
      "score": 2,
      "body": "You're both good and lucky. Must be single, no way you strike out 3 times!",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll6e8m0/",
      "created": 1725298691,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llaa0hs",
      "score": 2,
      "body": "CHPT is interesting. Would like to know your thoughts if you have time.",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/llaa0hs/",
      "created": 1725359904,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll43382",
      "score": 4,
      "body": "Those surges in beginning and mid 2024 are ecstatic.",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll43382/",
      "created": 1725261744,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3qp7b",
      "score": 2,
      "body": "![img](emote|t5_2th52|27189)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|27189)",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3qp7b/",
      "created": 1725254282,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3z5jf",
      "score": 2,
      "body": "Teach me sensei, give me the foresight",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3z5jf/",
      "created": 1725259258,
      "depth": 0,
      "replies": [
        {
          "id": "ll44bjn",
          "score": 35,
          "body": "The best “advice” I can give is to read Trading in the Zone. Best book that changed the trajectory of my trading. It helped me understand that the key to success in trading is ALL psychological. \n\nThe secret to success in trading is not having a trading plans, being smarter or working harder. It is in getting to a mental maturity level where you can actually follow your trading plan, and where you know when to take yourself out of the game in order to protect your portfolio from yourself\n\nI have been trading for 14 years and I haven’t been consistently profitable until after the 10 year mark.  I’m maybe a little more intelligent now than I used to be. The biggest difference is my maturity now compared to before.\n\nI have learned to identify when I’m not in the right mindset to trade well and make good decisions. I force myself to stop trading or lower my position sizes when I’m too excited, confident, regretful, or sad about buying a dip that keeps dipping. \n\nAnd I can also tell when I am in a good mindset to make big conviction bets. \n\nThese are all subtle things I had to learn about myself over 10,000 hours of failing/mediocrity/round tripping. It’s not something I can teach you bc every human reacts to external stress and their emotions differently\n\nI’m not saying we should be “unemotional” either. That’s a fallacy. We are humans and we cannot just stop feeling things. We can only control our actions and change our environment so that we are in the best mental state for success. \n\nTLDR: Give the book a read. Therapy > trading course",
          "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll44bjn/",
          "created": 1725262565,
          "depth": 1,
          "replies": [
            {
              "id": "ll4x4ps",
              "score": 6,
              "body": "I like Op. \n\nWell done.",
              "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll4x4ps/",
              "created": 1725280116,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll9o63t",
              "score": 3,
              "body": "Very interesting! & glad you’re doing great and stayed Persistent to see yourself profitable. Inspiring and encouraging story fr \n\nWill definitely give that book a read. Just out of curiosity, could you elaborate how you can tell you are in a good mindset to make big conviction bets? Does this mean you know when you are objectively/clearmindly analyzing a setup that has potential and decide the scale in? Just want to make sure I’m interpreting this correctly. \n\nI find it interesting that you prioritize a clear state of mind over finding great setups etc. very helpful advice \n\nThank you sensei *bows out of respect \n😆😆",
              "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll9o63t/",
              "created": 1725345394,
              "depth": 2,
              "replies": [
                {
                  "id": "llbe1je",
                  "score": 3,
                  "body": "For conviction bets: The main way is I take inventory of the things below:\n\n1. I did not have a big trade loss or profit in the last week or two. I gotta KNOW I’m not revenge trading to make up a loss or cocky trading after a recent win. After about a week, I’ve forgotten how much I made or loss and I’ve calmed down \n\n2. Ideally the last several trades I made were small or insignificant\n\n3. If the setup which I want to take a big conviction bet on is one I’ve been watching or keeping an eye out for a few weeks or months\n\n4. I don’t feel like I need to make this money (trading exclusively out of retirement accounts basically locks this in for me)\n\n5. I’m in a good place relationally with my wife\n\nThese are things specific to me and I wouldn’t say it’s necessary for anyone else. While it may seem unnecessarily cumbersome and silly, it’s what works for me. \n\nI do hear “what if the perfect setup happens when you’re in an argument? You’re just gonna skip it?”\nYes. I focus on the relationship bc that’s what matters more. \n\nBut this self-created rule maintains a balanced incentives system: \n\n- I wanna continue trading\n- So minimize arguments\n- In order to do that, I must learn to handle conflict better\n- In doing that - I must train myself to remain calm and controlled in my actions during times of stress and high emotions, \n- With that training, I also improve my ability to control actions trading\n- This usually leads to more profits",
                  "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/llbe1je/",
                  "created": 1725376166,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llfdnc8",
                      "score": 2,
                      "body": "Nice nice, I see. Was just curious about your process. Thanks for sharing man! Keep posting plz I wanna keep seeing your progress\n\nWish ya the best & no more arguments etc so you can zone in haha",
                      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/llfdnc8/",
                      "created": 1725429669,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ll6rcyw",
              "score": 5,
              "body": "Great advice. However, I think it may be wasted on most people in this sub, since all they seem to ask for is a TL;DR with buy/sell call/put on stock X, strike price Y, expiring on date Z.",
              "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll6rcyw/",
              "created": 1725303067,
              "depth": 2,
              "replies": [
                {
                  "id": "llfeh7r",
                  "score": 1,
                  "body": "Where do you think this would be less wasted? I’m not a heavy Reddit user",
                  "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/llfeh7r/",
                  "created": 1725430177,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llfssp3",
                      "score": 1,
                      "body": "Well, it is going to help a few people here. However, I feel that those, who need to change their mindset the most (the YOLO guys, who can afford to lose their savings the least) are also the least likely to read it, self-reflect and change. It is a bit ironic and sad at the same time.",
                      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/llfssp3/",
                      "created": 1725439968,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "llh192z",
                          "score": 2,
                          "body": "Believe me, I know. I know because I was one of them. Humans really are self destructive. \n\nAnd this is why I say with confidence that intelligence has nothing to do with successful training. It’s like finding love. You can be super smart but still terrible at picking who you date. \n\nMost ppl I explain this stuff to still keep doing whatever they want until they learn the hard way.\n\nI wish there was a way to upload the feeling of loss and regret from past mistakes into other ppl so they can speed run the maturity process. \n\nIt's kinda like how parents can't truly teach their teens to  understand heart break or betrayal. \n\nEveryone has to experience it themselves and we just hope they learn from the mistakes earlier than later",
                          "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/llh192z/",
                          "created": 1725460622,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "llbcfmc",
      "score": 1,
      "body": "You are the man!",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/llbcfmc/",
      "created": 1725375629,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llbipy7",
      "score": 1,
      "body": "Glorified gambling",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/llbipy7/",
      "created": 1725377684,
      "depth": 0,
      "replies": [
        {
          "id": "llbt972",
          "score": 1,
          "body": "No gamble no glory",
          "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/llbt972/",
          "created": 1725381092,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llbtorq",
          "score": 1,
          "body": "I’m an entrepreneur so I am quite comfortable with risk. Not just taking risk but managing it. Failed many more times than I’ve succeeded. I’m a professional get-back-upper",
          "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/llbtorq/",
          "created": 1725381232,
          "depth": 1,
          "replies": [
            {
              "id": "llbtw6p",
              "score": 2,
              "body": "Of course, i am happy for you while envious. Just remembered a quote from my finance professor, he used to call trading a glorified form of gambling",
              "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/llbtw6p/",
              "created": 1725381300,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll3o22i",
      "score": 0,
      "body": "Chill man, year ain’t over.",
      "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll3o22i/",
      "created": 1725252842,
      "depth": 0,
      "replies": [
        {
          "id": "ll6a2oq",
          "score": 1,
          "body": "this post is going to bite him in the arse!   \n\n\n!remindme 4 months",
          "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll6a2oq/",
          "created": 1725297316,
          "depth": 1,
          "replies": [
            {
              "id": "ll6a7gi",
              "score": 1,
              "body": "I will be messaging you in 4 months on [**2025-01-02 17:15:16 UTC**](http://www.wolframalpha.com/input/?i=2025-01-02%2017:15:16%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll6a2oq/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1f6xj6f%2Fmy_best_year_ever%2Fll6a2oq%2F%5D%0A%0ARemindMe%21%202025-01-02%2017%3A15%3A16%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201f6xj6f)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
              "permalink": "/r/wallstreetbets/comments/1f6xj6f/my_best_year_ever/ll6a7gi/",
              "created": 1725297359,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}