{
  "title": "Value investing in big companies",
  "score": 50,
  "selftext": "So according to Buffets philosophy, you should only buy undervalued businesses, and you can get a good idea of this depending on the P/E ratio and discounted cash flow analysis. However, from my understanding, if you carry out a DCF model on big companies such as Microsoft and Apple, it always suggests that the company is overvalued.\n\nHowever, these big companies have continued to rise significantly in price over the years.\n\nJust wondering anyone have any advice or correction on my knowledge?",
  "link_flair_text": "Rule 3: Low Effort",
  "id": "1f6z6ta",
  "num_comments": 47,
  "created_utc": 1725255467,
  "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/",
  "comments": [
    {
      "id": "ll3vke5",
      "score": 58,
      "body": ">However, from my understanding, if you carry out a DCF model on big companies such as Microsoft and Apple, it always suggests that the company is overvalued. \n\nIf you run the DCF analysis from 10 years ago to now, you'll find the prices (AAPL and MSFT) were fair to even below fair value. If you run it today, it's pretty hard to get the analysis to fit the stock price unless you start using ludicrously high growth rates (20+%)\n\nHowever, if you run it on GOOGL, you might find it sits around or even below fair value. I think the price difference is to do with how strong their moat is. MSFT has largely an impenetrable moat with many of their products. Windows won't be changed, Office is pretty hard to break, Azure would be hard to switch from etc. Google is a bit more vulnerable to competition, but YouTube is probably safe though.\n\nThe DCF can tell you abiut the money, but it won't tell you about the risks which are more qualitative and hard to put a price to.",
      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll3vke5/",
      "created": 1725257084,
      "depth": 0,
      "replies": [
        {
          "id": "ll74shw",
          "score": 5,
          "body": "This. DCF definitely is worth running for big companies. NVDA was a huge buy using DCF the last few September pullbacks. You just have to be comfortable with the forecasted years growth inputs. The qualitative decides that part.",
          "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll74shw/",
          "created": 1725307634,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll41lss",
      "score": 24,
      "body": "He's a lot more *qualitative* than you describe. He's looking for companies with very strong franchises that would be difficult to dislodge. Such businesses can raise prices significantly and not lose customers.\n\nWhen he finds such a company it might be a 10 or 20 year wait before they are selling at the right price to dive in.\n\nCoca-cola is a great example. He bought only after the price took a serious nosedive. It's not like he didn't know about Coca-cola before 1988.",
      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll41lss/",
      "created": 1725260791,
      "depth": 0,
      "replies": [
        {
          "id": "ll5yj4b",
          "score": -1,
          "body": "people love to highlight buffets achievements but never his failures\n\nin 1998, bill ackman criticized buffet for KO's poor management- the stock had an insanely high PE of 47.5 despite mediocre EPS growth of 13%, or a PEG ratio of 3.57. They were obsessed with share buybacks and not business growth. To put that into perspective, NVDA today trades at a PEG of 0.56 (56 PE/100% EPS Growth). KO was destroying shareholder value.\n\n\n\nBuffet defended KO by saying it was a high quality business, moat, blah blah blah. What has KO done since then? A whole lot of nothing. Because it barely grew and had a high multiple. It returned a CAGR of 5.6% vs SP500 of 8.8%.",
          "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll5yj4b/",
          "created": 1725293534,
          "depth": 1,
          "replies": [
            {
              "id": "ll8kycc",
              "score": 5,
              "body": "Imagine listening to biLL ACKman",
              "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll8kycc/",
              "created": 1725326635,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll8zk8e",
              "score": 3,
              "body": "Coca-cola has paid about $26.88 in dividends since 1998. He was buying it 10 years earlier, selling PUTS of all things, iirc, to collect a premium as his puts were exercised, for something like sub $3/share.\n\nWhat would you do if you were Buffett, dump all your shares in 98 and guarantee driving the price down as you sell, not to mention eat a boatload of capital gains (like $38/share in taxable gains)? Or let the price do what prices do, and just hang on to a wonderful business?\n\nWhen he rarely does criticize managements, he is intelligent enough to do it first quietly, one-on-one. There is nothing to gain by embarrassing someone who works for you publicly.\n\nSo even if management was doing something stupid? Maybe he did talk to the management. We don't know. Not in the Bill Ackman/Carl Icahn way of publicly bullying people, but behind closed doors where a person can maintain their dignity.",
              "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll8zk8e/",
              "created": 1725332420,
              "depth": 2,
              "replies": [
                {
                  "id": "ll9ujpq",
                  "score": 1,
                  "body": "Please let’s not delude ourselves here. Buffet just sold 80b of apple. Not selling because of cap gains? Bs. Put selling? Adds at best 1% of alpha. Doesn’t matter what dividends ko gave out. Total return doesn’t lie. Ko underperformed spy by 55% over the next 20 years \n\nNumbers don’t lie. Buying a wonderful business at a ridiculous valuation (keep in mind you could’ve bought a company like msft or apple at a 15-20 PE at this time) doesn’t make sense so why would a massive share buyback plan from ko make sense?",
                  "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll9ujpq/",
                  "created": 1725349617,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llae9ur",
                      "score": 2,
                      "body": "He actually is on record as saying that he's selling exactly because he expects there to be a cap gains increase if Dems take the White House.",
                      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/llae9ur/",
                      "created": 1725362221,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "llbl1rs",
                      "score": 1,
                      "body": "Coulda coulda coulda.\n\nIf I understood every business in the world, I coulda done a lot of shit better too.\n\nJesus christ.",
                      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/llbl1rs/",
                      "created": 1725378428,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ll8l7ga",
              "score": 1,
              "body": "Yea but hes still at like 60% yield on cost from the original investment from the dividend growth i wouldnt consider that a bad investment.",
              "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll8l7ga/",
              "created": 1725326737,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll4qe6p",
      "score": 14,
      "body": "Buffets strategy is completely different because berk has so much money.  Most companies, if he tried to invest he would move the price.  So he is restricted mostly to mega cap stocks and some acquisitions",
      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll4qe6p/",
      "created": 1725276876,
      "depth": 0,
      "replies": [
        {
          "id": "ll5rzee",
          "score": 5,
          "body": "Talking about early buffet and later buffet  is a difference in investment style.",
          "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll5rzee/",
          "created": 1725291391,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll58vnd",
          "score": 1,
          "body": "This is why hedge funds generally can't beat the market, but some individuals can (at least for a short period). The money they have is market moving. Whales watch where other whales money is going, they can then capitalize on it via squeezing.",
          "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll58vnd/",
          "created": 1725284821,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll6pe95",
      "score": 10,
      "body": "I think you’re learning the right things, but I see a couple contradictions here. \n\n***Big** companies* generally have stock prices that reflect that *value* already, since once they are seen as ***big*** companies most known things are already priced in.\n\nBuying ***undervalued*** businesses/investment opportunities is more about finding Apple/Microsoft ***BEFORE*** they became the behemoths they are today.\n\n***PE ratios*** are a good measure of performance, but when trying to find *undervalued* companies to multiply your investment this may ironically dissuade you if the PE ratio is too high, which is likely if still in its growth stage.\n\n> Read: *’One Up on Wall Street’* by Peter Lynch if you haven’t already; great book on value investing",
      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll6pe95/",
      "created": 1725302407,
      "depth": 0,
      "replies": [
        {
          "id": "llbuxrh",
          "score": 2,
          "body": "Keep in mind that Peter Lynch glosses over the quantitative work when you read through it",
          "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/llbuxrh/",
          "created": 1725381637,
          "depth": 1,
          "replies": [
            {
              "id": "llc6053",
              "score": 2,
              "body": "I like it and often recommend cause it’s a good starting point for anyone, since it covers a broad range of topics in a way that’s easy to understand. Wasn’t sure what level OP was.",
              "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/llc6053/",
              "created": 1725385160,
              "depth": 2,
              "replies": [
                {
                  "id": "llc9w2v",
                  "score": 2,
                  "body": "You’re doing excellent work building our community by teaching people how to invest. Thank you",
                  "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/llc9w2v/",
                  "created": 1725386392,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ll3tzgj",
      "score": 16,
      "body": "Buffet is sitting on record levels of cash, he doesn’t invest unless something is a good deal, big cash means big bubble and he’s taking profits to buy up at discounts later",
      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll3tzgj/",
      "created": 1725256150,
      "depth": 0,
      "replies": [
        {
          "id": "ll458hm",
          "score": 8,
          "body": "He mentioned that there's a lot of small companies he'd like to invest in, but he has so much money that he'd end up buying the entire company",
          "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll458hm/",
          "created": 1725263182,
          "depth": 1,
          "replies": [
            {
              "id": "ll48vjd",
              "score": 2,
              "body": "That's not the point, he loves to buy great companies. The issue is that it won't move the needle.",
              "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll48vjd/",
              "created": 1725265658,
              "depth": 2,
              "replies": [
                {
                  "id": "ll4cdzh",
                  "score": 1,
                  "body": "Thats what he said..",
                  "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll4cdzh/",
                  "created": 1725268045,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ll3um60",
          "score": 6,
          "body": "Plus also everyone is on the ai hunt which basically just means they buy chips from NVIDIA, whos earnings just went from 24bil to 30bil I believe, but it was only at expectations and did not exceed them so the stock dropped like 8%, good news causing a drop in the stock price of the cornerstone of the ai chip market isn’t a good sign to invest either",
          "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll3um60/",
          "created": 1725256514,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll5tic3",
          "score": 2,
          "body": "(Even if it seems like I'll be saying the same thing) It's incorrect.   \n   \nBuffet runs risk/reward calculation, 2-3-5-10 years expected/potential returns all the time. It turns out that 5% on cash is better than what's available to him (including some of his companies, like Apple...). He is not \"stacking up waiting for a crash\", it is a linear approach. He doesn't give a shit about \"the market\", if he finds nothing, he buys nothing, if the businesses he is looking at will produce less returns than cash, he keeps it cash (or sell for cash).",
          "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll5tic3/",
          "created": 1725291890,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll4980v",
          "score": 2,
          "body": "He sold now because he believes there would be a tax increase and he is waiting for the elections to see where he'll invest that money. I firmly believe he already has his picks, but he won't until there is an outlook of what the next 4 years will look like.",
          "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll4980v/",
          "created": 1725265897,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll6h6yp",
          "score": 1,
          "body": "Buffet is nearly always sitting on record cash",
          "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll6h6yp/",
          "created": 1725299663,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llaecxv",
          "score": 1,
          "body": "He stated he's doing it for cap gains reasons.",
          "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/llaecxv/",
          "created": 1725362265,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll54nvf",
          "score": 0,
          "body": "…or doesn’t care about the valuation as long as he’s got insider info. Dudes like him don’t trade hundreds of millions on data available to people like us.",
          "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll54nvf/",
          "created": 1725283216,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll53g9p",
      "score": 5,
      "body": "My sweet spot for value DCF is 5-30b market cap. I find value there. \n\nSome stocks i catched 5Y ago:\n\nWSO/SYK/DECK",
      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll53g9p/",
      "created": 1725282742,
      "depth": 0,
      "replies": [
        {
          "id": "ll7siz3",
          "score": 1,
          "body": "A very good and important post. You get my upvote.",
          "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll7siz3/",
          "created": 1725315829,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll404wl",
      "score": 9,
      "body": "You’re putting words in Buffett’s mouth. He explicitly does not say that. He says to buy excellent companies at fair prices.\n\nAlso, if your DCF is putting out inaccurate data, it is likely your inputs are bad or your calculator needs to be reviewed by someone else.",
      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll404wl/",
      "created": 1725259876,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll68y7o",
      "score": 2,
      "body": "Big Tech has seen significant multiple expansion, as have Costco and plenty of other quality companies. Yes, many are overvalued. No one knows when multiples will compress again, but it's very likely to happen. My advice would be to focus on companies you think are sensibly priced.",
      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll68y7o/",
      "created": 1725296945,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll6sgq5",
      "score": 2,
      "body": "I typically analyze average PE ratios across a sector and see if the PE compares to that. You'll see that tech stocks hold higher PE than other sectors. Do this for each sector and see how the company you're interested in fairs against the backdrop of its competition.",
      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll6sgq5/",
      "created": 1725303442,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll8tpw4",
      "score": 2,
      "body": "Trying to find undervalued companies were their initial strategy. Later they switched to buying great companies for fair prices. If the company is doing great, you can pay top 💰 and it will pay off.",
      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll8tpw4/",
      "created": 1725330029,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll8yn0a",
      "score": 2,
      "body": "Well we just went through maybe the greatest bull run ever, and everyone wants to own the largest, “safest” and most reputable stocks. Therefore the prices are higher, and the risks follow. If you look at smaller companies you’ll find many that are “cheap” based on a DCF.",
      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll8yn0a/",
      "created": 1725332032,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llbu6kf",
      "score": 2,
      "body": "Indexing is best for people who don’t want to do research.",
      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/llbu6kf/",
      "created": 1725381393,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll42hxy",
      "score": 1,
      "body": "I love Buffet but you gotta admit he moves markets . Whatever he buy we buy",
      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll42hxy/",
      "created": 1725261359,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll4v3jh",
      "score": -1,
      "body": "Its outdated. Situation is now different.",
      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll4v3jh/",
      "created": 1725279181,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll3yotl",
      "score": -2,
      "body": "Buffett has access to information and tools we don’t, he advises regular people buy the market.\n\nGenius financial whiz’s running value ETFs get shitty returns, as do individual value investors I imagine. (Likely Intel has been ‘value’ all the way down from $50…)\n\nThe chances some random discovers value what everyone has overlooked is very slim.",
      "permalink": "/r/stocks/comments/1f6z6ta/value_investing_in_big_companies/ll3yotl/",
      "created": 1725258967,
      "depth": 0,
      "replies": []
    }
  ]
}