{
  "title": "ESPN networks, ABC and Disney channels go dark on DirecTV on a busy night for sports",
  "score": 40,
  "selftext": "ESPN has gone off the air on a major carrier for the second straight year during the U.S. Open tennis tournament and in the midst of the first full weekend of college football.\n\nDisney Entertainment channels went dark on DirecTV Sunday night after the sides were unable to reach a new carriage agreement.\n\nThe move angered some sports fans, who posted their displeasure on social media. And the U.S. Tennis Association wasn’t pleased with another carriage dispute.\n\nESPN was showing the fourth round of the U.S. Open when it went off the air on DirecTV at 7:20 p.m. EDT.\n\nThat was a half-hour before the start of the match between Frances Tiafoe, an American who reached the 2022 U.S. Open semifinals, and Alexei Popyrin, an Australian who eliminated defending champion Novak Djokovic on Friday.\n\n“It is disappointing that fans and viewers around the country will not have the opportunity to watch the greatest athletes in our sport take part in the 2024 U.S. Open due to an unresolved negotiation between DirecTV and Disney, resulting in the loss of access to ESPN. We are hopeful that this dispute can be resolved as quickly as possible,” the USTA said in a statement.\n\nIt also happened 10 minutes before the start of the college football game between No. 13 LSU and 23rd-ranked Southern California in Las Vegas.\n\nABC-owned stations in Los Angeles; the San Francisco Bay Area; Fresno, California; New York; Chicago; Philadelphia; Houston; and Raleigh, North Carolina, also went off DirecTV.\n\nLast year, Disney and Spectrum — the nation’s second-largest cable TV provider — were involved in a nearly 12-day impasse until coming to an agreement hours before the first Monday night NFL game of the season.\n\nDirecTV said Disney offered an extension to keep the channels on the air in exchange for DirecTV having to waive all future legal claims that its behavior is anti-competitive.\n\n“The Walt Disney Co. is once again refusing any accountability to consumers, distribution partners, and now the American judicial system,” said Rob Thun, DirecTV’s chief content officer, in a statement. “Disney is in the business of creating alternate realities, but this is the real world where we believe you earn your way and must answer for your own actions. They want to continue to chase maximum profits and dominant control at the expense of consumers — making it harder for them to select the shows and sports they want at a reasonable price.”\n\nDirecTV has 11.3 million subscribers, according to Leichtman Research Group, making it the nation’s third-largest pay TV provider.\n\nDana Walden and Alan Bergman, co-chairmen of Disney Entertainment, and ESPN chairman Jimmy Pitaro issued a joint statement urging DirecTV to finalize a deal.\n\nThe statement added that “while we’re open to offering DirecTV flexibility and terms which we’ve extended to other distributors, we will not enter into an agreement that undervalues our portfolio of television channels and programs. We invest significantly to deliver the No. 1 brands in entertainment, news and sports because that’s what our viewers expect and deserve.”\n\nThe impasse comes as networks and distributors continue to be at odds over content. Distributors and subscribers would like to see a model where they can buy channels a la carte instead of subscribing to a bundling package.\n\nDistributors are also frustrated with production companies putting some of their premium programing on direct-to-consumer platforms before they show up on channels. DirecTV cited the miniseries “Shogun” appearing on Hulu before FX.\n\n“Consumer frustration is at an all-time high as Disney shifts its best producers, most innovative shows, top teams, conferences, and entire leagues to their direct-to-consumer services while making customers pay more than once for the same programming on multiple Disney platforms,” Thun said. “Disney’s only magic is forcing prices to go up while simultaneously making its content disappear.”\n\nBesides all ESPN network channels and ABC-owned stations, Disney-branded channels Freeform, FX and National Geographic channel went dark on DirecTV.\n\nSource: [https://www.cnbc.com/2024/09/02/espn-networks-abc-and-disney-channels-go-dark-on-directv-on-a-busy-night-for-sports.html](https://www.cnbc.com/2024/09/02/espn-networks-abc-and-disney-channels-go-dark-on-directv-on-a-busy-night-for-sports.html)",
  "link_flair_text": null,
  "id": "1f7b1xw",
  "num_comments": 28,
  "created_utc": 1725294562,
  "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/",
  "comments": [
    {
      "id": "ll65ymq",
      "score": 37,
      "body": "Doesn't this happen every year or so? Disney bluffs, DirecTV bluffs and eventually they realize they are both better off working together.\n\nIt is like the game insurance companies and hospitals play where I live.",
      "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll65ymq/",
      "created": 1725295968,
      "depth": 0,
      "replies": [
        {
          "id": "ll6op4q",
          "score": 5,
          "body": "Nah, this is the first that I can remember right off.\n\nI think last year there was a problem with Nexstar and DirecTV for a few weeks which made me lose ABC for a while, but I didn't lose all of the ESPN channels.\n\nI'm just grateful I'm not in an area that had ABC nuked as well because I actually have decent options for CFB while working around ESPN being dark on Saturday of next week (even though it's a major hassle) and that I don't think this is going to take as long as Bally Sports did with XFinity (that was months).\n\n(this mostly isn't a financial deal for me)",
          "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll6op4q/",
          "created": 1725302172,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll6d9wq",
      "score": 8,
      "body": "TL;DR summarize and just tell us which party the evil one.",
      "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll6d9wq/",
      "created": 1725298373,
      "depth": 0,
      "replies": [
        {
          "id": "ll747tt",
          "score": 10,
          "body": "both",
          "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll747tt/",
          "created": 1725307441,
          "depth": 1,
          "replies": [
            {
              "id": "ll74lwe",
              "score": 1,
              "body": "So, is this so simple as the party of the first part and the party of the second part?",
              "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll74lwe/",
              "created": 1725307572,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "llad6pw",
          "score": 2,
          "body": "Disney",
          "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/llad6pw/",
          "created": 1725361654,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llbuaa1",
          "score": 2,
          "body": "It’s always Disney. All my other directv channels work just not the Disney ones so I blame them",
          "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/llbuaa1/",
          "created": 1725381427,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll62o67",
      "score": 12,
      "body": "Who cares ESPN tanked once Disney bought them out \n\nIt doesn’t even cover sports anymore only talk shows and opinion pieces \n\n\nHMU when Disney finally sells ESPN to someone who will run it correctly",
      "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll62o67/",
      "created": 1725294892,
      "depth": 0,
      "replies": [
        {
          "id": "ll64zut",
          "score": 12,
          "body": "bruh what do you mean who cares. \n\nlast night we left buffalo wild wings because they couldn’t show the US Open or any College Football. \n\nso i think at the least buffalo wild wings cares lmao",
          "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll64zut/",
          "created": 1725295655,
          "depth": 1,
          "replies": [
            {
              "id": "ll6g502",
              "score": 7,
              "body": "How dare you tank my Buffalo Wild Wings stock! You better go back there and order another menu!",
              "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll6g502/",
              "created": 1725299313,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll82l6n",
              "score": 3,
              "body": "I take it no one goes to BWW for their wings?",
              "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll82l6n/",
              "created": 1725319627,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll64ptm",
      "score": 6,
      "body": "Let’s go FUBO.",
      "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll64ptm/",
      "created": 1725295564,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll8k21s",
      "score": 2,
      "body": "And I can’t watch FSU vs BC the Fckery.! Go Noles 🍢",
      "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll8k21s/",
      "created": 1725326285,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll9vbvs",
      "score": 3,
      "body": "Disney is the Boeing of entertainment.",
      "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll9vbvs/",
      "created": 1725350157,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll6k8bv",
      "score": 3,
      "body": "The benefits of having Hulu. Never have to worry about this.",
      "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll6k8bv/",
      "created": 1725300669,
      "depth": 0,
      "replies": [
        {
          "id": "ll746m6",
          "score": 3,
          "body": "hulu doesn’t have regional sports",
          "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll746m6/",
          "created": 1725307431,
          "depth": 1,
          "replies": [
            {
              "id": "ll88vfn",
              "score": 1,
              "body": "I have all my local channels and plenty of local sports",
              "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll88vfn/",
              "created": 1725322012,
              "depth": 2,
              "replies": [
                {
                  "id": "llbud3a",
                  "score": 3,
                  "body": "They don’t got the cubs in chi",
                  "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/llbud3a/",
                  "created": 1725381452,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ll89fou",
                  "score": 1,
                  "body": "ah doesn’t have for NY",
                  "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll89fou/",
                  "created": 1725322230,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll9v5tk",
                      "score": 0,
                      "body": "NY there is your problem right there ha",
                      "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll9v5tk/",
                      "created": 1725350041,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ll7e44k",
      "score": 1,
      "body": "Long, long time ago, I thought the model for cable (now streaming) is the advertisers, not the subscribers would pay for the channels. Now content providers want revenue from cable and streaming providers.",
      "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll7e44k/",
      "created": 1725310760,
      "depth": 0,
      "replies": [
        {
          "id": "llb77ab",
          "score": 2,
          "body": "Advertising alone isn't going to pay for the new NBA deal which is around 76 billion dollars.",
          "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/llb77ab/",
          "created": 1725373883,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll9wh4f",
      "score": 2,
      "body": "What pisses me off is I pay for ESPN+ and I still couldn’t watch.",
      "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll9wh4f/",
      "created": 1725350945,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lleyaqr",
      "score": 2,
      "body": "ESPN sucks. ABC sucks. Don't get me started on their nba finals coverage. Those 5 seconds of halftime commentary.",
      "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/lleyaqr/",
      "created": 1725421424,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llfa8h8",
      "score": 2,
      "body": "People still use directTV?",
      "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/llfa8h8/",
      "created": 1725427635,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll9os42",
      "score": 1,
      "body": "All the old people with DirecTV still are probably asleep at seven PM and won’t notice.",
      "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/ll9os42/",
      "created": 1725345783,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llb9u5r",
      "score": 0,
      "body": "Stuff like this is exactly why over the air and cable TV are slowly destroying themselves, and why streaming is inevitable long term. \n\nWhy bother with these services when they're consistently this unreliable?\n\nAnd then over the air broadcast TV is screwing themselves over with ATSC 3.0, which will let them encrypt free over the air TV channels, and force DRM onto users that can do all sorts of stuff like lock their channel down so much so that you can only watch it live and can't record anything.",
      "permalink": "/r/stocks/comments/1f7b1xw/espn_networks_abc_and_disney_channels_go_dark_on/llb9u5r/",
      "created": 1725374771,
      "depth": 0,
      "replies": []
    }
  ]
}