{
  "title": "Intel CEO will reportedly present plans to cut assets at an emergency board meeting",
  "score": 988,
  "selftext": "According to Reuters reports, Intel's CEO Pat Gelsinger and other key executives are to present their plan to trim Intel's fat and course-correct the company. The meeting will focus on removing assets and reducing costs, with items of discussion apparently including Intel's upcoming Magdeburg, Germany fab and its ownership of Altera.\n\nIntel announced a $1.6 billion loss in its now-infamous August 1 earnings call, which also carried the news that Intel had laid off 15% of its workforce and aims to reduce spending by $10 billion by 2025. The loss came thanks to Intel's falling behind in the AI arms race and its 13th/14th-generation widespread CPU failures. Intel stock had its worst day in 50 years immediately following the call, and the company has continued to suffer in the month since. Chip industry legend Lip-Bu Tan resigned from the board of executives, resulting in a 6% drop in Intel stock and a significant lack of industry experience.\n\nSignificant changes to Intel were always likely to reverse this major downturn, but recent reports reveal that Gelsinger's plans may include seriously drastic measures. Construction on Intel's upcoming Magdeburg chip fab is expected to be paused or canceled, leaving the $32 billion project unfinished. Magdeburg's local government has already begun drafting plans in case Intel withdraws its commitment to the project.\n\nIntel is also likely to sell off its ownership of Altera, its programmable chip business, which is currently a fully spun-off company owned solely by Intel. Altera has been an industry fixture for decades, with Intel investing heavily in reviving Altera after acquiring the company in 2015. Altera has been a part of Intel's broad market strategy for ten years but is likely to be entirely sold off to another interested chip manufacturer in the coming months.\n\nUnsurprisingly, Intel is not expected to entertain discussion about spinning off or selling its Intel Foundry wing. Intel's contract foundry business, one of Intel's most significant expenses, has been kept distinct from the rest of Intel's business since Q1 2024 and is considered a tentpole part of Intel's future. Two separate sources have confirmed that Intel will not propose any plans to sell its foundry wing to TSMC or another similar buyer, keeping it around for the day it is hopefully as profitable as Gelsinger believes it can be.\n\nIntel's sharp decline can be attributed to several factors. Lip-Bu Tan reportedly blamed his exit from Intel on a bloated workforce, and Gelsinger blamed expenditures across the board as a major problem. Intel is still mired in issues related to the instability and failure rate of 13th and 14th Generation CPUs, which could lead to permanent chip damage. Tech media heavily reported Intel's lethargic response to a disastrous product failure, leading to increased public distrust of Intel's brand. While selling off companies will help quell Intel's bleeding out; the company has a long road ahead to stability.\n\nhttps://www.tomshardware.com/tech-industry/intel-ceo-will-reportedly-present-plans-to-cut-assets-at-an-emergency-board-meeting-chipmaker-may-put-dollar32b-magdeburg-plant-on-hold-and-sell-off-altera",
  "link_flair_text": "Company News",
  "id": "1f7hjwm",
  "num_comments": 282,
  "created_utc": 1725310173,
  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/",
  "comments": [
    {
      "id": "ll7hkjl",
      "score": 661,
      "body": "$1.6b loss, dude still gonna get like $30m in bonus comp this year",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7hkjl/",
      "created": 1725311941,
      "depth": 0,
      "replies": [
        {
          "id": "ll7ry92",
          "score": 322,
          "body": "Stock based compensation went from 1.6 billion in the quarter last year to nearly 2 billion last quarter. Investors can now sleep well tonight knowing that the executives are getting paid despite their investment being underwater.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7ry92/",
          "created": 1725315615,
          "depth": 1,
          "replies": [
            {
              "id": "ll8jfjg",
              "score": 153,
              "body": "And it's not even like it's a \"bad year\" or \"bad quarter\". It's not even a bad decade. INTC is now back to 1997 pricing.\n\nIf you had told me back in 1997 that the whole freakin world was going to run on semis in 27 years and that Intel would have a lower market cap...I would not have believed it.\n\nThey have squandered one of the greatest companies the world ever produced. In some ways I feel we all owe Intel a debt because they jump started the tech revolution. But good grief they have just fallen on their face repeatedly for the last several years.",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8jfjg/",
              "created": 1725326041,
              "depth": 2,
              "replies": [
                {
                  "id": "ll8mpfu",
                  "score": 88,
                  "body": "They jump-started the tech revolution then sandbagged and basically bribed companies to not use AMD while almost putting them out of business. \n\n\nBut it's hard to say \"they\" when in reality it's just a bunch of old saggy dudes running these companies to the ground while getting paid.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8mpfu/",
                  "created": 1725327315,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llao4yv",
                      "score": 10,
                      "body": "I actually held AMD at the time and decided to consolidate chips stock so I ended up with INTC. One of my bad decisions.",
                      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llao4yv/",
                      "created": 1725366789,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ll9achv",
                  "score": 15,
                  "body": "If it was bad a year Intel would be in more trouble. Nvidia, AMD, and Broadcom basically all chip companies are booming right now. Earnings are higher than ever for these companies yet Intel is finding a way to somehow decline. I can only imagine if we were actually in a bad year for chips and these companies weren’t doing too good. Intels results would be even worse.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9achv/",
                  "created": 1725337459,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ll8wd8x",
                  "score": 34,
                  "body": "Fairly typical company cycle, isn‘t it? Become the industry leader, get complacent and arrogant, believe that your customers will buy whatever you put out, even if it‘s really mediocre and overpriced…",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8wd8x/",
                  "created": 1725331104,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llal06o",
                      "score": 5,
                      "body": "> Become the industry leader, get complacent and arrogant, believe that your customers will buy whatever you put out, even if it‘s really mediocre and overpriced…\n\nI'm seeing some parallels with Apple...",
                      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llal06o/",
                      "created": 1725365422,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ll8ljir",
                  "score": 43,
                  "body": "That reminds of another great failure, Boeing. I hope what intel is going through is more like what Apple dealt with from late 80s to mid 90s but then Jobs was still around and came back to save the sinking ship, unfortunately Andy Grove can’t return to revive Intel.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8ljir/",
                  "created": 1725326871,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llaq2m2",
                      "score": 6,
                      "body": "At least Boeing has entire airlines locked in to using their planes. Replacing computers is a drop in the bucket compared to replacing entire airplane infrastructure.",
                      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llaq2m2/",
                      "created": 1725367594,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "llea1yo",
                          "score": 4,
                          "body": "while you aren't wrong....replacing hardware and migrating everything to the new hardware is NOT easy and takes time and a lot of money and companies HATE doing it.  Just migrating a software platform from virtual machines to kubernetes ON THE SAME HARDWARE is a huge task that takes a lot of time and care and money to make sure it is done right and tested adequately and rolled out in a proper way and properly coded/automated so that management after the cutover is well coded to be easily reproduced if something goes wrong.",
                          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llea1yo/",
                          "created": 1725411712,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ll8t982",
                  "score": 5,
                  "body": "That’s what happens when you overpay. Unfortunately investors still don’t understand this a quarter century later. Intel changed the world. Revenue and profit was up 4x in 2021 from 2001. 20 years later, better business. Never reached the ATH.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8t982/",
                  "created": 1725329844,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ll88bwj",
              "score": 54,
              "body": "And workers can sleep well knowing they are being shafted from all angles",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll88bwj/",
              "created": 1725321805,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll7zwm9",
              "score": 21,
              "body": "The majority of that SBC likely went to regular employees not execs.\n\nI haven't looked at the financials but 2b in SBC would be a lot for a struggling company.",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7zwm9/",
              "created": 1725318607,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll9cpfq",
              "score": 8,
              "body": "“Times are difficult for all of us!” Said the board members in their yachts",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9cpfq/",
              "created": 1725338693,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll7nir9",
      "score": 125,
      "body": "How the hell did this happen. People used to say Intel has crazy cash flows like 3 years ago, they can weather AMD stealing their margins. Are the fabs sucking up all the capital? I thought the government helped out a lot with a loan and subsidy.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7nir9/",
      "created": 1725314009,
      "depth": 0,
      "replies": [
        {
          "id": "ll7usys",
          "score": 158,
          "body": "Gelsinger happened. To be completely fair on Gelsinger though Intel was in a bad spot before he took over. Intel was behind its competition and had inferior products which put them behind. At least though the company was profitable and had decent cash flow. Now it doesn’t even have that. \n\nWhen Gelsinger took over in the beginning of 2021 he basically said he wanted Intel to be a company that both designs chips and manufacturers them.  He was extremely optimistic to investors about that plan and started making announcements of building big factories in Arizona, Ohio, Oregon, Germany, and other places. In their original forecast in 2021 Intel said that the factories would start being constructed in 2021 and be built in late 2025 and start producing. \n\nThe main problem came that not even Intel foresaw was a complete earnings collapse. All of the money was basically going to capex to develop these factories and nothing was really going towards their existing products. Intel fell even further behind and their products became more undesirable and competitor’s moved even further ahead. It came to a point where margins collapsed and they are basically giving away their products for a small to no profit. They also took a massive loss on their chip fab machines cause they were crap so now they have to write them off and buy new ones from ASML. \n\nNow cause of the earnings collapse they have even less money to put towards these factories and have to use every financial trick in the book to get money to fund these. One they have been using is debt. Debt has ballooned but you can only take on so much debt. Another is issuing shares. Intel has been issuing shares quite substantially but that will only get you so far especially when your stock is selling off and not desirable as is. Another is selling their ownership stakes in their factories and spinning off other assets. They basically dumped Mobileye and now they want to dump Altera. \n\nConstruction was also delayed and now Intel is saying that the factories now won’t be ready until 2028 at the earliest. That also assumes no more delays. So their financial situation is only getting worse and worse and the fabs are not expected to have results until 2028-2030. Gelsingers plan only put Intel into an even worse spot then they were already in. Their financials have been the worst in decades, their stock price is at its lowest point in a long time, his promise of having results are looking even more bleak. \n\nIt’s not good.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7usys/",
          "created": 1725316684,
          "depth": 1,
          "replies": [
            {
              "id": "ll7wu8l",
              "score": 60,
              "body": "They also extended depreciation for their machines from 5 years to 8 years.",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7wu8l/",
              "created": 1725317449,
              "depth": 2,
              "replies": [
                {
                  "id": "ll7xdqd",
                  "score": 57,
                  "body": "You’re correct. They did that in 2023 to make their earning look better and I talked about it on this sub when they did that. It was scummy but it backfired on them cause those machines were crap and they ended up taking a massive loss on them. Now their earnings are even worse.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7xdqd/",
                  "created": 1725317653,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llafibz",
                      "score": 11,
                      "body": "That's kind of weird because a lot of investors don't pay much attention to depreciation anyway. Often EBITDA is the preferred measure to asses performance because it ignores 'technical accounting effects'. \n\nPlus a move like that screams desperation",
                      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llafibz/",
                      "created": 1725362843,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lljkmsi",
                      "score": 2,
                      "body": "So in your opinion do you think intel have any chance of turning this around or it just a dying cause at this point. I had very high hopes for their fab but at this point the company might not even live long enough to see it bear fruit.",
                      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/lljkmsi/",
                      "created": 1725490958,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "llb8j1h",
                  "score": 6,
                  "body": "Whenever i see someone adjust their depreciation policy like that I immediately assume there's a decent chance of fraud being involved.\n\nThat's one of the things that WM did a while ago to try to sustain their unsustainably high earnings growth, extend the depreciation of their vehicles, even though that wasn't true at all and they knew there was no way that most of their vehicles would ever last as long as the new depreciation length. They got in BIG trouble for it (i.e. I'm pretty sure some people went to jail for committing fraud).",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llb8j1h/",
                  "created": 1725374334,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llclk9x",
                      "score": 2,
                      "body": "Fraud or desperation.",
                      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llclk9x/",
                      "created": 1725390130,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ll8xbnz",
              "score": 33,
              "body": "Nana needed you to write this out a month ago.",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8xbnz/",
              "created": 1725331496,
              "depth": 2,
              "replies": [
                {
                  "id": "ll99qma",
                  "score": 15,
                  "body": "I did, people just didn’t want to listen lol",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll99qma/",
                  "created": 1725337146,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "llbcsgf",
              "score": 21,
              "body": "2021? Intel was in trouble LOOOONG before that. I've worked in high tech for over two decades now. There's a long list of examples of Intel's own hubris being their downflow:\n\n- Saw 64 bit coming and thought they could partner with Microsoft and force the market to adopt a proprietary standard (Itanium). All this did was increase AMD chip sales and accelerate the switch to Linux for servers\n\n- Thought that mobile/low power computing wasn't important, ignoring it for years before the iphone came out and made them realize maybe they should take it seriously. Then instead of focusing on a low power chip, theyt tried to make some x86 behemouth that no one wanted\n\n- Saw IOT coming, released a few interesting chips, and completely shat the bed on software support. Getting an OS up and running literally took hours of work and that was just bootstrapping the stupid things. They continued the bs where there all sorts of proprietary hooks so it was damn near impossible to make work with common toolchains.\n\n- Realized general purpose computing was a dying trend for cloud providers and learned that many were switching to custom IP blocks and other solutions. So, they purchased Altera and then did jack shit with the purchase. A few years later, they sold the company at a loss.\n\n- Literally screwed over their major cloud partners MUTIPLE TIMES over multiple generations of chips. We had Intel lie to us that they sold a competitor chips with an additional core (like we wouldn't find out). We had them lie to us for over a year about a major silent data corruption bug. They famously had numerous security bugs that severely impacted performance and they flat out refused to characterize the performance impacts or let us do the characterization ourself.\n\n- Created a GPU division/chip about 10 years after everyone else in the industry realized how important memory bandwidth and high core count architectures would be for cloud computing. When they launched the GPU, they focused on gaming, with no clear advantage in price (to compete with AMD) or performance (to compete with Nvidia).\n\nHere's the real issue with Intel. Their leadership is full of perpetual fart smellers. The company is full of people who think they are God's gift to engineering and if a product isn't successful, it's the market's fault for not realizing their genius.",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llbcsgf/",
              "created": 1725375750,
              "depth": 2,
              "replies": [
                {
                  "id": "llci0mj",
                  "score": 5,
                  "body": "> So, they purchased Altera and then did jack shit with the purchase. A few years later, they sold the company at a loss.\n\nThat's not what happened, their purchase of Altera originated a brand new business unit within Intel and then they spun it off as a separate company in Q1 this year while keeping majority ownership.\n\nRest is on point and I agree.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llci0mj/",
                  "created": 1725389000,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "llcn665",
                  "score": 3,
                  "body": "They continue to create fairy tales and aggressively sell the ideas, apparently ignoring the financial cost and impact, especially if it doesn't quite go as planned.  Now, after several iterations and the losses mounting. They are being forced to go to rehab, and get a grip on reality.  It is a sad story of massive rolling failures, arrogance, delusional behaviors, and incompetence.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llcn665/",
                  "created": 1725390646,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ll9hmx0",
              "score": 27,
              "body": "To be honest, Gelsinger is just a lagging indicator. In fact he was hired to fix Krzanich's tenure. Now all it remains is whether he will be given time to turn the massive container ship around. \n\nThe main concern a lot of folks had for them way back was whether Intel has the personnel needed to turn things around because Krzanich harmed the company deeply when he started regular layoffs to make the stock attractive to the Street and amongst those who took the golden handshakes were veterans of both design and manufacturing. \n\nWhen they kept failing their node shrinks and TSMC went full steam ahead succeeding with EUV implementation + commercialisation, you knew something was rotten within the ranks of Intel.",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9hmx0/",
              "created": 1725341445,
              "depth": 2,
              "replies": [
                {
                  "id": "ll9pptm",
                  "score": 7,
                  "body": "turning around the ship? the dude came aboard and did nothing but overload the ship causing it to sink faster",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9pptm/",
                  "created": 1725346385,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "llcvopz",
              "score": 3,
              "body": "Gelsinger was never capable to turn things around. At VMWare with monopoly in VM virtualization environment joker missed boat with containerization. The best they did was acquire pivotal and never made money with it. In 12yrs the stock just doubled. Clown has infinite cash and support from EMC, Dell and amazing engineers and still failed to bring new products and services.\n\nWhat made anyone believe he is capable to turn around a sinking ship? Guy is an idiot.",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llcvopz/",
              "created": 1725393358,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lleeofn",
              "score": 3,
              "body": "Thank you for the nice summary",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/lleeofn/",
              "created": 1725413494,
              "depth": 2,
              "replies": []
            },
            {
              "id": "llap1ps",
              "score": 2,
              "body": ">Construction was also delayed and now Intel is saying that the factories now won’t be ready until 2028 at the earliest. \n\nWhen did this news come out, the last earnings call?",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llap1ps/",
              "created": 1725367170,
              "depth": 2,
              "replies": []
            },
            {
              "id": "llfrgvj",
              "score": 2,
              "body": "Thanks for the write up, how do you gather all this info? I’d love to have this level of knowledge about all my stocks lol",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llfrgvj/",
              "created": 1725439017,
              "depth": 2,
              "replies": []
            },
            {
              "id": "llb6nhn",
              "score": 2,
              "body": "> The main problem came that not even Intel foresaw was a complete earnings collapse. All of the money was basically going to capex to develop these factories and nothing was really going towards their existing products. Intel fell even further behind and their products became more undesirable and competitor’s moved even further ahead. It came to a point where margins collapsed and they are basically giving away their products for a small to no profit. They also took a massive loss on their chip fab machines cause they were crap so now they have to write them off and buy new ones from ASML.\n\nWhat do you mean? Intel products are still profitable generating about 2.9bn in operating income.",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llb6nhn/",
              "created": 1725373694,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll7wv9h",
              "score": 2,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7wv9h/",
              "created": 1725317460,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll7wlj4",
      "score": 192,
      "body": "Granny is cooked",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7wlj4/",
      "created": 1725317356,
      "depth": 0,
      "replies": [
        {
          "id": "ll81lwa",
          "score": 44,
          "body": "Nanner going to roll in her grave.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll81lwa/",
          "created": 1725319255,
          "depth": 1,
          "replies": [
            {
              "id": "ll9yoyi",
              "score": 9,
              "body": "Ain't rolling into an IRA that's for sure",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9yoyi/",
              "created": 1725352484,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ll8ioa8",
          "score": 10,
          "body": "https://i.imgur.com/v7FKDxx.jpeg",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8ioa8/",
          "created": 1725325745,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llajafk",
          "score": 5,
          "body": "Is that guy still long?",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llajafk/",
          "created": 1725364638,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll9aelo",
          "score": 6,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9aelo/",
          "created": 1725337489,
          "depth": 1,
          "replies": [
            {
              "id": "ll9j0rj",
              "score": 6,
              "body": "Except for those who invested this month. Stock is +9%",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9j0rj/",
              "created": 1725342252,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "llaph8k",
          "score": 1,
          "body": "Why does this sound familiar.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llaph8k/",
          "created": 1725367351,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll7ipu2",
      "score": 194,
      "body": "boy am i glad they rejected me back when i applied. The engineers who interviewed me looked miserable too",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7ipu2/",
      "created": 1725312340,
      "depth": 0,
      "replies": [
        {
          "id": "ll7ye0i",
          "score": 76,
          "body": "Two of the worst programmers I've ever worked with both got jobs there after we fired them. More shocking is that both still work there years later. They also paid a huge relocation bonus.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7ye0i/",
          "created": 1725318035,
          "depth": 1,
          "replies": [
            {
              "id": "ll7yvd5",
              "score": 35,
              "body": "Maybe that part of their losses 😂",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7yvd5/",
              "created": 1725318216,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ll829o3",
          "score": 16,
          "body": "I worked there from 1999 to 2016. I left because I got tired of this shit. Survived 5 layoffs then took the voluntary seperation package",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll829o3/",
          "created": 1725319506,
          "depth": 1,
          "replies": [
            {
              "id": "llqysz5",
              "score": 2,
              "body": "I grew up in a town with a big Intel office. A lot of people don’t know how volatile intel has been for decades constant restructurings and layoffs",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llqysz5/",
              "created": 1725597925,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ll7v4iu",
          "score": 43,
          "body": "You dodged a bullet. Worked there, was never more depressed",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7v4iu/",
          "created": 1725316804,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll7tl0j",
          "score": 11,
          "body": "When was that interview?",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7tl0j/",
          "created": 1725316227,
          "depth": 1,
          "replies": [
            {
              "id": "ll86qf1",
              "score": 4,
              "body": "2020. Got a FAANG offer instead, no regrets",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll86qf1/",
              "created": 1725321194,
              "depth": 2,
              "replies": [
                {
                  "id": "ll89j9q",
                  "score": 26,
                  "body": "It cant be Amazon. I dont think ive ever heard Amazon and “no regret” in the same sentence on Reddit unless theyre talking about leaving the company.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll89j9q/",
                  "created": 1725322268,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll8iq3x",
                      "score": 10,
                      "body": "Nope not Amazon lol.",
                      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8iq3x/",
                      "created": 1725325765,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ll9z3ms",
                      "score": 5,
                      "body": "tbf, there are folks who are unhappy at every big tech if you ~~check blind~~ know where to look",
                      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9z3ms/",
                      "created": 1725352762,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "llazvib",
                          "score": 3,
                          "body": "Yeah, but Amazon is by far the worst in terms of culture. If you look at 100 posts complaining about working at big tech, you might find 30 for the other FAANGs combined, and 70 for Amazon alone.",
                          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llazvib/",
                          "created": 1725371349,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ll8awj9",
                  "score": 5,
                  "body": "Kind of hilarious to think of intc rejecting ppl who are sought by faang. Well done, and congrats on dodging a serious bullet.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8awj9/",
                  "created": 1725322785,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "llcx0hd",
          "score": 3,
          "body": "The world's tallest building is actually made of marshmallows.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llcx0hd/",
          "created": 1725393777,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll8m5ju",
          "score": 3,
          "body": "Could be universal - Had two interviewers who were not coordinated at all. One even yelled his question repeatedly at me because I didn't at the time understand what the words \"paradigms\" meant.\n\nThe question was \"What is the difference between object oriented programming and other paradigms of coding\"",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8m5ju/",
          "created": 1725327107,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll7e2ns",
      "score": 228,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7e2ns/",
      "created": 1725310747,
      "depth": 0,
      "replies": [
        {
          "id": "ll81hm4",
          "score": 9,
          "body": "Remember when NVDA was going BK ?",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll81hm4/",
          "created": 1725319210,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll7eplf",
          "score": 39,
          "body": "Yeah, they will nwvwe make it to any turn around. The bankers are not willing to give them anymore runway. Intel is terminal now.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7eplf/",
          "created": 1725310962,
          "depth": 1,
          "replies": [
            {
              "id": "ll7ss0o",
              "score": 56,
              "body": "Might be time to double my position, judging by how certain y'all were that Facebook was doomed and a terrible investment. ",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7ss0o/",
              "created": 1725315923,
              "depth": 2,
              "replies": [
                {
                  "id": "ll9lqfc",
                  "score": 18,
                  "body": "This is the only reason with I am buying more. Reddit keyboard warriors are wrong literally 110% of the times",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9lqfc/",
                  "created": 1725343880,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ll7svu1",
                  "score": 2,
                  "body": "Nanna would be proud of you.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7svu1/",
                  "created": 1725315963,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll7tnxy",
                      "score": 21,
                      "body": "If people had listened to the doomsayers when AMD was flirting with bankruptcy they would have missed out on life changing returns. ",
                      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7tnxy/",
                      "created": 1725316257,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ll836ai",
                          "score": 15,
                          "body": "Same with Tesla, this sub and r/investing would routinely say Tesla is going to 0 by the end of the year. I saw numerous people say they bought puts each month and rolled them up as they “knew for sure it was going to 0”",
                          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll836ai/",
                          "created": 1725319850,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ll7h5a7",
              "score": 63,
              "body": "They are the GE/IBM of the chip world. They will survive but they'll never go back to their past glory. These former behemoths are a constant reminder that the greatest of times is fleeting. Maybe 50 yrs from now people here will be talking about the FAANG companies the same way.",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7h5a7/",
              "created": 1725311796,
              "depth": 2,
              "replies": [
                {
                  "id": "ll7m2q3",
                  "score": 46,
                  "body": "Go look at a GE stock chart/market cap over the past few years. If they end up being the GE of the chip world, hell, even IBM I'll take it.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7m2q3/",
                  "created": 1725313501,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll7qsbp",
                      "score": 41,
                      "body": "GE could've been much more though. They could've been the Samsung of the US. Decades of short sighted management eroded GEs market share and reputation in almost all of its relevant products and services. They are a lesson in wasted potential and opportunities brought out by terrible decision making that caters to short sighted investors.",
                      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7qsbp/",
                      "created": 1725315188,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ll7t8xs",
                          "score": 17,
                          "body": "Yea but that's not the judgment we're making here. Those days are gone, for both GE and Intel. The issue for Intel today is whether or not can it turn things around in a more narrow way and turn into a smaller, but more meaningful company that can compete. GE post split is a leader in aircraft engines and competitive in energy and healthcare, but it's not the GE of old it's not trying to compete in everything. Most people think Intel is done, period. But I think Intel can be a similar story with its core being foundry. We'll see what happens, but if it's a 400% return from today, around what GE has gotten from its lowest point, I'll take it.",
                          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7t8xs/",
                          "created": 1725316100,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "llbeb0c",
                      "score": 4,
                      "body": "GE doesn't even exist anymore as we know it. What used to be GE was split up into a few different companies or been acquired.",
                      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llbeb0c/",
                      "created": 1725376253,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "llbf6jw",
                          "score": 2,
                          "body": "Yea and those of us who had GE stock got shares for each and all the components are doing well. Especially the core business, which was always meant to be the aerospace business. I probably should have held on to Vernova longer though.",
                          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llbf6jw/",
                          "created": 1725376542,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ll82mnu",
                  "score": 12,
                  "body": "50 Years? Make that 5. I work for a FAANG and the environment is deteriorating day by day.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll82mnu/",
                  "created": 1725319643,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll8grer",
                      "score": 9,
                      "body": "Is it that apparent from the inside?  I find it amazing how they all bashed Microsoft for being old and bloated and it seems like the roles reversed for all 5 of them.",
                      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8grer/",
                      "created": 1725325009,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ll8yz5a",
                          "score": 6,
                          "body": "Very apparent, in particular if you manage. Rounds of layoffs, less money to reward people, stricter performance review, no opportunity to grow or get promoted, expense cuts, ... Microsoft turned things around, but it's not going back to the golden era. Once the decline starts, the entire company is a different beast than it was before, there is no going back unfortunately.",
                          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8yz5a/",
                          "created": 1725332173,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ll7mzbb",
                  "score": 25,
                  "body": "I mean, both those names are doing decently now. They are not household names anymore and synonymous with an industry they created, but their turnaround has been decent. \n\nVery, very large companies with 100k+ employees and 50b+ revenues operate in cycles, especially in discretionary industries. And they need to reinvent themselves every few decades. \n\n100% guaranteed FAANG will be there... just look at the name, there is not M there either. Yet MSFT is probably one of the safest tech bets right now.\n\nUntil the US can guarantee chip manufacturing completely outside of China's sphere of influence, INTC will be there. That's why they continue to be big on foundry.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7mzbb/",
                  "created": 1725313818,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ll7sr42",
                  "score": 5,
                  "body": "I think fifty is too long. It can happen in next 10-15 years. Look. At top companies by market camp they change a lot every decade",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7sr42/",
                  "created": 1725315913,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ll7sij4",
                  "score": 3,
                  "body": "Yup definitely a cautionary tale for everyone who invests in stocks. Always keep watch over the companies you put your money in like a hawk. Any major leadership changes that leads to a change in the wrong direction or a change in your investment thesis don’t stick around hoping for a turnaround for too long learn to let go and move on.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7sij4/",
                  "created": 1725315824,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ll7v4u7",
                      "score": 10,
                      "body": "You can argue whether or not Pat was the best pick but it's unfair to pin this all on him. \n\nThey're digging out of years of missteps and the fab cycle is a long one. Wall Street wants them to go fabless, which isn't the best move in my opinion.",
                      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7v4u7/",
                      "created": 1725316807,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ll80izr",
                  "score": 3,
                  "body": "That's what happens when leadership lacks innovation. Look at Google now with their leadership team.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll80izr/",
                  "created": 1725318841,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ll865so",
              "score": 1,
              "body": "The DoD is going to have a massive say in that. ",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll865so/",
              "created": 1725320975,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ll7pnni",
          "score": 20,
          "body": "intel is way too important for the US in the geopolitical aspect. It’s the only company with foundries in the US.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7pnni/",
          "created": 1725314776,
          "depth": 1,
          "replies": [
            {
              "id": "ll80qwq",
              "score": 16,
              "body": "Tsmc's Arizona foundry will be running before Intel's",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll80qwq/",
              "created": 1725318927,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll7rwbs",
              "score": 30,
              "body": "Like the steel industry?",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7rwbs/",
              "created": 1725315596,
              "depth": 2,
              "replies": [
                {
                  "id": "ll7y340",
                  "score": 10,
                  "body": "What steel industry? \n\n\n/s",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7y340/",
                  "created": 1725317920,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ll8efc1",
                  "score": 13,
                  "body": "You think bleeding edge fabrication is the same as commodity steel?",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8efc1/",
                  "created": 1725324116,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ll87x8z",
                  "score": 7,
                  "body": "zactly. just because the government props up an industry doesnt' mean it's a good investment. The government only has to ensure that it continues to exist and does business....not that it is otherwise profitable.",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll87x8z/",
                  "created": 1725321649,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ll80zk4",
              "score": 4,
              "body": "When did they start calling them Foundry’s? When I was making them they were called Fabs…..",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll80zk4/",
              "created": 1725319018,
              "depth": 2,
              "replies": [
                {
                  "id": "llbjwmq",
                  "score": 3,
                  "body": "Fab = make your own chips\n\nFoundry = make chips for others",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llbjwmq/",
                  "created": 1725378064,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "llcsvvd",
              "score": 3,
              "body": "Intel may be important, Intel shareholders are not. Important difference.",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llcsvvd/",
              "created": 1725392478,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll8hi77",
              "score": 5,
              "body": ">It’s the only company with foundries in the US.\n\nDid you forget Samsung exists? They are even expanding their fabs in the Austin area.",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8hi77/",
              "created": 1725325296,
              "depth": 2,
              "replies": [
                {
                  "id": "llcukvi",
                  "score": 2,
                  "body": "Samsung is a Korean company",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llcukvi/",
                  "created": 1725393012,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lldn7jo",
                      "score": 2,
                      "body": "What's your point? They have fabs in the US and South Korea is a close ally. They said Intel is the only company with fabs in the US and that's just not true.",
                      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/lldn7jo/",
                      "created": 1725402400,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ll91oga",
              "score": 2,
              "body": "That doesn’t mean it’ll have good margins or a good investment",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll91oga/",
              "created": 1725333334,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lm80ge7",
              "score": 1,
              "body": "Global Foundries has fabs in the United States. \nI agree the US government won't let Intel fail, but also Intel isn't the only fab in town.",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/lm80ge7/",
              "created": 1725850951,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll7fkpn",
      "score": 97,
      "body": "Wow I know they took a 1.6B loss last quarter but i guess I didn’t realize how financially strapped they really were. My bags at $30.88 don’t look like they’ll ever break even now.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7fkpn/",
      "created": 1725311259,
      "depth": 0,
      "replies": [
        {
          "id": "ll7hzk7",
          "score": 41,
          "body": "On the other hand, you can sell at ~$22 so you could have done worse at cutting your losses.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7hzk7/",
          "created": 1725312087,
          "depth": 1,
          "replies": [
            {
              "id": "ll9mmxr",
              "score": 2,
              "body": "Or, you can average down and sell CCs and in 2 years you will be in gain",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9mmxr/",
              "created": 1725344435,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll7pn1t",
      "score": 32,
      "body": "Its like they were blind to the problems and weren't taking any actions to fix it until the quarterly report.  This $100B + company didn't know how to forecast cost and revenue...\n\nThe board needs to be culled and replaced.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7pn1t/",
      "created": 1725314770,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll9x7cw",
      "score": 13,
      "body": "I don't have a horse in this race, but I think the R&D layoffs were a bad strategy.   \n\n\nYou have a stagnating/failing product. The solution is not to cut down the R&D department, that will just make it worse. \n\n\nI'm not sure how they did the downsizing, but there is a big problem with giving incentives for quitting voluntarily in a research organisation. All the best researchers/engineers who can find other work or do their own startups are heavily incentivised to quit. You're left with the worst people who have few other options. You don't get a more lean/quick research team, you're left with the low functioning part of your team. And that is in addition to the high quality engineers who left years ago because Intel was not able to develop new and exciting tech anymore.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9x7cw/",
      "created": 1725351451,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll7ekng",
      "score": 61,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7ekng/",
      "created": 1725310915,
      "depth": 0,
      "replies": [
        {
          "id": "ll7k6ue",
          "score": 47,
          "body": "Not really. Anyone following the plan knows that TSMC is making Intel chips this quarter and next to allow Intel to skip a nod in their fabs, resulting in less revenue right now. The strategy is to trim the fat and regain manufacturing competence. Intel is playing leapfrog - 5 nodes in 4 years road map. \n\nWhen Panther Lake is in production, I expect revenue to be back on track since Intel will once again have a product made in-house. 2025 is and has always been Intel's pivotal year.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7k6ue/",
          "created": 1725312845,
          "depth": 1,
          "replies": [
            {
              "id": "ll7ljdc",
              "score": 16,
              "body": "We shall see. Intel has consistently failed to execute for the last decade plus. The recent chip failures are a prime example of those failures. While it's certainly possible they can turn it around, and using TSMC to manufacturer their chips gives them some breathing room for it... I'm not confident.",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7ljdc/",
              "created": 1725313311,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll7s2fd",
              "score": 4,
              "body": "Yes, really. Intel managed to miss all important market expansions (mobile devices, AI), while simultaneously being overtaken by almost bankrupt competitor on their primary product type - CPUs. All that despite being in position of strength.\n\nThere is 0% chance Intel will be back on track - best case scenario is trading blows with AMD in CPUs, while ARM chips away more and more desktop and server market, 3rd position in AI market (basically sharing remaining 5% with AMD after Nvidia takes their 95%), while leaving remaining markets like accelerators, networking and storage. And that's if they are successful.",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7s2fd/",
              "created": 1725315658,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "llag1jx",
          "score": 1,
          "body": "Once a company makes a serious malinvestment, as it sounds Intel have with their factories, it can be extremely difficult to recover. \n\nSee Bayer and 'Crop Science' - that venture has destroyed them and they still have no solution after all these years.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llag1jx/",
          "created": 1725363106,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll7qv1r",
      "score": 63,
      "body": "So intel is going to lean up, and reddit is bearish about that. Looks like I'm feeling bullish",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7qv1r/",
      "created": 1725315215,
      "depth": 0,
      "replies": [
        {
          "id": "llaqpht",
          "score": 4,
          "body": "The issue is the culture and attracting talent, all while structurally behind in foundry. Apparently they aren't getting their ohio fabs up until 2028 (delayed from 2025). That's very bad news for them.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llaqpht/",
          "created": 1725367851,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll89qrw",
          "score": 16,
          "body": "Lmao Intel and lean in the same sentence. They are bloated and even if they tried to lean up, all the motivated and talented engineers left.\n\nThey are left with corporate MBA and management holding together a skeleton ",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll89qrw/",
          "created": 1725322347,
          "depth": 1,
          "replies": [
            {
              "id": "ll9u5z9",
              "score": 1,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9u5z9/",
              "created": 1725349356,
              "depth": 2,
              "replies": [
                {
                  "id": "lla0s77",
                  "score": 3,
                  "body": "Boston Consulting Group strikes again",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/lla0s77/",
                  "created": 1725353923,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "llb89c0",
                  "score": 4,
                  "body": "They are just being replaced by other great American companies like NVIDIA, Meta, Alphabet, etc.  Circle of life",
                  "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llb89c0/",
                  "created": 1725374240,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ll7w2kr",
      "score": 47,
      "body": "Intel has more people than NVIDIA and TSMC combined. This is after the recent 15% layoffs \n\nWhat’s everyone doing?",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7w2kr/",
      "created": 1725317157,
      "depth": 0,
      "replies": [
        {
          "id": "ll9hoqq",
          "score": 25,
          "body": "Actually, TSMC is a foundry, and NVDA is a chip designer. Intel is both a foundry AND a chip designer.\nSo, just doing a basic comparison makes no sense like this.\n\n\nI'm sure that at all 3 companies 20% of the employees actually add most of the value. The difference is simply that Intel doesn't have much value to offer their customers compared to competition.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9hoqq/",
          "created": 1725341475,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll7xuqi",
          "score": 19,
          "body": "Grabbing my popcorn and watching a former giant crumble",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7xuqi/",
          "created": 1725317832,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll8dfss",
      "score": 6,
      "body": "Will this impact the stock price?",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8dfss/",
      "created": 1725323740,
      "depth": 0,
      "replies": [
        {
          "id": "llccq4c",
          "score": 1,
          "body": "Username checking tf out",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llccq4c/",
          "created": 1725387303,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll7fnpk",
      "score": 44,
      "body": "My previous employer’s CEO is on the board of Intel. They cut about 80% of the American staff (including me) and have heavily outsourced to India and Mexico. Not saying this is what is going to happen but one board member has done it before…",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7fnpk/",
      "created": 1725311287,
      "depth": 0,
      "replies": [
        {
          "id": "ll7njek",
          "score": 24,
          "body": "That wouldn’t work. You need talent. Trimming just to outsource seems like a good way to die out in the chip industry. Especially with all the subsidies they’ve received.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7njek/",
          "created": 1725314015,
          "depth": 1,
          "replies": [
            {
              "id": "ll7pk49",
              "score": 12,
              "body": "Exactly my thoughts. Semi-conductors rely on a delicate balancing act of requiring high-skill labor while also maintaining a low wage structure. It's impossible to have both in most places- like the US. \n\n\n Taiwan and China, are some of the few places where you can have both, but that advantage is fleeting (long-term) as wages will rise to meet skillets. As of right now, it is pure arbitrage for many Taiwanese and Chinese companies.",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7pk49/",
              "created": 1725314741,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ll7s5vz",
              "score": 2,
              "body": "You think they care about long term?\n90% only care just to extract enough capital for themselves before sinking",
              "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7s5vz/",
              "created": 1725315693,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ll82w4e",
          "score": 8,
          "body": "Pay 1/3rd the cost and get 1/10th the quality",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll82w4e/",
          "created": 1725319742,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll7wnti",
      "score": 5,
      "body": "About to see a lot if Intel employees looking for new jobs. We all know the first thing to go are workers, but im sure the board will reduce their salaries to zero.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7wnti/",
      "created": 1725317380,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll80sn4",
      "score": 6,
      "body": "Intel has had a significant innovation problem for many years now. They more or less rested upon their dominance in the CPU market and got complacent, which is a story as old as time especially in the tech industry. They relied way too heavily off innovation through acquisition rather then creating a culture of innovation from within.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll80sn4/",
      "created": 1725318945,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll85b6c",
      "score": 17,
      "body": "I’ve worked for Intel. The fact that Intel hasn’t replaced Pat tells you everything you need to know. They are always 2 steps behind every competitors move and don’t have the guts to make tough decisions, like fire Pat, because they have a culture of pretending like everything is OK. In fact on calls I bet you they are all praising each other while the house is on fire. Thats the intel culture.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll85b6c/",
      "created": 1725320659,
      "depth": 0,
      "replies": [
        {
          "id": "llbl78c",
          "score": 4,
          "body": "Replace pat with who though. He inherited a lot of bullshit but I don't think he understood the extent of the bullshit, and was way too optimistic over the past couple years. If we are still in this same situation in another year I'm sure he'll be gone.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llbl78c/",
          "created": 1725378477,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lloopll",
          "score": 1,
          "body": "Why would you fire Pat? Intel was dying regardless of Pat.  Shifting to manufacturing made a lot of sense.  And that requires a lot of money and time.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/lloopll/",
          "created": 1725567794,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll8dnyn",
      "score": 3,
      "body": "Man. From the gold standard of CPU’s to this shit show sinking ship. That was fast.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8dnyn/",
      "created": 1725323827,
      "depth": 0,
      "replies": [
        {
          "id": "ll9rrl6",
          "score": 3,
          "body": "You know, back in 2016 I was praying for their downfall, now it seems to have arrived. \n\nNow I'm praying for their rise again, because I dont want AMD to dominate the market.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9rrl6/",
          "created": 1725347716,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llbsvup",
      "score": 4,
      "body": "I'm curious as to why Intel needs to show good financial numbers while other tech companies can lose money for years on end and still maintain enormous valuations.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llbsvup/",
      "created": 1725380971,
      "depth": 0,
      "replies": [
        {
          "id": "llnq15j",
          "score": 1,
          "body": "I don't understand that either... I would like to know",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llnq15j/",
          "created": 1725556868,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll81fyp",
      "score": 3,
      "body": "About a decade late",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll81fyp/",
      "created": 1725319192,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll8egei",
      "score": 3,
      "body": "I wonder how the guy who put 700K into Intel is doing rn. Nana's revenge at its finest.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8egei/",
      "created": 1725324127,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll8m2fy",
      "score": 3,
      "body": "Pat is the reason VMware lost its way and was sold off to Broadcom. I think Broadcom should now buy Intel as it is known to collect tech relics.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8m2fy/",
      "created": 1725327075,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll9369h",
      "score": 3,
      "body": "Oh Nana, how -could- you?!",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9369h/",
      "created": 1725334004,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llabqch",
      "score": 3,
      "body": "RIP grandma’s-inheritance-guy",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llabqch/",
      "created": 1725360874,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll7pet8",
      "score": 7,
      "body": "Giga value trap",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7pet8/",
      "created": 1725314687,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll8fi7w",
      "score": 4,
      "body": "Cost cutting, we all know what that means.  Prepare for the mother of all layoffs.  Elon laid off like 6000 or 80% of employees when he took over Twitter/X. Intel has ~125K employees. Could end up being one of the biggest layoffs in US history.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8fi7w/",
      "created": 1725324524,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll7joxo",
      "score": 15,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7joxo/",
      "created": 1725312676,
      "depth": 0,
      "replies": [
        {
          "id": "ll7y1ey",
          "score": 12,
          "body": "They have just re-arranged the deck chairs now.  \n\nWatch people buy into it LOL.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7y1ey/",
          "created": 1725317902,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll7lyzi",
          "score": 2,
          "body": "That took like 2 hours.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7lyzi/",
          "created": 1725313464,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll7nnxf",
      "score": 8,
      "body": "I'm a buyer at $13",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7nnxf/",
      "created": 1725314061,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll87d5n",
      "score": 4,
      "body": "They just don't want to disappoint Grandma.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll87d5n/",
      "created": 1725321435,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll7oy0e",
      "score": 10,
      "body": "All these doom and gloom. I might double down soon on INTC.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7oy0e/",
      "created": 1725314519,
      "depth": 0,
      "replies": [
        {
          "id": "ll876e1",
          "score": 6,
          "body": "I'm kind of amazed by how confidently wrong redditors are about the current situation.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll876e1/",
          "created": 1725321363,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll8jnyx",
      "score": 2,
      "body": "Cutting fabs and limiting future growth seems really bad to me, but I honestly have no idea how the market will react. None.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8jnyx/",
      "created": 1725326131,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll8sj7v",
      "score": 2,
      "body": "You cannot simultaneously hope to be the supplier and top competitor to your customers and think that will be a growth driver to success.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8sj7v/",
      "created": 1725329558,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll8usqw",
      "score": 2,
      "body": "This has always been a huge red flag lol",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8usqw/",
      "created": 1725330463,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll8wx56",
      "score": 2,
      "body": "Nana’s not gonna like this.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8wx56/",
      "created": 1725331331,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll9a9nz",
      "score": 2,
      "body": "How much will the catering cost for said meeting?  /s",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9a9nz/",
      "created": 1725337418,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll9d9od",
      "score": 2,
      "body": "Oh Intel…",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9d9od/",
      "created": 1725338995,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llb21gu",
      "score": 2,
      "body": "Not looking good for Grandma’s $700k 😭",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llb21gu/",
      "created": 1725372114,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llbt0wo",
      "score": 2,
      "body": "Can’t really go lower than here so is this a buy?",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llbt0wo/",
      "created": 1725381016,
      "depth": 0,
      "replies": [
        {
          "id": "llbznk1",
          "score": 2,
          "body": "I think $15 is a much more accurate \"can't really go lower than here\"",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llbznk1/",
          "created": 1725383144,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llcv3ad",
      "score": 2,
      "body": "The pivotal biggest cut will be eliminating the clown role as CEO and getting a functioning adult who doesn't make cheesy public videos.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llcv3ad/",
      "created": 1725393173,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llddhxa",
      "score": 2,
      "body": "Stock will pop 20% as soon as CEO is fired",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llddhxa/",
      "created": 1725399058,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llenrph",
      "score": 2,
      "body": "I sure hope more bean counting fixes this 🙏",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llenrph/",
      "created": 1725417002,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llh98pd",
      "score": 2,
      "body": "Pat's last \"course-correct\" wasted tens of billions of cash only to abandon the plan, he's going to try fire-sell assets now to course-correct again?",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llh98pd/",
      "created": 1725463236,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll86yav",
      "score": 3,
      "body": "Intel needs to innovate to capture more market share.\n\nCutting costs on a sink ship is like plugging a few holes when the motor is also broken. It might stop sinking but it's still not going anywhere.\n\nCost cutting won't drive revenue growth.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll86yav/",
      "created": 1725321278,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll91pi6",
      "score": 2,
      "body": "As a PC Gamer I would never touch an intel processor with the current failure rates on 13th and 14th gen. We’re all buying AMD now.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll91pi6/",
      "created": 1725333347,
      "depth": 0,
      "replies": [
        {
          "id": "lld7lb3",
          "score": 3,
          "body": "AMD stock is in a good position to buy.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/lld7lb3/",
          "created": 1725397135,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lldry9f",
          "score": 1,
          "body": "Sounds like you speak for a lot of people",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/lldry9f/",
          "created": 1725404654,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll7gjiu",
      "score": 4,
      "body": "But the value invest bros will tell you to buy more… because… reasons.\n\nI just love taking my victory lap on this $INTC bear call. Basically for years I was hated for my bearish view. The one that finally nailed the coffin was when people kept saying “but they got billions in federal support” like it was a “bullish” sign. A business should never require federal support and be viewed as a good business.\n\nTo all the downvotes over the years, congrats, on, that, bag.\n\nEdit: lol even in this thread there are bros who are trying their best to cope. Upvotes for those copium posts. Downvotes for basically proving that $INTC is dead money. “A clock is right twice a day”. lol, just cleared another million at 36, it’s def more right than wrong me thinks. Don’t worry, when a bag holder sells for that loss, just know your money is in better hands 😂",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7gjiu/",
      "created": 1725311589,
      "depth": 0,
      "replies": [
        {
          "id": "ll9sbv8",
          "score": 3,
          "body": "I bought calls at $22 calls when it was at $18 and I'm loving the gains atm. I plan to sell soon and wait out another market overreaction. \n\nThey aren't going out of business but they made some missteps. I will take easy profit on the volatility though.",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9sbv8/",
          "created": 1725348098,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll7hnkq",
          "score": 16,
          "body": "Even a stopped clock is right twice a day…",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7hnkq/",
          "created": 1725311971,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll7iy1g",
      "score": 2,
      "body": "If you work at intel I would brush up my resume yesterday. 15% layoffs is just going to be the start.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll7iy1g/",
      "created": 1725312419,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll86lb6",
      "score": 3,
      "body": "I've never bought Intel. I think long term they will make a decent rebound. Suggestions when to buy in for a long term position?",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll86lb6/",
      "created": 1725321140,
      "depth": 0,
      "replies": [
        {
          "id": "ll8hg94",
          "score": 1,
          "body": "Layman logic to me implies if there is even a turn around it won’t be until 2028 when they have the actual new factory up and running",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8hg94/",
          "created": 1725325276,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll8l5ni",
      "score": 1,
      "body": "I thought they were talking about spinning off certain divisions.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8l5ni/",
      "created": 1725326717,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll8lst2",
      "score": 1,
      "body": "Intel was sleeping during the smartphones era. Name one phone with an intel chip? Name one tablet with an intel chip? What gaming system is using intel? Intel sells only 500,000,000, AI chips a year, while NVidia sells 2billion a quarter.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll8lst2/",
      "created": 1725326972,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll9cwdt",
      "score": 1,
      "body": "So calls it is - got it",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9cwdt/",
      "created": 1725338797,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll9kna5",
      "score": 1,
      "body": "RemindMe! 2 Years",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9kna5/",
      "created": 1725343221,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll9ok3c",
      "score": 1,
      "body": "Another possible 9%+ jump today",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9ok3c/",
      "created": 1725345639,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll9umq9",
      "score": 1,
      "body": "Don’t worry intel will grow next summer👍",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/ll9umq9/",
      "created": 1725349674,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llav7pt",
      "score": 1,
      "body": "They should be cutting liabilities instead. Silly Intel.",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llav7pt/",
      "created": 1725369613,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llcud5r",
      "score": 1,
      "body": "I see this as good news",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/llcud5r/",
      "created": 1725392946,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lld6l9w",
      "score": 1,
      "body": "!remindme 5 years",
      "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/lld6l9w/",
      "created": 1725396817,
      "depth": 0,
      "replies": [
        {
          "id": "lld6owg",
          "score": 1,
          "body": "I will be messaging you in 5 years on [**2029-09-03 20:53:37 UTC**](http://www.wolframalpha.com/input/?i=2029-09-03%2020:53:37%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/lld6l9w/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1f7hjwm%2Fintel_ceo_will_reportedly_present_plans_to_cut%2Flld6l9w%2F%5D%0A%0ARemindMe%21%202029-09-03%2020%3A53%3A37%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201f7hjwm)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "permalink": "/r/stocks/comments/1f7hjwm/intel_ceo_will_reportedly_present_plans_to_cut/lld6owg/",
          "created": 1725396849,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ],
  "stockTickers": {
    "post_summary": "Intel CEO will reportedly present plans to cut assets at an emergency board meeting due to recent losses and strategic challenges.",
    "companies": [
      "Intel",
      "Altera"
    ],
    "tickers": [
      "INTC"
    ],
    "main_ticker": [
      "INTC"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Intel is planning to present strategies aimed at asset reduction and cost-cutting during an emergency board meeting to handle financial losses and improve stability.",
    "stock_recommendations": "The user is not recommending buying or selling Intel stock directly.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "The sentiment is neutral as the post discusses Intel's strategic shift and challenges without making a direct stock buying or selling recommendation.",
    "sentiment": "neutral"
  }
}