{
  "title": "HIMS: Dark Patterns and what their Moat is (new take)",
  "score": 70,
  "selftext": "**Intro & numbers:**  \nThere have been a few DD on HIMS in this forum but I have a few new notes to add.\n\nExcellent growth (75% CAGR), 81% Gross Margin (Q2 2024), and trading at about 15x forward earnings...with $1.4B revenue, and 3 consecutive quarters of GAAP profitability.   Almost all of this is prior to GLP1...which added around $10-15M rev. last Q.  No debt.  $200M in bank.  \n  \n$3.2B Market cap....I see it as at least 3x undervalued just this year.  \n\nThey are the #6 health app on Apple apps.\n\nThey are taking 54% of all new entrants the entire telehealth market, with about 2M users (estimated, 1.9M as of Q2 earnings).\n\nInsider buy of millions on open market around $16-$19 (board member) and new board members as titans of industry (former Novo COO, Netflix subscription goddess, etc.)\n\nThey sell hair loss, weight loss, ED, and Hormone to come soon! among others.\n\nThe biggest fear from investors is : This excellent growth can't continue.  Telehealth is the future, HIMS is the growth leader by marketshare, but look at Teledoc!\n\n**Missunderstandings on the stock:**\n\n^(GLP1 shortages are ending, they won't be able to sell it anymore!)\n\n  \n-doesn't matter, they will sell customized doses, confirmed on CNBC by LLY CEO btw, or their extremely profitable and cheap to consumer oral (10x the rev of their glp1 currently btw).\n\n^(LLY or NOVO might sue them!)  \n\n-Yes they might.  But if HIMS does what they say they are doing, sell only customized doses of compounded glp1, non patented GLP1 (Liraglutide) made in house (vertically integrated), or orals (also VI), they will not be in trouble.  In fact, they will likely just sell branded in order to bring in customers and then cross sell more profitable products, but more on that later.\n\n^(Teledoc failed! Telehealth is trash)\n\n-You really think people other than boomers with no life want to go to the doctor for ED, hair loss, weight loss, or even most common ailments?  No one wants to do that.  Americans will spend $50 to have mcdonalds delivered with uber eats rather than drive to Mcdonalds for $5.  Americans spend excessively for convenience.  HIMS will give you 1 pakcage a month with all your drugs.  Teledoc was garbagio on a million software platforms, failed to modernize, no margin, no marketing, horifically bad operations, and took 20 years to reach 2.8B rev.  even then it's only at 1/3rd the price to sales ratio of HIMS, showing how undervalued a growing technology first company taking 54% of market share really is right now.\n\n\n\n**Finding their moat:**\n\nLook at their website: it's extremely clean and user friendly, uses back and forth dialogue to make recommendations, and when you get to weight loss end boss, it puts Oral Pills (compounded, $70) next to compounded GLP1s (Semaglutide, etc.) for couple hundo. and branded GLP1 as well, so legit Ozempic etc. is available for full price (thousands).  HIMS own COO has been taking the compounded GLP1 as proof of her faith in it.\n\nFor the record, the reason you want to see compounded sales increase is because it's extremely profitable vs branded which is a wash.  However, we value growth AS WELL as realize most glp1 customers fall off (fatigue from injecting, lose weight and dont want to inject drugs anymore and try to keep it off naturally as their set point has adjusted).  Here we will likely eventually see cross sell to orals, as they have about 33% of the efficacy.\n\nThis cross sell hasn't happened yet, if it does their $2M users will generate absurd revenue.  But it's only had GLP1 for a few months.\n\nSo what is different than before?  WHERE IS THE MOAT?  It's in the way they present these products for future cross sell.  It's how they make the user experience excellent.  It's how they market.  It's how the have such efficient operations to have such a high gross margin.\n\nOk how can marketing and operations be a moat?\n\nDark Patterns; the very best master this via many methods: Subscription methods, colors on the webpage, wording, packages, bundles, etc.\n\nWhat companies excel at Dark Patterns?  Amazon is generally considered the best at this, with Prime being difficult to cancel, BUY now buttons all over, subscription models with discounts but still overpaying, and focus on customer experience so we all shut up and overpay for the convenience.  Amazon has at least 11 different Dark Patterns in their buying process.\n\nMarketing is no longer some cut and paste thing in 2020's, nor is branding.  HIMS has mastered both, with an amazing gross margin to boot.  Excellence in all areas of business operations.  When all 3 of the pillars are aligned you have a moat.  Reminds me of Amazon when they sold \"books.\"  They spend all of their excess revenue that would be profit into MARKETING.  WHY DO THEY DO THIS?  Because they are taking ALL OF THE MARKETSHARE.  They have KPIs associated to their spend and thus it makes sense to pump as much cash as possible into that!  Remember when people were mad Amazon wasn't profitable?\n\n**Potential upcoming Catalysts:**\n\nThere is a rumor of Testosterone replacement therapy coming to HIMS given they announced in Q2 they are bringing hormone therapy to their platform.  Given Test rep therapy lends itself to the subscription model (it's legal steroids, xD) and is basically TAKEN FOR LIFE, this combined with HIMS recently aquired facility (FDA approved) that will be able to manufacture their own Test rep therapy, Liraglutide (a GLP1) and other drugs, means HIMS will continue to take market share, offer all drugs under one roof, and be extremely profitable regardless of if the FDA makes them stop compounding Tirz or Sema versions of GLP1.  TAM for Test rep therapy is $1.8B and will likely grow to $3B in the next 6 years, but i'd anticipate even more TAM growth as US men in their 20s are the least sex'd ever.  Test rep therapy is the fountain of youth and we will see more men trying to date in their 30s and 40s (50s as well) hopping on it, along with many other HIMS offerings.  This is like investing in cat food for all the growing # single mothers out there.  \n  \nTHEY WILL STILL SELL NON PATENTED GLP1, granted it's not as good BUT ITS CHEAP AS FUCK and who is spending thousands on Ozempic?  HIMS was never meant for the rich but luckily the middle class in the US have a ton of expendable income.   \n\nInsider buys: The stock is around where it was when we saw insider buys last quarter, as their financials are improving rapidly i'd be surprised if some new additions don't make some buys as well.\n\nContinued execution: This company has executed quarter after quarter.  It is a beast.\n\nThese catalysts are no joke: The stock runs insanely hard when stuff like this occurs so i'd say buy and hold vs. try and time this, it legit will open up 20-30% at a time if there is an insider buy.  Price is down just from a bit of a hangover from the GLP1 yoyo that no one understands fully.  The reason potential lawsuits don't matter: HIMS can just sell branded GLP1 and their own unpatented ones.  They will sell personalized doses just enough to keep\n\n**How to make money on this Asymetric Opportunity on the ground floor of the Telehealth industry:**\n\nThe price has fallen around 30% on news of GLP1 shortages ending, despite the fact that in 7 months they had $100M revenue growth in their oral weight loss pill alone, at $70.  Even if the FDA no longer allows them to compound, they will continue to sell branded GLP1 and that gets customers to...YOU GUESSED IT, DARK PATTERN buttons with subscriptions and other extras and substitutions for orals etc. that will maintain some margin and most importantly: FUEL GROWTH.\n\nI think this 30% pullback and extreme drop in volume and IV make long term call options very interesting again right now.  I'd suspect we see $45 end of year if smart money decides this is a risky but great chance at a 10X gain over the next few years.  I think $11 is the floor, but the stock can move fast so if I wasn't already in I'd enter now rather than wait.  It's at $14.7 range...the price they had before GLP1 was announced.\n\nShares are a smarter play...this stock can skyrocket 20-30% in a day depending on news.\n\nI'm at the point that random locals from the barber to friends are recommending HIMS for random things; not even using the drug names by this point. Just \"go to HIMS for that.\"  This convinced me that the cross sell opportunity is there.  People aren't saying \"go shop on Amazon for your semaglutide and ur xyz drug it's super great and nice and clinical and confusing with 3 carts etc....\"  \n\nI think there is of course risk they stop executing, but I don't see a more solid opportunity for a 10x and thus the risk return fits my profile.  Granted, my risk profile is infinite.  ",
  "link_flair_text": "DD",
  "id": "1f7rwg6",
  "num_comments": 59,
  "created_utc": 1725340126,
  "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/",
  "comments": [
    {
      "id": "ll9fci6",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 week ago\n**Total Comments** | 14 | **Previous Best DD** | \n**Account Age** | 1 week | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9fci6/",
      "created": 1725340140,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll9vtp7",
      "score": 15,
      "body": "Buying shares, if it drops to single digits I will be servings frosty on two different shifts at the Wendy's.",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9vtp7/",
      "created": 1725350494,
      "depth": 0,
      "replies": [
        {
          "id": "llbyfc9",
          "score": 10,
          "body": "I would full port if this thing drops to single digits",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llbyfc9/",
          "created": 1725382746,
          "depth": 1,
          "replies": [
            {
              "id": "ls2dzlk",
              "score": 1,
              "body": "Mods remember this i hope he does it",
              "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ls2dzlk/",
              "created": 1729012042,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ll9w3at",
          "score": 3,
          "body": "Frosty are important",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9w3at/",
          "created": 1725350680,
          "depth": 1,
          "replies": [
            {
              "id": "lle19jc",
              "score": 3,
              "body": "\"Ladies.... Go Frost yourselves\"",
              "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/lle19jc/",
              "created": 1725408402,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "llai7uj",
      "score": 12,
      "body": "Saw a hims ad below this![img](emote|t5_2th52|4271)",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llai7uj/",
      "created": 1725364143,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll9fbpk",
      "score": 9,
      "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9fbpk/",
      "created": 1725340127,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llaslte",
      "score": 10,
      "body": "This stock is ass, but I am a shareholder.  The stock is currently priced lower than the pre-GLP-1 announcement and has since had an ER where they beat revenue, EPS, and free cash flow expectations by a massive number, and upped guidance.  \n\nBut the GLP-1 uncertainty is killing it; I'd almost prefer they never mentioned offering it at all.",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llaslte/",
      "created": 1725368604,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll9j0l7",
      "score": 37,
      "body": "The stock ran up from $3 -> $25 and has pulled back a bit. No need to try to convince WSB, they will get in late as always. The chart is forming a cup and handle and with no debt, a ton more growth insight, and more products on the way this thing will moon.\n\n\nPositions: $20c Jan 17 ‘25",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9j0l7/",
      "created": 1725342249,
      "depth": 0,
      "replies": [
        {
          "id": "ll9kdwy",
          "score": 51,
          "body": "cup and handle DEEZ NUTS",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9kdwy/",
          "created": 1725343066,
          "depth": 1,
          "replies": [
            {
              "id": "llb4jbe",
              "score": 5,
              "body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)",
              "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llb4jbe/",
              "created": 1725372975,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ll9p4st",
          "score": 2,
          "body": "Jan 25 20c might still be a good idea.  I may look at picking some more up in a few weeks.",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9p4st/",
          "created": 1725346013,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llaourh",
          "score": 1,
          "body": "How many triangles on the chart? Less than 10 and I’m out.",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llaourh/",
          "created": 1725367091,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llbuj8y",
          "score": 1,
          "body": "Astrology mfs exist everywhere lol",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llbuj8y/",
          "created": 1725381506,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llacp0k",
      "score": 6,
      "body": "I agree with you.\n\nNo debt and growing. Profitable.\n\nDoubt they will get sued. Similar to generics.\n\nAlso have seen some ads when I watch Amazon Prime Video.",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llacp0k/",
      "created": 1725361393,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ll9fc11",
      "score": 4,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 week ago\n**Total Comments** | 14 | **Previous Best DD** | \n**Account Age** | 1 week | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9fc11/",
      "created": 1725340132,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llbmhya",
      "score": 4,
      "body": "I'm not reading that. Whats the tldr",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llbmhya/",
      "created": 1725378908,
      "depth": 0,
      "replies": [
        {
          "id": "llbmu43",
          "score": 7,
          "body": "it literally can't go tits up",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llbmu43/",
          "created": 1725379016,
          "depth": 1,
          "replies": [
            {
              "id": "llbo404",
              "score": 2,
              "body": "Buy calls got it 👍",
              "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llbo404/",
              "created": 1725379430,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "llb9o7a",
      "score": 5,
      "body": "Beta, simp, fat, balding, cuck males with limp dicks are at an all time high so why not just make that your TLDR and post your positions \n\n**TICKER DATE STRIKE**\n\n#POSITIONS OR BAN",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llb9o7a/",
      "created": 1725374717,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llbkyby",
      "score": 3,
      "body": ">How to make money on this Asymetric Opportunity on the ground floor of the Telehealth industry:\n\n\n\n\nWhy do you write like a motley fool article trying to hype up a pump and dump?",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llbkyby/",
      "created": 1725378398,
      "depth": 0,
      "replies": [
        {
          "id": "llbmrwm",
          "score": 4,
          "body": "sorry that I used words relevant to the DD and stock.  \n\nBigger question is why you are reading Motley fool articles.",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llbmrwm/",
          "created": 1725378997,
          "depth": 1,
          "replies": [
            {
              "id": "llby2ot",
              "score": 5,
              "body": "Shit buddy i dont read anything",
              "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llby2ot/",
              "created": 1725382635,
              "depth": 2,
              "replies": [
                {
                  "id": "llc1n2s",
                  "score": 2,
                  "body": "same",
                  "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llc1n2s/",
                  "created": 1725383782,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "llbvh6u",
      "score": 3,
      "body": "Hims can go fuck itself lost my entire portfolio last time I went in lol just buy Lily.",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llbvh6u/",
      "created": 1725381810,
      "depth": 0,
      "replies": [
        {
          "id": "llc0g26",
          "score": 8,
          "body": "unlike the geniuses here who want to make a 10% return on trillion dollar companies, i'd rather attempt to actually make life changing money.\n\nIf you want that you need to take risk.\n\nLLY and Novo are for old rich people to buy and hold.  good pharma companies.",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llc0g26/",
          "created": 1725383400,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llcne1h",
      "score": 2,
      "body": "Curious how many people you know that take GLP-1 injectables? How many of those people use compounded versions? Why do those people use compounded versions? Would they switch to brand name version if covered by insurance or if readily available at local pharmacy?",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llcne1h/",
      "created": 1725390716,
      "depth": 0,
      "replies": [
        {
          "id": "llcqgdh",
          "score": 1,
          "body": "I don't think anecdotes really matter.  these versions added $11M rev in Q2 for HIMS.  I don't think injectibles will be the future anyways as oral GLP1 becomes more popular.\n\nThat's why the play here is just in platform and how they manage to grow it long term.\n\nA large complaint for GLP1 is that people can't get it covered by insurance because it's typically considered cosmetic to use it to lose weight (not the case if they are diabetic for example).\n\nThey use compounded versions because they have to pay out of pocket, it's about as effective, it's shipped direct to their home, and it's $100-200 per month vs. thousands.\n\nLiraglutide for example is a GLP1 not covered under patent (can be produced forever by HIMS) and they will likely swap to that as their low cost offering if they can't compound semaglutide anymore.  The beautiful part is they can make it in house in their vertically integrated compounding facility,preserving margin.",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llcqgdh/",
          "created": 1725391700,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llaemiz",
      "score": 2,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llaemiz/",
      "created": 1725362402,
      "depth": 0,
      "replies": [
        {
          "id": "llb2yj0",
          "score": 2,
          "body": "Sounds more like behaviors that are wrong with young people vs company.\n\nMoney > all",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llb2yj0/",
          "created": 1725372438,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ll9ssyk",
      "score": 3,
      "body": "If you still on HIMs you deserve whats coming.",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9ssyk/",
      "created": 1725348423,
      "depth": 0,
      "replies": [
        {
          "id": "ll9ti65",
          "score": 9,
          "body": "Tell me so that I might avoid it?",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9ti65/",
          "created": 1725348905,
          "depth": 1,
          "replies": [
            {
              "id": "llftobd",
              "score": -1,
              "body": "HIMS only has acess to GLP1 drugs because they are on a shortage list, after they come out of it, HIMS wont be able to sell. They dont manufacture anything, it went up because getting those drugs  was near impossible, but not anymore.\n\nIn 6 months, it will have lost all of its gains.",
              "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llftobd/",
              "created": 1725440583,
              "depth": 2,
              "replies": [
                {
                  "id": "llfv8yz",
                  "score": 3,
                  "body": "Ah.  You are very wrong.  I’m glad you are wrong I was worried you might be intelligent.\n\nThey’ve just purchased an FDA approved compounding facility where they can produce Liraglutide (glp1) as well as testosterone replacement therapy, and other compounded drugs.  Liraglutide patent will no longer be valid in Nov., and it’s better tolerated than other glp1 (though less efficacious).  So it can be produced forever, shortage or not.\n\nWhen the shortage ends they can still produce and sell customized doses of semaglutide and tirzepatide, the most effective glp1s, according to LLY CEO(cnbc interview specifically mentioning HIMS) and HIMS CEO himself.\n\nOn top of that, they will continue to resell branded glp1 such as semaglutide and tirzepatide once shortage ends, though for less margin of course.",
                  "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llfv8yz/",
                  "created": 1725441686,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llfxhmk",
                      "score": 2,
                      "body": "Go all in then son, itll work out.\n\nThey are a telehealth company, yet you think they will produce GLP1s. They can compound, they will never have their own.\n\nJust because they purchased the facility doesnt mean they can produce Liraglutide, which they cant. Guess who owns the patent for Liraglutide?\n\nThey can sell compounded drugs, but what do you think will happen when theres no shortage and getting it directly is cheaper/refunded? Or when LLY/NVO simply do not sell to HIMs and other compounds?\n\nHeres what nvo said about the lawsuit on Liraglutide when Teva Pharma tried selling it - \"Novo Nordisk will continue to defend our broad intellectual property portfolio for innovative drugs against challenges\"\n\nJesus, it seems like you watched a news piece and believe everything they said. You have no idea what ur talking about.\n\nBut clearly intelligence isnt your strong point, considering you are invested in HIMs. Thats why you are down 20% in a single month, while NVO is up 7% and LLY is up 20%.",
                      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llfxhmk/",
                      "created": 1725443217,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "llwlc4g",
                          "score": 3,
                          "body": "Novo's Liraglutide patent ended this year.  Google it or here's a [random link](https://www.pharmavoice.com/news/drug-patent-expirations-xarelto-abilify-victoza/713384/).  /u/ZombieFrenchKisser\n\nGLP1s are just icing on the cake for HIMS, was growing revenue 40% yoy before GLP1s.",
                          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llwlc4g/",
                          "created": 1725680231,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lm8u63t",
                              "score": 1,
                              "body": "Thats not true, Victoza is out of patent, but not the compound Liraglutide.\n\nLiraglutide **U.S. Patent No.** **6,268,343**",
                              "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/lm8u63t/",
                              "created": 1725867874,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lmcnqy3",
                                  "score": 1,
                                  "body": "Thanks for the info.  You're right looks like Victoza is only prescribed for diabetes, and Novo still has a patent on Liraglutide for weight loss (Saxenda) until 2026.  Whether or not prescribers will be able to offer Liraglutide off-label for weight loss prior to 2026 looks uncertain (https://my-bmi.co.uk/medical-therapy/when-will-liraglutide-be-generic/).",
                                  "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/lmcnqy3/",
                                  "created": 1725921921,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "llglwug",
                          "score": 1,
                          "body": "HIMS is wildly successful outside of GLP-1.  GLP-1 made up around 5% of it's total revenue for the last quarter.  That said, the stock is now lower than it was when they initially announced carrying GLP-1s.  I honestly think the stock would be doing better if they didn't touch GLP-1s.",
                          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llglwug/",
                          "created": 1725455234,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "llgxiqi",
                              "score": 1,
                              "body": "Thats because they arent in GLP1s, they sell compounded because they overpay, and since theres a shortage, they can sell the compounded drugs for more money over the counter. This will soon end as LLY already took Zepbound out of the shortage list, and soon Ozempic will follow. \n\nThey should stick to being the telehealth company and not try to jump on the GLP1 trend.",
                              "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llgxiqi/",
                              "created": 1725459368,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lun0n8h",
      "score": 2,
      "body": "Let's wake this thread back up with the newest news of GLP1 off of shortage list and Q3 earnings coming up. They're actually still able to sell it for months. In my regarded opinion, I think earnings will be a blowout and I'm selling covered strangles on thursday holding through earnings.",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/lun0n8h/",
      "created": 1730344031,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llbgafx",
      "score": 1,
      "body": "I like what HIMS is trying to do, but they have issues. First they're not a medical, teledoc, or RX company they're a lifestyle company that sells drugs. Contrary to your view that \"marketing is their moat\", I believe marketing is part of their issue. Specifically the asymmetry between their marketing / target demographic (millennials and maybe older zoomers) and the products they sell. Young men generally don't need ED pills, shooting the club up as soon as you walk in is a skill issue, and skin care is niche. Hairloss treatment is their only offering that overlaps well with millennials. And now maybe also GLP-1 but they're not the only shop in town with this offering\n\nThey need to start taking their business seriously. They've been around for 4/5 years now and really only sell 6 products. Where are the HIMS branded daily vitamins? Supplements like melatonin? Nootropics? Workout supplements? Teeth whitening strips? Electric toothbrushes? Etc.. They need (for a lack of a better term) a whole ecosystem of products",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llbgafx/",
      "created": 1725376899,
      "depth": 0,
      "replies": [
        {
          "id": "llbwzgd",
          "score": 6,
          "body": "I work in a similar business.\n\nYou're dead wrong if you think young men aren't using ED meds.",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llbwzgd/",
          "created": 1725382288,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llc0wzb",
          "score": 3,
          "body": "Lmao this is a terrible take.  Imagine taking your company public in 3 years and homeboy over here is saying you aren’t taking things seriously",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llc0wzb/",
          "created": 1725383552,
          "depth": 1,
          "replies": [
            {
              "id": "lukmzfj",
              "score": 1,
              "body": "This was never a company that should have been taken public. They did it because private markets wouldn’t keep funding it.",
              "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/lukmzfj/",
              "created": 1730316302,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ll9iuv9",
      "score": -3,
      "body": "You should always look at competitors. Boy are there many. For instance: RocketRx. And they are cheaper too.",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9iuv9/",
      "created": 1725342157,
      "depth": 0,
      "replies": [
        {
          "id": "llaunca",
          "score": 7,
          "body": "RocketRx is a gas station boner pill compared to Hims viagra from a branding perspective. Brand matters when it comes to taking medicine",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llaunca/",
          "created": 1725369399,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ll9kdr8",
          "score": 6,
          "body": "believe me, the time i've spent I have definitely looked at competitors.  I'm convinced in this space, small diferences in price don't matter that much.\n\nCustomer experience, gross margin, growth, brand recognition, and customer acquisition cost matter the most.\n\nRocketRX is very similar to HIMS in look, but it's not as polished.  definitely not as good of customer experience.  Also less offerings.  \n  \nPeople don't want to shop for a bargain and order from a few different telehealths, they want 1 telehealth IMO.  \n  \nI could be wrong but for every person that says: competition, I say, the average consumer is less involved in shopping this stuff.  they are buying mainly on their phone, in the easiest way possible.  Shit, the average telehealth customer probably is buying on an iphone with a cracked screen.  \n  \nThis is why I think there's value here: 54% of new telehealth customers are coming to HIMS platform and pharma investors just see HIMS as a copycat because lets be honest; those geniuses make fat money on DRUG companies where efficacy is everything.  They don't care about revenue etc, all that matters is does the drug work?    \n  \nThis is ecomerce/retail.  All that matters here is the above: branding, operations, marketing, etc.  \n  \nAnd I just don't see anyone executing like HIMS, with the bench of talent HIMS has.  \n  \nAgain, def. agree competition is the #1 threat but I think the past few years have proven who stands out most to custmers.",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9kdr8/",
          "created": 1725343063,
          "depth": 1,
          "replies": [
            {
              "id": "llaczh4",
              "score": 2,
              "body": "As a medical student….\n\nYou are actually on the money 😅. Satisfactory experiences is a a huge part when it come medicine",
              "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llaczh4/",
              "created": 1725361548,
              "depth": 2,
              "replies": [
                {
                  "id": "llatvna",
                  "score": 2,
                  "body": "I’m not disagreeing with you but this is not something exclusive to medicine….. it’s business 101 with any fucking industry.",
                  "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llatvna/",
                  "created": 1725369102,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llb37ye",
                      "score": 1,
                      "body": "Ya I think my point is that the competition seems very ahem… “artistic” in their approach to customer satisfaction.  Like someone asked some nerds in lab coats for their advice on marketing.",
                      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/llb37ye/",
                      "created": 1725372527,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ll9fvtd",
      "score": -5,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9fvtd/",
      "created": 1725340441,
      "depth": 0,
      "replies": [
        {
          "id": "ll9gel2",
          "score": 10,
          "body": "Curious why you think it is a shitty company?  Based on financials alone if I said this was a rocketship software company you would agree it should be valued at $300.  \n\nSeriously curious sir.",
          "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9gel2/",
          "created": 1725340737,
          "depth": 1,
          "replies": [
            {
              "id": "ll9kmfh",
              "score": -14,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9kmfh/",
              "created": 1725343206,
              "depth": 2,
              "replies": [
                {
                  "id": "ll9ofcs",
                  "score": 2,
                  "body": "Some $15 some $20.  My price target is 45 eoy.  Next year 60",
                  "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9ofcs/",
                  "created": 1725345555,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ll9mym2",
                  "score": -2,
                  "body": "Do you own an air fryer?",
                  "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/ll9mym2/",
                  "created": 1725344632,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lmeqtve",
      "score": 0,
      "body": "Man I hate it when these DDs don't have a TLDR",
      "permalink": "/r/wallstreetbets/comments/1f7rwg6/hims_dark_patterns_and_what_their_moat_is_new_take/lmeqtve/",
      "created": 1725957120,
      "depth": 0,
      "replies": []
    }
  ]
}