{
  "title": "MarketWatch: September is historically the worst month for U.S. stocks. What investors need to know.",
  "score": 169,
  "selftext": "**September is historically the worst month for U.S. stocks. What investors need to know.**\r  \n[https://www.marketwatch.com/story/september-is-historically-the-worst-month-for-u-s-stocks-what-investors-need-to-know-4b5fd927](https://www.marketwatch.com/story/september-is-historically-the-worst-month-for-u-s-stocks-what-investors-need-to-know-4b5fd927)\n\n\r  \n*The U.S. stock market finished a turbulent month on a positive note after recovering from a bout of heavy selling on Aug. 5 that plunged Wall Street to its worst day in nearly two years.*  \n*But if the past is any guide, seasonal weakness in September could spoil the momentum via a heightened level of volatility in the financial markets.*   \n*History suggests September is the worst month of the year in terms of stock-market performance. The S&P 500 SPX has generated an average monthly decline of 1.2% and finished higher only 44.3% of the time dating back to 1928, according to Dow Jones Market Data.*   \n*The historical performance of the Dow Jones Industrial Average DJIA and the Nasdaq Composite COMP also indicates stocks could experience a lackluster period in September, with the two indexes delivering an average monthly drop of 1.1% and 0.9%, respectively. The Dow has recorded positive returns in September only 41.7% of the time since 1897, while the Nasdaq has finished higher 54.1% of the time since 1971, according to Dow Jones Market Data.*   \n*“The summer vacation cycle ends \\[in September\\] and people go back to their desks to trade stocks again. In fact, September is the second-highest month for trading volume of the whole year,” Liz Young Thomas, head of investment strategy at SoFi, said in emailed commentary on Thursday.*   \n*Trading volume usually remains light in the summer months, with July and August on average seeing the lowest number of shares changing hands on the New York Stock Exchange, according to FactSet data.*   \n*More trading activity can lead to more volatility in the stock market, Young Thomas told MarketWatch in a follow-up interview on Friday. The S&P 500’s strong gains during the summer months of 2024, as well as its quick recovery from the Aug. 5 rout may prompt investors to “reposition” their portfolios after “a period of returns that’s maybe a little bit outsized,” she added.*   \n*“If people have been away or haven’t done as much trading as usual through the summer, they come back in September and realize they’ve got a bunch of gains in their equity portion,” Young Thomas said. “You could see people take some gains in September just to get that positioning in the right place.”*  \n*Meanwhile, September brings what could be the start of the Federal Reserve’s interest-rate-cutting cycle — if inflation and labor-market data between now and the Fed’s Sept. 17-18 meeting still keeps the door open for rate reductions.*  \n*“We are in a period where we’re looking down the barrel of our first rate cut in a very long time … \\[but\\] markets are just not quite accustomed to that yet,” Young Thomas noted. “We’ve been hearing \\[about\\] rate cuts and been anticipating them in a positive way, but there’s really no guarantee that they will end up being positive for the duration of that cutting cycle.”*   \n*Last Friday’s PCE inflation data looked likely to keep the Fed on a path to cutting rates three times this year by 25 basis points each, according to the CME FedWatch Tool. But investors haven’t ruled out the chance of a more aggressive, 50-basis-point cut should this week’s August employment data show further slowing in the labor market.*   \n*Adding to potential volatility in the stock market is the upcoming U.S. presidential election. The S&P 500’s historical performance during election years suggests stocks could experience a lackluster and volatile period between now and Nov. 5, Sam Stovall, chief investment strategist at CFRA Research, told MarketWatch last month.*  \n*However, portfolio managers at Little Harbor Advisors said there’s no “imminent worry” in the stock market in September as Wall Street’s closely watched “fear gauge,” the Cboe Volatility Index VIX, has been in a free fall after peaking above 65 in early August.*   \n*The VIX has fallen 77% since Aug. 5 to remain well below its long-term average of around 20 as of Friday afternoon, according to FactSet data.*  \n*“Hedging is something you need to be very careful with, because hedging when nothing’s happening is very expensive,” said Matthew Thompson, portfolio manager at Little Harbor Advisors.*  \n*“We prefer to wait until we see signs in the VIX \\[that it is surging\\], and that’s where we’re going to start to hedge,” Thompson told MarketWatch on Friday. “You will get a lot of calendar items that could get \\[the VIX\\] moving in September, but as of now, we’re just watching and waiting.”*  \n*U.S. stocks finished August with monthly gains on Friday. The S&P 500 advanced 2.3% last month, while the Dow gained 1.8% and the Nasdaq rose 0.7% for the month, according to FactSet data.*",
  "link_flair_text": "Broad market news",
  "id": "1f86se0",
  "num_comments": 57,
  "created_utc": 1725386735,
  "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/",
  "comments": [
    {
      "id": "llcgn28",
      "score": 171,
      "body": "Everybody knows that, this is not a new revelation. Either do nothing or be ready to buy. Selling now is just reacting too late.",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcgn28/",
      "created": 1725388557,
      "depth": 0,
      "replies": [
        {
          "id": "llcpmom",
          "score": 49,
          "body": "Eh. Technically since September is traditionally the worst month, NOW is when you want to sell, before the REST of September hits. \n\nBut yeah. No reason to panic for those who know about this.",
          "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcpmom/",
          "created": 1725391436,
          "depth": 1,
          "replies": [
            {
              "id": "llcshaz",
              "score": 30,
              "body": "So you’re saying my portfolio will get even more red?",
              "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcshaz/",
              "created": 1725392349,
              "depth": 2,
              "replies": [
                {
                  "id": "llcy21a",
                  "score": 40,
                  "body": "Beating will continue until morale improves",
                  "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcy21a/",
                  "created": 1725394111,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lldc6x6",
                      "score": 6,
                      "body": "Beatings*",
                      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lldc6x6/",
                      "created": 1725398626,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lldcpt2",
                          "score": 2,
                          "body": "No, it’s beating.  Me beating it to my puts.",
                          "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lldcpt2/",
                          "created": 1725398798,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lld8b0w",
              "score": 2,
              "body": "the other end matters as well - when to buy back in. Buying at the end of September also seems too late.",
              "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lld8b0w/",
              "created": 1725397362,
              "depth": 2,
              "replies": [
                {
                  "id": "lldmzcp",
                  "score": 3,
                  "body": "Often, yeah!\n\nAnd there’s mad switch ups too—for example, if this September is a negative month it will be the third time in history there’s been a fifth negative September in a row. Not impossible, and it’s been something like 35 or something years since the last time so it’s possible. \n\nBut we could easily have a positive September after a few days of dips. \n\nBut basically, unless someone is in it for the long haul where these averages will work in their favor, the only direction you can bet the market will move is to the right.",
                  "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lldmzcp/",
                  "created": 1725402319,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lld8k73",
          "score": 4,
          "body": "> Selling now is just reacting too late.\n\nSince it's actually the last two weeks of September that are historically worse than average, it might not be.",
          "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lld8k73/",
          "created": 1725397444,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llcqcpy",
      "score": 53,
      "body": "Moreover, the first trading week after Labor Day is one of the worst weeks of the year.",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcqcpy/",
      "created": 1725391668,
      "depth": 0,
      "replies": [
        {
          "id": "lld5t6m",
          "score": 2,
          "body": "Heard stories about market crashes usually start-stick-stay/ Aug-sept-oct?",
          "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lld5t6m/",
          "created": 1725396571,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llcs6e1",
      "score": 54,
      "body": "Averages -1.2% monthly decline.\n\nFirst day of Sept\n\nSPY -2.15%\n\nQQQ over -3%\n\nLol",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcs6e1/",
      "created": 1725392253,
      "depth": 0,
      "replies": [
        {
          "id": "llcty25",
          "score": 17,
          "body": "Average has green months included. If you count only red months, that probably goes up to 6% or so, and peak to trough probably closer to 10%",
          "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcty25/",
          "created": 1725392814,
          "depth": 1,
          "replies": [
            {
              "id": "lldcmwf",
              "score": 19,
              "body": "Of course if you fucking remove positive return months from an average then the average return goes way down. But since you can’t possibly know at the beginning of the month whether or not it will be a green month I don’t see how you can apply this information in any way. It’s a conditional probability that you don’t have access to the conditional part.",
              "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lldcmwf/",
              "created": 1725398772,
              "depth": 2,
              "replies": [
                {
                  "id": "lldfabj",
                  "score": 5,
                  "body": "So obviously this guy is saying the average return for the month is -1% and we are already at that point so we're done. Obviously you're gonna have to make a guess if it's gonna be a green month or red month but historically it skews red",
                  "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lldfabj/",
                  "created": 1725399652,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lldrgbo",
                      "score": 0,
                      "body": "> So obviously this guy is saying the average return for the month is -1% and we are already at that point so we're done. \n\nThey didn't say that. You inferred that.\n\nTheir comment simply points out that the average September return is barely negative, so much so that the magnitude of daily swings can eclipse it by a large amount.",
                      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lldrgbo/",
                      "created": 1725404460,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "llds586",
                          "score": 4,
                          "body": "So you don't use the average. You extract what it actually is, which is the frequency of red Sept months dwarfs green Sept months to the point of skewing down the average to negative \n\nIs that so difficult to comprehend?\n\nyou also inferred that the other guy was talking about how trivial the return is. Of course a big daily move is gonna dwarf the average return for the whole month. \n\nIf the sp500 only returns 10% annually on average, and you have Sept with an average return of -5% or something, that annualizes to -60%, or you're gonna need other months with huge +5% to  balance it.",
                          "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llds586/",
                          "created": 1725404729,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lldsrr7",
                              "score": 0,
                              "body": "> So you don't use the average. You extract what it actually is, which is the frequency of red Sept months dwarfs green Sept months to the point of skewing down the average to negative\n\n> Is that so difficult to comprehend?\n\nLol, that is still an average. I'm a statistician, so no, that's not \"hard to comprehend\". You don't have to be a douchebag.\n\nThe probability of a red September is barely above 50%. It's trivial.\n\n> you also inferred that the other guy was talking about how trivial the return is.\n\nNo I didn't, that is literally what the numbers in the comment are about. You're the only one who made an assumption, namably, that they were trying to imply we're \"done\" already, which is absurd.\n\n> Of course a big daily move is gonna dwarf the average return for the whole month.\n\nYeah, so it's a good fucking point to keep in mind whether the month's average is slightly positive or slightly negative lol. You accidentally arrived at the point that the OP was trying to make in this comment chain.",
                              "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lldsrr7/",
                              "created": 1725404967,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "llduprs",
                                  "score": 4,
                                  "body": "The frequency alone is not the same as average. Average includes both frequency and magnitude. Shouldn't a statistician know this?\n\nThe probability of red Sept is about 56%, and it's actually the only month with red above 50%, and the only month with negative average. And if you look at previous pullback/correction from peak to trough instead of just first days of the month as your timeline, those corrections typically all occurred around Sept or Oct.\n\nAlso, the other guy didn't make any comments at all. You are the one who attached the word trivial difference to the data. So you also inferred what he meant.",
                                  "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llduprs/",
                                  "created": 1725405899,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lldzsw7",
                                      "score": 1,
                                      "body": "> The frequency alone is not the same as average. \n\n“Average” isn’t really a hard statistical term, it’s a colloquialism, and generically applies to any situation where you are dividing a set of data by the size of the sample — I.e., if you split months by a binary such as positive/negative return, and divide by the number of months, that’s an average — the frequency would just be a raw number, like 13, the average would be 56%.\n\n> The probability of red Sept is about 56%\n\n\n… right, barely above 50%. I don’t even know what we’re talking about at this point. Who cares — you’d need a subgroup analysis to make this predictively meaningful anyways.",
                                      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lldzsw7/",
                                      "created": 1725407845,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "llcpoo2",
      "score": 51,
      "body": "September woke up and chose violence today.",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcpoo2/",
      "created": 1725391455,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llcfke6",
      "score": 39,
      "body": "Paycheck tomorrow, buying son sweet google",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcfke6/",
      "created": 1725388213,
      "depth": 0,
      "replies": [
        {
          "id": "llcig4m",
          "score": 4,
          "body": "So do a bunch of other people, I'd deposit money now but with a standard transfer so it takes 1-2 days to get taken out of your bank.",
          "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcig4m/",
          "created": 1725389137,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llcl5bt",
      "score": 36,
      "body": "So essentially everything is discounted",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcl5bt/",
      "created": 1725389996,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llcdior",
      "score": 33,
      "body": "Buybuybuy.",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcdior/",
      "created": 1725387558,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llcsrfz",
      "score": 24,
      "body": "Wake me up when September ends",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcsrfz/",
      "created": 1725392439,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lld4xen",
      "score": 8,
      "body": "I only sell to rebalance, 1 month is noise",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lld4xen/",
      "created": 1725396293,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llcrf7w",
      "score": 19,
      "body": "So in 1 day the market is already down more than the average September returns which means according to these same statistics the stock market will be UP for the rest of September from where it is at this moment. Got it.",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcrf7w/",
      "created": 1725392012,
      "depth": 0,
      "replies": [
        {
          "id": "lld8rzz",
          "score": 12,
          "body": "This will only work if you sell all your stock because you got scared, then the stocks will skyrocket. \n\nHowever, if you buy more stocks now, it will just keep going down. \n\nTLDR: The stock market knows you personally lol",
          "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lld8rzz/",
          "created": 1725397515,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llcyde0",
          "score": 1,
          "body": "Yikes this isn’t a good sign",
          "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcyde0/",
          "created": 1725394211,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llfdrv1",
      "score": 6,
      "body": "my sophisticated approach to all of this is to simply do nothing.",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llfdrv1/",
      "created": 1725429746,
      "depth": 0,
      "replies": [
        {
          "id": "llfj76b",
          "score": 2,
          "body": "and then u buy some more",
          "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llfj76b/",
          "created": 1725433240,
          "depth": 1,
          "replies": [
            {
              "id": "llfjvib",
              "score": 2,
              "body": "monthly dca plan is unaffected",
              "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llfjvib/",
              "created": 1725433695,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "llccef2",
      "score": 3,
      "body": "!remindme 1 month",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llccef2/",
      "created": 1725387199,
      "depth": 0,
      "replies": [
        {
          "id": "lq6j70q",
          "score": 3,
          "body": "Survey says: September closed green! And thus seasonality is still hardly worth talking about.\n\n\nMore at 11.",
          "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lq6j70q/",
          "created": 1727981759,
          "depth": 1,
          "replies": [
            {
              "id": "lq6xjlf",
              "score": 1,
              "body": "Yup",
              "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lq6xjlf/",
              "created": 1727986313,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "llcclwq",
          "score": 1,
          "body": "I will be messaging you in 1 month on [**2024-10-03 18:13:19 UTC**](http://www.wolframalpha.com/input/?i=2024-10-03%2018:13:19%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llccef2/?context=3)\n\n[**9 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1f86se0%2Fmarketwatch_september_is_historically_the_worst%2Fllccef2%2F%5D%0A%0ARemindMe%21%202024-10-03%2018%3A13%3A19%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201f86se0)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcclwq/",
          "created": 1725387266,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lld9x6c",
      "score": 5,
      "body": "Priced in.",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lld9x6c/",
      "created": 1725397888,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llch3v9",
      "score": 3,
      "body": "Calls it is",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llch3v9/",
      "created": 1725388707,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lld2hln",
      "score": 3,
      "body": "Thanks for letting us know after today’s tumble… /s",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lld2hln/",
      "created": 1725395512,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llcugqd",
      "score": 7,
      "body": "Hoping to buy as much RKLB as I can.",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcugqd/",
      "created": 1725392977,
      "depth": 0,
      "replies": [
        {
          "id": "llvq3n7",
          "score": 1,
          "body": "Yep p much this. Sold at 6.60 and am waiting for a good re-entry point.",
          "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llvq3n7/",
          "created": 1725667776,
          "depth": 1,
          "replies": [
            {
              "id": "llx9r7n",
              "score": 1,
              "body": "I am not selling anything, just to DCA into it every week regardless if it is up or down. This is now my primary growth stock and I am hoping to accumulate at least 10j shares before it goes crazy.",
              "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llx9r7n/",
              "created": 1725694029,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lldzjro",
      "score": 2,
      "body": "“Only 44% of the time” 😂",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lldzjro/",
      "created": 1725407748,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llh46mw",
      "score": 2,
      "body": "my strategy is called holding!",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llh46mw/",
      "created": 1725461588,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llcwnt9",
      "score": 1,
      "body": "When do you think it will bottom out?",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llcwnt9/",
      "created": 1725393664,
      "depth": 0,
      "replies": [
        {
          "id": "llelebt",
          "score": 2,
          "body": "who cares? do you like todays price or not? if you do buy otherwise hold",
          "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llelebt/",
          "created": 1725416079,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lld3zjl",
      "score": 1,
      "body": "We need to sell. To panic when others are fearful.",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lld3zjl/",
      "created": 1725395995,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lldiwk1",
      "score": 1,
      "body": "It's when brokers and analysts sober up and actually start to work.",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lldiwk1/",
      "created": 1725400878,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lle9rz3",
      "score": 1,
      "body": "I am hoping this September not going to be that bad as it’s an election year!!",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lle9rz3/",
      "created": 1725411607,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llfyepa",
      "score": 1,
      "body": "So... finished higher almost half the time? The FUD is despicable in here.",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llfyepa/",
      "created": 1725443815,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llg3svs",
      "score": 1,
      "body": "This is the kind of thing where the phrase \"Past performance is no guarantee of future results\" applies best.\n\nIt's statistical noise, eventually some other month will become the \"historical worst month\".",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/llg3svs/",
      "created": 1725447067,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lldxilz",
      "score": -5,
      "body": "If you're buying at this level, you deserve what you're about to get.\n\nJust about all signals are screaming \"bull market top\" on the S&P. Economy is slowing here in the US and already slowing in Europe and Asia. Unemployment has risen decidedly above its multi-month downtrend from COVID, starting a new uptrend. GDI has been diverging away from GDP, a very bearish indicator historically speaking. Oil producers \\*cutting\\* production while gas prices have been this low during the summer? Hello? Stretched consumer much?\n\nOh and yea, the fed is starting to cut. Like, cmon. Is it really going to take a 15-20% haircut for people to finally say, \"hmm maybe we're  heading into a recession?\"\n\n2025 is going to be bad. Very bad, and it doesn't matter who's elected.\n\nSell here, buy bonds, and buy some @ 4100-4800 on the S&P for the next 12 months.",
      "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lldxilz/",
      "created": 1725406978,
      "depth": 0,
      "replies": [
        {
          "id": "lle4txn",
          "score": 5,
          "body": "RemindMe! 200d",
          "permalink": "/r/stocks/comments/1f86se0/marketwatch_september_is_historically_the_worst/lle4txn/",
          "created": 1725409751,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}