{
  "title": "Dollar Tree shares slide after discounter cuts full-year forecast ",
  "score": 37,
  "selftext": "Shares of Dollar Tree fell more than 15% in early trading Wednesday after the discounter cut its full-year outlook, citing increasing pressures on middle-income and higher-income customers.\n\nThe retailer said it now expects its full-year consolidated net sales outlook to range between $30.6 billion and $30.9 billion. It expects adjusted earnings per share to range from $5.20 to $5.60. That compares with previous guidance of $31 billion to $32 billion in net sales and $6.50 to $7 for adjusted earnings per share.\n\nIn a news release, Chief Financial Officer Jeff Davis said the company cut the forecast to reflect softer sales and costs associated with converting 99 Cents Only stores. The company also said it has had higher expenses to reimburse, settle and litigate claims related to customer accidents and other incidents at stores.\n\nHere’s how Dollar Tree did in its fiscal second quarter ended Aug. 3:\n\nEarnings per share: 62 cents, it was not immediately clear if it was comparable to what analysts surveyed by LSEG expected\n\nRevenue: $7.38 billion, it was not immediately clear if it was comparable\n\nDollar Tree’s report comes about a week after major rival Dollar General slashed its full-year sales and profit outlook, sending its shares tumbling. Dollar General CEO Todd Vasos chalked up weak sales to “a core customer who feels financially constrained.”\n\nDollar stores, in particular, have felt pinched as their core customer — shoppers with lower incomes and little leftover money to spend on discretionary items — makes trade-offs after a prolonged period of pricier food and everyday costs. Walmart has won more business from value-conscious shoppers across incomes and newer online players, such as Temu, have also attracted customers with cheap merchandise.\n\nDollar Tree includes two store chains, its namesake, which sells a wide variety of lower-priced items like party supplies, and Family Dollar, which carries more food.\n\nSame-store sales for the company rose by 0.7% in the quarter. At Dollar Tree, same-store sales increased by 1.3% and at Family Dollar, same-store sales fell by 0.1%. The industry metric takes out the impact of store openings and closures.\n\nOn an earnings call, Davis said the company saw weaker sales, particularly on the discretionary side of the business. He said it “reflected the increasing effect of macro pressures on the purchasing behavior of the Dollar Tree’s middle- and higher-income customers.”\n\n“Our original second-quarter outlook did not anticipate those pressures migrating to Dollar Tree’s customer base to the degree that they did,” he said.\n\nAlong with contending with inflation-stretched shoppers, Dollar Tree has faced company-specific challenges. The retailer announced in March that it would close about 1,000 Family Dollar stores, citing market conditions and store performance. Then, in June, the company said it is considering selling the Family Dollar brand.\n\nDollar Tree bought Family Dollar for nearly $9 billion in 2015 and since then, it’s struggled to strengthen the grocery-focused chain and better compete with Dollar General.\n\nThe liability claims also added to the company’s challenges. On the company’s earnings call, Davis said the outcome of claims, particularly older ones, “has become increasingly challenging to predict given the higher settlement and litigation costs that have resulted from a more volatile insurance environment.” \n\n“The claims have continued to develop unfavorably due to the rising cost to reimburse, settle, and litigate these claims, which impacted our actuarially determined liabilities,” he said.\n\nAs of Tuesday’s close, Dollar Tree’s shares are down nearly 43% so far this year. The company’s stock hit a 52-week low on Tuesday and closed the day at $81.65.\n\nSource: https://www.cnbc.com/2024/09/04/dollar-tree-dltr-earnings-q2-2024.html",
  "link_flair_text": null,
  "id": "1f8vvsr",
  "num_comments": 26,
  "created_utc": 1725462920,
  "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/",
  "comments": [
    {
      "id": "llhe5sa",
      "score": 16,
      "body": "Dollar General has had some very rocky earnings recently so it’s not surprising Dollar Tree is in the same spot.",
      "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llhe5sa/",
      "created": 1725464813,
      "depth": 0,
      "replies": [
        {
          "id": "llj5mqe",
          "score": 8,
          "body": "Imo...really reflects on how lower income consumer are doing. ",
          "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llj5mqe/",
          "created": 1725485594,
          "depth": 1,
          "replies": [
            {
              "id": "llja6tw",
              "score": 10,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llja6tw/",
              "created": 1725487194,
              "depth": 2,
              "replies": [
                {
                  "id": "lljb9mu",
                  "score": 2,
                  "body": "Exactly....inflation kicks up so they cut back.",
                  "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/lljb9mu/",
                  "created": 1725487574,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "llm7tj7",
              "score": 3,
              "body": "I think it’s likely more that a not insignificant number of their customers have gotten wise to the poor value and shopping experience and are just trading up to Walmart if they’re able.\n \n \n\n \nTheir core customer will always be there, and obviously they have a stranglehold on food deserts and rural areas.",
              "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llm7tj7/",
              "created": 1725538162,
              "depth": 2,
              "replies": [
                {
                  "id": "llnal6s",
                  "score": 3,
                  "body": "No. If that were the case you wouldn't see similar businesses also struggling. Any business that caters to lower income or budget conscious consumers is hurting....McDonalds comes to mind.",
                  "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llnal6s/",
                  "created": 1725551987,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llnr7hv",
                      "score": 3,
                      "body": "McDonald’s is a really poor example of this, they themselves have acknowledged they’ve increased prices too far and are walking some of those hikes back \n \nhttps://www.cnbc.com/amp/2024/05/29/mcdonalds-cost-increases.html\n \n \nDollar General is another story of having a shit business model.\n \n \nWalmart certainly isn’t hurting, nor is Costco. I get Costco isn’t the low income segment, but those customers are coming from somewhere.",
                      "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llnr7hv/",
                      "created": 1725557241,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "llndhsf",
                      "score": 1,
                      "body": "Seems like a ton of customer-facing companies having bad earnings calls lately.",
                      "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llndhsf/",
                      "created": 1725552912,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "llk9edo",
          "score": 0,
          "body": "Oh the irony. Dollar Tree stock is a value trap!",
          "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llk9edo/",
          "created": 1725500231,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llhoxo7",
      "score": 6,
      "body": "i bet you a PE firm is looking at the DG & Dltr combo right now",
      "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llhoxo7/",
      "created": 1725468281,
      "depth": 0,
      "replies": [
        {
          "id": "llks8oj",
          "score": 3,
          "body": "One or the other, but not both.  DollarTree is already effed with their family dollar merger and have no idea what to do with it.  The possibility of any combo is impossible in their climate and overlap is insane.  There are too many DG dtores already too.  If anything, DG would be the play for PE.",
          "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llks8oj/",
          "created": 1725507942,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llhtqcz",
      "score": 7,
      "body": "people are shopping at walmart....... \n\nim shocked by the dollar stores getting hammered for the last 2 years.... cause the local DG is almost always packed",
      "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llhtqcz/",
      "created": 1725469794,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llhktkv",
      "score": 16,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llhktkv/",
      "created": 1725466962,
      "depth": 0,
      "replies": [
        {
          "id": "llik1nd",
          "score": 11,
          "body": "They try to control costs by understaffing and underpaying. No way in hell I’ll ever buy stocks and support that business model.",
          "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llik1nd/",
          "created": 1725478389,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lljwyet",
          "score": 4,
          "body": "so funny you say this, walked into the one by me for the first time last week and it looked like a hurricane went through it",
          "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/lljwyet/",
          "created": 1725495518,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llhfzj2",
      "score": 4,
      "body": "I don't pay a lot of attention to retailers like this. They've always been between a rock and a hard place where their customers will never really be happy. Now there's the added factor that they can no longer keep the cost of product low enough to justify the quality hit of going there instead of somewhere like Costco.",
      "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llhfzj2/",
      "created": 1725465396,
      "depth": 0,
      "replies": [
        {
          "id": "llhmrsz",
          "score": 14,
          "body": "Maybe you have the customer sentiment right, but comparing Costco to Dollar Tree isn't the same.. I could be wrong but the clients are way different. People come out of Costco not expecting to spend 200+ per trip, but they do because most can afford it.  People go into Dollar Tree for various reasons, from small projects, to save a little money, or because they have to. I can imagine most transactions are under $50. They cater to much different demographics, and there's a bit of a difference as to how you would advertise/ cater to the customers they serve.",
          "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llhmrsz/",
          "created": 1725467592,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llhs6fk",
          "score": 4,
          "body": "Costco has an entirely different customer than dollar stores; Wal Mart is a much more direct competitor.\n\nThe small format dollar stores have a difficult time gaining efficiencies of scale like a Wal Mart can; add in delivery from Wal Mart, and the convenience advantage is eroded as well.\n\nAt single digit P/Es, the dollar stores are starting to be tempting, looking for a snap back rally like Target had, but I think their high growth days are behind them.",
          "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llhs6fk/",
          "created": 1725469304,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llijs9e",
      "score": 4,
      "body": "I won’t buy any shares from any of these discount retailers purely based on my own morals. I can’t support an organization who pays their employees so little they have to be subsidized.",
      "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llijs9e/",
      "created": 1725478307,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llk3qsi",
      "score": 2,
      "body": "At a like 7 year low. It's gotta be quite undervalued at thus price, I'm sure inflation is eating into their margins but to be down like 60% from the 52 week high seems like an extreme sell off",
      "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llk3qsi/",
      "created": 1725498058,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llhj1a8",
      "score": -8,
      "body": "Cause people have no money, cause the government sucks asshole.",
      "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llhj1a8/",
      "created": 1725466383,
      "depth": 0,
      "replies": [
        {
          "id": "llicdjv",
          "score": 3,
          "body": "Is it the government or is it greedy businesses (aka the capitalist class) that is taking all our money? Think reallllllly hard about this one, brother.",
          "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llicdjv/",
          "created": 1725475944,
          "depth": 1,
          "replies": [
            {
              "id": "llif9x9",
              "score": 0,
              "body": "Both",
              "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llif9x9/",
              "created": 1725476894,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lllgvro",
      "score": 0,
      "body": "Shit they are gonna become dollar fifty tree soon. God damnit.",
      "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/lllgvro/",
      "created": 1725522055,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llicxfj",
      "score": -4,
      "body": " They should rename the store from Dollar Tree to Ghetto Tree",
      "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llicxfj/",
      "created": 1725476133,
      "depth": 0,
      "replies": [
        {
          "id": "llksgae",
          "score": 3,
          "body": "I refuse to go to dollar tree.  Dollar General isn't much better but at least they have more than one or two employees and a fair clean store where i live",
          "permalink": "/r/stocks/comments/1f8vvsr/dollar_tree_shares_slide_after_discounter_cuts/llksgae/",
          "created": 1725508040,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}