{
  "title": "Thoughts on Nike these days?",
  "score": 44,
  "selftext": "Nike stock has been falling dramatically the last few years, from what I understand mostly due to competition from On and HOKA, whilst it seems pulling out of retail chains such as footlocker cost them in revenues. It's P/E ratio is lower than its 10 year average at 21.6, which begs the question, can Nike continue to grow in the future?\n\nIt has a strong moat. although they are losing market share in running shoes, they still have a large market that they dominate in Basketball, Football and other sports. It's brand I'd argue also plays a big part in it staying relevant, it still seems to me that Nike is synonymous with sportswear. \n\nIf anyone has any downsides they see in Nike, please share here!",
  "link_flair_text": null,
  "id": "1f8xlkm",
  "num_comments": 70,
  "created_utc": 1725467082,
  "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/",
  "comments": [
    {
      "id": "llhl6y8",
      "score": 1,
      "body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llhl6y8/",
      "created": 1725467082,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llhxzx0",
      "score": 73,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llhxzx0/",
      "created": 1725471139,
      "depth": 0,
      "replies": [
        {
          "id": "llinwi4",
          "score": 33,
          "body": "There’s also the part where they caught a bolt of lightning by signing Jordan. He’s been retired for nearly 30 years, and they’re still milking it. It just can’t hold its caché much longer as people who never saw him play start deciding where to spend their sports apparel dollars.",
          "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llinwi4/",
          "created": 1725479601,
          "depth": 1,
          "replies": [
            {
              "id": "llk2ml1",
              "score": 9,
              "body": "I mean they always seem to snag the next generational talent. They got Tiger, LeBron, the Williams Sisters etc. We're now at the crossroads of what's next again, just another cycle.",
              "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llk2ml1/",
              "created": 1725497640,
              "depth": 2,
              "replies": [
                {
                  "id": "lll91bb",
                  "score": 7,
                  "body": "Also had Ronaldo, Ronaldinho, and Cristiano Ronaldo in soccer for almost 25 years.",
                  "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lll91bb/",
                  "created": 1725517015,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lllgx5v",
          "score": 2,
          "body": "I think its important to point out that sport viewership had also been stagnant and even shrunk the last 2 decades. Video games and internet videos took market share.",
          "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lllgx5v/",
          "created": 1725522083,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lliu1q5",
      "score": 16,
      "body": "It needs leadership with a vision. The way they got to where they were was with a strong presence in the athletic community, they have gotten a little confused from that. The second problem is the quality of all of their products has went down considerably over the past 10 years, other brands like Asics are basically the same, Adidas, similar but Nike has had a serious loss in quality relying on the brand and people wanting to wear it just because. If we look at other premium brands like Lulu, they make nice stuff, really high quality product, Nike needs to get back to making very high quality shoes and very high quality clothing, directly market to athletics, make that their image, if they do this the stock will take off but it's a long-term turnaround and first management has to realize that this is the problem",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lliu1q5/",
      "created": 1725481505,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llhodc0",
      "score": 43,
      "body": "I was in at $76, and out at $82. I'd go back in at $74; but if macro recession forces pick up, I could see Nike going into the $60's. \n\nAnyway, when a company is this big, I think it's nearly impossible to truly understand how they will perform in the future. There's just too many moving parts and unknowns. Almost any thesis someone has is not based on hard data, but rather gut feelings. \n\nSo I treat a company like Nike as a momentum play. Right now the momentum is neither up or down... it probably trades sideways until it reports earnings (sept 26 i think), which will then push the momentum one way or another. \n\nIf it's at $74 before earnings, I'd buy just as a gamble. If it's in the $80's, too much downside risk for my liking.",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llhodc0/",
      "created": 1725468102,
      "depth": 0,
      "replies": [
        {
          "id": "lli6hc6",
          "score": 6,
          "body": "You got a good strategy my man 🙌🏼",
          "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lli6hc6/",
          "created": 1725473856,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llhp6h7",
      "score": 8,
      "body": "There are just so many better plays out there.  I don’t see a reason to buy Nike as an individual stock.  Seriously, why? \n\nIf you’re looking for some kinda bounce after it dropped, you’ve missed it.  If you think it “has to” go up to where it was, you’re mistaken.  Nike is closer to fair value now than it was before.  \n\nIt’s such a massive brand that the upside is very limited in terms of what we KNOW (shoe sales, apparel sales, branding, etc); if something NEW or UNKNOWN were to come along and impact the stock price significantly to the upside, (branch out to new territory; start a new revenue stream, etc) it would be dumb luck.  \n\nWith increasing competition and Nike’s proven ineptitude to quickly adapt to the changing landscape, I only see challenges ahead.  I believe the risk is bigger than the reward.  Even if it sits pretty flat for the next few years, it’s dead money that could’ve earned you 10% just sitting in an ETF.  \n\nI just don’t see the major upside potential to make it an enticing buy.  Maybe I’m missing it.  If I am, I’d love to be enlightened.  But for the projected gains IMO (recapturing ATH within next couple years potentially as it recovers and they drive increased profitability), the risk of it sitting flat or declining is just as likely IMO.  Would rather buy an ETF than Nike.  So many better stocks to pick as an individual stock than this one.  Like hundreds.",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llhp6h7/",
      "created": 1725468358,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lllaaet",
      "score": 5,
      "body": "Characteristics of Nike:  \n-No monopoly pricing power  \n-Low barriers to entry  \n-Too dependent on brand image  \n-High competition  \n-Non essential business\n\nThats not to say you can't money investing in clothing companies, but generally I stay away from them as investment. They are very volatile and unpredictable with a lot of hurt as you hold them.",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lllaaet/",
      "created": 1725517820,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llj020h",
      "score": 7,
      "body": "The company culture at Nike is concerning. Not many employees with positive things to say.",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llj020h/",
      "created": 1725483405,
      "depth": 0,
      "replies": [
        {
          "id": "llo0d8d",
          "score": 1,
          "body": "It has 4\\* on glass door which I would have thought for a company this size is pretty good",
          "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llo0d8d/",
          "created": 1725560118,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llkkx17",
          "score": 1,
          "body": "Do you know employees? Is this through a subreddit that’s you’ve seen?",
          "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llkkx17/",
          "created": 1725504755,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lloxw6g",
          "score": 1,
          "body": "What's the culture like? Too much pandering to the woke?",
          "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lloxw6g/",
          "created": 1725570649,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llkmmox",
      "score": 3,
      "body": "I get that Reddit is a strong /leans left community overall but I think it’s rarely a good idea for a company (that exists to make profit) get involved in politics or religion. There are some exceptions that make it work (Chick Fil A for one). But as a country where generally things are 50/50 on views and more heated than maybe ever why get involved in anything that alienates your customer base. It only takes a mild annoyance for a person to say let me try that brand in an aggressive and saturated market.\n\nSo generally I agree with everyone else as a brand they lost their way a bit. Sign more big name athletes who are universally likable and make boatloads of money. Appeal to all kids and all parents. Get back to that “Crush Adidas” mindset that got them here.",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llkmmox/",
      "created": 1725505465,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llljrae",
      "score": 3,
      "body": "There's a podcast called Acquired they did one on Nike. It's a great listen",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llljrae/",
      "created": 1725524080,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llih1py",
      "score": 7,
      "body": "They brand is built on sport celebrities. This is a non-tangible asset, which means it can change. Times change. People can fall out of love with those big Nike stars. \n\nAlso competitors now came up with alternative marketing strategies. \nTake Lululemon as an example. They are known for their quality, not marketing. They are not signing sport celebrities, instead they cooperate with local sport influencers, personal trainers, yoga instructors etc. They sign young talents - for example they cooperate with Summer MacIntosh.\n\nGen Z is not that into mainstream sports as Millenials were. I can imagine them being more curious about the brand advertised by young swimming talent instead of 40 years old Lebron.",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llih1py/",
      "created": 1725477451,
      "depth": 0,
      "replies": [
        {
          "id": "llj5bdc",
          "score": 6,
          "body": "Lulu has actually been making commercials with Odell Beckham Jr and DK Metcalf",
          "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llj5bdc/",
          "created": 1725485479,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llla1ma",
          "score": 2,
          "body": "I think the problem with Nike isn’t that Gen Z doesn’t want to be marketed to but rather that their best spokesperson is still LeBron or Cristiano Ronaldo. \n\nNone of the new generation athletes can stand on their own brands in tandem with Nike the way these two did.\n\nGilgeous-Alexander being signed to Converse is actually a good play for them, but time will tell if it carries over.",
          "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llla1ma/",
          "created": 1725517661,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llidkp9",
      "score": 2,
      "body": "Im (what feels like) bagholding a good sized position around $95/share, and like a lot of people here have alluded to, my views are mostly based on sentiment. Im glad i didnt buy at its peak of $180 lol, but my notion around nike is all just a \"feeling\" that it will recover. Its Nike, the biggest brand in the world, maybe besides apple but different worlds. It might take a year or two, or it could hover between $60-80 for the next couple years. Its P/E is lowish and i dont picture any brand surpassing them (yeah yeah it can happen) but anyways...",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llidkp9/",
      "created": 1725476348,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lljgfqr",
      "score": 2,
      "body": "I am a total noob with stocks so I don’t know about it’s price or anything but I believe in the company. You can’t tell me that a company which turned shoes like dunks which were collecting dusts in outlets on sale for like 20$ to super hyped shoes OOS milliseconds within restocks that people were pay crazy amounts of resale price for doesn’t know how to turn things back.",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljgfqr/",
      "created": 1725489437,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lllhb6u",
      "score": 2,
      "body": "I think Nike has lost the plot with their branding and their products have become staggeringly poor in quality too. The sentiment towards Nike among the public has seemed to decline in my experience, so I won't buy it.",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lllhb6u/",
      "created": 1725522356,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llm3npm",
      "score": 2,
      "body": "Nike got too into politics. I stopped purchasing anything related to Nike. Didint need to be told by a multi-billion dollar company what is right or wrong. Then those Olympic track uniforms wtf.\n\nTheir moat today may be basketball and football shoes and having athlete celebrities but most people buy running or walking shoes for daily wear. Now, you have the ON's, Hokas, and Brooks that are more comfortable and better made.",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llm3npm/",
      "created": 1725536284,
      "depth": 0,
      "replies": [
        {
          "id": "ltp4iiw",
          "score": 0,
          "body": "Taking a stance on racism should not be considered political - its moral.  They've never been \"political.\"",
          "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/ltp4iiw/",
          "created": 1729870130,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lln560m",
      "score": 2,
      "body": "Nike will be at $93 per share in 3 months.",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lln560m/",
      "created": 1725550260,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llhmexj",
      "score": 3,
      "body": "Their products sometimes face quality issues",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llhmexj/",
      "created": 1725467477,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llixehh",
      "score": 2,
      "body": "Pretend to be some social justice warrior compmany while taking advantage of sweat shop labor. F Nike!",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llixehh/",
      "created": 1725482546,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lljiy4r",
      "score": 2,
      "body": "Nikes are cringe now, air jordans are so ugly.  It’s a bunch of niche buyers now.  \n\nOn shoes are more modern and have the Swiss flag of approval stamped on them= guaranteed superior quality",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljiy4r/",
      "created": 1725490348,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llhoz6s",
      "score": 1,
      "body": "I bought when it dropped which was just before the Olympics. Nike did Team USA uniforms so was hoping to see a bump there post-Olympics. Will see…",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llhoz6s/",
      "created": 1725468294,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lljsctc",
      "score": 1,
      "body": "If they can grow FCF by 7%/year, then it's at a fair price. I'd probably buy at $70 or less.",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljsctc/",
      "created": 1725493804,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lljsqev",
      "score": 1,
      "body": "Too much competition and no real moat",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljsqev/",
      "created": 1725493941,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lljzvj3",
      "score": 1,
      "body": "Why does Nike have a strong moat? They make products that have a very low barrier of entry. You can make a case for ZoomX, but competitors have caught on",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljzvj3/",
      "created": 1725496618,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lll84jz",
      "score": 1,
      "body": "I remember when I was in highschool Nikes shoes quality was excellent and today idk",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lll84jz/",
      "created": 1725516444,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lllawur",
      "score": 1,
      "body": "I dropped out after DCA for four years and losing my ass",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lllawur/",
      "created": 1725518111,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lllg94e",
      "score": 1,
      "body": "Don’t they let ppl come in the stores and take the shoes for free now? Fk that stock",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lllg94e/",
      "created": 1725521607,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llmehx1",
      "score": 1,
      "body": "Everyone's giving a lot of fundamental answers here, some better than others and some are just hope. But with the stock trading under a downward sloping 200 day and in a downtrend since its peak in 2021 you've got time to buy this and most likely will see lower prices in the future. One of the great things about the stock market is you have thousands of stocks to choose from so why not choose a stock that has already bottomed and is starting a new uptrend? Just my TA .02",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llmehx1/",
      "created": 1725540904,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llmwmzh",
      "score": 1,
      "body": "My thoughts are “why?”, many better options",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llmwmzh/",
      "created": 1725547498,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lloy44s",
      "score": 1,
      "body": "Nike quality has dropped substantially and it's now absolute dogwater. I used to buy lots of Nike clothing for working out but now have replaced them with mostly Adidas. If I don't like a company's products, I don't buy its stock.",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lloy44s/",
      "created": 1725570719,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lls2f7t",
      "score": 1,
      "body": "The CEO needs to be changed, wonder when the activists will start buying shares and lobby for management changes",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lls2f7t/",
      "created": 1725622519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llic1fn",
      "score": 1,
      "body": "Way better merchandise than Nike..",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llic1fn/",
      "created": 1725475826,
      "depth": 0,
      "replies": [
        {
          "id": "llkyty7",
          "score": 0,
          "body": "Agree it's toast.\n\n\nUnder Armour is the new Nike for the poors\n\n\nThere's fabletics \n\n\nLulu for the upper middle class \n\n\n\n\nNike only had to compete with a few brands back in the day. Now with the rise of Instagram where small companies can take bites from Nike I think all the big legacy brands like Nike and Adidas are done at this point.",
          "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llkyty7/",
          "created": 1725511160,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lli14mm",
      "score": 1,
      "body": "Great brand, but I'm struggling to see the catalyst for material growth (above and beyond any market share lost to Hoka, etc)",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lli14mm/",
      "created": 1725472125,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lliva8l",
      "score": 1,
      "body": "At 70$ is a buy",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lliva8l/",
      "created": 1725481888,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lliyh27",
      "score": 1,
      "body": "Fun fact: the creator of On was sponsored by Nike. He went to Nike to pitch his idea. Nike told him to F off so he started his own brand.",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lliyh27/",
      "created": 1725482881,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lli1z5k",
      "score": 0,
      "body": "They do not have a moat if they are being outcompeted. They are much more a price taker than price maker",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lli1z5k/",
      "created": 1725472392,
      "depth": 0,
      "replies": [
        {
          "id": "llie32b",
          "score": 2,
          "body": "When you ask a lot of people which sports apparels brand comes to their mind first, it's in most cases going to be Nike - I would definitely argue that Nike has a moat.",
          "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llie32b/",
          "created": 1725476515,
          "depth": 1,
          "replies": [
            {
              "id": "llii2ry",
              "score": 1,
              "body": "well that's because nike is paying an absurd cost for advertising. if they stopped advertising, they are cooked. moats are basically non existent in apparel. very few companies have a moat.",
              "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llii2ry/",
              "created": 1725477773,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lljilai",
              "score": 0,
              "body": "Having a very strong brand =/ having a MOAT",
              "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljilai/",
              "created": 1725490219,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "llicrl2",
      "score": 0,
      "body": "Do you remember when a lot of people asked here about Meta?? Can you remember the most upvoted takes??\n\nI wouldn't listen to redditors",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llicrl2/",
      "created": 1725476078,
      "depth": 0,
      "replies": [
        {
          "id": "lljf6yg",
          "score": 1,
          "body": "New young guy here could you go on please",
          "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljf6yg/",
          "created": 1725488982,
          "depth": 1,
          "replies": [
            {
              "id": "lljfy5w",
              "score": 3,
              "body": "When a stock is beaton down, EVERYONE says it is dead and negative sentiment goes all around\n\nDownvoted comments are those that said, you're gonna see this double soon, this is a powerhouse brand...\n\nUpvoted posts are.. this companu is dead, they don't know what they're doing, they lost their identity\n\n\nMeta went down to 88. I bought and bought and bought and got DOWNVOTED here EVERYDAY. My average cost was 120 dollars and I bought 400 shares.\n\nWhen the stock went parabolic I sold at 410 bucks or aprox and I made, in a year, a shit ton of money. More than 100k\n\nNow META stock sits at 510/520 dollars and those who criticized the stock are nowhere to be found or are the same that now are criticizing Nike",
              "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljfy5w/",
              "created": 1725489257,
              "depth": 2,
              "replies": [
                {
                  "id": "lljhjwj",
                  "score": 2,
                  "body": "👌thank you! I bought some shares of Nike too because I feel like they’re a very big sector king that knows damn well how to milk profit. They turned shoes like dunks which were dead on outlet shelves for like 20 bucks to hyped OOS everywhere shoes. Not to mention how big they are in professional sports. I am a big football fan in which crazy amount of money is involved and those guys are everywhere there. My club Barca literally needed the funds from the Nike deal to go through to be able to register players. They’re this big!",
                  "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljhjwj/",
                  "created": 1725489843,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lli2emy",
      "score": -1,
      "body": "I like reebok better. Because of that, I don't care to own Nike stock.",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lli2emy/",
      "created": 1725472527,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lljw5ex",
      "score": 0,
      "body": "The thing about stocks is I don’t have to buy anything.\n\nIs it a buy here?  Maybe but I’m leaning no.  But if I ever hit “completely convinced” then I’ll buy it",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljw5ex/",
      "created": 1725495215,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lljd2vv",
      "score": -2,
      "body": "trash i buy ON shoes now\n\n  \nbuy a big boy stock like $RKLB",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljd2vv/",
      "created": 1725488223,
      "depth": 0,
      "replies": [
        {
          "id": "lljf1hg",
          "score": 1,
          "body": "Damn never knew Optimum nutrition are doing shoes now. Must tell all my gym bros",
          "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljf1hg/",
          "created": 1725488927,
          "depth": 1,
          "replies": [
            {
              "id": "lljxgyq",
              "score": -1,
              "body": "Save this joke for your gym bros too cause it ain't funny",
              "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljxgyq/",
              "created": 1725495714,
              "depth": 2,
              "replies": [
                {
                  "id": "lljz6z3",
                  "score": 3,
                  "body": "Damn gpatterson7o on Reddit says my joke isn’t funny💔",
                  "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljz6z3/",
                  "created": 1725496362,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "llhvr64",
      "score": -8,
      "body": "Competition and Woke policies have hurt them badly… sad",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llhvr64/",
      "created": 1725470436,
      "depth": 0,
      "replies": [
        {
          "id": "lljfgip",
          "score": 1,
          "body": "Bruh wth does ‘woke’ have to do with anything negative regarding the sales of a sports apparel company tff😭",
          "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljfgip/",
          "created": 1725489078,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llhxfex",
      "score": -4,
      "body": "Big name in their space, but mediocre and inconsistent performance. Reddit users bring them up all the time in the hope of a major turnaround. \n\nTLDR: Basically Intel but with shoes.",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/llhxfex/",
      "created": 1725470960,
      "depth": 0,
      "replies": [
        {
          "id": "lli5l1r",
          "score": 0,
          "body": "Haha comparing any company to intel right now is savage",
          "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lli5l1r/",
          "created": 1725473560,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lljx99h",
      "score": -6,
      "body": "I hate them. I avoid all their products and would never buy a stock share. They gave Colin Kaeppernick a contract. F THEM!",
      "permalink": "/r/stocks/comments/1f8xlkm/thoughts_on_nike_these_days/lljx99h/",
      "created": 1725495634,
      "depth": 0,
      "replies": []
    }
  ]
}