{
  "title": "Volvo Cars cuts margin and revenue aims after ditching electric vehicle target",
  "score": 46,
  "selftext": "Volvo Cars on Thursday scaled back its margin and revenue targets, after announcing it was no longer targeting 100% all-electric vehicle sales by 2030.\n\nThe Swedish automaker, which is majority-owned by China’s Geely Holding, said it is now targeting a 2026 EBIT (earnings before interest and taxes) margin goal of 7-8%, down from “above 8%,” due to “increased complexity especially in relation to global trade and tariffs.”\n\nIt added that it was now seeking to “continue outgrowing the premium car market until 2026,” rather than sticking to its previously announced revenue target of between 500 billion Swedish kronor ($48.6 billion) and 600 billion kronor.\n\nEver-shifting international trade disputes and tariffs have become a major headache for automakers as they navigate geopolitics between the European Union, China and the U.S., while also seeking a competitive edge in a market dominated by the EV transition.\n\nVolvo Cars shares were 3.2% higher in early afternoon deals following a 10% decline so far this week.\n\nThe firm is holding its Capital Markets Day in Gothenburg, Sweden where it is discussing its product plans for the coming years with a firm focus on shifting to electric and plug-in hybrid models. Volvo Cars has five fully-electric models on the market, along with five in development.\n\nHowever, on Wednesday it revealed that it would no longer target 100% electric vehicle sales by 2030 — which it defines as “cars with a cord” — instead looking for a 90-100% range, allowing mild hybrid models to continue to be sold. Mild hybrids have internal combustion engines which utilize some electric assistance.\n\nVolvo cited consumer demand, a slower-than-expected rollout of charging infrastructure, a withdrawal of government incentives in some markets and uncertainty from fresh tariffs on EVs in various markets as reasons for the change.\n\nIt said it remains committed to fully electric sales in the longer term “when the market conditions are suitable.”\n\nNumerous automakers have reported challenges related to the electric vehicle transition, particularly from underwhelming demand. Many consumers, meanwhile, continue to complain of insufficient charging infrastructure and cite concerns about range.\n\nVolvo Cars also announced Thursday that it was extending its partnership with U.S. chip giant Nvidia as it develops features including advanced driving assistance and autonomous driving. It also said it would switch to a “single technology stack” as it looks to bring down the costs of EV manufacturing.\n\nFigures released by Volvo Cars on Thursday showed its global sales rose 3% year-on-year in August, driven by 32% growth in Europe, as China sales tumbled 23%. Fully-electric and plug-in hybrids accounted for 25,028 of 52,944 vehicle sales — or 47% — in August 2024, with the remainder mild hybrids and vehicles with internal combustion engines.\n\nIn July, the firm reported record quarterly operating profit of 8.2 billion Swedish kronor.\n\nSource: https://www.cnbc.com/2024/09/05/volvo-cars-cuts-margin-aims-after-ditching-electric-vehicle-target.html",
  "link_flair_text": null,
  "id": "1f9na3t",
  "num_comments": 6,
  "created_utc": 1725544917,
  "permalink": "/r/stocks/comments/1f9na3t/volvo_cars_cuts_margin_and_revenue_aims_after/",
  "comments": [
    {
      "id": "lln6tt9",
      "score": 5,
      "body": "It makes sense given the amount of tariffs Europe and US are imposing. \nI'm guessing though, Europe only invoked the tariffs in order to keep good relationships with the US.",
      "permalink": "/r/stocks/comments/1f9na3t/volvo_cars_cuts_margin_and_revenue_aims_after/lln6tt9/",
      "created": 1725550795,
      "depth": 0,
      "replies": [
        {
          "id": "lloph9q",
          "score": 8,
          "body": "> I’m guessing though, Europe only invoked the tariffs in order to keep good relationships with the US.\n\nLol no. Europe gotta protect their precious automotive sector.\n\n> Economy - the turnover generated by the automotive industry represents over 7 % of EU GDP\n\nhttps://single-market-economy.ec.europa.eu/sectors/automotive-industry_en",
          "permalink": "/r/stocks/comments/1f9na3t/volvo_cars_cuts_margin_and_revenue_aims_after/lloph9q/",
          "created": 1725568035,
          "depth": 1,
          "replies": [
            {
              "id": "llr0as3",
              "score": 3,
              "body": "That's the thing. The countries with biggest automotive companies in Europe (i.e Germany, Sweden) have actually abstained from increasing the tariffs, probaly because they have large manufacturing plants in China.\n\nThe only other big automotive company is Renault and they've voted for it.\n\nhttps://www.globaltimes.cn/page/202407/1316162.shtml\n\nBig companies like VW, BMW, and Volvo Cars would only shoot themselves in the foot if this increase of tariffs comes through. \n\nThat's why I'm thinking it really seems more like a political move to appease a certain country, especially the EU tariffs came only few months after the US did it.",
              "permalink": "/r/stocks/comments/1f9na3t/volvo_cars_cuts_margin_and_revenue_aims_after/llr0as3/",
              "created": 1725598716,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "llqcdxa",
      "score": 0,
      "body": "I think a lot of car companies are going to straight up disappear a decade from now - the American, European, Japanese ones.  These are low growth, low margin companies with insane amounts of debt competing against new incumbents that can build EVs without having to worry about supply chains/unions.",
      "permalink": "/r/stocks/comments/1f9na3t/volvo_cars_cuts_margin_and_revenue_aims_after/llqcdxa/",
      "created": 1725588475,
      "depth": 0,
      "replies": [
        {
          "id": "llqjd0o",
          "score": 2,
          "body": "We already have less companies than brands. Even before tarrifs, expensive and useless cars where pushed to people while their existing cars, if modern enough, can run the home-work-shopping pretty much forever.",
          "permalink": "/r/stocks/comments/1f9na3t/volvo_cars_cuts_margin_and_revenue_aims_after/llqjd0o/",
          "created": 1725591167,
          "depth": 1,
          "replies": [
            {
              "id": "llqjuhm",
              "score": 1,
              "body": "I think that this is the general trend where while technology becomes more advanced, people are becoming more lazy and basic in what they do. This leads to technological advances having virtually zero added value, while r&d and production aren't free.",
              "permalink": "/r/stocks/comments/1f9na3t/volvo_cars_cuts_margin_and_revenue_aims_after/llqjuhm/",
              "created": 1725591366,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}