{
  "title": "Snap sued by New Mexico AG over 'sextortion' of kids by predators ",
  "score": 136,
  "selftext": "The New Mexico attorney general filed a lawsuit against Snap, alleging that its social media app Snapchat’s design and algorithmic recommendations “openly foster and promote illicit sexual material involving children and facilitate sextortion and the trafficking of children, drugs, and guns.”\n\nThe suit calls Snapchat “a breeding ground for predators to collect sexually explicit images of children and to find, groom and extort them.”\n\nNew Mexico Attorney General Raul Torrez, who has a pending lawsuit against Facebook owner Meta for allegedly enabling the sexual exploitation of children, in a statement said, “Snap has misled users into believing that photos and videos sent on their platform will disappear, but predators can permanently capture this content and they have created a virtual yearbook of child sexual images that are traded, sold, and stored indefinitely.\n\n“Through our litigation against Meta and Snap, the New Mexico Department of Justice will continue to hold these platforms accountable for prioritizing profits over children’s safety,” Torrez said.\n\nCNBC has requested comment from Snap about Torrez’s lawsuit, which was filed in the First Judicial District Court in Santa Fe County.\n\nThe suit alleges that Snap “repeatedly made statements to the public regarding the safety and design of its platforms that it knew were untrue,” or that were contradicted by the company’s own internal findings.\n\n“Snap was specifically aware, but failed to warn children and parents, of ‘rampant’ and ‘massive’ sextortion on its platform — a problem so grave that it drives children facing merciless and relented blackmail demands or disclosure of intimate images to their families and friends to suicide,” the suit says.\n\nNew Mexico’s Department of Justice, which Torrez leads, in recent months conducted an investigation that found that there was a “vast network of dark web sites dedicated to sharing stolen, non-consensual sexual images from Snap” and that there were more than 10,000 records related to SNAP and child sexual abuse material “in the last year alone,” the department said.\n\nThe suit alleges violations of New Mexico’s unfair trade practices law.\n\nSource: https://www.cnbc.com/2024/09/05/snap-sued-new-mexico-kid-sextortion.html",
  "link_flair_text": null,
  "id": "1f9o6rj",
  "num_comments": 27,
  "created_utc": 1725547529,
  "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/",
  "comments": [
    {
      "id": "llnal5c",
      "score": 41,
      "body": "Damn.  Who could have predicted an app set up to send dick pics could be used for sextortion?",
      "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llnal5c/",
      "created": 1725551986,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llo6o2a",
      "score": 15,
      "body": "> Snap has misled users into believing that photos and videos sent on their platform will disappear, but predators can permanently capture this content\n\n... Well duh, this shouldn't be a surprise to anyone. Any image or video or whatever you send can be captured in another app and stored elsewhere by whoever receives it. Even if you try to protect it with DRM it can still be copied as long as whoever receives it can open and view the file, it just might take a bit more effort to do so. \n\nAlways assume that anything you send over the Internet will be there forever. Nothing Snap can do can change that.",
      "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llo6o2a/",
      "created": 1725562117,
      "depth": 0,
      "replies": [
        {
          "id": "llylfhr",
          "score": 2,
          "body": "like this makes no sense, at the end of the day anyone can just take a picture of the device from another device, it’s common sense i fear",
          "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llylfhr/",
          "created": 1725719986,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lln2new",
      "score": 36,
      "body": "I'm glad that someone is starting to crack down on these things. Social media is utterly destructive and dangerous to children and children's health. I feel guilty holding meta in my portfolio for this reason, though I'll say meta is the one platform I've seen take a step in the right direction with parental controls. I will never own Snapchat.",
      "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/lln2new/",
      "created": 1725549453,
      "depth": 0,
      "replies": [
        {
          "id": "llpb3v9",
          "score": 0,
          "body": "Weirdos can’t randomly message you on snap or find you unless you give them your username. If anything Facebook is pedophile paradise. Snapchat makes it so no one can search for me unless I tell them my username or add them in person. \n\nI think Snapchat is a lot better for mental health because it’s not about showing off your life but just messaging friends and family?",
          "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llpb3v9/",
          "created": 1725575057,
          "depth": 1,
          "replies": [
            {
              "id": "llpteh4",
              "score": 9,
              "body": "That’s not true at all.. snap aggressively suggests random people you can add as friends",
              "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llpteh4/",
              "created": 1725581652,
              "depth": 2,
              "replies": [
                {
                  "id": "llqqfdv",
                  "score": 5,
                  "body": "So easy to not add them however.",
                  "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llqqfdv/",
                  "created": 1725594056,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llr8l0l",
                      "score": 3,
                      "body": "Ok? But the point is that snap does encourage contact with randoms.",
                      "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llr8l0l/",
                      "created": 1725603521,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "llrhog5",
                          "score": 4,
                          "body": "Yes and it appears that is the ONLY legal ground this case has… with the “openly fostering” aspect.  If they remove suggesting friends I don’t see how that would not fix this.  The suit is a joke to begin with, long time conspiracy of making laws to cater to protecting children while prosecuting every adult",
                          "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llrhog5/",
                          "created": 1725609551,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "llwjs0g",
                          "score": 1,
                          "body": "It’s even easier in Facebook!",
                          "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llwjs0g/",
                          "created": 1725679547,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lln9irm",
      "score": 6,
      "body": "I got confused for a second and thought that New Mexico AG was a Central European company lol.",
      "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/lln9irm/",
      "created": 1725551651,
      "depth": 0,
      "replies": [
        {
          "id": "llt81o1",
          "score": 3,
          "body": "Brb investing in ADRs of Neue Mexico AG u. GmbH",
          "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llt81o1/",
          "created": 1725637701,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llpgz4c",
      "score": 2,
      "body": "Facebook does the same shit. Morally reprehensible videos of children get lots of engagement, and they don't remove them because they technically don't break a law.\n\nI've tried reporting them and facebook always comes back saying \"We've taken a look and found that this content doesn't go against our Community Standards\". Total bullshit.\n\nI hope Facebook is the next defendant in a similar lawsuit.",
      "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llpgz4c/",
      "created": 1725577144,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llw0hs3",
      "score": 1,
      "body": "I hate election years. ",
      "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llw0hs3/",
      "created": 1725671682,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llnxw6d",
      "score": -2,
      "body": "Seems kind of political and frivolous.",
      "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llnxw6d/",
      "created": 1725559332,
      "depth": 0,
      "replies": [
        {
          "id": "llo4mif",
          "score": 8,
          "body": "I think \"apolitical\" and \"substantially justified\" are the words you're looking for, considering they have 10,000 pieces of evidence at a minimum.",
          "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llo4mif/",
          "created": 1725561468,
          "depth": 1,
          "replies": [
            {
              "id": "llpbgc1",
              "score": 5,
              "body": "If I have a kid and let them go online, that’s the parents fault not the messaging app that’s really good at being a messaging app? Parents can easily set up parental controls on a iPhone. Snapchat also offers resources for parents. Snapchat can just say its parents being irresponsible not monitoring what their kid is doing or putting safeguards in place. If I had a kid, they aren’t getting a social media app until their at least 15 and I’m knowing who is messaging them on their friend list on Snapchat because only people the user adds and the other accepts can message",
              "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llpbgc1/",
              "created": 1725575177,
              "depth": 2,
              "replies": []
            },
            {
              "id": "llp3gbv",
              "score": 2,
              "body": "I think \"lack of parental oversight\" is the word you are looking for, considering parents should be the ones vetting what their children do at minimum.",
              "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llp3gbv/",
              "created": 1725572453,
              "depth": 2,
              "replies": [
                {
                  "id": "llpbk4i",
                  "score": 6,
                  "body": "How about just not letting your kid download certain apps? Pretty simple it’s the parents fault if they trust the kid to go on the internet",
                  "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llpbk4i/",
                  "created": 1725575213,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llpdeze",
                      "score": 2,
                      "body": "Fully agree!",
                      "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llpdeze/",
                      "created": 1725575872,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lloeujk",
              "score": 0,
              "body": "We will see",
              "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/lloeujk/",
              "created": 1725564724,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "llntghg",
      "score": 1,
      "body": "This might be the beginning of the end for snap.",
      "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llntghg/",
      "created": 1725557948,
      "depth": 0,
      "replies": [
        {
          "id": "llpbax9",
          "score": 4,
          "body": "Do me a favor and look up their dau ( daily active user) and just be amazed at the chart from over the last 10 years. It’s a meme that people keep on saying snap is dying and now it’s over 400 million dau",
          "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llpbax9/",
          "created": 1725575125,
          "depth": 1,
          "replies": [
            {
              "id": "llpoirm",
              "score": 6,
              "body": "Buddy you ain’t lying. https://www.reddit.com/r/dataisbeautiful/s/PIittVmgfv",
              "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llpoirm/",
              "created": 1725579874,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "llr2q3o",
      "score": 0,
      "body": "Finally someone doing something about chid porn on Snapchat",
      "permalink": "/r/stocks/comments/1f9o6rj/snap_sued_by_new_mexico_ag_over_sextortion_of/llr2q3o/",
      "created": 1725600057,
      "depth": 0,
      "replies": []
    }
  ]
}