{
  "title": "Nio Reports Q2 Earnings: Revenue Nearly Doubles, Gross Margin Hits 9.7%",
  "score": 44,
  "selftext": "Electric vehicle (EV) manufacturer Nio published on Thursday its second quarter earnings results posting a revenue increase of 98.9 per cent year over year mainly attributed to the 144 per cent surge in vehicle deliveries.\n\nThe company reported a vehicle margin of 12.2 per cent in the second quarter, nearly doubling from the 6.2 per cent reported a year ago and up sequentially from the 9.2 per cent reported in the first three months of the year.\n\nGross margin also improved to 9.7 per cent, up from 1.0 per cent a year ago and from 4.9 per cent reported in the first quarter of the year.\n\nNio delivered 57,373 vehicles between April and June achieving a new quarterly record.\n\nThe company reported a loss of 5,209.3 million yuan ($716.8 million), decreasing by 14.2 per cent year over year and also sequentially by 3.4 per cent.\n\nStanley Yu Qu, Nio’s chief financial officer, said, “Due to ongoing cost optimizations, our vehicle gross margin increased to 12.2% in the second quarter”.\n\n“We will continue to focus on efficient R&D and infrastructure investment, leverage the growth potential in the mass market, adopt flexible market strategies and continuously optimize our product portfolio. We are confident that these efforts will result in steady improvements in gross profit and cost efficiency in the future,” the new CFO added.\n\nSource: https://eletric-vehicles.com/nio/nio-reports-q2-earnings-revenue-nearly-doubles-gross-margin-hits-9-7/",
  "link_flair_text": "Earnings beat!",
  "id": "1f9u2er",
  "num_comments": 8,
  "created_utc": 1725561961,
  "permalink": "/r/stocks/comments/1f9u2er/nio_reports_q2_earnings_revenue_nearly_doubles/",
  "comments": [
    {
      "id": "llockuw",
      "score": 18,
      "body": "They've still got quite a way to go with that loss, but it's actually nice seeing them make good progress this year. Can't say I expected that when they were just a random, hyped, overpriced EV stock a couple of years ago when the price was between $35 and $50 and people were just bigging up NIO.\n\nNot that I think they are a buy now, because I imagine they'll likely record losses for another couple of years, but with the current path forward and their current valuation, it's not unreasonable to keep them on the shortlist and watch for opportunities.\n\nThis also is their first beat in forever, isn't it? So obviously the market is overreacting today, but it's still a decent signal. I think I'll keep watching them, and maybe I'll be tempted to open a speculative position if the research turns out okay and they fall below $4 again.",
      "permalink": "/r/stocks/comments/1f9u2er/nio_reports_q2_earnings_revenue_nearly_doubles/llockuw/",
      "created": 1725564004,
      "depth": 0,
      "replies": [
        {
          "id": "lloymru",
          "score": 2,
          "body": "They cannot afford to lose money for another couple years.",
          "permalink": "/r/stocks/comments/1f9u2er/nio_reports_q2_earnings_revenue_nearly_doubles/lloymru/",
          "created": 1725570886,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llqrawz",
      "score": 9,
      "body": "This used to be a Reddit darling stock back in the day. Good times.",
      "permalink": "/r/stocks/comments/1f9u2er/nio_reports_q2_earnings_revenue_nearly_doubles/llqrawz/",
      "created": 1725594427,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llpmzog",
      "score": 2,
      "body": "Impressive recovery, thought this stock would get PPD'd after earnings given the weak consumer market signal from China",
      "permalink": "/r/stocks/comments/1f9u2er/nio_reports_q2_earnings_revenue_nearly_doubles/llpmzog/",
      "created": 1725579321,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llqfqor",
      "score": 2,
      "body": "Zoom out on the chart",
      "permalink": "/r/stocks/comments/1f9u2er/nio_reports_q2_earnings_revenue_nearly_doubles/llqfqor/",
      "created": 1725589737,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llpljrg",
      "score": 0,
      "body": "Europe and the north American market to become inaccessible to them, even without the additional tariffs yet, they can't sell in any meaningful number. Just too expensive currently and their plan is to swallow up the tariffs in future and not pass to consumers? \nNeed a rethink of their strategy.",
      "permalink": "/r/stocks/comments/1f9u2er/nio_reports_q2_earnings_revenue_nearly_doubles/llpljrg/",
      "created": 1725578802,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llqefpu",
      "score": 0,
      "body": "Do you like China?",
      "permalink": "/r/stocks/comments/1f9u2er/nio_reports_q2_earnings_revenue_nearly_doubles/llqefpu/",
      "created": 1725589239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llq7t2u",
      "score": -3,
      "body": "If you believe a set of Chinese financials then you deserve to lose all your money",
      "permalink": "/r/stocks/comments/1f9u2er/nio_reports_q2_earnings_revenue_nearly_doubles/llq7t2u/",
      "created": 1725586823,
      "depth": 0,
      "replies": []
    }
  ]
}