{
  "title": "Intel Is Exploring Sale of Part of Stake in Mobileye",
  "score": 58,
  "selftext": "Intel still in desperate search of cash. They currently own 88% of $MBLY, which is down 70% YTD. This was another terrible investment on their end. All the terrible decisions that compounded for the last decade is coming back to nail the coffin shut. \n\nI don’t get $INTC bulls.\n\n\nSource: https://www.bloomberg.com/news/articles/2024-09-05/intel-is-said-to-explore-sale-of-part-of-stake-in-mobileye?embedded-checkout=true",
  "link_flair_text": "News",
  "id": "1f9yiif",
  "num_comments": 54,
  "created_utc": 1725572949,
  "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/",
  "comments": [
    {
      "id": "llp4za2",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 127 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llp4za2/",
      "created": 1725572953,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llpdnmc",
      "score": 34,
      "body": "I was talking shit internally about mobileye when that acquisition happened.  I call it the fetish for israeli companies.  Same with the alterra spinoff.  What happened was we tried to fab their shit for them and fucked them over so badly that it was probably one of those \"well I guess we'll just have to buy you at inflated price\" to compensate.",
      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llpdnmc/",
      "created": 1725575959,
      "depth": 0,
      "replies": [
        {
          "id": "llpuztn",
          "score": 4,
          "body": "Why so ? Wasn't it a play to get into autonomous driving space ?\n\nDid intel get to have their IP ?",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llpuztn/",
          "created": 1725582234,
          "depth": 1,
          "replies": [
            {
              "id": "llqcag3",
              "score": 9,
              "body": "Mobileye is losing business to Nvidia and Qualcomm. Ambarella and TI are also targetting the same space.",
              "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llqcag3/",
              "created": 1725588437,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "llpkxqx",
      "score": 71,
      "body": "People are bullish on Intel because their books are actually solid and the short term pain will end. Their margins are identical to AMD's, their market share is double AMD's, their net income is in line with AMD's on an adjusted basis. Yet Intel is trading at 1.7 P/S and AMD at 9.7. \n\nYou want more? Emergency shareholder this month. \n\nYou want more? Price to book ratio of 0.78. Find me another company with 53bn in revenue and a P/B <1.\n\nYou want more? Goldman Sachs, JPM and BCG have been in direct contact with the board.\n\nAt what point do people stop parroting WSB bullshit and realize this is probably one of the best value investments of the decade.\n\nAlso fuck that dividend, no volatility in dividend stocks because only boomers buy them, glad all those fucks got shook up, if covid can't kill them at least they lost money on INTC.",
      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llpkxqx/",
      "created": 1725578583,
      "depth": 0,
      "replies": [
        {
          "id": "llpucza",
          "score": 22,
          "body": "Flair checks out",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llpucza/",
          "created": 1725581999,
          "depth": 1,
          "replies": [
            {
              "id": "llrqpps",
              "score": 5,
              "body": " There's definitely an interesting dynamic at play with Intel right now. It's like they have the foundation but need to switch up the strategy to really capitalize. The move to sell off part of the stake in Mobileye could be a step in that direction. Sometimes being too attached to a failed investment can hold a company back more than anything else.",
              "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llrqpps/",
              "created": 1725615832,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "llq03ey",
          "score": 14,
          "body": "The funny thing is all those dividend investors stayed for 20 years but didn't bother to stay long enough to collect the rest of the dividend. I did.",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llq03ey/",
          "created": 1725584057,
          "depth": 1,
          "replies": [
            {
              "id": "llq0cbj",
              "score": 6,
              "body": "As counterintuitive as it is, hopefully dropping the dividend will lead Intel to focus more on revenue growth and forward PE.",
              "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llq0cbj/",
              "created": 1725584145,
              "depth": 2,
              "replies": [
                {
                  "id": "llr0gud",
                  "score": 3,
                  "body": "Dividend is really a non factor for valuing a stock, it's just there to bring stability. What that leads to is sure, safety, but not momentum one way or the other. The buy and hold tactic that boomers like doesn't lead to massive gains. \"Yeah we make so much that we don't need it, we're fine where we are, here go buy an ice cream\" mentality.\n\nYou kind of need a solid business structure and a longtime reputation. And even then, dividends are not popular for tech because by its very nature, it needs to adapt to the times, tech will never stay stagnant. That income is better spent on the business because it will usually lead to business growth which is in turn reflected in the share price, and then you can make your own dividend.\n\nIntel made a mistake giving one as it showed that they were going to remain stagnant and coast. Now that it's off, they're back in the tech game.",
                  "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llr0gud/",
                  "created": 1725598808,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "llrwuha",
          "score": 8,
          "body": "As I keep commenting here: 99% of the regards in here can't think 2 days ahead and can't remember 2 days behind. They got brainwashed with meme stocks and meteoric stock rises and think that every company should do that or it's worthless.",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llrwuha/",
          "created": 1725619637,
          "depth": 1,
          "replies": [
            {
              "id": "llrxbhs",
              "score": 7,
              "body": "The sub has changed a lot since I was browsing it every day in 2020-2021. It feels like the rest of reddit found wsb after the stock that will not be named and it's been slowly bleeding into the character of the sub becoming more whiney and less thoughtful when it comes to DD and analysis.",
              "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llrxbhs/",
              "created": 1725619901,
              "depth": 2,
              "replies": [
                {
                  "id": "llryjno",
                  "score": 3,
                  "body": "Yup, I joined around the same period and it was genuinely interesting to read some of the DD posted in here. Lately it's been all regarded takes with close to no reasoning behind them.",
                  "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llryjno/",
                  "created": 1725620564,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llrytiq",
                      "score": 10,
                      "body": "The thing that annoys me more is how fucking sensitive the posters/commenters are. You used to be able to talk shit without people getting mad now you get 65 downvotes in 12 seconds like the rest of reddit.",
                      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llrytiq/",
                      "created": 1725620711,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "llwsgib",
                          "score": 1,
                          "body": "Wsb isnt interesting sub to visit anymore, occasionally i fly by it.\nHODL INTEL",
                          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llwsgib/",
                          "created": 1725683611,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "llqkoqe",
          "score": 10,
          "body": ">Yet Intel is trading at 1.7 P/S and AMD at 9.7.\n\nFor a reason\n\nSelling asset won't address the issues",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llqkoqe/",
          "created": 1725591707,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llshr4c",
          "score": 1,
          "body": "Intc is being shaken hard by the big boys. What’s your position?",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llshr4c/",
          "created": 1725628938,
          "depth": 1,
          "replies": [
            {
              "id": "llspzbn",
              "score": 1,
              "body": "Like $200 in debit spreads for Dec LOL",
              "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llspzbn/",
              "created": 1725631876,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "llsr297",
          "score": 1,
          "body": "> their books are actually solid\n\nIf true then they wouldn’t currently be looking to offload assets to find quick cash lol\n\n> the short term pain will end\n\nThey’ve been losing market share on all fronts for nearly a decade and revenue is nearly $20B lower than what their 5 year guidance projected in 2020. This isn’t short term pain.\n\n> Their margins are identical to AMDs\n\nIntel’s margins have been collapsing over the past decade from 65% down to 41% in the TTM. AMD’s have been climbing from 35% a decade ago to 46% today. Again, they’re not the same \n\n> Their market share is double AMD’s\n\nAnd falling \n\n> Their net income is in line with AMD’s on an adjusted basis\n\nAdjusted earnings are kind of a joke. If you’re going to compare any profitability metrics other than GAAP accounting, it should be FCF. AMD took in $1.5B cash in the TTM while Intel burned $12B. They’re desperate for money.\n\n> Find me another company with 53bn in revenue and a P/B <1.\n\nGM, the company that mismanaged their way into bankruptcy and is trading at the same stock price they were 30 years ago. \n\n> Goldman Sachs, JPM, and BCG have been in contact with the board\n\nIntel’s credit recently got downgraded to BBB+ which spooked lenders. It’s rarely a good thing when the people you owe money to are contacting your board. \n\n\nTo be clear, I’ve been bearish on Intel for years, but have been buying in at sub $20. Ive believed for a while that the day they cut the dividend is probably the day they’re worth actually looking at as an investment. There’s a path here for them to succeed, but by no means is this “the best value investment of the decade.” They’re horribly managed and most of the top execs need to be booted out before we see any real change.",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llsr297/",
          "created": 1725632244,
          "depth": 1,
          "replies": [
            {
              "id": "llsstpq",
              "score": 3,
              "body": "Net income is a GAAP lol? On 54.23bn in revenue Intel had net income of 1.68bn. On 22.68bn AMD had net income of 854m. Very simple math, very much a GAAP. \n\n1.68bn/54.23bn = a profit margin of 3.1% for Intel \n\n854m/22.68bn = a profit margin of 3.7% for AMD\n\nNeither company has great margins to be clear, they're just nearly identical.\n\nThey're offloading assets not to gather cash (partially to do this) but to eliminate unprofitable company segments. The chip design business? Good. The fab business? Not so good. The cash will also help them pay down debts.",
              "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llsstpq/",
              "created": 1725632832,
              "depth": 2,
              "replies": [
                {
                  "id": "llsu4zo",
                  "score": 2,
                  "body": "Your post very clearly says “on an adjusted basis”, which is non-GAAP. If you wanted to compare net income, then mention net income. When analysts and investors just say “margins” they’re referring to gross and operating margin.",
                  "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llsu4zo/",
                  "created": 1725633263,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llsv8a3",
                      "score": 1,
                      "body": "Profit margin is more important than operating margin in this case because it illustrates that their core business model is good or at least /as good as AMD's. The disconnect is with their operating margin but if you aren't stupid you know why that's low. They've been pouring their money into fab projects in the US that they thought would contribute to rapid growth and make them a competitor to TSMC. Erase those bad projects and suddenly, boom their operating margin is fixed! Which is why the asset selling talk is bullish af.\n\nWhen I said on an adjusted basis, I meant their net incomes were the same if you considered the massive difference in revenue, tldr their profit margin is the same.",
                      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llsv8a3/",
                      "created": 1725633620,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "llsw65d",
                          "score": 1,
                          "body": "Fair enough. Like I said, I’m buying small chunks of intc at these prices. I don’t necessarily disagree with you, I just think it’s important to also highlight the massive issues they’re currently experiencing. We’re in the middle of a chip boom and Intel is somehow losing revenue while every other semi stock is going parabolic. \n\nThat raises red flags, and it means we’re betting on a turnaround story here instead of a growth story.",
                          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llsw65d/",
                          "created": 1725633927,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "llswpd8",
                              "score": 1,
                              "body": "I think it's disingenuous to say every other semi stock is going parabolic though, that was a time and a place and mostly carried by NVDA and TSMC. Look at the market and it starts to vibe like NVDA is the only semi firm with continued revenue growth. AMD? Kinda shit. SMCI? Lol... Broadcomm just got smacked.",
                              "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llswpd8/",
                              "created": 1725634100,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "llqwnyt",
          "score": 2,
          "body": "Counterpoint: Intel looks like great value short-term, but long-term it is at a huge competitive disadvantage. It pays less than its competitors and does not have better products. The best would rather work elsewhere. So, their future products will be competitively weak.",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llqwnyt/",
          "created": 1725596852,
          "depth": 1,
          "replies": [
            {
              "id": "llrvvzi",
              "score": 5,
              "body": "The pay part might be true but they're definitely still producing solid chips, better than AMD in the consumer market.",
              "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llrvvzi/",
              "created": 1725619084,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "llrcog4",
          "score": 0,
          "body": "sure, and massive overhead.  having their own fabs while using tsmc's, having their own packaging while using tsmc's, negative cash flow, bleeding out, dcai being down while everyone else is booming, etc and etc... \n\nbroken promises and half-assed push-ups only went so far.",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llrcog4/",
          "created": 1725606120,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llpmajx",
      "score": 9,
      "body": "Sale of that stake will increase cash on hand fairly significantly…. Smart to ditch dead weight",
      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llpmajx/",
      "created": 1725579068,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llp6nx0",
      "score": 24,
      "body": "People are bullish on Intel because it’s the only advanced chip manufacturer from the west, and semiconductors are the new “oil”.",
      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llp6nx0/",
      "created": 1725573516,
      "depth": 0,
      "replies": [
        {
          "id": "llp7jy1",
          "score": -1,
          "body": "The government can throw all the money they want at it, but a failed company is still a failed company. Just because they won’t let it die, doesn’t mean it will flourish.",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llp7jy1/",
          "created": 1725573820,
          "depth": 1,
          "replies": [
            {
              "id": "llplk79",
              "score": 26,
              "body": "18A has the potential to be INTC’s RYZEN.  There was a time when AMD chips were dog shit and everyone was saying this crap about them.",
              "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llplk79/",
              "created": 1725578806,
              "depth": 2,
              "replies": [
                {
                  "id": "llq0eoi",
                  "score": 5,
                  "body": "I first joined this sub when AMD was $8. I increased my IRA position in INTC by 50% yesterday (101 to 151 shares). I think this is a good sale. I started buying late 2022",
                  "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llq0eoi/",
                  "created": 1725584169,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llqwwrq",
                      "score": 2,
                      "body": "Ah, $8 AMD. Fuck Goldman's Sachs.",
                      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llqwwrq/",
                      "created": 1725596972,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "llpajld",
              "score": 2,
              "body": "Hopeum they get first dibs on some DARPA tech",
              "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llpajld/",
              "created": 1725574860,
              "depth": 2,
              "replies": []
            },
            {
              "id": "llpde35",
              "score": 2,
              "body": "They haven’t sent out the chips act money yet.",
              "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llpde35/",
              "created": 1725575863,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "llqzgv1",
      "score": 9,
      "body": "I’m not going to put money in Intel but:\n\nYesterday I saw a video from Dave2D (the only tech influencer who seemed honest). It was a Lenovo laptop with better battery life than a MacBook and capable of playing modern games. It had a new Intel x86 chip. It was 30w under max use which was impressive. \n\nI don’t know if Intel paid him a nice amount for the video but made it seem like Intel processors (new ones) didn’t suck. ",
      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llqzgv1/",
      "created": 1725598272,
      "depth": 0,
      "replies": [
        {
          "id": "llrks85",
          "score": 3,
          "body": "D2D is a honest reviewer. I don’t think intel paid him to say the things he did in that video.",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llrks85/",
          "created": 1725611719,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llrcc7v",
          "score": 1,
          "body": "Yes, I also checked comments on similar videos and Reddit posts, and people are positive.",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llrcc7v/",
          "created": 1725605902,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llr9nx8",
          "score": -2,
          "body": "If it sucks, intel wouldn't say though. I would rather wait for release products and independent reviews.\n\n\nAlso, it would be nice to see what competitions' new offerings will do.",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llr9nx8/",
          "created": 1725604205,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llpsqrl",
      "score": 4,
      "body": "Mobili is shit",
      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llpsqrl/",
      "created": 1725581413,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llppndh",
      "score": 3,
      "body": "They should just stop the Germany fab, they don’t need it. Be smart with capital Pat",
      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llppndh/",
      "created": 1725580283,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llqflyb",
      "score": 2,
      "body": "Nothing wrong with this move. I am still in it",
      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llqflyb/",
      "created": 1725589686,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llr6jwj",
      "score": 2,
      "body": "Intel will get $8B from government, that will patch them over for 2025 foundry losses. Starting from 2026 18A ramps up and margins start improving.\n\nIntels stock will be dead until end of 2025, with occasional brief bounces with every new client added to their 18a customer list.",
      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llr6jwj/",
      "created": 1725602268,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmdmuli",
      "score": 1,
      "body": "Everytime I buy MBLY it get to its new low. I am trying to catch falling knife from January when it suddenly drop 45%. Today it's almost hitting 10 from 45",
      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/lmdmuli/",
      "created": 1725934763,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnwhdmb",
      "score": 1,
      "body": "Mbly is a buy rn! Sold the news",
      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/lnwhdmb/",
      "created": 1726756250,
      "depth": 0,
      "replies": [
        {
          "id": "lnwlzlr",
          "score": 1,
          "body": "\nIntel reaffirms majority stake in Mobileye (MBLY), emphasizes focus on growth and autonomous driving leadership \n\nhttps://www.briefing.com/in-depth-analysis/content/article?ArticleId=IN20240919070804INTC&utm_campaign=inplay&utm_medium=social&utm_source=st&utm_content=view_page",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/lnwlzlr/",
          "created": 1726757821,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llp7f3b",
      "score": -4,
      "body": "People are bullish on Intel because they want to double their money and when they click 5 year graph in Intel they look at $60 and think it’s their once in a lifetime opportunity at becoming a millionaire. Just a bunch of idiots. Idiot tax. Wealth distribution for regards. Life is difficult when your are stupid",
      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llp7f3b/",
      "created": 1725573773,
      "depth": 0,
      "replies": [
        {
          "id": "llponm8",
          "score": 11,
          "body": "I have no position in intel but what bear case is left? Do bears honestly believe intel goes completely bankrupt? Intel is in a really shitty spot but they still have some value. I’d argue there might be more room to fall but it does start to become pretty attractive soon imo.",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llponm8/",
          "created": 1725579924,
          "depth": 1,
          "replies": [
            {
              "id": "llrywhb",
              "score": 2,
              "body": "Bear case is too much negative vibes",
              "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llrywhb/",
              "created": 1725620755,
              "depth": 2,
              "replies": []
            },
            {
              "id": "llpq952",
              "score": 3,
              "body": "I mean they can stagnate indefinitely. Plus there’s still a long ways between 100Billiom market cap and bankruptcy.",
              "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llpq952/",
              "created": 1725580503,
              "depth": 2,
              "replies": [
                {
                  "id": "llprvmp",
                  "score": 9,
                  "body": "Of course they could but is that likely? And at what point does their valuation equate to the value of their IP alone? I’d argue we are getting close to it. As I’ve said, intel is absolutely in a shit spot and they need significant change. But I do think there is potential here.",
                  "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llprvmp/",
                  "created": 1725581098,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "llpef7a",
          "score": 9,
          "body": "But the bottom is near and a short pop is due, we just need grandmas boy to sell",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llpef7a/",
          "created": 1725576239,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llpk50j",
          "score": 0,
          "body": "![img](emote|t5_2th52|27189)",
          "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llpk50j/",
          "created": 1725578293,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llqirib",
      "score": -3,
      "body": "Trash owns trash. Shocker.",
      "permalink": "/r/wallstreetbets/comments/1f9yiif/intel_is_exploring_sale_of_part_of_stake_in/llqirib/",
      "created": 1725590921,
      "depth": 0,
      "replies": []
    }
  ]
}