{
  "title": "Salesforce to acquire startup Own for $1.9 billion in cash ",
  "score": 99,
  "selftext": "Salesforce announced Thursday that it would pay $1.9 billion in cash for Own Co., a startup specializing in tools for backing up data in cloud-based applications. Salesforce intends to close the deal in the quarter ending in January 2025 if regulators give it their blessing, according to a statement.\n\nThe startup, formerly known as OwnBackup, was valued at $3.35 billion in a 2021 funding round. Salesforce Ventures, the cloud software company’s venture arm, invested in that round and earlier ones.\n\nThe proposed deal would mark the return of sizable deals for Salesforce, less than two years after co-founder and CEO Marc Benioff said the board was eliminating a committee on mergers and acquisitions.\n\nBenioff’s pronouncement came after activist investors bought stakes in Salesforce and raised questions about profitability after the company had splurged on expensive assets, including MuleSoft and Slack, without delivering major growth in return.\n\nThe decline in value for Own reflects a more sluggish backdrop for software companies.\n\nIn late 2021, investors became less interested in cloud software, which had seen a surge in adoption in 2020 thanks to remote-work policies instituted after Covid. Central banks raised rates to ward off inflation, prompting money-losing cloud companies to focus more on profitability. Enterprises aiming to slim down information-technology budgets consolidated their purchases, burdening single-product companies, including startups and publicly traded companies.\n\nAnaplan, Avalara, Coupa, Everbridge, Qualtrics, Sumo Logic and Zendesk all went private.\n\nOwn, which had specialized in helping Salesforce clients, sought to diversify. In its 2021 funding announcement, it touted its intent to work with Microsoft’s Dynamics enterprise software that competes with Salesforce’s core applications. Support for ServiceNow followed.\n\nSalesforce in recent weeks has also revealed plans to buy smaller startups PredictSpring and Tenyx.\n\nSalesforce said the Own acquisition wouldn’t impact Salesforce’s shareholder return initiatives, and said the deal would be accretive to free cash flow starting in the second year after the deal closes.\n\nIn April, data-management software maker Informatica said it was not in talks to be acquired after media outlets reported Salesforce was interested in buying the company for around $10 billion.\n\n“We’re going to be looking at products organically, but, yes, we will continue to look at products inorganically,” Benioff told analysts on Salesforce’s May earnings call. “But as we’ve committed to you, if we’re looking at a large-scale acquisition, we’re going to make sure that it is not dilutive to our customers, that it’s accretive, that it has the right metrics.”\n\nSource: https://www.cnbc.com/2024/09/05/salesforce-to-acquire-own-for-1point9-billion-in-cash.html",
  "link_flair_text": null,
  "id": "1fa2bgd",
  "num_comments": 14,
  "created_utc": 1725583329,
  "permalink": "/r/stocks/comments/1fa2bgd/salesforce_to_acquire_startup_own_for_19_billion/",
  "comments": [
    {
      "id": "llq1ppu",
      "score": 26,
      "body": "after the news larry ellison was buying paramount, i thought salesforce was buying oprah winfrey’s tv channels at first when i read the headline",
      "permalink": "/r/stocks/comments/1fa2bgd/salesforce_to_acquire_startup_own_for_19_billion/llq1ppu/",
      "created": 1725584627,
      "depth": 0,
      "replies": [
        {
          "id": "llrwuj8",
          "score": 2,
          "body": "Ditto, 100 per cent",
          "permalink": "/r/stocks/comments/1fa2bgd/salesforce_to_acquire_startup_own_for_19_billion/llrwuj8/",
          "created": 1725619638,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lls26to",
          "score": 1,
          "body": "That would be sad if she win from another scam. ",
          "permalink": "/r/stocks/comments/1fa2bgd/salesforce_to_acquire_startup_own_for_19_billion/lls26to/",
          "created": 1725622408,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llqxs83",
      "score": 11,
      "body": "Wow, I’m very familiar with this company from my network and this is a really tough return on equity for their employees if this goes through.",
      "permalink": "/r/stocks/comments/1fa2bgd/salesforce_to_acquire_startup_own_for_19_billion/llqxs83/",
      "created": 1725597406,
      "depth": 0,
      "replies": [
        {
          "id": "llqyssb",
          "score": 4,
          "body": "As in they’re all not in the money at this valuation?",
          "permalink": "/r/stocks/comments/1fa2bgd/salesforce_to_acquire_startup_own_for_19_billion/llqyssb/",
          "created": 1725597921,
          "depth": 1,
          "replies": [
            {
              "id": "llqywhb",
              "score": 9,
              "body": "I’m sure a good % are, but the last valuation was like $4b so that’s a pretty tough pay cut",
              "permalink": "/r/stocks/comments/1fa2bgd/salesforce_to_acquire_startup_own_for_19_billion/llqywhb/",
              "created": 1725597974,
              "depth": 2,
              "replies": [
                {
                  "id": "llvieym",
                  "score": 2,
                  "body": "The alternative was IPO which would be an even bigger disaster. This is probably the best deal they could get. Most Employees will get a few thousand bucks atleast. Not great but being part of Salesforce isnt the worst thing.",
                  "permalink": "/r/stocks/comments/1fa2bgd/salesforce_to_acquire_startup_own_for_19_billion/llvieym/",
                  "created": 1725664842,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lltjemc",
                  "score": 1,
                  "body": "Why do you think the discount?",
                  "permalink": "/r/stocks/comments/1fa2bgd/salesforce_to_acquire_startup_own_for_19_billion/lltjemc/",
                  "created": 1725641332,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lltu2aw",
                      "score": 3,
                      "body": "Money isn’t cheap anymore due to interest rates. Have to make an exit when you can",
                      "permalink": "/r/stocks/comments/1fa2bgd/salesforce_to_acquire_startup_own_for_19_billion/lltu2aw/",
                      "created": 1725644737,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "llv7k3f",
                          "score": 1,
                          "body": "Assuming you’re relying on debt and can’t fund organically, correct?",
                          "permalink": "/r/stocks/comments/1fa2bgd/salesforce_to_acquire_startup_own_for_19_billion/llv7k3f/",
                          "created": 1725660901,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "llqyn1z",
      "score": 3,
      "body": "I guess acquisitions are back on the menu for Salesforce.",
      "permalink": "/r/stocks/comments/1fa2bgd/salesforce_to_acquire_startup_own_for_19_billion/llqyn1z/",
      "created": 1725597839,
      "depth": 0,
      "replies": [
        {
          "id": "llrwgcc",
          "score": 2,
          "body": "Guess the signs of rate drops are true, this & Verizon happening",
          "permalink": "/r/stocks/comments/1fa2bgd/salesforce_to_acquire_startup_own_for_19_billion/llrwgcc/",
          "created": 1725619414,
          "depth": 1,
          "replies": [
            {
              "id": "llyupzl",
              "score": 1,
              "body": "Will that matter if there is recession/economic unc AAA bond yields will go up. For example in 2008 yields went up to as high as 6% not its at 4.5%",
              "permalink": "/r/stocks/comments/1fa2bgd/salesforce_to_acquire_startup_own_for_19_billion/llyupzl/",
              "created": 1725723241,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lm749dh",
      "score": 1,
      "body": "This is going to be interesting. Own Backup is big in the ServiceNow space. Wonder how that'll play out.",
      "permalink": "/r/stocks/comments/1fa2bgd/salesforce_to_acquire_startup_own_for_19_billion/lm749dh/",
      "created": 1725838272,
      "depth": 0,
      "replies": []
    }
  ]
}