{
  "title": "Sen. Elizabeth Warren writes a letter backing the DOJ investigation into Nvidia antitrust allegations",
  "score": 366,
  "selftext": "https://www.businessinsider.com/elizabeth-warren-backs-justice-department-nvidia-antitrust-investigation-2024-9\n\nSeptember 5 2024\n\nDear Assistant Attorney General Kanter.\n\nCompetition is key to a thriving U.S. economy and faster economic growth. This is particularly true in the semiconductor market, which will drive future advances in artificial intelligence (AI) and other tech breakthroughs --- the reason Congress provided $52.7 billion in support for the industry in the CHIPS and Science Act.\n\nThis is why I welcome the reports that the Department of Justice (DOJ) has opened an antitrust investigation into Nvidia, whose blockbuster growth has made it one of the world's largest companies. While this growth has been primarily driven by the recent AI boom, it has been supercharged by Nvidia's use of anticompetitive tactics that have choked off competition and chilled innovation. I am pleased that the DOJ has joined authorities in other countries, such as the United Kingdom and the European Union, in investigating Nvidia's conduct.\n\nUntil recently, Nvidia was a relatively niche provider of gaming chips, but as a \"prime beneficiary of the Al frenzy,\" it has seen its market capitalization increase by 250% between November 2021 and May 2024. The money involved is vast, and Big Tech is spending most of it: Microsoft and Meta spent a combined $9 billion on Nvidia's chips last year alone. Amazon purchased as many as 50,000 chips in 2023. And Google plans to pour nearly $40 billion into AI this year much of it on Nvidia's products and services.\n\nAs a result of this spending, Nvidia now controls an estimated 90% of the market for high-end AI chips and 98% of the lucrative and growing data center graphics processing units (GPUS) market. Its hardware has been the underpinning of almost every AI milestone, including the development and deployment of OpenAl's ChatGPT-4 and other models. Market power like that means the company decides who gets chips from its limited supply and how much they pay, with some experts theorizing that Nvidia has been making a 1000% profit through the retail price of some of its chips. This has effectively made Nvidia the gatekeeper for the world's AI future. \n\nBut in carrying out this responsibility, Nvidia has shown that it is not committed to fair play. The company locks customers in by bundling products, software, and services a practice that has already triggered antitrust scrutiny in France-resulting in Nvidia's own programming software being the only system that is fully compatible with its chips. In a move that was ultimately blocked by the Federal Trade Commission, Nvidia has attempted to further raise barriers to entry by acquiring Arm Limited, the developer of essential chip architecture. If the deal had gone through, experts say Nvidia would have gained control over a software architecture that most of the industry relies on. As Nvidia cements its dominance, venture funders are investing less in companies attempting to build competing chips. Indeed, the number of U.S. venture funding deals for Al chips fell approximately 80% between 2022 and 2023.\n\nThe insatiable hunger of gargantuan Big Tech companies for Nvidia chips, along with the company's opaque and preferential allocation of them, are starving startup companies of the infrastructure they need to do business and crowding academic AI researchers out of the field. Allowing a single company so much influence over AI research, development, and monetization poses dire economic risks. Competition powers a virtuous cycle of rapid innovation by impelling each market participant to create the best products. It creates jobs and generates tax revenue. It reduces the need for regulation by giving the market a role in keeping aspiring monopolists in check. It reduces costs for companies by giving them a choice of suppliers.\n\nWithout the intervention of U.S. regulators, the prospects of restoring competition in the semiconductor market are bleak. They will only grow bleaker as Nvidia approaches 100% ownership of the market, and as it begins pouring money into lobbying alongside the conventional Big Tech players to shape the contours of AI regulation and lock in its advantage. I thank you for your leadership and support efforts to undertake a comprehensive and fair investigation into Nvidia.\n\nSincerely,\n\nElizabeth Warren \nUnited States Senator \n",
  "link_flair_text": null,
  "id": "1fahrhc",
  "num_comments": 219,
  "created_utc": 1725635922,
  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/",
  "comments": [
    {
      "id": "llt66t3",
      "score": 316,
      "body": "She must have puts on NVDA.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llt66t3/",
      "created": 1725637117,
      "depth": 0,
      "replies": [
        {
          "id": "lltjuv8",
          "score": 56,
          "body": "Against Pelosi?",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltjuv8/",
          "created": 1725641477,
          "depth": 1,
          "replies": [
            {
              "id": "lltqbfy",
              "score": 70,
              "body": "Wouldn't be surprised if it's revealed in a month that Pelosi sold right before the investigation",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltqbfy/",
              "created": 1725643537,
              "depth": 2,
              "replies": [
                {
                  "id": "llz5oas",
                  "score": 2,
                  "body": "For those curious like me, it looks like she's bought into NVDA [twice this year, with cumulative returns on those purchase of -8.31% and -17.4%](https://imgur.com/a/989Zl46)",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llz5oas/",
                  "created": 1725726945,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lm08ldd",
                  "score": 1,
                  "body": "Bought right after it",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lm08ldd/",
                  "created": 1725740061,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lltlil8",
              "score": 50,
              "body": "Never go against a Sicilian when death is on the line, or Pelosi when it is stocks.",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltlil8/",
              "created": 1725642001,
              "depth": 2,
              "replies": [
                {
                  "id": "llurwul",
                  "score": 14,
                  "body": "Pelosi seems to be a Sicilian last name, which makes it worse.\n\nhttps://www.heraldrysinstitute.com/lang/it/cognomi/Pelosi/Italia/idc/853168/#:~:text=La%20casata%20%C3%A8%20sorta%20dall%27unione%2C%20probabilmente%20per%20via,secolo%20decimo%20sesto%2C%20da%20un%20Bartolomeo%2C%20di%20Gio.",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llurwul/",
                  "created": 1725655632,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llyi52h",
                      "score": 2,
                      "body": "That's actually crazy but makes sense.  Sicilianas have crazy ancestry and don't fuck around",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llyi52h/",
                      "created": 1725718781,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lm0kh4b",
                      "score": 2,
                      "body": "She's not of Sicilian ancestry. Her ancestry is on her Wiki page.",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lm0kh4b/",
                      "created": 1725744155,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lltu83u",
          "score": 10,
          "body": "Must be that. She totally doesn't have a long track record of railing against any large businesses and being staunchly pro-consumer.",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltu83u/",
          "created": 1725644789,
          "depth": 1,
          "replies": [
            {
              "id": "llu11dh",
              "score": 13,
              "body": "Yea we all want 5 even shittier versions of twitter, and 5 even shittier types of wal mart, and 10 shitty Amazons. “Pro-consumer,” that’s a good one.",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu11dh/",
              "created": 1725646964,
              "depth": 2,
              "replies": [
                {
                  "id": "llxxh42",
                  "score": 4,
                  "body": "Twitter can get shittier?",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llxxh42/",
                  "created": 1725709788,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llyakmg",
                      "score": 1,
                      "body": "When the govt gets involved, things can get *much* shittier.",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llyakmg/",
                      "created": 1725715830,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "llz5zaq",
                  "score": 1,
                  "body": "Literally every economics academic from the last 200 years could agree that more competition reduces prices, increases innovation, and is overall better for consumers than more concentrated competition....",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llz5zaq/",
                  "created": 1725727044,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lm07bq2",
                      "score": 1,
                      "body": "Yes, that is well understood. You’re going to have to somehow incorporate government intervention in this context. Do they also think that government intervention is a good way to introduce competition?  What is the catalyst for introducing more competition?",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lm07bq2/",
                      "created": 1725739629,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lm2aigm",
                          "score": 1,
                          "body": "Yes.  It's called trust busting.  We've done it many times, most famously with Standard Oil (John Rockafeller) and Northern Securities (JP Morgan).\n\nMonopoly prevents competition.  In cases where monopoly has formed, busting up that monopoly enables competition.",
                          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lm2aigm/",
                          "created": 1725768454,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "llu6c4g",
                  "score": -1,
                  "body": "So you don’t believe in free market competition?",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu6c4g/",
                  "created": 1725648670,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llu7h7i",
                      "score": 27,
                      "body": "Sometimes the free market picks a winner.",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu7h7i/",
                      "created": 1725649034,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lluzwsj",
                          "score": 8,
                          "body": "And then that winner gets progressively shittier to squeeze out more profits with basically no real competition.",
                          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lluzwsj/",
                          "created": 1725658277,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "llvj4x2",
                          "score": 1,
                          "body": "These people are just anti success",
                          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llvj4x2/",
                          "created": 1725665109,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "llu7gx9",
                      "score": 17,
                      "body": "I absolutely do. And NVDA is the biggest competitor in the chip market. What I don’t believe in is government installed “competition,” or government tinkering that kneecaps companies that are the best in their field.",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu7gx9/",
                      "created": 1725649031,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "llummej",
                      "score": 5,
                      "body": "They have no case against nvidia.  I’m all for free market competition but you can’t dismantle a company that’s in the mists of developing the infrastructure to support AI.  Their argument that the chip comes bundled with software is ridiculous because it’s the combination of their software and hardware that makes them the best.",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llummej/",
                      "created": 1725653917,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "llwepk5",
                          "score": 2,
                          "body": "midst",
                          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llwepk5/",
                          "created": 1725677378,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "llxbq8j",
                              "score": 1,
                              "body": "misdt",
                              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llxbq8j/",
                              "created": 1725695384,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lm0iz3r",
                                  "score": 1,
                                  "body": "Mytz",
                                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lm0iz3r/",
                                  "created": 1725743623,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "llwk3wo",
              "score": 4,
              "body": "Huh? She's always anti-consumer.",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llwk3wo/",
              "created": 1725679691,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "llt9v2y",
      "score": 97,
      "body": "Looking forward to buying the tasty dip.  Just bought at $102 and $101 and will continue to keep buying on the way down.\n\nI'd like to see a debate between Nancy Pelosi and Elizabeth Warren about Nvidia so the public can get a better idea of how the stock market works.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llt9v2y/",
      "created": 1725638270,
      "depth": 0,
      "replies": [
        {
          "id": "lltj1wu",
          "score": 12,
          "body": "Might be a long way down without a way up, bro.",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltj1wu/",
          "created": 1725641220,
          "depth": 1,
          "replies": [
            {
              "id": "lltn4wh",
              "score": 19,
              "body": "I love how, for hyped stocks like Nvidia, there's always this one super upvoted comment in every thread in the style of \"oh, so it's a super discount day!😀\" with no reasoning backing it up whatsoever. (Not saying this particular Redditor is wrong, just in general). Even I bought a little bit of Nvidia now",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltn4wh/",
              "created": 1725642519,
              "depth": 2,
              "replies": [
                {
                  "id": "llu08os",
                  "score": 33,
                  "body": "I remember not that long ago when Reddit was convinced that META was cooked.",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu08os/",
                  "created": 1725646706,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llu85ti",
                      "score": 13,
                      "body": "If it follows anything close to META's chart, it's going to $33 a share before hitting $200.",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu85ti/",
                      "created": 1725649256,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "llv1op4",
                      "score": 8,
                      "body": "People were saying that Meta was cooked when it was sitting at about PE of 7 and profiting tens of billions in profits.  The Facebook situation was just completely irrational in every regard.\n\n\n People are saying NVDA may be overvalued and over hyped at a PE of 50.   The two situations are not similar. For what it's worth, I'm long on NVDA with a small position, but it's just not the same messaging at all.  ",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llv1op4/",
                      "created": 1725658879,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "llu6w1x",
                      "score": 3,
                      "body": "I remember that. Bought massive in the 90s. Laughed my way to gains still",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu6w1x/",
                      "created": 1725648846,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "llv00wo",
                          "score": 1,
                          "body": "Gigachad.",
                          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llv00wo/",
                          "created": 1725658316,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "llv4wv7",
                              "score": 2,
                              "body": "The zuck provides!",
                              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llv4wv7/",
                              "created": 1725659981,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lm0ktbq",
                          "score": 1,
                          "body": "RemindMe! 6 months",
                          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lm0ktbq/",
                          "created": 1725744278,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lm0ky87",
                              "score": 1,
                              "body": "I will be messaging you in 6 months on [**2025-03-07 21:24:38 UTC**](http://www.wolframalpha.com/input/?i=2025-03-07%2021:24:38%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lm0ktbq/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1fahrhc%2Fsen_elizabeth_warren_writes_a_letter_backing_the%2Flm0ktbq%2F%5D%0A%0ARemindMe%21%202025-03-07%2021%3A24%3A38%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201fahrhc)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lm0ky87/",
                              "created": 1725744327,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "llv4pwu",
                      "score": 2,
                      "body": "Meta had a PE of 8. What is NVDA?",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llv4pwu/",
                      "created": 1725659915,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "llxcivq",
                      "score": 1,
                      "body": "before anyone got too excite and liken this drop as if the next META, META drawdown is up to 77% from ATH where it stand at basically single digit P/E.",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llxcivq/",
                      "created": 1725695937,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lltp6r7",
                  "score": 7,
                  "body": "That's just me, I'm a perma bull. :D",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltp6r7/",
                  "created": 1725643176,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "llu01hv",
                  "score": 7,
                  "body": "To me, Nvidia is sort of a standout. They have such a huge AI footprint that it's seemingly impossible for them not to sit up top somewhere like Microsoft when everything settles in a decade or two, so getting in now on the frenzy seems like a good idea if you're holding long.\n\nBut what do I know.. I just write algorithms all day.",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu01hv/",
                  "created": 1725646643,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llub573",
                      "score": 3,
                      "body": "stick to algorithms lil bro",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llub573/",
                      "created": 1725650218,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "llvmqbp",
                  "score": 1,
                  "body": "after many ups and downs, what about this down in particular makes it seems like it will be the final up and perpetual down from here onward and here specifically? Next earnings they'll anounce they made yet another morbitrigorillion dollars and it will go up again.",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llvmqbp/",
                  "created": 1725666477,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "llz64mw",
                  "score": 1,
                  "body": "> \"oh, so it's a super discount day!😀\" with no reasoning backing it up whatsoever\n\nWent down from 100.0x NTM Sales to 95.0x NTM sales!!!",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llz64mw/",
                  "created": 1725727092,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "llthhnq",
          "score": -8,
          "body": "Mate Nancy sold before the doj news was out.",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llthhnq/",
          "created": 1725640717,
          "depth": 1,
          "replies": [
            {
              "id": "lltmarn",
              "score": 19,
              "body": "Source? There is a 45 day gap between transactions and reporting so I dont believe that",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltmarn/",
              "created": 1725642252,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lltmj95",
              "score": 6,
              "body": "Dumb",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltmj95/",
              "created": 1725642326,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lltfe0r",
      "score": 70,
      "body": "Love the free market. So that means they'll be removing the export bans from NVDA to China right? \n\nFor true competition and market growth?",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltfe0r/",
      "created": 1725640033,
      "depth": 0,
      "replies": [
        {
          "id": "lltnnbl",
          "score": 12,
          "body": "The chips are getting smuggled in very easy",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltnnbl/",
          "created": 1725642683,
          "depth": 1,
          "replies": [
            {
              "id": "lltudxn",
              "score": 7,
              "body": "Makes it more expensive for China at a minimum.",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltudxn/",
              "created": 1725644841,
              "depth": 2,
              "replies": [
                {
                  "id": "lltwfve",
                  "score": 11,
                  "body": "Actually right now renting an hour of compute on nvda chips in China is cheaper then US rates , it’s been all over the news",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltwfve/",
                  "created": 1725645491,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llxby2m",
                      "score": 1,
                      "body": "That's kind of impressive, actually",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llxby2m/",
                      "created": 1725695533,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "llu0uxc",
              "score": 2,
              "body": "My friend smuggles Legos from Seattle to northern England. Apparently they pay the most there for Legos. He makes enough to pay for the travel and his flight. \n\nIf they can’t stop Legos and are looking for them to make people pay duties and large taxes, then chips are easy. ",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu0uxc/",
              "created": 1725646907,
              "depth": 2,
              "replies": [
                {
                  "id": "lluk29f",
                  "score": 2,
                  "body": "Omg I’m going to London paid for with Legos lol that’s awesome 👏",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lluk29f/",
                  "created": 1725653098,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llurhh4",
                      "score": 2,
                      "body": "His last trip he had four star destroyers so you’ll need some capital(ship) worth about $8k. ",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llurhh4/",
                      "created": 1725655494,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "llut6w0",
                          "score": 2,
                          "body": "But the resell is where the profit comes from that covers the travel expenses right ? Just randomly offer for sale at a price below retail there? Do they use offer up ?",
                          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llut6w0/",
                          "created": 1725656038,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "llvkv4q",
                              "score": 1,
                              "body": "He works in tech so he knows a bunch of tech guys in the area. It might be hard to find high-paying guys in other fields. ",
                              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llvkv4q/",
                              "created": 1725665763,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "llvo67x",
                                  "score": 2,
                                  "body": "If you are selling a thing below market price then you always have a buyer lol",
                                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llvo67x/",
                                  "created": 1725667028,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "llw08pr",
                                      "score": 2,
                                      "body": "For something with high liquidity like stocks and bonds. For a high-end product, not so much. You have to find the right buyer. ",
                                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llw08pr/",
                                      "created": 1725671586,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "llwhpra",
                                          "score": 3,
                                          "body": "You saying he lines up Lego buyers before he even gets on plane ?",
                                          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llwhpra/",
                                          "created": 1725678637,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "llyq0ns",
          "score": 2,
          "body": "Ahh yes, China, the IP stealing bastion of free market competition and goodwill on Earth. A country truly in need of defenders on reddit brave enough to stand, not against something, but *for* something. Something like the CCP. Good job comrade.",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llyq0ns/",
          "created": 1725721606,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llt7egd",
      "score": 110,
      "body": "\"... it has been supercharged by Nvidia's use of anticompetitive tactics that have choked off competition and chilled innovation.\"\n\nBeth, this shows you have no idea what you're talking about.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llt7egd/",
      "created": 1725637499,
      "depth": 0,
      "replies": [
        {
          "id": "lltl8u8",
          "score": 31,
          "body": "Has anyone specified what these anticompetitive practices are that NVDA has allegedly employed?",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltl8u8/",
          "created": 1725641915,
          "depth": 1,
          "replies": [
            {
              "id": "llvym78",
              "score": 4,
              "body": "It's in the article......",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llvym78/",
              "created": 1725670960,
              "depth": 2,
              "replies": []
            },
            {
              "id": "llu0mr5",
              "score": 3,
              "body": "Yeah.. scroll up 🙄",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu0mr5/",
              "created": 1725646834,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lltlrd9",
          "score": 21,
          "body": "She is screaming today about how she wants to discourage long-term investing. She's lost it. A >50% tax rate in some states for long-term investing will mean for most people it isn't worth the risk any longer.",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltlrd9/",
          "created": 1725642077,
          "depth": 1,
          "replies": [
            {
              "id": "lluek19",
              "score": 18,
              "body": "She has definitely pushed some bad tax concepts.",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lluek19/",
              "created": 1725651332,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lltl73o",
          "score": 14,
          "body": "You don’t know nvidia. I like the company, but they have always been anti-competitive as all hell.",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltl73o/",
          "created": 1725641900,
          "depth": 1,
          "replies": [
            {
              "id": "lltz8g8",
              "score": 19,
              "body": "For consumer GPU sales? sure. I’ll agree with you.\n\nFor AI/ML compute? I think that has more to do with NVidia being early to market and spending the resources to optimize its products before the industry became so popular.\n\nI feel like it’s a stretch to take NVidia’s consumer hardware practices and extrapolate to CUDA. Businesses can afford to buy and retool for AMD or other AI chips. There just isn’t a strong profit motive to do so unless you’re Tesla or Google scale.",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltz8g8/",
              "created": 1725646385,
              "depth": 2,
              "replies": [
                {
                  "id": "llv63ka",
                  "score": 3,
                  "body": "If NVIDIA has long demonstrated its enthusiasm for anti-competitive behaviour, why would it suddenly stop once it is enthroned as the monopoly of an enormous new market? The fact it had the gall to try the ARM takeover (understanding full well the backlash it would get) tells you all you need to know. We should be very afraid.",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llv63ka/",
                  "created": 1725660388,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lltwb6w",
              "score": 8,
              "body": "Which software and or technology they use for their chips make it anti-competitive",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltwb6w/",
              "created": 1725645449,
              "depth": 2,
              "replies": [
                {
                  "id": "lltwvhr",
                  "score": 8,
                  "body": "They have basically attempted to block out or eliminate competition by getting people to adopt proprietary standards that lock out competition every product cycle. This has gone on forever.",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltwvhr/",
                  "created": 1725645627,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llup9qv",
                      "score": 7,
                      "body": "The timeline for those kinds of claims of evil doing just don't work though. CUDA preceded OpenCL for example. Also this (GPUs... from everyone) is all proprietary technology with their own ISAs etc. . Which is an important reason that allowed them to progress faster than say x86 which is mired in long standing compatibility. So you can't exactly make hardware and then wait around for everyone to agree on an open standard while all your features remain unused. So of course you define and develop your own APIs, libraries and toolchains etc. to access those features. Especially if you are the first doing it.\n\nGetting open standards together often takes years and can get mired in politics. I guess someone could argue then they should start the standardization process way in advance... But then you are also telegraphing all your plans to your competition about two years in advance?",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llup9qv/",
                      "created": 1725654777,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "llu3efz",
                      "score": 3,
                      "body": "NVDA actively helps other companies develop AI technology including chips. They are investors in OpenAI who is a potential competitor... by investing in them they are giving life to a company who will compete with them. Will NVDA profit from this investment and their competition? Sure, that's not illegal. How many shares of Apple do you think Gates owns? Or Jobs and Cook own of MSFT?",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu3efz/",
                      "created": 1725647726,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "llu0a7z",
                      "score": 2,
                      "body": "Which products? Which software? How so?",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu0a7z/",
                      "created": 1725646721,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "llz4xyj",
              "score": 1,
              "body": "Sounds very similar to the alleged behavior of Intel, Microsoft, Google, Apple, Amazon, Netflix, VALVE.",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llz4xyj/",
              "created": 1725726713,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lluiv9q",
          "score": 2,
          "body": "This is insanely unfair - It was super charge because nvdia put in a lot of blood and sweat building the ecosystem - this is why they are in a good position",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lluiv9q/",
          "created": 1725652713,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lltcyzr",
      "score": 8,
      "body": "Warren vs Pelosi cage match!",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltcyzr/",
      "created": 1725639258,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llt95cr",
      "score": 109,
      "body": "The Karen of Congress",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llt95cr/",
      "created": 1725638046,
      "depth": 0,
      "replies": [
        {
          "id": "lltigd4",
          "score": 20,
          "body": "She’s just trying to stay relevant/in the news \n\nShe had her 15 minutes and it’s over, we see it with many politicians who were put up on a pedestal the then fell back to earth.",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltigd4/",
          "created": 1725641028,
          "depth": 1,
          "replies": [
            {
              "id": "llvkv1t",
              "score": 5,
              "body": "And it clearly works too, she keeps getting headlines and the lemmings in the various big political and tech focused subs keep posting and jerking off to the articles about it when it pops up",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llvkv1t/",
              "created": 1725665762,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "llthiqf",
          "score": 2,
          "body": "simpson for oligarchs again?",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llthiqf/",
          "created": 1725640727,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lltq18w",
      "score": 15,
      "body": "I miss the times when GPU was only about rendering boobs and anime ass",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltq18w/",
      "created": 1725643447,
      "depth": 0,
      "replies": [
        {
          "id": "llv2y9g",
          "score": 1,
          "body": "Where is anime vagina ",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llv2y9g/",
          "created": 1725659315,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lltgbsr",
      "score": 10,
      "body": "Nancy dispatch the ⚒️",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltgbsr/",
      "created": 1725640339,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llt71gg",
      "score": 38,
      "body": "My guess is she missed out on the stock run. Sour grapes.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llt71gg/",
      "created": 1725637384,
      "depth": 0,
      "replies": [
        {
          "id": "lltfd1k",
          "score": 26,
          "body": "She's got most of her wealth in real estate \n\nhttps://www.thestreet.com/lifestyle/elizabeth-warren-net-worth-15024381\n\nWhich probably also explains why she threw a shitfit about the rate hikes",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltfd1k/",
          "created": 1725640024,
          "depth": 1,
          "replies": [
            {
              "id": "lltvj38",
              "score": 7,
              "body": "I mean you're pretty out of touch if you don't realize most average people are going to throw a shit fit about interest rates. I know here most people are hyper focused about stock gains and know the general inverse correlation between interest rates and stock prices, but most other people are concerned about things like consumer car loan rates, mortgage rates, credit card interest rates, etc. Don't be disingenuous in denying that Warren has a track record of advocating for the average consumer against the interest of big business.",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltvj38/",
              "created": 1725645204,
              "depth": 2,
              "replies": [
                {
                  "id": "lltwmd5",
                  "score": 1,
                  "body": "Well you're pretty out of touch if you don't realise most people were nonplussed about inflation.\n\nIt cannot be that, as a lawmaker, you ignore the reason for rate hikes and focus solely on what would be good for your personal wealth.",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltwmd5/",
                  "created": 1725645547,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llxv6wv",
                      "score": 1,
                      "body": "Biden has been a terrible president for the economy ",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llxv6wv/",
                      "created": 1725708552,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lluzb2b",
                  "score": 1,
                  "body": "they're already being disingenuous by calling it \"real estate\". it's literally her house and an apartment near Congress\n\nit's not like she's renting out Air BnBs or investing in condos\n\nand you're spot on, everyone I know who doesn't make six figures is getting hit with 11-15% used car loan rates and it's absolutely brutal for someone making $40k",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lluzb2b/",
                  "created": 1725658071,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "llt75nh",
      "score": 38,
      "body": "Ben Thompson on Stratechery wrote (behind a paywall):\n\n>*Nvidia under Huang did everything we hope our greatest companies will do: they had a long-term vision, they innovated relentlessly to find new markets and applications for industry-leading technology, and when a world-changing opportunity presented itself with large language models, they were ready to take advantage of it, for a long-term benefit that may forever be unmeasurable. This is the behavior our government apparently wants to punish?*  \n  \n*Now granted, the demand for Nvidia’s GPUs came on so suddenly and in such an overwhelming amount that the company had to pick-and-choose who got allocation; that the company may have preferred companies it was invested in, or who only bought from Nvidia, or who were willing to host DGX cloud is hardly a crime: it’s the reward for building a product that people want. It’s nuts to me that the DOJ is even considering this case.*  \n  \n.*...Huang and Nvidia made a massive bet on the future, they were right, and because they were right — with no other meaningful change in their strategy — our government wants to investigate them.*\n\nI am 100% with him. The narrative of rich = bad needs to die, and we need to stop demonify people who are actually heroes! Musk has so often been unfairly scapegoated, which only really escalated when he became the richest man on earth.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llt75nh/",
      "created": 1725637422,
      "depth": 0,
      "replies": [
        {
          "id": "lltgkyf",
          "score": 13,
          "body": "I read that newsletter too and was similarly annoyed\n\nIt’s penalizing the exact thing you want to see from these companies: long term vision beyond an individual quarter and investing in the future\n\nAs opposed to companies like Intel or Boeing who want to fight change or just financially engineer profitability instead of focusing on their products",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltgkyf/",
          "created": 1725640421,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lltibi2",
          "score": 6,
          "body": "Congratulations on finding some kind of twisted logic in your brain that made this about Elon Musk.",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltibi2/",
          "created": 1725640985,
          "depth": 1,
          "replies": [
            {
              "id": "llupacc",
              "score": 9,
              "body": "The person was just giving Elon as an example.  I hate Elon too but you cant just shut people out because they mentioned Elon.  A little hyperbolic in your own worldview don’t you think?",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llupacc/",
              "created": 1725654783,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "llu84k5",
          "score": -1,
          "body": "I mean, having a head start with Mommy & daddy Diamond mine certainly helps to......",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu84k5/",
          "created": 1725649244,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llu7sn8",
      "score": 4,
      "body": "Elizabeth Warren is the Jim Cramer of politics, if she's backing something you know it's ethically and/or economically the wrong thing to do.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu7sn8/",
      "created": 1725649136,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lltrf0z",
      "score": 6,
      "body": "How come Lizzie never goes after Comcast? They have a monopoly in Cambridge and everyone who lives here always complain about this.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltrf0z/",
      "created": 1725643889,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llunqzv",
      "score": 6,
      "body": "She’s as fake as they come",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llunqzv/",
      "created": 1725654281,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llt81cj",
      "score": 40,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llt81cj/",
      "created": 1725637698,
      "depth": 0,
      "replies": [
        {
          "id": "lltdbhb",
          "score": 3,
          "body": "What's this? Do you have an article I could read?",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltdbhb/",
          "created": 1725639369,
          "depth": 1,
          "replies": [
            {
              "id": "llteeub",
              "score": 13,
              "body": "https://www.npr.org/2019/02/01/690806434/warren-apologizes-to-cherokee-nation-for-dna-test",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llteeub/",
              "created": 1725639719,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lltiegf",
              "score": 17,
              "body": "Her \"Pocahontas\" nickname from Trump didn't come from nothing.",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltiegf/",
              "created": 1725641012,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lltlxqu",
              "score": 7,
              "body": "It's sad that there's so many people that don't know since the media buried this story. She has been committing fraud for decades.",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltlxqu/",
              "created": 1725642135,
              "depth": 2,
              "replies": [
                {
                  "id": "lltw9e4",
                  "score": 2,
                  "body": "[removed]",
                  "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltw9e4/",
                  "created": 1725645433,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "llunkyb",
                      "score": 1,
                      "body": "[removed]",
                      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llunkyb/",
                      "created": 1725654228,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lltw1iz",
          "score": 3,
          "body": "That's not even a 2/10 on the scandal scale now compared to say a major party candidate being found to have crediblely raped a woman and still running for President.",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltw1iz/",
          "created": 1725645364,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lltae0c",
      "score": 20,
      "body": "interesting how people worth 10 million dollars want to kill the free market system....\n\nthey created the best chips in the world.... everyone wants to buy them... \n\nthey are the american dream with this stupid politicians pushing socialism ......\n\nhow about the other chip makers work harder >>>?????",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltae0c/",
      "created": 1725638435,
      "depth": 0,
      "replies": [
        {
          "id": "lltu905",
          "score": 5,
          "body": "Exactly, NVIDIA was smarter than anyone else and reaps the benefits from it. They were the ones most ready to sail the blue ocean. Of course they are going to sell to customers who buy bulk quantities of their products.\n\nAMD has had the same time as NVIDIA to come up with a chip that is better but has failed to do so. Its not because its easy. It's super hard to do what NVIDIA is doing.",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltu905/",
          "created": 1725644798,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llu7vye",
      "score": 3,
      "body": "Companies demand more AI chips than NVDIA can supply, big techs are committing financial suicide to even have a chance at competing in the AI race. Yet, NVDIA they must be making all this money by \"anti-competitive\" tactics against small and nonprofit companies. What a clown.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu7vye/",
      "created": 1725649166,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llv1s6v",
      "score": 3,
      "body": "There should be an antitrust into the x86 ISA. Why is it that only Intel and AMD are allowed to make x86 compatible CPUs? We should open it up so anyone can do it so we can get true competition in the Windows desktop space. Its been closed off for decades, there should be a limit to how long an ISA can be closed off against the benefit of the world.\n\nAlso why can't I buy just an Apple laptop without having to get their OS with it? It seems we should have the option of it coming with any OS we choose.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llv1s6v/",
      "created": 1725658912,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lltpvvl",
      "score": 6,
      "body": "NVDA isn't a monopoly, they've just been smarter than everyone else (especially Intel) Intel can go bankrupt and i wouldn't care at all. They had their chance.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltpvvl/",
      "created": 1725643400,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lltphti",
      "score": 6,
      "body": "I’m all for breaking up monopolies, but there is plenty of actual ones in healthcare and pharmaceuticals that should be targeted first",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltphti/",
      "created": 1725643275,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llt724o",
      "score": 8,
      "body": "She must be fun at parties.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llt724o/",
      "created": 1725637390,
      "depth": 0,
      "replies": [
        {
          "id": "lltdp05",
          "score": 1,
          "body": "Make it PPV and we can pay down the debt",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltdp05/",
          "created": 1725639490,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llth0o3",
      "score": 9,
      "body": "Not a single person asked for this btw",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llth0o3/",
      "created": 1725640565,
      "depth": 0,
      "replies": [
        {
          "id": "lltkcws",
          "score": 9,
          "body": "Well, some of the AI chip buyers that felt deprioritized went to the DOJ for this.\n\nWarren’s letter is half boasting of nvida’s success and half speaking on behalf of the companies that was complaining.",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltkcws/",
          "created": 1725641635,
          "depth": 1,
          "replies": [
            {
              "id": "lltvj64",
              "score": 1,
              "body": "I'm super biased because I've been a believer in Nvidia since 2018/2019, but I believe they've earned every bit of success they've had. They make excellent products.",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltvj64/",
              "created": 1725645204,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "llt6gla",
      "score": 15,
      "body": "Dis crazy bitch at it again!",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llt6gla/",
      "created": 1725637202,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llt4w3r",
      "score": 14,
      "body": "She's so toxic. She needs to go away and take her crazy opinions about crypto and stocks with her.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llt4w3r/",
      "created": 1725636704,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llttl9v",
      "score": 2,
      "body": "Pocahontas doesn’t support AI apparently.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llttl9v/",
      "created": 1725644588,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llue3y3",
      "score": 2,
      "body": "did pelosi loose money? 🤣",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llue3y3/",
      "created": 1725651187,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llueeon",
      "score": 2,
      "body": "Warren, I really want to like you, but what the actual fuck",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llueeon/",
      "created": 1725651284,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llvgqze",
      "score": 2,
      "body": "This lunatic comes from wackochusettes, who cares what she thinks? This scumbag loud mouth is just jealous of their stock appreciation over the last 10 years. She whines constantly about anyone making a profit. Her name should banned from this sub. NVIDIA is  destroying competition, hurting consumers, causing higher prices, advanced AI R&D- horrible, send in the FBI swat teams.(sarcastic)",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llvgqze/",
      "created": 1725664222,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llvhrjo",
      "score": 2,
      "body": "I don’t really understand this. When I buy an iPhone or Samsung and it comes with a native operating system, am I being subject to anticompetitive behaviour? She is acting like Nvidia is the only game in town. You have AMD, Intel, Broadcom, etc. Nvidia is just the best.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llvhrjo/",
      "created": 1725664600,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llw8p15",
      "score": 2,
      "body": "I’m not sure there’s any elected official I dislike more than her.  And yes, that’s saying alot.\n\nShe’s the least logical.  She has no real world experience and it’s detached her from reality.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llw8p15/",
      "created": 1725674927,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llt7adb",
      "score": 8,
      "body": "Disclaimer: This was written by chat gpt powered by nvdia, signed by Elizabeth Warren, the genius of hypocrites.  I have 2% Native American blood!!!!! I’m an American mutt too!!!!",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llt7adb/",
      "created": 1725637463,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llt7y0l",
      "score": 4,
      "body": "I thought they announced that there has been no investigation or subpoena",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llt7y0l/",
      "created": 1725637668,
      "depth": 0,
      "replies": [
        {
          "id": "llt8nhm",
          "score": 5,
          "body": "Just more “legal” manipulation \n\n“We’re suing!, oh just kidding, oh but we’re still thinking about it!”",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llt8nhm/",
          "created": 1725637893,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lltky16",
          "score": 5,
          "body": "It was not a subpoena but legally binding questionnaires (evidence gathering) which may then lead to a formal investigation…depending on the response/evidence.\n\nDOJ to NVDIA\n\nPlease answer: did you do bad things?\n\n[  ] Yes\n\n[  ] No\n\n[  ] 🤷🏻‍♂️",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltky16/",
          "created": 1725641819,
          "depth": 1,
          "replies": [
            {
              "id": "lltnx0l",
              "score": 2,
              "body": "🤷‍♀️",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltnx0l/",
              "created": 1725642770,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lltbo6z",
      "score": 3,
      "body": "But , but, many folks said investigation news is bloomberg’s stock manipulation",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltbo6z/",
      "created": 1725638843,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lltytm5",
      "score": 4,
      "body": "Warren isn't very smart when it comes to economics. I'll never understand why our politicians think going after our own companies is a good idea because it only empowers countries like China to own the next generation of technology.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltytm5/",
      "created": 1725646254,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lluyfli",
      "score": 4,
      "body": "democrats hates winners. It's a fact. Their entire voter base is based on victimhood and wanting mama government to help them all the time. \nThey don't understand it's their mentality that keeps them poor",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lluyfli/",
      "created": 1725657772,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lltcorp",
      "score": 2,
      "body": "Interesting considering Pelosi bought into NVDA unless she's already exited.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltcorp/",
      "created": 1725639168,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lltk3ig",
      "score": 2,
      "body": "Hey, this is antitrust—stay in your lane bankruptcy lady!",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltk3ig/",
      "created": 1725641553,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lltgo10",
      "score": 1,
      "body": "More lawfare abuse. God forbid you should ever be successful, especially when your competition are big boys like Meta, Microsoft and Amazon who can fend for themselves",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltgo10/",
      "created": 1725640449,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lltjmxn",
      "score": 3,
      "body": "Does anyone actually like this lady?",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltjmxn/",
      "created": 1725641406,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lltgaqm",
      "score": 1,
      "body": "I hadn't heard about the acquisition attempt/interest in ARM.  Makes sense to make the moat even deeper.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltgaqm/",
      "created": 1725640329,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lltks9t",
      "score": 1,
      "body": "Useless",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltks9t/",
      "created": 1725641769,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llto0iz",
      "score": 1,
      "body": "Jesus that face... Its self-explanatory.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llto0iz/",
      "created": 1725642801,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lltp1yx",
      "score": 1,
      "body": "This is after she sold all her stake in nvda at the peak",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltp1yx/",
      "created": 1725643134,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lltwuae",
      "score": 1,
      "body": "I'm all about breaking up monopolies and hate big tech but from what I've read the only crime Nvidia committed was being first and being the best. It feels like the DOJ is gonna shoot America in the foot on this tech to please people who are simply not as good.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltwuae/",
      "created": 1725645616,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llu5jq8",
      "score": 1,
      "body": "This whole investigate to find a crime thing can get bad for everyone. If you suspect a crime, investigate on those grounds. Don’t investigate to find a crime. That’s gotta go against some constitutional amendment like the 4th…right?",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu5jq8/",
      "created": 1725648417,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llu7109",
      "score": 1,
      "body": "I'm buying slowly on these dips",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llu7109/",
      "created": 1725648890,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llucmaj",
      "score": 1,
      "body": "The thing about NVIDIA is that it’s really really hard to dethrone them in the categories that they rule not just due to CUDA but also because the competition just can’t beat them.\n\nThis goes from both consumer (gaming GPUs) and datacenter.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llucmaj/",
      "created": 1725650700,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lluf4v1",
      "score": 1,
      "body": "lol alright I think it’s time to put someone else in her spot",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lluf4v1/",
      "created": 1725651520,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lluh85i",
      "score": 1,
      "body": "Pocahontas haha",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lluh85i/",
      "created": 1725652192,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llur2qc",
      "score": 1,
      "body": "Will this make my spy $537 puts print?",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llur2qc/",
      "created": 1725655361,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llv2h8f",
      "score": 1,
      "body": "Eh, prospectus is better for other AI companies now anyway. Nvidia is gonna drop. Not a good time to invest in it. ",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llv2h8f/",
      "created": 1725659151,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llwju2z",
      "score": 1,
      "body": "Standard  Warren if a company is successful they must be cheating.  Intel had a monopoly and blew it through awful management.  They had the same opportunities as Nvidia and chose not to take it Jensen pivoted to crypto and now to AI.  It’s a chip world and I expect Jensen to continue to pivot to the next big thing as well",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llwju2z/",
      "created": 1725679574,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llx9c51",
      "score": 1,
      "body": "Screw Warren- oust that POS!",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llx9c51/",
      "created": 1725693738,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llxci92",
      "score": 1,
      "body": "Okay. That made me lose so much stress....\n\nThat bogus lawsuit is as real as warren indian DNA.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llxci92/",
      "created": 1725695924,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llxoy4s",
      "score": 1,
      "body": "Jensen not being paying the kick backs?  \n  \nWhats next? Opening DOJ investigations on all athletes who cross a finish line first?",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llxoy4s/",
      "created": 1725704686,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llxycl0",
      "score": 1,
      "body": "What about Tesla ms. Warren ?",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llxycl0/",
      "created": 1725710246,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lly55tq",
      "score": 1,
      "body": "wonder if anyone else in the administration \"proof read\" the letter earlier in the week.. chart went down all week, when you'd expect it to level off or perhaps climb a bit.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lly55tq/",
      "created": 1725713522,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llzjw2z",
      "score": 1,
      "body": "Anti trust would be more Facebook that ust destroys small tech companies to take them over, nividia built their system from the ground up. Europe blocked them from buying ARM yrs ago. If this letter was correct the entire nasdaq would have to go away. 🤣 these old people need to go away",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llzjw2z/",
      "created": 1725731621,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm0mmyq",
      "score": 1,
      "body": "RemindMe! 2 months",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lm0mmyq/",
      "created": 1725744928,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm10fs4",
      "score": 1,
      "body": "Go back to bed Karen.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lm10fs4/",
      "created": 1725749957,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm1c2ey",
      "score": 1,
      "body": "Ah warren the native American senator",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lm1c2ey/",
      "created": 1725754381,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm25ggw",
      "score": 1,
      "body": "A lot incorrect here.  For one Google will spend majority of the $48 billion on their own chips and not Nvidia.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lm25ggw/",
      "created": 1725766151,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm3tli8",
      "score": 1,
      "body": "She wrote a word salad. It is as bad as the Kathy comic strips in the 90s. I think they were an inside joke.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lm3tli8/",
      "created": 1725799750,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm9hny2",
      "score": 1,
      "body": "I like E. Warren for her morals, not so much for her practical proposals.\n\nShe quotes ARM deal, which antitrust blocked.\n\nWhat is she complaining here about exactly?\n\nNvidia locking the software and hardware bundle? Do they expect Nvidia to pour millions in making Cuda work natively across all architectures including competitor ones?\n\nNvidia isn't really preventing competitors to write their own drivers or translation layers for cuda applications (in fact, there's two projects for that, ZLUDA and SCALE).\n\nThe real question here is why competitors haven't spent more money for having their hardware make most of the the ML software stack? Like alternative backends/libraries/drivers for anything from Pandas to whatever.\n\nThey have slept for a decade while Nvidia was gifting their GPUs to any research laboratory asking for it, it was only natural most of the ML research was built on Nvidia's stack.\n\nI'm not sure whether Nvidia is now cornering customers with monopolistic behavior and I don't fully believe it either. They should obviously leverage their position, but no one's preventing Microsoft from having a huge deal with AMD or Intel and rewriting whatever they need in the stack to work better with that hardware.\n\nNvidia did pull already such shit in the past (think of physx and their lame excuse that it could only run on their hardware, when it run on CPUs mostly anyway) and some other stuff. But why should they have the incentive on opening their software stack to competitors? Again, there are both financial and technological incentives for third party players to provide their own libraries.\n\nML/AI isn't magic, it's really just about lots and lots of matrix calculations.",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lm9hny2/",
      "created": 1725882813,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lltb6mo",
      "score": -1,
      "body": "Love how this is downvoted by people butthurt nvda is tanking",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltb6mo/",
      "created": 1725638686,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llt5hso",
      "score": -1,
      "body": "Fuck her",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/llt5hso/",
      "created": 1725636895,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lltf07b",
      "score": 1,
      "body": "If they are broken up, shareholders will get some of each new company, right?",
      "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltf07b/",
      "created": 1725639910,
      "depth": 0,
      "replies": [
        {
          "id": "lltlwcs",
          "score": 3,
          "body": "If NVDA gets broken up before any of the other true mega-corps then our regulatory bodies are infinitely more corrupt than I imagined.\n\nNVDA has the superior product and built an ecosystem over decades of work. That’s about as American as it gets.",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltlwcs/",
          "created": 1725642122,
          "depth": 1,
          "replies": [
            {
              "id": "lltp2uw",
              "score": 1,
              "body": "DOJ was 20 years late to Google party and now they don’t want to be late to NVDA .. why get mad at first to market and first to invest in emerging tech gets the advantage and lions share of the market ? There are many companies in other industries (non tech) that basically have a monopoly or it’s just 2 companies that control a market for a product but they aren’t sexy tech so they just print money for 50 years. NVDA isn’t stopping anyone from doing what they do , it’s just the rules of business, how expensive is it to gain entry into that market and how long will it take to compete. If another company has the cashola they can do it too.",
              "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltp2uw/",
              "created": 1725643142,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lltjk0j",
          "score": 1,
          "body": "Should be",
          "permalink": "/r/stocks/comments/1fahrhc/sen_elizabeth_warren_writes_a_letter_backing_the/lltjk0j/",
          "created": 1725641380,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}