{
  "title": "Is what I’m doing with my gains dumb?",
  "score": 72,
  "selftext": "Hey yall - wanted to run this by you...\n\nBeen investing for a few years now, not nearly enough of an expert but know my way around.\n\nI have a few positions (Tesla, Spotify, etc) that I have gains of about 20-30% on. I’ve been thinking about cashing them out and putting them in VOO to lock them in while giving them the opportunity to grow as well.\n\nDoes this make sense? I still would invest regularly into these individual stocks as I pretty much do recurring buys weekly but is this a good way to lock in gains? Any other recommendations?",
  "link_flair_text": null,
  "id": "1fc7lom",
  "num_comments": 59,
  "created_utc": 1725827728,
  "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/",
  "comments": [
    {
      "id": "lm6uyh6",
      "score": 63,
      "body": "It's reasonable to exit positions like these if you feel uncertain about the future of those companies' performance. Do consider your cap gains tax in this decision as well. \n\nVOO does not lock in gains, it subjects your gains to the averaged volatility of the market. We witnessed a near 10% drawdown in VOO a month ago. This volatility could continue or not  🔮\n\nBonds and CDs are the only real way to lock in gains.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm6uyh6/",
      "created": 1725834926,
      "depth": 0,
      "replies": [
        {
          "id": "lm6yicn",
          "score": 4,
          "body": "I personally wouldn't start a new CD right now. There could be some good entries coming up for long haul index funds and you don't want to be locked into a CD when that manifests.",
          "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm6yicn/",
          "created": 1725836188,
          "depth": 1,
          "replies": [
            {
              "id": "lmdady9",
              "score": 1,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmdady9/",
              "created": 1725930116,
              "depth": 2,
              "replies": [
                {
                  "id": "lmdc0bu",
                  "score": 1,
                  "body": "VTI VOO SPY QQQ",
                  "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmdc0bu/",
                  "created": 1725930713,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmdcyuj",
                      "score": 1,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmdcyuj/",
                      "created": 1725931062,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lmdna2c",
                          "score": 1,
                          "body": "Inventories are building, employment numbers are flattening, AI enthusiasm deflating, indices have already gone up quite a bit this year.",
                          "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmdna2c/",
                          "created": 1725934931,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lm6ztlp",
              "score": 1,
              "body": "I don't disagree. Mostly using CDs as the only real option to \"lock in gains\" at current rates. I think having a portion of your portfolio split into CDs is a reasonable move at this moment. So many factors in what makes that the \"right\" choice for someone though.",
              "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm6ztlp/",
              "created": 1725836656,
              "depth": 2,
              "replies": [
                {
                  "id": "lmdbddr",
                  "score": 2,
                  "body": "I reduced my purchase of CDs and changed to investing in Treasuries for a better return with improved liquidity.  I feel stupid though cause it took me 30 years of investing before I came to that point though.",
                  "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmdbddr/",
                  "created": 1725930482,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmdbx6e",
                      "score": 1,
                      "body": "Better late than never, and better than zero or negative returns. CDs are a super conservative move, but there’s a time and place for those moves in certain portfolios. ",
                      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmdbx6e/",
                      "created": 1725930681,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lm6x5ih",
          "score": 3,
          "body": "I actually meant that I would cash out my 20% gains from a position and reinvest those gains. I would still maintain my initial investment and invest more into the stock down the line.",
          "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm6x5ih/",
          "created": 1725835705,
          "depth": 1,
          "replies": [
            {
              "id": "lm702bh",
              "score": 13,
              "body": "Eh, you're creating capital gains taxes. No reason to do that unless your reasons for owning the stock have disappeared.\n\nIf you would buy the stock today, don't sell.\n\nIf you wouldn't buy the stock today, why are you owning it at all?\n\nThere's other ways to diversify a portfolio.",
              "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm702bh/",
              "created": 1725836742,
              "depth": 2,
              "replies": [
                {
                  "id": "lm88t83",
                  "score": 1,
                  "body": "Unless he's in a low tax bracket (under 15%) like I am. Then you can get the gains now and ultimately be taxed less.",
                  "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm88t83/",
                  "created": 1725854700,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmbmg1d",
                      "score": 2,
                      "body": "So you can cash positions on profit and buy them back ... to have margin to offload loses in future with same positions.",
                      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmbmg1d/",
                      "created": 1725909835,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lm9ftd0",
              "score": 2,
              "body": "I’m not against what you’re proposing, just confused. Taking money out of the stock but investing more money in the stock down the line. Are you expecting a short term pullback on their prices? If you’re confident enough in the stock that you will continue to put money in it, why not leave what you have there? That said, I’m never against taking profits.",
              "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm9ftd0/",
              "created": 1725881917,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lm6yut3",
              "score": 2,
              "body": "I would personally argue against this strategy and would recommend selling off the whole position to move into a split of bonds, CDs, VOO. Holding individual stocks is high risk and past performance is no guarantee of future results.   \n  \nRising unemployment rates, sahm rule, yield curve inversion, the uncertainty of rate cuts, and other scary things dissuade me from holding individual stocks or VOO currently and shift my focus to Bonds and CDs that are offering attractive rates. This is a 50/50 of crystal ball talk and clear uncertainty/indicators in the market.",
              "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm6yut3/",
              "created": 1725836313,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lm7c1h2",
              "score": 1,
              "body": "Gains are free money. With the exception of reinvested dividends, we only gain on our basis. Taking those gains and putting them to work makes sense. Yes, you have to pay taxes but those gains can be put into something like SCHD and living off dividends when you're older is more of a reality.",
              "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm7c1h2/",
              "created": 1725841235,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lm8d6zz",
      "score": 10,
      "body": "If you are planning to buy more there’s no point in selling it ‘to lock in gains.’ That’s just feel good math, not actual money making math. So to answer your question, yeah, it’s dumb. If you want to diversify some, just put the new money in VOO instead of buying more of the individual stock.\n\nTax gain harvesting is certainly a thing if you are in a low enough tax bracket, but that doesn’t sound like what you are trying to do.\n\nIf the stock is worth buying today, it’s worth holding what you own. Don’t sell. If it’s not worth buying today, you should probably close the entire position and move on.\n\nPersonally, I avoid individual stocks anyway. Too much risk.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm8d6zz/",
      "created": 1725856992,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm6zmdn",
      "score": 15,
      "body": "I keep individual stocks to less than 10% of my portfolio.  Everything else is in low cost, diversified ETFs.\n\nReddit is filled with folks who thought they could beat the market with individual stocks and lost it all.\n\nStock picking is fun, doing the research is fun for me, but it's way too high of a risk to be the majority of my portfolio.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm6zmdn/",
      "created": 1725836584,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm88joz",
      "score": 3,
      "body": "A reasonable choice. While VOO's expense ratio is lower than SPY or SPX. Fidelity and Schwab also have derivatives with even lower than VOO. Some claim their return is even slightly better.  Always research and compare different derivatives not taking someone's word for.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm88joz/",
      "created": 1725854569,
      "depth": 0,
      "replies": [
        {
          "id": "lm9s55d",
          "score": 1,
          "body": "Read OP's post again. If you think what he wants to do is reasonable, you either didn't understand what he's planning to do or you don't understand how capital gains work.",
          "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm9s55d/",
          "created": 1725887347,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lm6dmzr",
      "score": 12,
      "body": "I'd just hold and start increasing your VOO position. \n\nTesla might be a sell, though, I wouldn't feel comfortable having it in my portfolio just because of all the baggage it has.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm6dmzr/",
      "created": 1725829108,
      "depth": 0,
      "replies": [
        {
          "id": "lm6g2zv",
          "score": -8,
          "body": "Tesla is a great stock to short. Wait for some poopy news, fans go crazy stock goes up, short Friday 1 day exp profit taking. I’ve done it twice but last weeks really hit",
          "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm6g2zv/",
          "created": 1725829888,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lm72bgh",
      "score": 2,
      "body": "Its a smart move.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm72bgh/",
      "created": 1725837560,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm7cg0t",
      "score": 2,
      "body": "Yes. I wouldn't call it \"locking in\" but they will be much safer than gambling on individual stocks. I'd start selling everything and buying index funds, not just with your gains.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm7cg0t/",
      "created": 1725841392,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmap0eu",
      "score": 2,
      "body": "The only way to \"lock in gains\" is to sell and never buy again.  As soon as you put it into something like VOO, you have the potential to lose it again.\n\nSo... no, it's a stupid idea, because it's based on a flawed premise.  Selling and buying VOO may be a great idea, but it's got nothing to do with locking in gains.  Either you want to own those stocks right now, or you don't.  What price you bought them at is largely irrelevant except with regard to taxes.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmap0eu/",
      "created": 1725898908,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm73f2p",
      "score": 2,
      "body": "Nobody went broke taking profits",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm73f2p/",
      "created": 1725837962,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm76lh0",
      "score": 2,
      "body": "Yes but just because it’s 20-30% doesn’t mean you have to sell.\n\nBest too look at your overall assets allocation. Are you over weight in TSLA. \n\nAlso this is the worst time to sell. September is typically the worst month of the year. I’m sure TSLA will recover more than what you would gain by buying spy",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm76lh0/",
      "created": 1725839140,
      "depth": 0,
      "replies": [
        {
          "id": "lm7c3y7",
          "score": -8,
          "body": "I agree!! I’m shocked at those that disregard Tesla. In my mind it’s not a car company. Elon Musk is the brightest mind I will see in my lifetime. \n\nWith Optimus, Energy Storage etc  I believe Tesla will 5x in 5 years. I’m increasing my position. \n\nNo way I’d sell. No way.",
          "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm7c3y7/",
          "created": 1725841262,
          "depth": 1,
          "replies": [
            {
              "id": "lm7depi",
              "score": 3,
              "body": "He does great things and stupid things. It doesn't really matter, since people love him and will buy and hold the stock even if he becomes a scientologist and wants to be president of the moon.\n\n\nTesla's \"not a car company\" rhetoric is baked-in, as Elon has been making broken promises for over a decade and competitors are coming to eat his lunch. \n\n\nIf I owned Tesla, I would ride it out for kicks.",
              "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm7depi/",
              "created": 1725841766,
              "depth": 2,
              "replies": [
                {
                  "id": "lm7dsl9",
                  "score": -2,
                  "body": "Time will tell but Musk and Altman are brilliant and I definitely see their stock value rising. Two of my fav companies Tesla & Microsoft\n\nAny CEO of a successful company could join any religion—I could care less. I care about them being able to foresee the future, take that vision and lead their team to making it into a reality. Beyond that I could care less what they do\n\nPeople will not own cars in the future. They will schedule autonomous vehicles to pick them up and drop them off. The future is in Tesla, Microsoft, blockchain etc",
                  "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm7dsl9/",
                  "created": 1725841917,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lm7fpxh",
                      "score": 2,
                      "body": "Yes, robotaxis \"by end of next year\" tm\n\n\nI'm not sure if that will happen before or after AI enslaves humanity or Bitcoin becomes the world currency. \n\n\nI was VERY into that promise ten years ago, and thought Tesla could even license out the tech to basically monopolize the future of transportation. But they aren't even the highest-level autonomous brand anymore.\n\n\nI wish I could believe him about their robots; that is truly the next world-changing revolution. But I'm too disillusioned to believe anything Elon says anymore. Amazon is mass-producing hundreds of thousands of Android robots, and they don't even talk about it.",
                      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm7fpxh/",
                      "created": 1725842674,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lm7guze",
                          "score": 2,
                          "body": "Well, time will tell. Innovation has always had ups & downs with success and failure—this is part of it. \nRemember when fax machines came out? Those were going to be worthless. Internet u had no search engine and couldn’t use ur landline. It was up then down yadda yadda…..first generation always the hardest. \n\nI don’t know if I’m necessarily even buying the company per se but the progression of tech and the current best and brightest minds that have drive & ability to translate it to reality. \n\nRemember cars and planes—-the masses thought it was nonsense. U think those innovations happened in linear fashion??? \n\nI personally think these guys will do amazing things but your right if u need it linear and without failures and remodels then VOO all the way",
                          "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm7guze/",
                          "created": 1725843124,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lm7cgz6",
              "score": 0,
              "body": "Lol",
              "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm7cgz6/",
              "created": 1725841401,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lm9ryfp",
      "score": 2,
      "body": "Lesson one when you're investing should be that there's no difference between a euro in gains or a euro in own invested dollars.\n\nIf you're gonna take money out of these stocks to \"lock in the profits\" and then putting new dollars in, you're just fooling yourself.\n\nIf anything, it's even worse than just investing your new money into VOO, because you're gonna be paying unnecessary taxes over those gains.\n\nBottomline, emotionally it might feel different, but whether you've earned a dollar or made it as profit through investing, and whether it's sitting in your bank account or locked in an investment (whether in the green or red), a dollar is just a dollar.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm9ryfp/",
      "created": 1725887273,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm6v6re",
      "score": 1,
      "body": " Locking gains is not a bad move if you aren't holding them into 2025. If it is too much to see a stock go down 20-30% in one day which most it isn't then it isn't for you and your best bet is to buy VOO. If you forget about them and keep doing it weekly you might do better. But the SP500 is the benchmark and it is unlikely to Best it. Best of luck to whatever you do.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm6v6re/",
      "created": 1725835010,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm8d4ar",
      "score": 1,
      "body": "You could hedge them with options to protect yourself. Or sell options against them for income and put that into voo. Diversifying (your Initial thought) isn’t a bad move though.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm8d4ar/",
      "created": 1725856951,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm8nela",
      "score": 1,
      "body": "I day trade and swing trade 3-4 times a week and just cash out the profits (when successful, i lose too) and immediately throw the dollar amount of profits into my ROTH ETFs. Its a very sensible thing to do",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm8nela/",
      "created": 1725863189,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmako9t",
      "score": 1,
      "body": "Cashing out gains to invest in VOO for diversification and stability is smart, balancing growth with reduced risk.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmako9t/",
      "created": 1725897366,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmei2ym",
      "score": 1,
      "body": "why do you want to lock in gains - said another way, pay taxes on gains?  Most of the times I have sold, I have regretted in the long term.  Unless something has fundamentally changed in the business such that the initial case to buy the stock has changed, hold for the long term.  Remember, money isn't made buying and selling, its made while holding stocks.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmei2ym/",
      "created": 1725950803,
      "depth": 0,
      "replies": [
        {
          "id": "lmeymya",
          "score": 1,
          "body": "Technically, money is ONLY made selling.",
          "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmeymya/",
          "created": 1725962740,
          "depth": 1,
          "replies": [
            {
              "id": "lmfgb2i",
              "score": 1,
              "body": "Selling is when your ownership in companies is converted to the depreciating asset we call cash and you pay tax on the gains you made while holding.",
              "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmfgb2i/",
              "created": 1725971787,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmej4o3",
      "score": 1,
      "body": "If you want to lock it in, I'd do gold.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmej4o3/",
      "created": 1725951510,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmh9e2w",
      "score": 1,
      "body": "I spend all my gains on drugs.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmh9e2w/",
      "created": 1725993492,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmplcao",
      "score": 1,
      "body": "Keep some money in bond funds…when they cut rates (usually during a recession when something bad is happening) bonds usually rise (inverse relationship between bonds and interest rates)\n\nYour bond funds won’t decrease as much as the stock market during a recession, so you can do an exchange from a bond fund and buy the stock dip.\n\nIt’s also pretty nice having a dollar amount coming in every month in case you get laid off or have an emergency where you can’t work anymore. Bonds are underrated on this sub tbh",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmplcao/",
      "created": 1726110176,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm9k26f",
      "score": 1,
      "body": "i would exit out of Spotify and Tesla ASAP if you have solid gains.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm9k26f/",
      "created": 1725883914,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm8sgaa",
      "score": 0,
      "body": "This is pretty much the position I was in after the Bitcoin ETF's first came out. I found myself up 40-50%, but the volatility was stressing me out so I cashed out and put it all into VTI. \n\nI'll owe taxes on the gains but the overall peace of mind so far has been absolutely worth it.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm8sgaa/",
      "created": 1725866638,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm9l9o6",
      "score": 0,
      "body": "If you have enough shares you could sell calls against them at a target exit price so that you then earn premiums on your holdings and won’t care if they are eventually called away from you.",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm9l9o6/",
      "created": 1725884456,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm8m0u6",
      "score": -4,
      "body": "Horrible idea. Put your gains in something less volatile. Perhaps do research and invest it in penny stocks",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm8m0u6/",
      "created": 1725862286,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm74ccq",
      "score": -1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm74ccq/",
      "created": 1725838303,
      "depth": 0,
      "replies": [
        {
          "id": "lmap53c",
          "score": 2,
          "body": "VOOV is the portion of the S&P 500 deemed \"value\" (as opposed to growth, which would be VOOG).",
          "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lmap53c/",
          "created": 1725898955,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lm7yy7b",
      "score": -1,
      "body": "The comments here are really solid. I'll add that Peter Lynch said to let your winners run",
      "permalink": "/r/stocks/comments/1fc7lom/is_what_im_doing_with_my_gains_dumb/lm7yy7b/",
      "created": 1725850327,
      "depth": 0,
      "replies": []
    }
  ]
}