{
  "title": "This is how turn around plays are supposed to go in the beginning…",
  "score": 40,
  "selftext": "Not going to lie it hurts to look at. Especially since I’m either a buy/hold or intra week trader.\n\nThis is my first real mid term turnaround play. I’m betting in 1-2 years PLUG will be revenue positive and this position will pay off but I figured I’d ask the diamond hands crew.",
  "link_flair_text": "Loss",
  "id": "1fcqm9i",
  "num_comments": 34,
  "created_utc": 1725891694,
  "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/",
  "url_overridden_by_dest": "https://i.redd.it/6dg71mv3msnd1.jpeg",
  "comments": [
    {
      "id": "lma3wyj",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 23 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lma3wyj/",
      "created": 1725891701,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lma9dd1",
      "score": 39,
      "body": "$40k margin on a shit tier meme stock that’s been in straight decline for four years? You’re gonna get your own special dumpster behind Wendy’s. ",
      "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lma9dd1/",
      "created": 1725893566,
      "depth": 0,
      "replies": [
        {
          "id": "lmadxg9",
          "score": 13,
          "body": "That is why we’re here…\n\nNah did some DD on them and I do think they’re approaching a turning point as a lot of their facilities are finally coming online, some shifting around on the board to get their costs under control, a lot of said cost was initial development expenses which are behind them. If they can get that EPS above 0 in the next 18-24 months (about their cash on hand) I’ll be in good shape.\n\nIf not, never frozen beef it is…",
          "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmadxg9/",
          "created": 1725895089,
          "depth": 1,
          "replies": [
            {
              "id": "lmasrme",
              "score": 11,
              "body": "Or, they'll spend a lot of money doing a bunch of stuff, pay for it by dilution, and reverse split again.",
              "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmasrme/",
              "created": 1725900230,
              "depth": 2,
              "replies": [
                {
                  "id": "lmaw7wl",
                  "score": 6,
                  "body": "Thats what makes a market baby",
                  "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmaw7wl/",
                  "created": 1725901371,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmb2sq0",
                  "score": 3,
                  "body": "Yeah, they just did a follow on offer with Morgan Stanley this year.\n\nI think it’s more likely they’re in shifting into cost control mode they have the infrastructure in place to grow their revenues, now they have to stop spending more than they’re bringing in and actually profit off that revenue.\n\nTheir recent COO move tells me the board knows that too.",
                  "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmb2sq0/",
                  "created": 1725903520,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lmaicy0",
      "score": 9,
      "body": "I have owned PLUG for years and kick myself for not getting out a few years ago, or near it.  same with BLDP.  now I may as well hold for eternity.",
      "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmaicy0/",
      "created": 1725896566,
      "depth": 0,
      "replies": [
        {
          "id": "lmaj5c6",
          "score": 3,
          "body": "I feel that. I made a few bucks on them back when they blew up but not nearly as much as I’d wished. I had about few hundred shares in 2019 and right before the meme craze sold out for about a $1 per share profit. Kicked myself for not waiting 3 more months and now I’m glad I didn’t jump on the bandwagon wagon.\n\nThere’s still a lot of headwinds for them, especially in the adoption space, but they are getting closer to profitability. It’s all about cost control now. They have great revenue growth but their costs are growing just as fast or faster. I’m hoping with the addition of the new board members, especially the one from Amazon, they can cut a lot of those costs and could maintain revenue and still turn positive. May be a light at the end of the tunnel my friend…",
          "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmaj5c6/",
          "created": 1725896838,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmb7u2l",
          "score": 2,
          "body": "Ballard and plug. Yes I remember we all lost money holding these bags a while back. Every week there was a new rumor about which one’s hydrogen battery pack was going to be used for the forklifts in every Amazon warehouse.",
          "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmb7u2l/",
          "created": 1725905134,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmavlx7",
      "score": 5,
      "body": "Risky, but they might survive and you will be thus rewarded, personally I would not but hey I've seen worse plays here",
      "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmavlx7/",
      "created": 1725901167,
      "depth": 0,
      "replies": [
        {
          "id": "lmb1ehc",
          "score": 3,
          "body": "I stepped a bit outside my comfort zone on this one myself. I’ve followed them for a while and like hydrogen technology in general but I know it has a long way to go. I don’t think hydrogen cars are a good bet because of the practicality issues but grid level storage makes sense especially with some of the advances in round trip efficiency. \n\nIt’s a contrarian play but I think they’re reaching that turn around point. I am developing a taste for Wendy’s just in case",
          "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmb1ehc/",
          "created": 1725903066,
          "depth": 1,
          "replies": [
            {
              "id": "lmb9ilf",
              "score": 2,
              "body": "I remember losing money just holding the bag on this stock years ago, but back in 2015. It was at least a little more stable and would just fluctuate from like $2.50 to $3.50. The five-year chart on this thing shows that it is way more volatile now. The five-year chart is like a roller coaster Starting pre-pandemic. Under three dollars then up to $63, then down to $23, back up to $43, and now back down under two dollars again. You’re looking for them to turn things around, but they seem to just have these sort of bursts ofoptimism or something in the stock price. Not sure if they’re just very good at press releases, or if this is stock buying euphoria.",
              "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmb9ilf/",
              "created": 1725905677,
              "depth": 2,
              "replies": [
                {
                  "id": "lmbf7o5",
                  "score": 3,
                  "body": "A lot of the price swings in 2020-21 was part of the meme stock craze. I don’t think they’re really good at press releases or they wouldn’t have fallen this far.\n\nThey’re getting down to the wire where they’re either going to make or break. I’m betting they’re going to turnaround before the end of next year. If they post their first positive EPS before then, they’ll survive and my position will pay off. If they don’t, I’m out 40k…",
                  "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmbf7o5/",
                  "created": 1725907510,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmbw1fe",
                      "score": 1,
                      "body": "Seems like you either really believe in this new CEO, or you’re just ready to flip the coin. I mean there next earnings are in about 60 days in early November. So the new CEO better have some inspiring new plans to talk about, because his mere presence won’t improve the EPS.",
                      "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmbw1fe/",
                      "created": 1725912844,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lmbzi0x",
                          "score": 2,
                          "body": "I’m not holding out for November’s call, the COO will hopefully have some kind of insight as to how they’re going control costs but idk that that’s enough time for him to make a meaningful difference.\n\nThey do have about 70 million in carryover revenue which could help that they couldn’t claim on their Q2 report. All in all, I’m not expecting any kind of meaningful return until Q2 2025.",
                          "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmbzi0x/",
                          "created": 1725913914,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lmdoqpi",
                              "score": 1,
                              "body": "Fair assessment",
                              "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmdoqpi/",
                              "created": 1725935505,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lmf0yx3",
                              "score": 1,
                              "body": "The five-year chart is wild. I know stuff went haywire during the pandemic but this run up from early 2022 early 2021 is crazy. It went from like two dollars to $68 in about 12 months before returning back down. That can’t be just memes. They must’ve had the CEO doing wild stuff during the pandemic or wild speculation about where this technology was going, or at least a few different quarterly earnings reports. That run up from two dollars to $68 and 2020 is wild.",
                              "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmf0yx3/",
                              "created": 1725964208,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lmi6tl1",
                              "score": 1,
                              "body": "Just back in this thread to say congrats 🎊 to u/StreetSweeper92 because this went up 10% today on no news at all and average trading volume.",
                              "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmi6tl1/",
                              "created": 1726003961,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lmb0mr1",
      "score": 3,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmb0mr1/",
      "created": 1725902819,
      "depth": 0,
      "replies": [
        {
          "id": "lmb1ry2",
          "score": 2,
          "body": "That’s fair lol",
          "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmb1ry2/",
          "created": 1725903188,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmb9wgp",
          "score": 1,
          "body": "Down about 10% on the five day chart, 13% on the one month chart, and down close to 60% on the six month chart. Whatever is causing this massive sell off – puts are probably the way. Just buy one dollar puts for a month out and enjoy the sell off. It seems like every new CEO dilutes the share price by issuing new shares. There’s no way the latest guy is going to start share buybacks within the first month in the position.",
          "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmb9wgp/",
          "created": 1725905801,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmd6epj",
      "score": 3,
      "body": "Seems a bit pie in the sky. Everyone (especially 20 year olds) want to be in on the ground level of the next Amazon, but forget about survivorship bias. For every Amazon, there is a graveyard full of thousands of businesses that had the same ideas and approaches but couldn’t execute. Really nothing groundbreaking about PLUG and the execution is sloppy. Sure it’s an okay company that will probably make enough to keep staff payed until they retire (hopefully) but it’s not going to be a stock market blockbuster. Why wouldn’t you at least wait until signs of a reversal before you jump in?",
      "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmd6epj/",
      "created": 1725928665,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmdroe2",
      "score": 2,
      "body": "Lmao first thing to do is stop listening to anyone here, but do listen to someone....",
      "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmdroe2/",
      "created": 1725936678,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lma8wjw",
      "score": 2,
      "body": "atleast you didnt really lose that you just paper trading",
      "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lma8wjw/",
      "created": 1725893410,
      "depth": 0,
      "replies": [
        {
          "id": "lmacnxk",
          "score": 1,
          "body": "I didn’t anticipate taking the loss either way, going to hold this minimum 1 yr",
          "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmacnxk/",
          "created": 1725894669,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmbe3hk",
      "score": 1,
      "body": "The trend is your friend, so they say. What is the trend here?",
      "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmbe3hk/",
      "created": 1725907149,
      "depth": 0,
      "replies": [
        {
          "id": "lmbeb7v",
          "score": 1,
          "body": "The trend is your friend unless it’s a contrarian trade. \n\nThis one I’m betting against the market sentiment here. I think I watched too much of the big short…",
          "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmbeb7v/",
          "created": 1725907219,
          "depth": 1,
          "replies": [
            {
              "id": "lmbf0oh",
              "score": 2,
              "body": "OK, good luck. This was a trendy ticker when ESG was all the rage. Now it's just a money losing penny stock. But I wish you luck friend.",
              "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmbf0oh/",
              "created": 1725907448,
              "depth": 2,
              "replies": [
                {
                  "id": "lmbfi2d",
                  "score": 1,
                  "body": "We’ll see, it’s got me nervous for sure otherwise I wouldn’t have posted it. If they can get their EPS positive before the end of next year, than I’ll have a nice payoff. If they don’t, the reverse splits are going to hurt…",
                  "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmbfi2d/",
                  "created": 1725907603,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lmdpzfm",
      "score": 1,
      "body": "it's either a turnaround play or a falling knife. finding out is the fun part.",
      "permalink": "/r/wallstreetbets/comments/1fcqm9i/this_is_how_turn_around_plays_are_supposed_to_go/lmdpzfm/",
      "created": 1725936005,
      "depth": 0,
      "replies": []
    }
  ]
}