{
  "title": "AI exuberance masks broad weakness in tech sector, say investors",
  "score": 45,
  "selftext": ">[https://www.ft.com/content/0b14d871-2d19-46f1-9660-5466301e8066](https://www.ft.com/content/0b14d871-2d19-46f1-9660-5466301e8066)\n\n  \n**AI exuberance masks broad weakness in tech sector, say investors** \n\nMany companies unconnected to artificial intelligence boom are yet to recover from post-pandemic downturn \n\nEnthusiasm about artificial intelligence masks weakness across most of the technology sector, with many companies “still in a recession” following a slowdown that started in 2022, according to investors and analysis of recent financial reports. \n\nMassive share price gains for large companies that were predicted to be early beneficiaries of AI, such as Nvidia and Microsoft, helped to erase memories of a dreadful 2022, when the tech-dominated Nasdaq Composite tumbled by almost a third.  \n\nBeneath the surface, however, many tech businesses that do not focus on AI have struggled to regain momentum. \n\n“When you look at technology outside of AI, there’s not that much happening,” said Tony Kim, head of technology investing in BlackRock’s fundamental equities division. “Many \\[sub\\]-sectors are still in a recession. The only thing that has been really growing has been AI.” \n\nMore traditional tech areas such as software, IT consulting and the production of electronic equipment for other sectors such as manufacturing and the auto industry have faced difficulties, including weak demand and the hangover from overexpansion and overstocking of inventories during the coronavirus pandemic. Some have also directly suffered from the growth of AI, as customers with limited budgets redirect investment. \n\nDustin Moskovitz, the Facebook co-founder who is now chief executive of Asana, last week summed up the situation for many companies as the business software group scaled back its forecasts for the rest of the year. \n\n“What we’re seeing in tech is still kind of the unwinding of the over-hiring and overspending that we saw at the beginning of the pandemic,” he told analysts. “And then that all couples with what I think is massive uncertainty in the economic environment. And then, also, just with how AI is going to play out.” \n\nRecent financial reports show the majority of large tech companies have been growing more slowly than in the past, while many smaller ones are actively shrinking. \n\nGroups in the S&P 500 IT sub-index increased revenues by an average of 6.9 per cent over the past 12 months, according to Bloomberg data, compared with a five-year average of 10 per cent. About three-quarters of companies grew more slowly than their recent average. \n\nEarnings per share increased by an average of 16 per cent in the past 12 months, down from 21 per cent over the past five years. \n\nThe weakness is more obvious in small cap indices, where there is no boost from megacap groups. In the Russell 2000, technology was the second-worst performing sector in terms of revenue growth in the second quarter, according to data from LSEG. Revenue fell 6.1 per cent year on year, while profits were down 2.8 per cent. \n\n“Generative AI is masking a cyclical downturn in a lot of other core sectors,” said Ted Mortonson, a tech strategist at RW Baird. “Everyone is hoping things get better in the next few quarters, though hope is not an investment strategy.” \n\nEven within subsectors that have been caught up in the AI enthusiasm such as semiconductors, some business lines have been struggling. Brice Hill, chief financial officer at chip equipment supplier Applied Materials, told analysts last month that “we’re seeing particularly strong pull related to AI and data centre computing”, but there were “pockets of weakness in the auto and industrial end-markets”. \n\n“Everywhere you look on the industrial side it’s similar,” said John Barr, a portfolio manager at Needham Funds who has invested in several semiconductor companies including Applied Materials. “Current growth is not so great, so what we’re looking for are companies that have a stable business and are investing in something new.” Recommended Artificial intelligence Rethinking the AI boom, with Daron Acemoğlu \n\nInvestor exuberance around AI-focused companies has faded since the early summer, leading many commentators to predict a prolonged rotation of investor attention away from Big Tech stocks towards sectors such as financial services and industrials.  \n\nSome tech specialists are hoping for a similar intra-industry rotation from the biggest AI stocks to more unloved corners of the industry. While few companies are predicting the sort of triple-digit growth that Nvidia has reported in recent quarters, there are signs that some of the worst-performing parts of the tech sector are turning a corner. \n\n“I think we are seeing a stabilisation — things have stopped getting worse in those more macro-sensitive areas, and if rates go down then that will help,” said Tony Wang, portfolio manager for T Rowe Price’s science and technology fund. \n\n“I feel like the idea that AI is the only thing that is working has been the case for the last two years. I’m not sure it will be the case for the next two.”",
  "link_flair_text": null,
  "id": "1fcvhdq",
  "num_comments": 39,
  "created_utc": 1725903821,
  "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/",
  "comments": [
    {
      "id": "lmc9d6x",
      "score": 12,
      "body": "The quotes that most caught my attention were:\n\n1) \"“Generative AI is masking a cyclical downturn in a lot of other core sectors,”\n\n2) \"Investor exuberance around AI-focused companies has faded since the early summer, leading many commentators to predict a prolonged rotation of investor attention away from Big Tech stocks towards sectors such as financial services and industrials.\"  \n  \nRegarding the second point, I personally have not seen any signs of a rotation into industrials --specifically, materials. If anything, I've seen weakness in materials stocks, possibly due to China issues.",
      "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmc9d6x/",
      "created": 1725917022,
      "depth": 0,
      "replies": [
        {
          "id": "lme3uc8",
          "score": 3,
          "body": "Ive seen instead an heavy rotation to consumer staples and REITS,tobacco stocks crashed only for now to be like 15% up in a matter of 2 months",
          "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lme3uc8/",
          "created": 1725942262,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmdouce",
      "score": 10,
      "body": "Honestly I hate the word tech, I feel like it doesn’t really mean anything anymore and needs more division/categorization. To make a sweeping generalization on all tech companies is a bit asinine \n\nAlso generative AI is not the only thing propping up their valuation lol big tech absolutely prints money with margins like no other, and that doesn’t come from AI",
      "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmdouce/",
      "created": 1725935545,
      "depth": 0,
      "replies": [
        {
          "id": "lme95h9",
          "score": -2,
          "body": "40 years ago tech meant aerospace, industrial advancements such as new heavy duty equipment, and biomedical advancement, and so much more.  Today tech has been degraded to just include microchips now. And the world is much poorer for investment mainly into just microchips.",
          "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lme95h9/",
          "created": 1725945156,
          "depth": 1,
          "replies": [
            {
              "id": "lmfi8km",
              "score": 5,
              "body": "Is this supposed to be some smear?\n\nYou do realize microchips are very industrial right? And most of the industrial advancements in the past 30 years have been from semiconductors.",
              "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmfi8km/",
              "created": 1725972576,
              "depth": 2,
              "replies": [
                {
                  "id": "lmihxzg",
                  "score": 2,
                  "body": "I bet that kid didn’t even make it through college yet but reduces an entire mega industry as “just chips” as if he’s got it all figured out lol",
                  "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmihxzg/",
                  "created": 1726007788,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lmf52ja",
              "score": 2,
              "body": "That is simply not true lmao there is cloud computing, software/SAAS, cybersecurity, robotics, biotech still around and kicking, and plenty more \n\nDid you just decide to make up an entire comment and hope no one would call you out? \n\nTo say tech = chips is so wrong it hurts",
              "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmf52ja/",
              "created": 1725966546,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmb682z",
      "score": 36,
      "body": "One data point - engineers cant get jobs. I was shopping at Costco and the kid trying to sign up folks for AT&T service seemed well put together so I asked if this was his first job out of school - he said he graduated as a full stack engineer and neither he nor any of his friends could get jobs. He went to UC Santa Cruz - so in the backyard of Silicon Valley. He said nobody is hiring unless you have AI experience.",
      "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmb682z/",
      "created": 1725904621,
      "depth": 0,
      "replies": [
        {
          "id": "lmbeyew",
          "score": 23,
          "body": "Bullish af",
          "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmbeyew/",
          "created": 1725907427,
          "depth": 1,
          "replies": [
            {
              "id": "lmbkzw5",
              "score": 7,
              "body": "For AT&T calls right?",
              "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmbkzw5/",
              "created": 1725909370,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lmcx16b",
          "score": 12,
          "body": "It's common for graduates to struggle landing their first job",
          "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmcx16b/",
          "created": 1725925299,
          "depth": 1,
          "replies": [
            {
              "id": "lmehx5e",
              "score": 2,
              "body": " Not SEs when I graduated a decade and change ago...",
              "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmehx5e/",
              "created": 1725950695,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lmcx8ir",
          "score": 4,
          "body": "When people say full stack, they mean the front end and back end of web dev, right?",
          "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmcx8ir/",
          "created": 1725925374,
          "depth": 1,
          "replies": [
            {
              "id": "lmcy5al",
              "score": 13,
              "body": "Yes. Usually it means you're a serviceable programmer capable of making a shitty UI feature for some API call you developed.",
              "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmcy5al/",
              "created": 1725925713,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lmc9qi1",
          "score": 3,
          "body": "It's funny you mentioned that. I've gotten a similar vibe from mobile service reps at our nearby Costcos. I get the feeling that they're overtrained for the job. Maybe they're in a similar boat as the engineer you referred to.",
          "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmc9qi1/",
          "created": 1725917141,
          "depth": 1,
          "replies": [
            {
              "id": "lmcdg0q",
              "score": 1,
              "body": "PLTR is good 👍",
              "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmcdg0q/",
              "created": 1725918343,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lme374f",
          "score": 3,
          "body": "UC colleges have computer science and computer engineering majors, never heard of a full stack engineering major… sounds more like something from a coding bootcamp.",
          "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lme374f/",
          "created": 1725941926,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmfhya3",
          "score": 3,
          "body": "1. No one graduates as a full stack engineer.\n2. Tech definitely is in a slowdown with hiring for entry level.",
          "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmfhya3/",
          "created": 1725972462,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmc9d5l",
          "score": 4,
          "body": "Bullish for Costco",
          "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmc9d5l/",
          "created": 1725917021,
          "depth": 1,
          "replies": [
            {
              "id": "lmer5gz",
              "score": 2,
              "body": "I’ll never be bearish on free samples",
              "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmer5gz/",
              "created": 1725957363,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lmc7rlk",
          "score": 1,
          "body": "Not sure why anyone would graduate from CS without ML in 2024, but it's UCSC so that makes sense.",
          "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmc7rlk/",
          "created": 1725916503,
          "depth": 1,
          "replies": [
            {
              "id": "lmchuu2",
              "score": 9,
              "body": "Machine learning is saturated as well.",
              "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmchuu2/",
              "created": 1725919798,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmdlmc6",
      "score": 3,
      "body": "I can believe that. Open AI shocked the world with chat gpt right when tech companies were on a downward path. The rise in stocks like NVDA almost single handedly led the stock market windfall.",
      "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmdlmc6/",
      "created": 1725934296,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmb5he5",
      "score": 4,
      "body": "For a good time: put VPU and VGT on a chart together, then set it to 6 months.",
      "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmb5he5/",
      "created": 1725904385,
      "depth": 0,
      "replies": [
        {
          "id": "lmdgqvl",
          "score": 3,
          "body": "lol sure VPU beats it short term. Do the same over 5 years. VPU performed better over last 6 months (19%) than last 5 years (18%). VGT over 5 years is 148% - not even close",
          "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmdgqvl/",
          "created": 1725932461,
          "depth": 1,
          "replies": [
            {
              "id": "lmnrdoa",
              "score": 1,
              "body": "Totally, but take it in the context that most investors are always trying to time the market and tinker with their portfolios. Imagine the hypothetical thread, posted in March: \"Hey guys, what sector should I invest in for the short term? I'm looking to sell around August or September-ish.\" Once this hypothetical OP filtered through all the \"don't time the market\" and \"sector pays are dumb\" replies, they'd find that the rest are universally, unquestionably telling them the answer to their question is Information Technology.\n\nLiterally no one would've told that hypothetical OP to invest in Utilities. In fact I would wager that if someone did, they would've got like 75 downvotes and laughed out of the thread, regardless of OP clarifying that they're going short term. Yet here we are. That's what makes it so interesting to me. If market timing is possible to any degree, what was *everyone* missing about Utilities for the last 6 months?",
              "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmnrdoa/",
              "created": 1726085827,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lmcipbb",
          "score": 1,
          "body": "Gotta keep the lights on. ",
          "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmcipbb/",
          "created": 1725920098,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmc8m80",
      "score": 3,
      "body": "1. Outsourcing and automation have nonlinear growth that allows them to beat general growth curves until most of the things are automated and outsourced. This is not R&D because even most tech isn't R&D.\n2. It seems that predictologists are somehow worse in predicting true technical advances than regular people. Don't invest on people's vision of the future as we can only somehow predict by extrapolation, not actually work with paradigm shifts.\n3. Rate cuts are unrelated to scientific progress. At best, to R&D spending. People who make stupid arguments should not be taken as honest.\n4. People mostly express opinions because they benefit financially from you listening to them. You can't trust professionals that can only gain if others lose (because they don't create value, they cannot increase the value pie).\n5. Use your common sense. Technology is the only thing that prevents us from disappearing as humans are horrible survivals without technology. And yes, even the nuclear weapons help.\n6. Being bullish science and bearish financial players isn't enough to predict how to become filthy rich using stocks, so use your head, always.",
      "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmc8m80/",
      "created": 1725916778,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmbkvht",
      "score": 1,
      "body": "Feels like there are a lot of pockets of technology focus where a lot of investment has been absorbed, and we’ll see if now that the technology is post hype can find better ROI. Warehouse robotics/automation, robotaxis/self driving, and  just in general IOT/cyber-physical devices are prior period AI hype areas. Now that the tech is past that/early adopters it has a real chance to start scaling, but with little discussion because folks are focused on AI. \n\nLike software adoption 10-15 years ago for what are now standard areas, like payments/CRM/HR, I think we’re still pretty early innings in adoption on the prior investment focus areas with AI investment further out to payoff in real implementation.",
      "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmbkvht/",
      "created": 1725909331,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmbuesa",
      "score": 1,
      "body": "hm. less money overall means consolidation and weaker companies and products get left behind right? i think im gonna keep buying goog amzn and aapl",
      "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmbuesa/",
      "created": 1725912339,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmdxinv",
      "score": 1,
      "body": "Might as well as the tech-adjacent video game sector. Which also lost a lot of investor interest to AI.",
      "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmdxinv/",
      "created": 1725939166,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmbi3an",
      "score": -6,
      "body": "This is dot com 2.0.  If you look at the Nasdaq chart from 1995-2000, the market got overly exuberant on the internet & growth stocks and those stocks pulled forward the next 10 years or so of demand in the stock prices and created a bubble.  \n\nThe same thing is happing with the AI hype.  We have pulled forward the next decade or so of  AI growth & revenue into these stocks today in 2024 and we have created a market bubble.\n\nAs Mega Tech companies like Google, Amazon, and Apple start to lose their margins, they are being forced to cut spending that includes labor/employees to continue to show growth and valadate their high P/E ratios.  Their growth margins are no longer there and is slowing down as the next decades AI demand & revenue has already been pulled forward into their stock prices today.",
      "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmbi3an/",
      "created": 1725908434,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmbsrv2",
      "score": -1,
      "body": "I only invest in big tech anyways. Most tech companies are not that innovative and have no meaningful moat",
      "permalink": "/r/stocks/comments/1fcvhdq/ai_exuberance_masks_broad_weakness_in_tech_sector/lmbsrv2/",
      "created": 1725911829,
      "depth": 0,
      "replies": []
    }
  ]
}