{
  "title": "If you are starting out with individual stocks, is it better to build a position with fewer companies?",
  "score": 90,
  "selftext": "Someone once told me it's better to build up a position with a small handful of companies if you have less money to start with rather than trying to get a lot of shares from different companies. Is that the prevailing sentiment? It's hard to not feel FOMO for missing out on so many companies. But if you had to start over with a few thousand dollars, would you build a larger position in 2-3 companies?",
  "link_flair_text": "Advice",
  "id": "1fcx3qf",
  "num_comments": 126,
  "created_utc": 1725907797,
  "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/",
  "comments": [
    {
      "id": "lmbipnp",
      "score": 134,
      "body": "The number of companies you invest in relates to the amount of work you're willing to put in more than the amount of capital you have to spread around. You will never have enough time or money to play the whole market and every opportunity, so put the silly fomo stuff out of your mind asap. Learn a sector, learn about its best companies, and buy the ones you think are worth it. Otherwise just stick to an index fund.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbipnp/",
      "created": 1725908636,
      "depth": 0,
      "replies": [
        {
          "id": "lmbj308",
          "score": 18,
          "body": "Thank you, do you recommend any specific resources for learning about the companies? I feel like I don't know how to discern what's real information and what might be written as a sham to convince people to buy the stock",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbj308/",
          "created": 1725908756,
          "depth": 1,
          "replies": [
            {
              "id": "lmbo3io",
              "score": 25,
              "body": "Don't trust articles about a company.  Look at their numbers.  YahooFinace and Stockanalysis.com are good starting points.  Plus your brokerage probably has some good resources on quantitative data.",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbo3io/",
              "created": 1725910363,
              "depth": 2,
              "replies": [
                {
                  "id": "lmbpuhh",
                  "score": 19,
                  "body": "I would add don’t trust tv analyst personalities, I swear they are all in cahoots with each other to pump up their holdings.",
                  "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbpuhh/",
                  "created": 1725910917,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmc825l",
                      "score": 17,
                      "body": "You don't have to swear this. They are.",
                      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmc825l/",
                      "created": 1725916599,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lmdrcsy",
                      "score": 3,
                      "body": "nobody sane trades reactively to what tv shite shows",
                      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmdrcsy/",
                      "created": 1725936552,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lmc8dqh",
                  "score": 7,
                  "body": "Learning how to read the numbers isn't easy, though. I've been actively investing for decades and still have trouble unwinding some of the complexities",
                  "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmc8dqh/",
                  "created": 1725916702,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmbpfk0",
                  "score": 2,
                  "body": "thank you for the resources",
                  "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbpfk0/",
                  "created": 1725910787,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmclrlc",
                      "score": 4,
                      "body": "www finviz dot com is useful",
                      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmclrlc/",
                      "created": 1725921197,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lmbrooq",
              "score": 6,
              "body": "if you want to do it right, you need to learn accounting.",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbrooq/",
              "created": 1725911490,
              "depth": 2,
              "replies": [
                {
                  "id": "lmcz4oi",
                  "score": 2,
                  "body": "Ugh, I was reading this thread thinking positive til I read this.  I failed Accounting in college.  I could never understand balance sheets and moving money around.....",
                  "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmcz4oi/",
                  "created": 1725926072,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lmbopn7",
              "score": 5,
              "body": "Public companies lying to trick people into buying shares is a serious crime. Which isn't to say that you shouldn't be sceptical of the meaning of some claims they make, or try to read between the lines in company reports, investor presentations and management discussion and analysis. \n\nThe biggest obstacle for me at first was decoding basic accounting jargon. I still can't tell debtors from creditors or remember what EBITDA means without looking it up.",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbopn7/",
              "created": 1725910559,
              "depth": 2,
              "replies": [
                {
                  "id": "lmbqnqq",
                  "score": 5,
                  "body": "That's easy.  \nDebtor - someone who owes you money  \nCreditor - someone who you owe money to  \nEBITDA - Earnings before Interest, Taxes, Depreciation and Amortization (or as Warren Buffet says, earnings before all the bad stuff; he doesn't use this metric)",
                  "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbqnqq/",
                  "created": 1725911172,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lme7d1n",
                      "score": 1,
                      "body": "I really don't like that EBITDA is so important. Just pushed this all further into gamesmanship.\n\n(Incidentally, it autocorrected 'gamesmanship' to 'haha hahahahahahaha' dunno why but thought it was funny)",
                      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lme7d1n/",
                      "created": 1725944149,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lmc35go",
              "score": 3,
              "body": "Learn how to read their numbers, go for good companies with good track record, 10-20 companies is a good number to diversify between multiple industries.\n\nAlways go long term and learn to do fundamental analysis of their quarterly reports yourself, sell only if the performance of the company goes against the fundamental analysis that convinced you to invest, avoid short term and calls, its easier to win money in blackjack.\n\nIf you want to avoid all of this and get more or less  the same (probably better) go for an index fund, but its never bad to learn how stocks work.",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmc35go/",
              "created": 1725915046,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lmfapwi",
              "score": 3,
              "body": "Look at the numbers they put out on material that is audited. If you want to check other sources then simply remove all adjectives from the wording. That should get you to the gist of it (or at the very least should strip it down to measurable/checkable factoids). It is OK to have *a bit* of your money in 'speculative' stocks, but you should be aware - on a technical level - what the business entails and what the real chances/risks are.",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmfapwi/",
              "created": 1725969330,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lmbpb2f",
              "score": 4,
              "body": "read 10-Ks",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbpb2f/",
              "created": 1725910748,
              "depth": 2,
              "replies": [
                {
                  "id": "lmbpkjh",
                  "score": 4,
                  "body": "I'll look this up!",
                  "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbpkjh/",
                  "created": 1725910830,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmnrpgy",
                      "score": 1,
                      "body": "\"...and knowing is half the battle!\"",
                      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmnrpgy/",
                      "created": 1726085930,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lmblevf",
              "score": 2,
              "body": "Look into individual companies, any company that is public has regular disclosures they need to file. These are the earnings numbers as well as their board meeting disclosures. You will only get a glimpse of the inner workings, but if you work in or know people in specific industries, they can tell you a little bit more about the behind the scenes stuff as long as it is generally public information. ",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmblevf/",
              "created": 1725909503,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lmea6ra",
              "score": 2,
              "body": "Based on this comment. You should probably not invest in individual stocks. I would continue adding to broad vanguard ETFs like voo and vti. Maybe open a paper trading account to mess with individual stocks with pretend money and start watching and reading content on stock trading. \n\nYou don’t want to learn hard lesson with real money, at least not with a lot of it.",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmea6ra/",
              "created": 1725945763,
              "depth": 2,
              "replies": [
                {
                  "id": "lmeavkv",
                  "score": 5,
                  "body": "Eh thanks but I want to learn about individual stocks and it's just not true that I 'shouldn't based on this comment'. I already have a portfolio invested in ETFs and safe things. I've learned some lessons and made some gains already. Some have worked out, some haven't. I do agree though I'm not putting a lot of money into any of it.",
                  "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmeavkv/",
                  "created": 1725946174,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lmere6i",
          "score": 3,
          "body": "Also important: read their financial reports and balances carefully.\n\nJust because company is great, doesn't mean it's worth what the market's demanding.",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmere6i/",
          "created": 1725957545,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmbmefs",
      "score": 19,
      "body": "I invest like 95 percent in index funds or etfs through my 401k and roth ira. The remainder is in my taxable brokerage. Adding individual stocks is higher risk higher reward. Adds a little aggression to the portfolio. So if I pick poorly the majority of my investments are safe. I currently only own 4 individual stocks. 2 or 3 on a warchlist. Better to have a few well researched companies than a ton of them. Stockanalysis.com and macrotrends are where I get my data.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbmefs/",
      "created": 1725909821,
      "depth": 0,
      "replies": [
        {
          "id": "lmbn9uw",
          "score": 2,
          "body": "thank you for the resources!",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbn9uw/",
          "created": 1725910101,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmbsb4b",
      "score": 9,
      "body": "More companies is better when you are starting out. You will learn faster what works and what doesn’t since each will  perform differently. You will also have less risk of a single stock ruining your results.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbsb4b/",
      "created": 1725911685,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmcbfle",
      "score": 7,
      "body": "I built my portfolio by buying one stock until I got to 100 shares. When you have 100 shares you can start to sell covered calls and puts. Which will enhance your returns. There are a wide range of other options you can play. Covered puts and calls are they only options I was knowledgeable enough to use and qualified by the brokerage company to use in my portfolio.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmcbfle/",
      "created": 1725917687,
      "depth": 0,
      "replies": [
        {
          "id": "lmdbdll",
          "score": 3,
          "body": "I used a personal IRA fund to shield my self from taxes. I also had a taxable IRA using the same scheme. Rarely had calls or puts called to create taxable events, but, a 25-30% return still beats your 6-8% return.",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmdbdll/",
          "created": 1725930484,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmch8up",
          "score": 2,
          "body": "Do you make your own IRA to shield it from taxes on the trades?",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmch8up/",
          "created": 1725919587,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmbra3k",
      "score": 6,
      "body": "Start with ETFs and build up your net worth that way for a while. If you feel like having a share or two of a stock, go ahead. Understand that you will be WRONG 40% to 60% of the time if you are good at it. Having a few shares is a good way to learn without taking on too much risk.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbra3k/",
      "created": 1725911365,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmbrpwg",
      "score": 6,
      "body": "Yes. The more companies you add, the less research you will have time to do on each, plus eventually you'll run out of really great companies.  \nIt's best to start with small businesses because rich people can't invest in them without buying them up and still having a ton of cash left over so they usually invest in bigger businesses plus small businesses have less analyst coverage. Start with profitable businesses and look at their EV/EBIT and ROIC, but also look at how stable their earnings are.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbrpwg/",
      "created": 1725911501,
      "depth": 0,
      "replies": [
        {
          "id": "lmbugh8",
          "score": 3,
          "body": "This seems like valuable information, I will look up these resources, thank you",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbugh8/",
          "created": 1725912354,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmbmexr",
      "score": 18,
      "body": "You're top performers of an index are the only ones which make the index beat treasury bonds.\n\n\nPicking stocks is not really wise unless you have an edge versus people who pick stocks fill time as a career.\n\n\nBen Felix did a video on picking stocks which cites the studies.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbmexr/",
      "created": 1725909826,
      "depth": 0,
      "replies": [
        {
          "id": "lmbneq1",
          "score": 5,
          "body": "I'll watch that. I know JL Collins said the people whose funds performed best overall were the ones who died and left it alone",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbneq1/",
          "created": 1725910143,
          "depth": 1,
          "replies": [
            {
              "id": "lmbqtfo",
              "score": 3,
              "body": "Well that's explained by a video he did called \"The Problem with High Stock Valuations\" and \"Cash is a terrible long-term investment, even at 5% interest\"",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbqtfo/",
              "created": 1725911222,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmblkj4",
      "score": 11,
      "body": "I’m a concentration for wealth creation and diversification for wealth preservation kinda guy. Do so at your own risk though. If you want to set it and forget it, just go with SP500 etf, it will just take much longer than if you pick one banger correct early in your investing career. Good luck.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmblkj4/",
      "created": 1725909553,
      "depth": 0,
      "replies": [
        {
          "id": "lmbmofo",
          "score": 7,
          "body": "Yeah I personally am fine with calling this gambling. I know there are higher upsides and downsides and I am willing to take the risks because I already have a 401K, IRA, and HSA. This is my gambling fund. I want to make educated decisions, but I understand the volatility. I also have crypto which a lot of people would disagree with. I am okay with treating it as an experiment. So in short I plan to do both.",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbmofo/",
          "created": 1725909910,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmcdv3c",
      "score": 4,
      "body": "I heavily diversified for the first couple of years. Made some gains lost a lot, but learned a bunch of stuff in the meantime. \n\nI went from around 20+ individual stocks to 5, and after I became numb to volatility and disappointment, I ventured to crypto. (Btc, jasmy, doge)\n\nI swing some stocks too but my actual invested companies are high growth high risk now that I have an idea of what to look for",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmcdv3c/",
      "created": 1725918479,
      "depth": 0,
      "replies": [
        {
          "id": "lmcicga",
          "score": 2,
          "body": "It's been interesting because I already have some random individual stocks, some took a shit and some have good returns. Not much rhyme or reason though, just luck and trying things out. But I am trying to be more strategic now going forward. A few years ago everything tanked whether it was doing well or not, and some of those have started to creep back up, some were just crap to begin with and bad recommendations from coworkers or whatever. I do have some crypto as well, and plan to keep DCAing in. \n\nThanks for sharing your experience, what are the things to look for in a company when you choose?",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmcicga/",
          "created": 1725919969,
          "depth": 1,
          "replies": [
            {
              "id": "lmct03r",
              "score": 2,
              "body": "One stock I made very good returns on is SMR. My horizon for them wasn't until 2030, so I slowly accumulated the past couple of years, and this year something happened that caused it to run 500% in like a month or two. so i locked in profits because I was being realistic and still kept 2030 as my horizon. Since I sold its lost about half its value, it was good timing and leaving emotions out helped me deter from greed.\n\nOne company I have high hopes for is Cybin. I know from personal experience the medicinal properties of psilocybin, if any company is going to quantify psilocybin to attract investors and patients, it'll be them. If Trump wins office, the whole health sector is going to experience volatility but natural and \"alternative\" medicines should make their way as staples into the sector.\nI also have the psilocybin etf for added exposure and gamble for the election results. \n\nI work in retail so I see how much of Oatly is sold, I even have asked customers why they prefer that. The answers vary from the taste, to the humane aspect of it, and also allergies. Customers who buy oatly, buy oatly. \n\nAnd my last high risk stock is Virgin Galactic. I've been in the negative on this stock for literally years. I made money on it by swinging shares here and there. But overall I'm always seeing -60%+. This stock is more intuition and huffing tanks of hopium along with it. It's by far my biggest position, and I continue to accumulate.",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmct03r/",
              "created": 1725923833,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmbhumg",
      "score": 8,
      "body": "I would agree with that for sure. \n\nNot feeling the FOMO can be hard, but that's why you need a strategy and set goals. If you have less than $5000, I wouldn't bother having more than 1 ticker.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbhumg/",
      "created": 1725908357,
      "depth": 0,
      "replies": [
        {
          "id": "lmbiss5",
          "score": 2,
          "body": "yeah it feels counterintuitive, like what if the one company tanks but if I had 10-20 shares of other companies and they keep going up I could potentially add to them. It would be hard to pick that company, but I can see the logic too since a lot of them would fluctuate",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbiss5/",
          "created": 1725908664,
          "depth": 1,
          "replies": [
            {
              "id": "lmbj4sc",
              "score": 9,
              "body": "What you're describing is why you should be in an index tracking ETF",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbj4sc/",
              "created": 1725908772,
              "depth": 2,
              "replies": [
                {
                  "id": "lmbjw5b",
                  "score": 2,
                  "body": "Yeah there are so many ETFs even. VOO, PIMCO, REITs I hear all of these are good",
                  "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbjw5b/",
                  "created": 1725909017,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmcothe",
                      "score": 5,
                      "body": "That’s called analysis paralysis and it can hit anyone. IVV is a great fund, IMO. Do your DD and check it out. Individual stocks are where it’s at, though. Everyone’s different and that’s OK. Your money and your future are yours – no-one else’s.",
                      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmcothe/",
                      "created": 1725922310,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lmbke5v",
                      "score": 2,
                      "body": "Don’t overthink it, just pick one and do it, otherwise I can see you sitting there analysing which one is the best for a whole year while never putting any money in ",
                      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbke5v/",
                      "created": 1725909176,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lmd1luw",
      "score": 5,
      "body": "Yes.  It's better to have fewer, even if you have a lot of money as you'd be diversified, but also more concentrated.  Check out the book, You Have More Than You Think by the Gardner brothers and they'll break it down for you as far as how many you should own due to the amount you are investing.  I think they start with $5,000. or less.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmd1luw/",
      "created": 1725926962,
      "depth": 0,
      "replies": [
        {
          "id": "lmd3h4y",
          "score": 3,
          "body": "awesome, thanks for the recommendation! I'm gonna listen to the audiobook",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmd3h4y/",
          "created": 1725927623,
          "depth": 1,
          "replies": [
            {
              "id": "lmd6ffo",
              "score": 2,
              "body": "You can find a cheap copy on eBay or amazon.  I still go back and use mine often to see if I need to do something.  They also have a website, fool(dot)com.  Many don't care for them, but I've made a lot of money on their advice/knowledge.",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmd6ffo/",
              "created": 1725928672,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmbjrca",
      "score": 3,
      "body": "Picking to much shares will not make much difference if you invest it in ETF or index. You will just pay more charges I guess on diversified portfolio.   \nGo trough the list of picked shares, pick half of them  \nDo the same with picked... and so on until you will be left with 3-5 shares. Then buy it.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbjrca/",
      "created": 1725908974,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmdd0ag",
      "score": 3,
      "body": "I started out focusing on three or four stocks for similar reasons.  I thought I would have the top choices.  The problem was I got too attached to them and made bad sell decisions.   \n\nI do better now buying small amounts of many companies.  I have about 50 right now.  About 80% win rate so far this year.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmdd0ag/",
      "created": 1725931076,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmdkbvh",
      "score": 3,
      "body": "Look at it this way - at the end of the day you’re looking to grow your capital.\n\nLet’s say for instance you like 3 companies. Is investing in 3 or 1 better? Well neither option is “better”\n\nLet’s say these 3 companies have the potential to 10x value in maybe 10 years. This is massive growth mind you. Let’s say 1 company grows 5x, another grows 10x, the third grows 25x all in the same time frame.\n\nOk great! Now what about your money? Well depending how you split your funds you have some weighted average of that growth. Maybe 12x, maybe 7x.\n\nWhat I would suggest is picking at most 2-3 companies to invest in. Doing this will not be easy if it is not your full time job. You need to stay up to date with everything about these companies, all earnings reports, understand their technology, their product, listen to the ceo interviews to get their vision. That’s a lot of work for each company multiplied by the number of companies.\n\nAnd growing the number you invest in will not correlate with greater growth. You’re just casting a wider net.\n\nI dropped META reluctantly for this reason. I did not want to dilute my profit from another 2 companies who I believe have the potential to have more relative growth.\n\nI love META. I see their future. I see Zuckerberg’s vision. I see the roadmap and how they will scale, the hardware piece, how AI will be integral to the meta verse and how integral the meta verse will be in our daily lives.\n\nBut, I dropped them to stick with 2 other companies I believe simply are in a position to have greater relative growth and on a shorter timeline",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmdkbvh/",
      "created": 1725933812,
      "depth": 0,
      "replies": [
        {
          "id": "lmiqwsr",
          "score": 1,
          "body": "> I love META. I see their future. I see Zuckerberg’s vision. I see the roadmap and how they will scale, the hardware piece, how AI will be integral to the meta verse and how integral the meta verse will be in our daily lives.\n\nMe too, dog, me too. Just bought more META again today.",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmiqwsr/",
          "created": 1726011038,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmgdt37",
      "score": 3,
      "body": "People have done very well just buying the magnificent 7.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmgdt37/",
      "created": 1725983476,
      "depth": 0,
      "replies": [
        {
          "id": "lmghwnd",
          "score": 1,
          "body": "Would like some of those, pricey but seem worthwhile",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmghwnd/",
          "created": 1725984780,
          "depth": 1,
          "replies": [
            {
              "id": "lmgn14f",
              "score": 1,
              "body": "Some brokerages allow you to buy partial shares.",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmgn14f/",
              "created": 1725986421,
              "depth": 2,
              "replies": [
                {
                  "id": "lmgo5jf",
                  "score": 1,
                  "body": "Yeah Fidelity does, gotta start somewhere!",
                  "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmgo5jf/",
                  "created": 1725986775,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lmi07jf",
      "score": 3,
      "body": "As a new investor with only $1k invested, I went all-in on a small cap stock I have a lot of faith in growing exponentially over the next few years (RKLB)",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmi07jf/",
      "created": 1726001836,
      "depth": 0,
      "replies": [
        {
          "id": "lmi6x5e",
          "score": 1,
          "body": "Thanks for sharing the info! This is the second time I've heard about this stock. What makes you believe in it?",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmi6x5e/",
          "created": 1726003994,
          "depth": 1,
          "replies": [
            {
              "id": "ln2fby4",
              "score": 2,
              "body": "Did the same with LUNR. Heard about them on wsb, was reading up on the contract they are in the lead for that is worth 8x their market cap, then i saw they just got a contract that was then equal to 1/3 their market cap so i bought all in. That was last friday. I'm up 28%.\n\nI'm new to this too, so i might be looking at the wrong things but I'd rather be lucky than good.",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/ln2fby4/",
              "created": 1726312008,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmbgknk",
      "score": 6,
      "body": "If this company has potential, I will do this",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbgknk/",
      "created": 1725907950,
      "depth": 0,
      "replies": [
        {
          "id": "lmbh81l",
          "score": 1,
          "body": "What metrics or strategies do you use to determine whether a company has potential?",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbh81l/",
          "created": 1725908155,
          "depth": 1,
          "replies": [
            {
              "id": "lmbhspq",
              "score": -3,
              "body": "I will follow Dow Jones and S & P 500",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbhspq/",
              "created": 1725908340,
              "depth": 2,
              "replies": [
                {
                  "id": "lmbih9i",
                  "score": 1,
                  "body": "So you look for affordable stocks listed in s&P 500 that you can buy more of, or you're saying you only doe ETFs/index funds?",
                  "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbih9i/",
                  "created": 1725908559,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lmcy7eb",
      "score": 7,
      "body": "The OP asked a clear question about INDIVIDUAL STOCKS and what did he get in return? A bunch of morons shilling for holy index funds, unbelievable. It’s a fucking cult at this point.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmcy7eb/",
      "created": 1725925734,
      "depth": 0,
      "replies": [
        {
          "id": "lmd1756",
          "score": 1,
          "body": "Happy Cake Day!!  \n  \nYeah I appreciate the warnings and all, but I already do invest in index funds. I have a retirement account and some ETFs and I am aware it can be risky to invest in stocks, but I am not putting the majority of my money in them or anything. I understand it's essentially gambling and limiting my exposure, and I swear I won't dump $20,000 into a WSB stock lol",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmd1756/",
          "created": 1725926817,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmbskrc",
      "score": 2,
      "body": "I think investing in individual stocks take a lot of time and requires checking regularly. Knowing the market, knowing the financials, industry and timing. If you’re not versed in these things don’t bother and just buy a etf or stable high dividend stocks such as a major bank, insurance provider or something boring. \n\nIf you don’t want to buy & sell often then I don’t really recommend individual stocks unless it’s something that suffered some bad press news, had a sudden dump then you pick it up like that.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbskrc/",
      "created": 1725911767,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmbv26z",
      "score": 2,
      "body": "The comments are all over the place! Good luck figuring out what you want to do.\n\nI have come to accept that I cannot beat the market, so my retirement portfolio is in indexes. However, my brokerage account is concentrated on 30 tickers so I have added exposure to companies that I believe will grow steadily and have the wherewithal to follow the news for. I absolutely miss out on the \"new shiny thing\" with this strategy, but they are covered in my retirement account, usually. I do not beat market upswings this way but I definitely beat when the market turns sour. The market was down more than my accounts were last week because I am in less volatile and speculative companies. I think I'm at 27 names I am actively monitoring, with space to add a few more if something exciting comes along or I make a decision. Because I am a buy-and-hold investor, this is working for me. You need to decide what will work for you. Why 30? Because that's what I've decided represents a well-balanced portfolio across multiple sectors.\n\nThe problem with spreading yourself too thin is that you won't experience the gains at the accelerated rate you would in a concentrated portfolio. I needed to ask myself - what's the most I'm willing to lose on a speculative company that I believe in but hasn't proved itself? The answer, to me, was about 1% of my portfolio and the most weight I will invest is about 6% of my portfolio. You have to start somewhere and have a growth strategy - how much will you be adding over time? Is this a lump sum you're looking to make purchases in over time? Etc. \n\nLots to think about! Trust yourself but most importantly, empower yourself with knowledge.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbv26z/",
      "created": 1725912542,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmckmm2",
      "score": 2,
      "body": "If I was starting out today for me It’s better to start with 1–2 ETFs like SCHG, QQQM, SCHD, SMH and as I am investing money into ETF I’ll learn more about the stock market/finance and then if I have the passion to learn more about individual companies then I’d jump into 2-3 that I’d consider core positions for my portfolio",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmckmm2/",
      "created": 1725920786,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lme4o5l",
      "score": 2,
      "body": "Very simple, there is a style of investing that has historically been a very solid way of building wealth called the satellite investment method. Basically 90-95% of your holdings are in low to mid-risk investment options like ETF's, Gold etc giving you 5-10% of your total capital to invest however you wish. This means you can restrict your gambling so you won't get wiped out while having some fun investing. The neat aspect of satellite investing is your gambling money pool gets bigger over time so you have more fun. Some years my 10% personally managed capital investments has better gains than my other low risk investments. You won't reach this point straight away, it takes about 2-5 years of practice to learn to manage your losses and wins. I normal investment pool for me is 10-20 companies. The only other lesson is you will get better returns owning Australian banks than putting your money in a high return savings account. So it is usually smart to own some bank shares.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lme4o5l/",
      "created": 1725942696,
      "depth": 0,
      "replies": [
        {
          "id": "lmeab88",
          "score": 2,
          "body": "I like this, the idea of having some solid, boring, safe investments, (I have 401K and IRA now, but getting some solid ETFs like VOO etc would be cool. I don't have any gold, I do have crypto.Anyway, I just gotta do a little speculating, otherwise it's no fun! Mostly I've just picked without knowing much so far and have done ok, probably broke even with what I've lost, some really dumb investments like a couple hundred bucks in darkpulse and some pleasant surprises like forgetting PLTR existed and having them go up all of a sudden. Do you have any examples of some AUS banks to research?",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmeab88/",
          "created": 1725945837,
          "depth": 1,
          "replies": [
            {
              "id": "lmedwk4",
              "score": 3,
              "body": "to be honest any of the big 5 banks in Australia would have returned 20-30% this year, I'm pretty heavy on ASX:ANZ right now and that's working out for me. Gold has been very good for me this year, I purchased a pile of options earlier this year and smashed out 28% in 6 months. You quickly learn everything goes in cycles, so in a few years gold will be a slow runner again. Also keep an eye on commodity prices as you will be surprised how even the smallest things can cause massive upside or downside changes in a companies bottom line.\n\n[https://tradingeconomics.com/commodities](https://tradingeconomics.com/commodities)",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmedwk4/",
              "created": 1725948046,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmf04hf",
      "score": 2,
      "body": "You are working towards your goal of 5 million",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmf04hf/",
      "created": 1725963689,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmfsir6",
      "score": 2,
      "body": "The longer I do this, the fewer companies I own. I spent years squinting and crossing my eyes trying to pick winners. When I went back and looked at the net profit I made it ended up being virtually exactly what I'd have made if I'd put it all in SPY and went to sleep.\n\nThese days I really only buy individual stocks when there is an overwhelmingly obvious opportunity to buy a good company on a bad day. Literally the only stock I've bought this year has been PFE with its 5.7% dividend and oversold reaction to disappointing covid booster revenue.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmfsir6/",
      "created": 1725976435,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmfyx6q",
      "score": 2,
      "body": "Read \"how to make money in stocks\" - William O'Neil",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmfyx6q/",
      "created": 1725978632,
      "depth": 0,
      "replies": [
        {
          "id": "lmg399a",
          "score": 2,
          "body": "I will!",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmg399a/",
          "created": 1725980075,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmkcdqq",
      "score": 2,
      "body": "How to cheat the market of 20 trillion?\n\nOver two years (1H24 to 1H22), net income of US public non-financial companies declined by 1.5% at par and fell by 7.9% on an inflation-adjusted basis. \n\nMeanwhile, moderate stagnation with a downward trajectory was driven by the strong performance of technology companies, i.e. excluding technology and trading (Amazon factor), profits collapsed 18% at par and 23.3% when adjusted for inflation. \n\nAt the same time, the US market was balancing in the 3600-3800 range with a break to 3500 points (1H22 reports were known, as they are now for 1H24).\n\nProfits were down by a quarter in real terms with no successful reps in tech, and this was presented as a 20 trillion dollar success (the difference in capitalization now and then).\n\nMental distortions, AI hallucinations, pure idiocy, baybucks and highly concentrated insanity are the ingredients of a 20 trillion success and nothing more. Someone dreamed that they started growing at the economic boom rate of the 90s, when in reality it’s stagnation with a downward slope on a high base.\n\nThis is no longer in the field of economics, it is pure psychiatry and social engineering. The results in 2024 are worse than 2022, and the elation is as if one has teleported to an alternate universe of magical dreams, a fairy tale utopia AI world and incredible cash flows that don’t exist.\n\nIs it true that technology is showing an increase in profits? Yes, it’s true. A historic high in absolutes and high growth rates, yet everyone else is in severe decline by their own calculations based on company reports: \n\n- Trading: +10.7% y/y and +43.5% for 2Q24, and for 1H24 +11.6% y/y and +44.2% for two years (further in the sequence shown).\n\n- Medical: +38.9% and -22.2% / -19.5% and -44.9% (!)\n\n- Consumer Discretionary: -23.6% and -2.1% due to Warner Bros. 10 bln loss / -8.7% and +0.7%.\n\n- Industrials: +4.4% and +4.7% / -9.3% and +10.3%.\n\n- Commodities and utilities: -13% and -52.1% / -21.1% and -33.9% (!)\n\n- Transportation and communications: +37.5% and +0.1% / +10% and -5.8%.\n\n- Technology: +22.8% and +38.9% / +30.7% and +24%.\n\nThese data, please note, are at par! If we compare 1H24 to 1H22, three sectors are in the negative (medical, raw materials and transportation, communications), two are in the zero (consumer discretionary and industrials) and only two sectors are in the plus (technology and trade due to Amazon).\n\nThere are literally 10 tech companies in good profit, everyone else is very bad. But everyone else is on the hai (look it up).",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmkcdqq/",
      "created": 1726034011,
      "depth": 0,
      "replies": [
        {
          "id": "lmkecpe",
          "score": 2,
          "body": "Interesting tech stocks are doing well when so many emerging tech funds like ARKK took a dump. Thank you for the info, I will look more closely at the sectors!",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmkecpe/",
          "created": 1726035214,
          "depth": 1,
          "replies": [
            {
              "id": "lw7kos2",
              "score": 1,
              "body": "Chronicles of Market Madness\n\nTook 6,000 points on the S&P 500. It was understood that it would try, but it was tried in just 4 days of growth on very high trading volumes - 1.5 times higher than usual. \n\nUsually high turnovers occur during quarterly expiration conditions (September and March this year) or during a major collapse (August 5-6, 2024), but even more rarely ... when a local high is forming. \n\nThe last time there was comparable volume on an isthay breakout was in December 2021 when a high was formed, then the market fell about 25% for a year. \n\nThe market rose 5.55% from Monday’s low to Friday’s high. The last time it happened was on 27.12.2021 (5.75%) at the moment of maximum formation. Another indicative breakout was 03.24.2000 (7.21%) and then the market formed the peak of the dotcom bubble, the high was updated only at the end of 2007 and consolidated 6 years later (more than 13 years of recovery attempts).\n\nDuring the week 3 trillion of capitalization or +5.2% of market growth was created by 614 companies with 48.3 trillion of total capitalization. \n\n●The top 100 companies contributed 2.2 trillion in gains with a combined capitalization of 34.8 trillion.\n\n●The top 50 companies contributed 1.87 trillion in incremental capitalization to the entire market with a total capitalization of 28.8 trillion. \n\nThe top 5 companies contributed 837 bln: Nvidia - 317 bln, Tesla - 222 bln, Google - 101 bln, Microsoft - 100 bln, Amazon - 96.5 bln.\n\nOver 1,000 companies (a quarter of all US public companies) showed a combined decline of 252bn, with a capitalization of 7.7 trillion, or about 12.5% of the entire market by capitalization. The leaders of the decline by scale were: Johnson & Johnson - 12.3 bln, Philip Morris and Pfizer - 10 bln, AbbVie - 8.6 bln.\n\nThe major contributors to the market growth pattern were:\n\n- Technology: 1.37 trillion or +6.4%, contributing 46% of the total market growth or 2.4 p.p. to the overall growth of 5.2%\n\n- Finance: 438bn or +6.2%, contributing 14.7% or 0.76pc.\n\n- Business & Industry: 363 bln or +5.5%, contributing 0.63 p.p.\n\n- Consumer Staples: 326 bln or +5.7%, contributing 0.56 p.p., but Tesla alone contributed 222 bln, and non-durable consumer goods were down 0.3% or minus 8 bln.\n\n- Commerce: 234bn or +4.4% contribution was 0.41pc, where Amazon contributed almost 100bn. \n\n- Healthcare: 122bn or +2%, contribution was 0.21p, biotech and pharma were mostly down.\n\n- Commodities & Utilities: 69bn or +1.9%, 0.12pc contribution, where utilities declined and growth was generated by oil & gas and metals.\n\n- Transportation & Communications: 55 bln or +3.3%, 0.09 p.p. contribution.\n\nThe breakout of the isthmus with record momentum at very high rates and the market rising broadly is a reversal pattern, just as it was in the bubble of 2021, 2000 and 1929.",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lw7kos2/",
              "created": 1731131560,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmmb17t",
      "score": 2,
      "body": "IBD is a good resource for info on stocks / companies.  No I don’t work for them but I subscribe.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmmb17t/",
      "created": 1726069161,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmbzvyn",
      "score": 2,
      "body": "Sure. As long as one of those \"companies\" is an ETF",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbzvyn/",
      "created": 1725914034,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmbmpxp",
      "score": 1,
      "body": "Yes. Use etf's for broad market stuff. Start with just a couple single stocks. The roi on small investments sucks compared to the work required to make and monitor good picks.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbmpxp/",
      "created": 1725909924,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmbyieh",
      "score": 1,
      "body": "It's better not to invest in individual stocks. I would advise anyone starting to invest to split their money between VTI and AGG, rebalance quarterly at most, and invest in individual stocks in smaller, incremental amounts.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbyieh/",
      "created": 1725913606,
      "depth": 0,
      "replies": [
        {
          "id": "lmcfb2g",
          "score": 0,
          "body": "I put a third of my money in asts, a third in lunr and a third In rklb",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmcfb2g/",
          "created": 1725918947,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmc0c8d",
      "score": 1,
      "body": "Yes.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmc0c8d/",
      "created": 1725914177,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmca87c",
      "score": 1,
      "body": "I consider my method good for an individual. \n\nA core of a few (sometimes industry centric) ETFs.  And a select few individual stocks   because they need time and research to keep from blindsiding you. \n\nIf you have lots of time, you can justify more individual stocks",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmca87c/",
      "created": 1725917300,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmcjuu4",
      "score": 1,
      "body": "Every era there is people win big in those attempts or step over the wall street bet it happens on a daily basis. While there is a lot more who lost the gamble. \n\nI mean if you are 60 and are holding the big 7. You chance to end well if not win big is pretty good. If you are 25. I don’t know, Apple can go crazy next 10 20 years like they did back in the 90s then it become a penny stock who knows. Longer term go with broad spectrum is lower risk",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmcjuu4/",
      "created": 1725920509,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmd6ds6",
      "score": 1,
      "body": "As Buffet says, you only have so many good ideas.  If I were to start again with a few thousand dollars, I'd probably dollar cost average into a low expense ETF like SPY until I could grow it to 50-100K.  That way you own a small piece of 500 companies.  While building, I'd do research and fundamental analysis so I'd have conviction in a few good tickers once the pie grows...",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmd6ds6/",
      "created": 1725928656,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmduykh",
      "score": 1,
      "body": "I don’t have any more than 3% of my portfolio in any one company and even then I’m mixing in like 33% blue chips, 33% etf, and then mid-range risk at like 24% so high risk stocks make up 10% of my portfolio. But it’s up to you. I diversify so I don’t die. I get bad anxiety. So the aim is not to lose. \n\nSome people want to put it all on 3 companies they believe in and let it roll. Just don’t gamble for the sake of it. Have sound reasoning for your choices, like build a case for them, and then keep your risk/loss level to something that won’t negatively impact your life.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmduykh/",
      "created": 1725938032,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lme6fx8",
      "score": 1,
      "body": "No",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lme6fx8/",
      "created": 1725943644,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmen8np",
      "score": 1,
      "body": "Yes IMO. If you're going to try your hand at stock picking, you should be fully educated on what you're buying, which is difficult to do once you're beyond a double digit number of companies.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmen8np/",
      "created": 1725954457,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmfa668",
      "score": 1,
      "body": "If you start with individual stocks you need to deep dive into these companies and keep up to date with whatever is happening with them (and their competitors, potentially changing legislation in the field in any country they have major activitioes in, other factors that might affect the business like geopolitical issues, etc.). Time is limited. You will not be able to find enough time to do this for a large amount of companies.\n\n  \nIf you're thinking about throwing money at individual companies because \"youtuber X told me so\" or \"I like their name/they seem to be hot right now\"...then: don't. Stick to ETFs. Investing into individual stocks takes *serious* effort if you want to have a decent chance of not burning your money.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmfa668/",
      "created": 1725969077,
      "depth": 0,
      "replies": [
        {
          "id": "lmg2ede",
          "score": 1,
          "body": "No, no youtubers and nothing hot right now I'm aware of, just trying to educate myself",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmg2ede/",
          "created": 1725979795,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmfhnoo",
      "score": 1,
      "body": "You can try M1 Finance if you want to test a lot of stocks for the long run. It charges $3 monthly fee if account is below 10k though.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmfhnoo/",
      "created": 1725972343,
      "depth": 0,
      "replies": [
        {
          "id": "lmg2rnp",
          "score": 1,
          "body": "I have Fidelity. Does M1 do anything differently?",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmg2rnp/",
          "created": 1725979915,
          "depth": 1,
          "replies": [
            {
              "id": "lmi6ssl",
              "score": 2,
              "body": "Dynamic rebalance, automatically buy the underweighted ones. The pie interface is easier to see what the weights are of all the stocks or ETFs you invest, and the holding tab is easier to see % gain compared to the ones in the same pie. That's about it for me.",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmi6ssl/",
              "created": 1726003954,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmg8kmt",
      "score": 1,
      "body": "Investing in individual stocks, especially as a beginner, is not recommended because it is an uncompensated risk- your portfolio is at higher risk of significant losses, but it does not boost expected returns.\n\nA good approach would be to invest 90-95% in a diversified ETF like VT, and then for the remaining 5-10%, invest in a few individual companies you know well and have a good reason to believe they will outperform.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmg8kmt/",
      "created": 1725981810,
      "depth": 0,
      "replies": [
        {
          "id": "lmgb732",
          "score": 1,
          "body": "Yes, that's the plan.",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmgb732/",
          "created": 1725982650,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmhpm1g",
      "score": 1,
      "body": "Never bet with 1 fund. Do not care it is entire market or 1 stock.  Learned long ago to hedge should market tank. I personally prefer different sectors. Betting some sectors will do better than others.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmhpm1g/",
      "created": 1725998581,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmi3k1t",
      "score": 1,
      "body": "There are services like Seeking Alpha and Simply Wall Street where they do help you understand stock data.\n\nAlso, let me beat the SA is only trying to sell you articles, sigh. It's no wonder why they are struggling with their portfolio. For $99 a year. They have the info for nearly every company on their site. They break down how they are fair in the sectors and sub sectors and the sentiment. They have Wall Street, Quant, and their own metrics to rate stocks. It's so much data that you have in one location.\n\nThey also provide you with alerts that you may not be aware of (even with all the homework).\n\nIn my opinion it's a good resource. Simply Wall Street is cheaper, especially when holidays occur as they give you discounts. It is easier to use vs. SA if you are a new investor.\n\nFYI - I made numerous mistakes over the seven years of investing. At one point, I was down a little over 80%. My all-time high was 425%. It's currently 353.34%. All long-term investing/no options. Guess I'm doing something right.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmi3k1t/",
      "created": 1726002904,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmiv19j",
      "score": 1,
      "body": "Do you know these companies inside out and truly understand their business models, the business models of competitors, outlook for the industry and what impacts your base case, and most importantly have (public) information that differentiates your view versus what’s already priced into the market? I’m assuming you’re doing this down cap otherwise the latter point is highly highly unlikely. If you’re not an expert I’d say you’re better off diversifying. If you want just a few names with no real knowledge then that’s called gambling and can also work but risk is different. Is this a long only deal? There’s a lot to consider here but based on how you asked the question I’d be wary of putting all your money into 2 companies. It could payout sure but then without that research how do you know if you continue to reinvest or redeploy and into what etc etc etc. good luck!",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmiv19j/",
      "created": 1726012554,
      "depth": 0,
      "replies": [
        {
          "id": "lmj0n07",
          "score": 2,
          "body": "Yeah I am already diversified and plan to do even more. I have ETFs and retirement account/Roth IRA. I definitely don't know about all of these companies, but I am willing to spend the time and energy to learn. I do consider it gambling, even if you already know about the companies, picking stocks is never a guarantee. But I want the best odds possible for sure.",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmj0n07/",
          "created": 1726014636,
          "depth": 1,
          "replies": [
            {
              "id": "lmj3x4u",
              "score": 2,
              "body": "Wishing you the best! 100% agree. Absolute worst is spending lifetimes on this shit then being wrong and realizing those losses. Been there done that. God speed",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmj3x4u/",
              "created": 1726015851,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmlxsn4",
      "score": 1,
      "body": "Less is more! Pick a few companies you have researched and believe in and invest in those. Don’t over complicate it.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmlxsn4/",
      "created": 1726064881,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmbr2jq",
      "score": 1,
      "body": "Definitely build small positions on a couple of companies and slowly diversify as your positions grow too large. Warren Buffett and Charlie Munger are big fans of concentrated portfolios for those who understand the risks and are willing to put in the effort. I currently have 5 companies making up 50% of my total portfolio, the rest split up into different asset classes. My stock however is 100% in those 5 companies. As your portfolio grows, you will need to diversify more but if you're going to invest in individual stocks, you should definitely concentrate first, then split out",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbr2jq/",
      "created": 1725911299,
      "depth": 0,
      "replies": [
        {
          "id": "lmbu8vd",
          "score": 1,
          "body": "Okay so that's how you started? Some ETFs and then branched out from there? How do you know when your position is too large?",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbu8vd/",
          "created": 1725912288,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmbhdac",
      "score": -8,
      "body": "Just buy $VOO, you wont beat the market. i 100% promise you.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbhdac/",
      "created": 1725908201,
      "depth": 0,
      "replies": [
        {
          "id": "lmbhr5k",
          "score": 9,
          "body": "Just a reminder that you are commenting on /r/stocks",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbhr5k/",
          "created": 1725908326,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmbj052",
          "score": 5,
          "body": "Can this sub just ban talk about index funds? Not that they aren’t a sound investing strategy, but the whole point of this sub is to discuss stocks. \n\nIf you wanna circlejerk about VOO, go to r/investing, r/bogleheads, r/ETFs, etc.",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbj052/",
          "created": 1725908730,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmbjp68",
          "score": 3,
          "body": "r/bogleheads is that way ->",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbjp68/",
          "created": 1725908955,
          "depth": 1,
          "replies": [
            {
              "id": "lmbkmre",
              "score": 1,
              "body": "No, I meant that as “he doesn’t have enough knowledge to beat the market”\n\nBogleheads is the general broad idea that it’s impossible to beat the market.",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbkmre/",
              "created": 1725909252,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lmbht2n",
          "score": 0,
          "body": "I plan to! But you don't recommend ever investing in any individual stocks on top of VOO?",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbht2n/",
          "created": 1725908343,
          "depth": 1,
          "replies": [
            {
              "id": "lmby8ib",
              "score": 0,
              "body": "I personally wouldn't.   It's incredibly hard to beat the market.   Read about that Warren Buffet bet (a million dollar bet) he had versus other professional investors.   The bet was they would not outperform the market over something like a 10 year span.   Spoiler: he won the bet.   S&P was the superior play.   \n\nIt's a very tiny percentage of stocks that end up carrying the whole index.   What are the odds that you will pick the correct stocks?    \n\nOn top of that, consider the opportunity cost of doing all the work so that maybe you break even or slightly with or beat an index over a long time period.    You spent all that time doing research that could have been spent with your family, learning an instrument, getting into shape, developing a hobby, traveling, etc.   And again... even after all that work, you aren't likely to do better than the index.\n\nIt really is fantastic that the lazy approach happens to be better for most people.   Remember, most folks don't tell you about all their poor picks.   \n\nRemember that when a thing looks good, the goodness of that thing may already be priced into the stock, limiting the upside.   \n\nAll these are reasons to be happy with your real 5-7% return from an index.   If you want to get rich, focus on career choices that will bump your income, and save a lot.",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmby8ib/",
              "created": 1725913522,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmbh68f",
      "score": -4,
      "body": "No this adds unnecessary risk to a portfolio that cannot handle as much volatility drawdown. You’re better off building a foundational portfolio of index tracking funds before you add what is mathematically unnecessary risk exposure.",
      "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbh68f/",
      "created": 1725908140,
      "depth": 0,
      "replies": [
        {
          "id": "lmbhlcb",
          "score": 1,
          "body": "Okay, so I am investing in a 401K, roth IRA, and HSA, so taking that into consideration is it still too much exposure? Or would it be better to do VOO and things like that before drilling down into a few companies?",
          "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbhlcb/",
          "created": 1725908274,
          "depth": 1,
          "replies": [
            {
              "id": "lmbitww",
              "score": 4,
              "body": "Here’s what I would recommend to someone who wants to speculate on individual stocks- use no more than 5% of your total portfolio value on your speculating. The other 95% should remain conservative. If you’re playing around with that 5% and find yourself consistently losing trades, you’re going to thank me you didn’t spend any more money trying to pretend to be a trader. If you take that 5% and double it, you have more gambling money to play with and leave it at that. It costs more money over the long run losing trades earlier in your investing history as you lose compounded future value.",
              "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbitww/",
              "created": 1725908674,
              "depth": 2,
              "replies": [
                {
                  "id": "lmbjcmi",
                  "score": 2,
                  "body": "This is sound advice, thank you",
                  "permalink": "/r/stocks/comments/1fcx3qf/if_you_are_starting_out_with_individual_stocks_is/lmbjcmi/",
                  "created": 1725908841,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}