{
  "title": "JPMorgan shares drop 7% after bank cuts guidance on interest income and expenses ",
  "score": 123,
  "selftext": "JPMorgan Chase shares fell 7% Tuesday after the bank’s president told analysts that expectations for net interest income and expenses in 2025 were too optimistic.\n\nWhile the bank expects to be in the “ballpark” of the 2024 target for NII of about $91.5 billion, the current estimate for 2025 of about $90 billion “is not very reasonable” because the Federal Reserve is cutting interest rates, JPMorgan president Daniel Pinto said at financial conference.\n\n“I think that that number will be lower,” Pinto said. He declined to give a specific figure.\n\nThe stock move was the New York-based bank’s worst drop since June 2020, according to FactSet. JPMorgan, the biggest U.S. bank by assets, has been a winner among lenders in recent years, benefiting from better-than-expected growth in NII as the bank gathered more deposits and made more loans than expected. But skittish investors are now concerned about the outlook for a bellwether banking stock.\n\nNII, one of the main ways banks make money, is the difference in the cost of a bank’s deposits and what it earns by lending money or investing it in securities. When interest rates decline, new loans made by the bank and new bonds it purchases will yield less.\n\nFalling rates can help banks in the sense that customers will slow the rotation out of checking accounts and into higher-yielding instruments like CDs or money market funds. But they also make new assets lower yielding, which complicates the picture.\n\n“Clearly, as rates go lower, you have less pressure on repricing of deposits,” Pinto said. “But as you know, we are quite asset sensitive.”\n\nWhen it comes to expenses, the analyst estimate for next year of roughly $94 billion “is also a bit too optimistic” because of lingering inflation and new investments the firm is making, Pinto said.\n\n“There are a bunch of components that tell us that probably the number on expenses will be a bit higher than what is expected at the moment,” Pinto said.\n\nSource: https://www.cnbc.com/2024/09/10/jpmorgan-chase-shares-drop-nearly-7percent-after-bank-tempers-guidance-on-net-interest-income.html",
  "link_flair_text": null,
  "id": "1fdmktz",
  "num_comments": 18,
  "created_utc": 1725986850,
  "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/",
  "comments": [
    {
      "id": "lmgr02h",
      "score": 44,
      "body": "I’d nibble on this if it falls much more. The bank is super secure and highly profitable with rates falling, making its HTM securities profitable also. Meanwhile it trades around sector average for banking. \n\nNot gonna make you much money even compared to SP500 but probably safer on downside.",
      "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmgr02h/",
      "created": 1725987668,
      "depth": 0,
      "replies": [
        {
          "id": "lmh23vo",
          "score": 40,
          "body": "> I’d nibble on this if it falls much more. \n\nmy man, its still up 19% YTD and 42% in a 12 month period..",
          "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmh23vo/",
          "created": 1725991178,
          "depth": 1,
          "replies": [
            {
              "id": "lmh7t2r",
              "score": 29,
              "body": "For this sub inception is today, and every drop below ATH is a big dip.\n\nIf you didn’t buy JPM at $140 - a year ago - stfu about investing and opportunities. It was bad at $140, but incredible buy at $200.",
              "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmh7t2r/",
              "created": 1725992986,
              "depth": 2,
              "replies": [
                {
                  "id": "lmi07m8",
                  "score": 6,
                  "body": "I bought a bunch back then and have held since \n\nSomehow done better than my Google despite growing slower, with less profit growth, and lower margins. \n\nBut hey the market is all-seeing!",
                  "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmi07m8/",
                  "created": 1726001837,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmh8otm",
                  "score": 0,
                  "body": "> If you didn’t buy JPM at $140 - a year ago - stfu about investing and opportunities.\n\n\ni bought it near the bottom in 2020. but this is completely irrelevant to my original comment.\n\n\n\n\n>It was bad at $140, but incredible buy at $200.\n\n\nwhat is your thesis for this? what do you know that the market doesnt?",
                  "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmh8otm/",
                  "created": 1725993268,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmhap5k",
                      "score": 15,
                      "body": "He’s being sarcastic",
                      "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmhap5k/",
                      "created": 1725993902,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lmk6l1e",
              "score": 4,
              "body": "Absolutely agree.  The bank is not cheap at all. I mean even Jamie Dimon said that its expensive and did the first sale (not a small amount) in like 8 years.   \nBanks are hard to valuate, but from all the metrics its highly valued, maybe overvalued.  \nWe are talking about 2% dividend yield for a bank which is insane.",
              "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmk6l1e/",
              "created": 1726030729,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lmgtz2y",
          "score": 3,
          "body": "Plus the buy backs.\n\nI got BAC today for a swing. Should be around $40.\n\nBoth doing $20-30 billion buy backs everytime they are allowed by regulators.",
          "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmgtz2y/",
          "created": 1725988618,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmizkyo",
          "score": 1,
          "body": "> Not gonna make you much money even compared to SP500 but probably safer on downside.\n\nEspecially given how tech-weighted SP500 returns are",
          "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmizkyo/",
          "created": 1726014245,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmmh4my",
          "score": 1,
          "body": "> highly profitable with rates falling\n\nrates falling is bad for banks.",
          "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmmh4my/",
          "created": 1726071110,
          "depth": 1,
          "replies": [
            {
              "id": "lmnh6ng",
              "score": 3,
              "body": "Only if it’s rapid. For the most part they benefit since they own so much HTM dogshit yielding 2% from 2021",
              "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmnh6ng/",
              "created": 1726082595,
              "depth": 2,
              "replies": [
                {
                  "id": "lmnkyde",
                  "score": 1,
                  "body": "interesting",
                  "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmnkyde/",
                  "created": 1726083801,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lmjsw6k",
      "score": 4,
      "body": "I would sell 2 * 180 put Nov expiry and make 500 bucks and if it drops 180 is my perfect cost",
      "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmjsw6k/",
      "created": 1726024578,
      "depth": 0,
      "replies": [
        {
          "id": "ln5f0sv",
          "score": 2,
          "body": "smart, I got 2 put credit spreads right at 205 lol",
          "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/ln5f0sv/",
          "created": 1726349782,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmiup0t",
      "score": 2,
      "body": "7% was amazing. added more.",
      "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmiup0t/",
      "created": 1726012429,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmkc9xh",
      "score": 1,
      "body": "How to cheat the market of 20 trillion?\n\nOver two years (1H24 to 1H22), net income of US public non-financial companies declined by 1.5% at par and fell by 7.9% on an inflation-adjusted basis. \n\nMeanwhile, moderate stagnation with a downward trajectory was driven by the strong performance of technology companies, i.e. excluding technology and trading (Amazon factor), profits collapsed 18% at par and 23.3% when adjusted for inflation. \n\nAt the same time, the US market was balancing in the 3600-3800 range with a break to 3500 points (1H22 reports were known, as they are now for 1H24).\n\nProfits were down by a quarter in real terms with no successful reps in tech, and this was presented as a 20 trillion dollar success (the difference in capitalization now and then).\n\nMental distortions, AI hallucinations, pure idiocy, baybucks and highly concentrated insanity are the ingredients of a 20 trillion success and nothing more. Someone dreamed that they started growing at the economic boom rate of the 90s, when in reality it’s stagnation with a downward slope on a high base.\n\nThis is no longer in the field of economics, it is pure psychiatry and social engineering. The results in 2024 are worse than 2022, and the elation is as if one has teleported to an alternate universe of magical dreams, a fairy tale utopia AI world and incredible cash flows that don’t exist.\n\nIs it true that technology is showing an increase in profits? Yes, it’s true. A historic high in absolutes and high growth rates, yet everyone else is in severe decline by their own calculations based on company reports: \n\n- Trading: +10.7% y/y and +43.5% for 2Q24, and for 1H24 +11.6% y/y and +44.2% for two years (further in the sequence shown).\n\n- Medical: +38.9% and -22.2% / -19.5% and -44.9% (!)\n\n- Consumer Discretionary: -23.6% and -2.1% due to Warner Bros. 10 bln loss / -8.7% and +0.7%.\n\n- Industrials: +4.4% and +4.7% / -9.3% and +10.3%.\n\n- Commodities and utilities: -13% and -52.1% / -21.1% and -33.9% (!)\n\n- Transportation and communications: +37.5% and +0.1% / +10% and -5.8%.\n\n- Technology: +22.8% and +38.9% / +30.7% and +24%.\n\nThese data, please note, are at par! If we compare 1H24 to 1H22, three sectors are in the negative (medical, raw materials and transportation, communications), two are in the zero (consumer discretionary and industrials) and only two sectors are in the plus (technology and trade due to Amazon).\n\nThere are literally 10 tech companies in good profit, everyone else is very bad. But everyone else is on the hai (look it up).",
      "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmkc9xh/",
      "created": 1726033949,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmicgbu",
      "score": -3,
      "body": "There is a pattern of people who are willing to play the far right fiddle for some good old protectionism.\n\n\nNot investing in the stock, just good old empathic satisfaction.",
      "permalink": "/r/stocks/comments/1fdmktz/jpmorgan_shares_drop_7_after_bank_cuts_guidance/lmicgbu/",
      "created": 1726005848,
      "depth": 0,
      "replies": []
    }
  ]
}