{
  "title": "How does the Russell 2000 outperform the S&P 500.",
  "score": 41,
  "selftext": "I'm new to the stock market and I'm trying to learn about how the Russell 2000 outperforms the S&P.\n\nI am looking at all these graphs showing the S&P with better rate of return percentages. Why does everyone keep saying the Rus2000 is doing better when the graphs are saying the opposite?",
  "link_flair_text": null,
  "id": "1fduso6",
  "num_comments": 45,
  "created_utc": 1726007291,
  "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/",
  "comments": [
    {
      "id": "lmj19kq",
      "score": 50,
      "body": "The typical r.2000 company has more debt.  Fed lowering rates means high debt companies will now pay less debt, more money goes to the bottom line, stock value goes up faster.  Theoretically at least.  A Lotta trash in the Russell tho.",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmj19kq/",
      "created": 1726014868,
      "depth": 0,
      "replies": [
        {
          "id": "lmq6jxu",
          "score": 6,
          "body": "A lot of trash in the S&P 500 too",
          "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmq6jxu/",
          "created": 1726121283,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmo96ij",
          "score": 3,
          "body": "The not-trash Russell companies tend to end up leaving the Russell",
          "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmo96ij/",
          "created": 1726091672,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmocoi5",
          "score": 1,
          "body": "They also compromise much smaller companies. A small move for a smaller company is a larger percentage than a large company.",
          "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmocoi5/",
          "created": 1726092914,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmruadt",
          "score": 1,
          "body": "You can avoid the trash by applying a profitability screen, there are funds like AVUV that do this",
          "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmruadt/",
          "created": 1726152428,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmiii7m",
      "score": 61,
      "body": "You need to look longer term, like decades back. Most early records of stock markets go back to the early 1900s. S&P’s dominance is largely from the couple of decades if I remember correctly.",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmiii7m/",
      "created": 1726007990,
      "depth": 0,
      "replies": [
        {
          "id": "lmj16jk",
          "score": 33,
          "body": "This is correct. Fama and French found that size was one of the most meaningful factors for returns. The s&p500 has recently dominated the r2k; whether this is sustainable is unclear (I think it is unlikely).",
          "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmj16jk/",
          "created": 1726014837,
          "depth": 1,
          "replies": [
            {
              "id": "lmj1umk",
              "score": 32,
              "body": "So what you are saying is size DOES matter.",
              "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmj1umk/",
              "created": 1726015086,
              "depth": 2,
              "replies": [
                {
                  "id": "lmj30d1",
                  "score": -1,
                  "body": "From first hand experience: Yes!",
                  "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmj30d1/",
                  "created": 1726015516,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lml5ig0",
                      "score": 3,
                      "body": "Strong username to post content ratio",
                      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lml5ig0/",
                      "created": 1726053478,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lmotewp",
                      "score": 2,
                      "body": "“first hand experience”",
                      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmotewp/",
                      "created": 1726099166,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lmj9g1c",
              "score": 16,
              "body": "I think it is likely, on account of lists falling from the S&P to the Russel, and the winners being promoted to the S&P. It's like soccer leagues where the best teams get promoted and the worst get relegated. You'll never amass talent in the lower league for long.",
              "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmj9g1c/",
              "created": 1726017906,
              "depth": 2,
              "replies": [
                {
                  "id": "lmjapxy",
                  "score": 5,
                  "body": "The R2k is a “flawed” index - many companies are unprofitable so - but combining size premium with other factors I expect will beat the S&P 500 over time.\n\nOf course, it’s easier to grow small entities by a greater %, and less mature companies have more levers to pull.",
                  "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmjapxy/",
                  "created": 1726018330,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lmjy94f",
              "score": 8,
              "body": "I think we are moving into an Era where megacorps will dominate most sectors of business while small businesses will slowly fade. AI and automation will prove to be a massive boon to large scale operations and smaller groups will slowly fail or be eaten. We see this happening already, especially with amazon. \n\n\nThe justice department anti trust unit doesn't let them go after the entire share in their main segment, so they buy and expand into new areas. Amazon has gotten into grocery and pharmacy recently and even finance/banking",
              "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmjy94f/",
              "created": 1726026751,
              "depth": 2,
              "replies": [
                {
                  "id": "lmkscg3",
                  "score": 7,
                  "body": "Sure but following your example, Amazon et al. are not starting most of these services in-house. There is generally a smaller entity which grows at a rate which is hard to imagine Amazon matching.\n\nSmaller businesses will still be able to scale from ai, and also have more basic operational levers to pull/improve. LMM PE, which has less amateur investors than public markets, still reflects this logic.\n\nI think we are just in a temporary psychological/behavioral bias driven by self directed 401ks and dilettantish boglehead thought. People piling into just the S&P 500/growth/all passive investments don’t really know what they’re doing imo - it’s certainly not sophisticated - and the increasing prevalence is making price discovery less efficient.",
                  "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmkscg3/",
                  "created": 1726044996,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmmk7tx",
                  "score": 2,
                  "body": "How do you think mega caps are getting these technologies? They’re not making them in-house.\n\nIf anything I think AI will be *more* lucrative for small caps. Mega cap money will be flowing to them either by sales or by buy-outs, and margins will be high.",
                  "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmmk7tx/",
                  "created": 1726072103,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lmj9ild",
              "score": 4,
              "body": "You had me at Fama and French bae.",
              "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmj9ild/",
              "created": 1726017933,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lmoh7rp",
              "score": 1,
              "body": "How is this? I get confused with value and growth stocks, that cheaper stocks (if you own them) can return more than big companies. And somehow there the factor investing comes up?\n\nDo you know how that works?",
              "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmoh7rp/",
              "created": 1726094585,
              "depth": 2,
              "replies": [
                {
                  "id": "lmomw5b",
                  "score": 1,
                  "body": "Your question is slightly confusingly worded and I’m not willing to distill dozens of white papers into what will still be a lackluster elucidation. I’m not an expert on factor investing. A rough overview is below and I can point you to white papers if you pm.\n\nGrowth and value I would basically consider styles not factors.\n\nGrowth investing is akin to the Silicon Valley thought, if you’ve ever seen that: profits don’t really matter, just growing the top line of the income statement matters. I consider the top line a meaningful metric in stock picking, but not an indicator of value, and I think this style of investing will lead to difficulties in price discovery - random walk stuff. This is the people that just keep piling into nvda.\n\nValue investing is focused more on the bottom like - profits and cash flows - or relative valuations based on size, invested capital, etc. It’s the Buffett style of investing.\n\nFama and French are academics who looked at overall explanations of returns. We once believed that beta explained everything. This was far from correct. f&f, over decades, advanced new models several times. They’re generally pretty hard to challenge imo, though as they approach their 5 factor ideas maybe some factors become apparently less meaningful.\n\nStill, factors are basically our explainers of returns, and research indicates factors work best when integrated into a single portfolio. BlackRock generally uses a 5 factor model I believe. AQR, DFA, many other managers also offer factor models. These may be considered active, semi active, or smart beta. Maybe there are some “factor indices” I’m unaware of, but I would not call these strategies indexed or passive like an S&P 500 etf.",
                  "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmomw5b/",
                  "created": 1726096700,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lmj4svy",
          "score": 9,
          "body": "I wonder if it has dominated since 1978 and onwards, the advent of the 401k.",
          "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmj4svy/",
          "created": 1726016172,
          "depth": 1,
          "replies": [
            {
              "id": "lmjgjpg",
              "score": 7,
              "body": "This, it all has to do with money flows. More money flows into the S&P500 because more funds are able to invest in it based on their mandate.",
              "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmjgjpg/",
              "created": 1726020285,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmj2i0a",
      "score": 18,
      "body": "Small caps benefit from a high gdp economy, lots of consumer spending. US gdp growth has slowed down in the last 40 years, hence the underperformance. Furthermore, in a slow growth low interest rate economy like the 2010s decade, high growth companies outperform, which the sp500 is heavily weighted towards. \n\nWhether or not these conditions will persist in the future will determine whether or not small cap outperforms. Nevertheless, small caps are not priced to outperform so you have some margins of error there",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmj2i0a/",
      "created": 1726015327,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmjhw6g",
      "score": 11,
      "body": "Theoretically the upcoming rate cuts are more favourable for small caps, so some people expect r2000 to outperform sp500 after entering a rate cutting cycle",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmjhw6g/",
      "created": 1726020721,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmiiye4",
      "score": 28,
      "body": "it doesn't, and the russell 2000 isn't a serious investment\n\nits a gamble or a bet at a specific time that small caps in that bucket are undervalued relative to the rest of the market, companies it contains are removed once they appreciate and enter the top 1000",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmiiye4/",
      "created": 1726008156,
      "depth": 0,
      "replies": [
        {
          "id": "lmj4vnn",
          "score": 12,
          "body": "Agreed IWM is a better tool for trading than long term investing. \n\nRussell 2000 has a built in disadvantage, because the companies that grow and perform well graduate out of the index and companies that struggle fall into the index. Compared to SPY where companies performing poorly will fall out of the index and growing companies that are performing well graduate into it. \n\nIWM will surely outperform SPY at times in a market cycle, but it’s not better for long term holds",
          "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmj4vnn/",
          "created": 1726016199,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmiu2ue",
          "score": -1,
          "body": "Yup.  I cringe everytime there’s talk of a rotation into the russell 2000.  Seems to institutional investors looking to offload their bags or pump stocks to dump.",
          "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmiu2ue/",
          "created": 1726012202,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmmjxol",
      "score": 2,
      "body": "Look at a much longer time frame",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmmjxol/",
      "created": 1726072012,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmk5k1a",
      "score": 2,
      "body": "with rate cuts and if Kamala wins ( who talk a lot about policies to benefit small business), things would looks really good for small caps!",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmk5k1a/",
      "created": 1726030203,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmimaq3",
      "score": 4,
      "body": "As you have noticed, the small caps have not outperformed the S&P500. Some talking heads and idiot journalists yammer on about small caps but the reality is far different. Maybe a few good small cap companies will outperform the S&P but which ones? The index certainly won’t",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmimaq3/",
      "created": 1726009364,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmiil4z",
      "score": 2,
      "body": "What time frame are you looking at?  The truth is small caps and large caps regularly trade off who is leading the market. Owning a broader index (like the Russel 2000 or just a total market index fund) gets you exposure to all of it, rather than just sticking with large caps in the s&p 500.\n\nhttps://www.cmegroup.com/education/featured-reports/equities-comparing-russell-2000-vs-sandp-500.html",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmiil4z/",
      "created": 1726008020,
      "depth": 0,
      "replies": [
        {
          "id": "lmijysv",
          "score": 1,
          "body": "The chart in the article doesn’t seem to show IWM is needed",
          "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmijysv/",
          "created": 1726008523,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmix6qy",
      "score": 2,
      "body": "Look at VTWO, VIOO, and VXF and compare them to VOO. Don't just focus on outperformance, but also consider risk-adjusted returns and volatility. There's a common pattern: as a whole, big companies are more stable and profitable than small companies (wait, don't riskier assets have a higher yield? Yes, within the same category, but some categories are just inherently underperforming). Suppose you understand that all large companies are essentially holding companies while small companies operate in isolation (like playing a solo co-op game). In that case, you'll realize there is no reason to believe that small-cap stocks, as a whole, can outperform large-cap or large-cap-heavy indices. Sorry small-cap value fans, but you will never win.\n\nPeople invest in individual small caps because no amount of leverage on large-cap stocks, even companies like NVDA, can replicate the explosive returns from a successful small-cap investment. But there’s a major problem: even those who have made billions from small caps typically have only one or two big winners—nobody has a consistent track record of finding small-cap winners repeatedly over the long term.\n\nTLDR: As long as the US isn't trying to be EU, large US-based internationally-operating holding companies are going to be both safer and more profitable than any trivially constructed index when accounting for risk and leverage.",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmix6qy/",
      "created": 1726013354,
      "depth": 0,
      "replies": [
        {
          "id": "lmiy0rz",
          "score": -2,
          "body": "**Even shorter TLDR:** Fund managers claiming X will cause a rotation from growth to value or large-cap to small-cap often just want you to sell your VOO stocks at a discount or buy their underperforming Y shares at an unjustified premium.",
          "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmiy0rz/",
          "created": 1726013664,
          "depth": 1,
          "replies": [
            {
              "id": "lmkzcb8",
              "score": 2,
              "body": "Or they're looking at PE And not wanting to pay 25 dollars for a buck of earnings, so they switch to value in anticipation of multiples contraction.",
              "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmkzcb8/",
              "created": 1726049896,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmkcbgr",
      "score": 2,
      "body": "How to cheat the market of 20 trillion?\n\nOver two years (1H24 to 1H22), net income of US public non-financial companies declined by 1.5% at par and fell by 7.9% on an inflation-adjusted basis. \n\nMeanwhile, moderate stagnation with a downward trajectory was driven by the strong performance of technology companies, i.e. excluding technology and trading (Amazon factor), profits collapsed 18% at par and 23.3% when adjusted for inflation. \n\nAt the same time, the US market was balancing in the 3600-3800 range with a break to 3500 points (1H22 reports were known, as they are now for 1H24).\n\nProfits were down by a quarter in real terms with no successful reps in tech, and this was presented as a 20 trillion dollar success (the difference in capitalization now and then).\n\nMental distortions, AI hallucinations, pure idiocy, baybucks and highly concentrated insanity are the ingredients of a 20 trillion success and nothing more. Someone dreamed that they started growing at the economic boom rate of the 90s, when in reality it’s stagnation with a downward slope on a high base.\n\nThis is no longer in the field of economics, it is pure psychiatry and social engineering. The results in 2024 are worse than 2022, and the elation is as if one has teleported to an alternate universe of magical dreams, a fairy tale utopia AI world and incredible cash flows that don’t exist.\n\nIs it true that technology is showing an increase in profits? Yes, it’s true. A historic high in absolutes and high growth rates, yet everyone else is in severe decline by their own calculations based on company reports: \n\n- Trading: +10.7% y/y and +43.5% for 2Q24, and for 1H24 +11.6% y/y and +44.2% for two years (further in the sequence shown).\n\n- Medical: +38.9% and -22.2% / -19.5% and -44.9% (!)\n\n- Consumer Discretionary: -23.6% and -2.1% due to Warner Bros. 10 bln loss / -8.7% and +0.7%.\n\n- Industrials: +4.4% and +4.7% / -9.3% and +10.3%.\n\n- Commodities and utilities: -13% and -52.1% / -21.1% and -33.9% (!)\n\n- Transportation and communications: +37.5% and +0.1% / +10% and -5.8%.\n\n- Technology: +22.8% and +38.9% / +30.7% and +24%.\n\nThese data, please note, are at par! If we compare 1H24 to 1H22, three sectors are in the negative (medical, raw materials and transportation, communications), two are in the zero (consumer discretionary and industrials) and only two sectors are in the plus (technology and trade due to Amazon).\n\nThere are literally 10 tech companies in good profit, everyone else is very bad. But everyone else is on the hai (look it up).",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmkcbgr/",
      "created": 1726033974,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmja187",
      "score": 1,
      "body": "Need to look at top holdings at R2000 vs S&P.   Indeed it has lately out perform. I expect at least now some small cap are performing better.  Rather than owning the index I keep a few top performers in the small cap.",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmja187/",
      "created": 1726018119,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmopexe",
      "score": 1,
      "body": "Companies in the S&P generally are profitable, Russell2K, not so much.  Russell much more interest rate sensitive so theory is there will be a or has been a rotation from large cap to Russell which is finally due to outperform.  Id sell S&P rips, accumulate larger cash position and rebuy S&P on dips rather than trust the Russell right now. Rates still historically high and many small caps are on shaky ground.",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmopexe/",
      "created": 1726097652,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmlv274",
      "score": 0,
      "body": "If you're talking recently, it's mostly driven by Mag7. Smaller companies even in the S&P500 haven't seen a ton of growth. so yes R2k has seen lower returns. many anticipate that to change as rates come down and money pivots away from big tech that's seen huge gains and towards more beaten down companies that may be very good, but have not appreciated in price the same way larger companies have in the past few years, because the growth wasn't there. earnings overall have been pretty strong. since it's what a lot of people seem to be expecting, im sure it won't go down exactly this way, but we've seen a bit of a correction in larger companies in favor of a pop in smaller companies.",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmlv274/",
      "created": 1726063957,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmmwq6b",
      "score": 0,
      "body": "Who is “everyone”?",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmmwq6b/",
      "created": 1726076068,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmijkq6",
      "score": -2,
      "body": "money rotates from big cap to small cap, based on historical data, every time small cap stocks out performed the large cap, it means recession is coming.",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmijkq6/",
      "created": 1726008381,
      "depth": 0,
      "replies": [
        {
          "id": "lmioq70",
          "score": 5,
          "body": "Every time? Out performed in how long of a period? Source?",
          "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmioq70/",
          "created": 1726010253,
          "depth": 1,
          "replies": [
            {
              "id": "lmjckl8",
              "score": 0,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmjckl8/",
              "created": 1726018966,
              "depth": 2,
              "replies": [
                {
                  "id": "lmjrfvl",
                  "score": 2,
                  "body": "That isn't what they said. They said EVERY TIME small caps outperform, recession is coming. This is patently untrue.",
                  "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmjrfvl/",
                  "created": 1726024027,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmkk0o0",
                  "score": 1,
                  "body": "Try reading before you reply.",
                  "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmkk0o0/",
                  "created": 1726038948,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lmij3py",
      "score": -3,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1fduso6/how_does_the_russell_2000_outperform_the_sp_500/lmij3py/",
      "created": 1726008210,
      "depth": 0,
      "replies": []
    }
  ]
}