{
  "title": "Oracle trails only Nvidia among large-cap tech this year, as Ellison closes in on Bezos",
  "score": 38,
  "selftext": "Larry Ellison turned 80 last month. It’s been a celebratory year.\n\nWhile fellow legacy tech players Intel and Cisco struggle to find their footing in a world driven increasingly by the promise of artificial intelligence, Oracle has emerged as a Wall Street darling.\n\nFollowing a better-than-expected [earnings report](https://www.cnbc.com/2024/09/09/oracle-orcl-q1-earnings-report-2025.html) after the close on Monday, the stock popped 11% on Tuesday. It gained more steam on Wednesday, closing at a record $157.10. Oracle has seen double-digit gains following each of its three quarterly reports this year, driven by the company’s cloud businesses. The stock didn’t have a single double-digit increase last year and had only one in 2022.\n\n“The excitement is back,” Guggenheim analysts titled their post-earnings report, highlighting “momentum across all business.”\n\nOracle shares are now up 49% this year, trailing only AI chipmaker Nvidia — up 136% — among large-cap tech stocks. The next best performer in the group is Meta, which has gained 45%.\n\nIntel, meanwhile, has lost 60% of its value and Cisco is down almost 3%. Both companies announced major layoffs in their earnings reports last month.\n\nThe biggest financial winner from Oracle’s rally is Ellison, who founded the software company in 1977 and remains chairman. He owns over 40% of the outstanding stock and has seen his net worth swell to $192 billion, according to Forbes. Only Tesla CEO Elon Musk ($251 billion) and Amazon founder Jeff Bezos ($202 billion) are wealthier.\n\nBy the standards of high-growth tech, Oracle remains fairly plodding.\n\nRevenue increased 8% in the latest quarter from a year earlier to $13.31 billion. For the current period, growth is expected to be between 8% and 10%, CEO Safra Catz said on the earnings call.\n\nSince 2011, Oracle has had only one year of double-digit revenue growth — 18% in fiscal 2023 — and four times the company has contracted.\n\n“After 13 years of single-digit organic total revenue growth, Oracle is reaccelerating into the double digits,” JMP analysts wrote in a note on Tuesday, bumping up their rating to buy from hold. “We remain very EPS confident and committed to full-year total revenue growth growing double digits.”\n\nOracle is currently in the midst of its CloudWorld conference, which wraps up on Thursday in Las Vegas. Between the earnings report and the annual event, investors are applauding the company’s cloud story, including both its infrastructure business and its databases.\n\nWhile Oracle is still way behind Amazon Web Services, Microsoft and Google in terms of cloud infrastructure market share, the business has turned into a big growth driver for the company. Revenue in the unit surged 45% in the quarter from a year earlier to $2.2 billion.\n\nIn addition to competing with the top cloud companies, Oracle is increasingly partnering with them.\n\nA year ago, Ellison visited Microsoft’s headquarters outside of Seattle for the first time, announcing a collaboration with a company he’d competed with for more than 30 years.\n\nOn Monday, Oracle said its database software will become available for AWS customers to use atop Oracle hardware sitting inside of Amazon data centers. Oracle has forged such arrangements with all three major cloud infrastructure vendors in the past year.\n\n“We believe our cloud partnerships with AWS and Microsoft and Google will turbocharge the growth of our database business for years to come,” Ellison said on Monday’s earnings call.\n\nOracle didn’t immediately provide a comment for this story.\n\n# ‘No more passwords’\n\nFor years, Ellison described Oracle’s database as “autonomous,” playing into the hype around self-driving cars (he used to be on Tesla’s board and is close with Musk) and the emergence of AI. Its product wouldn’t need manual patching and wouldn’t have downtime, and Ellison said no other cloud provider could do it. But of late he’s benefitted from playing nice.\n\nAfter years of criticizing AWS at events, Ellison decided to ensure that clients are able to use Amazon’s market-leading cloud with Oracle’s full-featured database.\n\n“Of course, customers have been able to use Oracle inside of AWS for a long time,” AWS CEO Matt Garman told CNBC in a recent interview. But the new offering will allow clients to easily sign up in the AWS marketplace of third-party software, make backups and move data to AWS analytics tools, Garman said.\n\nGarman, who replaced Adam Selipsky as AWS CEO in June, added that clients had been asking the two companies to figure out how to work more closely together.\n\nAs Ellison digs deeper into AI and enters his 81st year on the planet, he’s now taking on passwords, which he calls “utterly ridiculous” because they’re insecure and can be “easily hacked.”\n\n“This is the way log-on is going to work,” Ellison said on the earnings call. “I’m going to type in Larry.Ellison@oracle.com, the computer is going to look at me and say, ‘OK, Hi Larry.’ We’re done.”\n\nHe went on to say that Catz can recognize him as can his kids, so there’s no reason his computer shouldn’t be able to the same.\n\n“No more passwords,” he said. “Those have got to go.”\n\nSource: [https://www.cnbc.com/2024/09/11/oracle-trails-only-nvidia-among-large-cap-tech-in-2024-ellison-wins.html](https://www.cnbc.com/2024/09/11/oracle-trails-only-nvidia-among-large-cap-tech-in-2024-ellison-wins.html)",
  "link_flair_text": null,
  "id": "1feqk2z",
  "num_comments": 17,
  "created_utc": 1726103727,
  "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/",
  "comments": [
    {
      "id": "lmpe6ut",
      "score": 23,
      "body": "I want Larry Ellison’s physique at 80\n\nI’m just saying that Larry Ellison will live longer from this point than Jim Cramer.",
      "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmpe6ut/",
      "created": 1726107205,
      "depth": 0,
      "replies": [
        {
          "id": "lmpjpnr",
          "score": 15,
          "body": "you need Larry Ellison’s money",
          "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmpjpnr/",
          "created": 1726109482,
          "depth": 1,
          "replies": [
            {
              "id": "lmpjzp8",
              "score": 3,
              "body": "Oh for sure, and throw me a couple inches on the ol’ schnitzel as well. Hell, you don’t have to make it longer. Just make it look longer when it ain’t hard!",
              "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmpjzp8/",
              "created": 1726109600,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lmpm3z6",
          "score": 11,
          "body": "Plastic surgery, blood boys, hair dyes, probably a good diet. It can be achieved",
          "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmpm3z6/",
          "created": 1726110513,
          "depth": 1,
          "replies": [
            {
              "id": "lmrziy8",
              "score": 3,
              "body": "Yea lol isn’t Larry Ellison like the origin story of the tech bro health immortality shit",
              "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmrziy8/",
              "created": 1726154136,
              "depth": 2,
              "replies": [
                {
                  "id": "lmtsqxu",
                  "score": 2,
                  "body": "Tech vampires lol",
                  "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmtsqxu/",
                  "created": 1726174878,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lmqmej7",
          "score": 1,
          "body": "He can f you from behind",
          "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmqmej7/",
          "created": 1726132308,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmps7jy",
          "score": 1,
          "body": "You weren't kidding.",
          "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmps7jy/",
          "created": 1726113320,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmpjpvm",
      "score": 10,
      "body": "damn he doesn't look 80yo",
      "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmpjpvm/",
      "created": 1726109485,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmq21un",
      "score": 14,
      "body": "The fundamentals simply don’t support much higher valuation. The company exists purely because of legacy deals and GPU compute at Azure, AWS, and GCP are booked to the gills. The moment that cloud demand slows, Oracle goes first. \n\nNow I have no clue how the stock performs with this exceptionally absurd and short termist market, but Oracle quite literally trades at a 50% higher multiple than Google despite making half the margin and a third the revenue in Cloud. And that’s JUST in GCP. \n\nThe company trades how Google should trade. It simply doesn’t have the FUD discount of antitrust looming. But keep in mind it’s not a top tier cloud provider. It’s the second tier people go to because no compute is left. \n\nI bought in around $105 this year.",
      "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmq21un/",
      "created": 1726118577,
      "depth": 0,
      "replies": [
        {
          "id": "lmqw13i",
          "score": 5,
          "body": "It is a shitty tech company but it has been a shitty tech company that doesn't die or shrink or apparently do anything interesting for so long that it is considered safe. And billionaire worshippers have a hardon for Ellison",
          "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmqw13i/",
          "created": 1726138548,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmrptit",
          "score": 2,
          "body": "I think Oracle's moat is deeper. It is said that the replacement cost of databases is extremely high for IT companies, and a large number of sql scripts are not suitable for other database software, which requires a great price. It is as difficult as replacing the azure server.",
          "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmrptit/",
          "created": 1726150936,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lop9v6g",
          "score": 0,
          "body": "\"The fundamentals simply don’t support much higher valuation.\" that can be said for most of the mag7/tesla, yet too many people have their head in the sand",
          "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lop9v6g/",
          "created": 1727190809,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmqmdbm",
      "score": 3,
      "body": "Pump and dump competition heating up",
      "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmqmdbm/",
      "created": 1726132284,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmwerbh",
      "score": 1,
      "body": "YTD Return\nHOOD\n69.86%\nS&P 500\n17.32%\n1-Year Return\nHOOD\n99.63%\nS&P 500\n24.70%\n3-Year Return\nHOOD\n47.44%\nS&P 500\n25.51%\n5-Year Return\nHOOD\n43.05%\nS&P 500\n26.63%\n\nYTD Return\nORCL\n54.59%\nS&P 500\n17.32%\n1-Year Return\nORCL\n29.10%\nS&P 500\n24.70%\n3-Year Return\nORCL\n88.36%\nS&P 500\n25.51%\n5-Year Return\nORCL\n210.38%\nS&P 500\n86.47%",
      "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmwerbh/",
      "created": 1726217119,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmpb7tt",
      "score": 0,
      "body": "I don't think Ellison understands security fundamentals very well at all.",
      "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmpb7tt/",
      "created": 1726106040,
      "depth": 0,
      "replies": [
        {
          "id": "lmqozpj",
          "score": 2,
          "body": "He doesn’t need to.",
          "permalink": "/r/stocks/comments/1feqk2z/oracle_trails_only_nvidia_among_largecap_tech/lmqozpj/",
          "created": 1726134147,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}