{
  "title": "McDonald’s to extend $5 value meal offer into December in most U.S. markets",
  "score": 233,
  "selftext": "MCD rose by more than 15% since early July 2024 while US economy continues to cool off \\~\n\nExtending the value meal offer seems positive for MCD yet probably reflecting the issue arising from overall economy ...\n\n&#x200B;\n\n&#x200B;\n\n**McDonald’s to extend $5 value meal offer into December in most U.S. markets**\n\n[https://www.cnbc.com/2024/09/12/mcdonalds-to-extend-5-value-meal-offer-into-december.html](https://www.cnbc.com/2024/09/12/mcdonalds-to-extend-5-value-meal-offer-into-december.html)\n\n*Key Points*\n\n* *McDonald’s will extend its $5 value meal into December in most U.S. markets.*\n* *Franchisees have been voting on extending the value meal in their local markets, and roughly 80% of local markets have opted to extend the deal into December.*\n* *The restaurant sector focused on value this summer, as companies including McDonald’s, Burger King and even Starbucks attempted to lure consumers in with discounted offerings as diners cut back on restaurant spending.*\n\n&#x200B;\n\n*McDonald’s will extend its $5 value meal into December in most U.S. markets as it looks to win back lower-income consumers.*\n\n*Franchisees have been voting on extending the value meal, and roughly 80% of local markets have opted to extend the deal into December. Votes on extensions are ongoing, so additional locations may be added in the weeks to come.*\n\n*The value meal offers a McDouble or McChicken sandwich, small fries, four-piece chicken nuggets and a small soft drink for $5.*\n\n*Owners will also be offering local promotions in the weeks and months to come, in addition to the value bundle, the company said. Deals will also be available in McDonald’s app.*\n\n*“Together with our franchisees, we’re committed to keeping our prices as affordable as possible, which is why we’re doubling down with even more ways to save,” McDonald’s U.S. President Joe Erlinger said in a statement about the meal’s extension into December.*\n\n*The restaurant sector focused on value this summer, as companies including McDonald’s, Burger King and even Starbucks attempted to lure consumers in with discounted offerings. Diners have pulled back on their restaurant spending after years of persistent inflation.*\n\n*After McDonald’s posted declining second-quarter same-store sales in July, executives told restaurant operators and analysts the company would focus on how to recapture consumers with deals, as they pushed for an extension of the $5 value meal. The offer ran through the end of August, after 93% of restaurants had agreed to keep it on the menu following its initial four-week run in June and July.*\n\n*In a memo to the U.S. system obtained by CNBC after the July earnings report, Erlinger said McDonald’s struggled to sell diners on affordability in the most recent quarter, adding that he expects “industry and competitive challenges” to continue throughout the year. Erlinger encouraged operators to look ahead to building momentum for next year, adding that “channeling a long-term mindset is crucial” to the company’s success.*\n\n*“Reversing the narrative and re-establishing our position as the leader on value and affordability is possible, but it cannot be done overnight,” he wrote at the time. “It will happen through sustained and coordinated actions that show the customer we’re on their side.”*\n\n*The $5 meal trial performed well among low-income consumers, and sentiment around the company’s value had started to improve, Erlinger said in the July memo.*",
  "link_flair_text": "Company News",
  "id": "1ff05du",
  "num_comments": 148,
  "created_utc": 1726140234,
  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/",
  "comments": [
    {
      "id": "lmrbk7z",
      "score": 241,
      "body": "Its a trap, they just want to lure customers back then slowly raise the prices again.",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrbk7z/",
      "created": 1726145725,
      "depth": 0,
      "replies": [
        {
          "id": "lmru2an",
          "score": 96,
          "body": "I mean I stopped going, they got the 5 dollar deal and now I go again. \n\n\nThey go back to only having app based deals? I’m gone again",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmru2an/",
          "created": 1726152353,
          "depth": 1,
          "replies": [
            {
              "id": "lmtb83v",
              "score": 16,
              "body": "\"$15 was too much for a burger meal? OK we'll turn it back down to $5 and try again more slowly.\"",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtb83v/",
              "created": 1726169297,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lmtrfli",
              "score": 5,
              "body": "Dude i get free medium fries like every day with the app",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtrfli/",
              "created": 1726174458,
              "depth": 2,
              "replies": [
                {
                  "id": "lmyawgp",
                  "score": 14,
                  "body": "You shouldn't be eating fries every day, my brother in christ.",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmyawgp/",
                  "created": 1726245711,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lmsv49j",
              "score": -4,
              "body": "> They go back to only having app based deals? I’m gone again\n\nWait what's wrong with that? The app is where the deals are.\n\nHowever, for those who take issue with installing an app due to privacy concerns or other reasons, I understand that too.\n\nEdit: damn people really don't like apps lmao.",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsv49j/",
              "created": 1726164086,
              "depth": 2,
              "replies": [
                {
                  "id": "lmsxsq4",
                  "score": 25,
                  "body": "The problem with the app is just that they're requiring you to use the app to get discounts. \n\nI think people are just tried of having 50 different apps for 50 different stores to make things cheaper. And really they aren't cheaper they're putting them at the price they should be marked at. I don't think it's so much a privacy issue.",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsxsq4/",
                  "created": 1726164947,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmtc4px",
                      "score": 6,
                      "body": "It's both. The app isn't just a psychological thing, they derive value from the data they collect. I *assume* the privacy considerations are atrocious as most apps are, but I don't know. Even if they know nothing else than what items you ordered, when, and it what restaurants, that is hugely important information for business planning and marketing purposes. They wouldn't get that with a cash purchase. But they probably *could* gather than information from credit card purchases as well, so it really raises suspicion about wtf they are doing with your data.",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtc4px/",
                      "created": 1726169592,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lmtzqtd",
                          "score": 3,
                          "body": "Free advertising with push notifications to entice you to eat there too.",
                          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtzqtd/",
                          "created": 1726177150,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lmu04wb",
                              "score": 1,
                              "body": "Ah. Great point, I hadn't thought of that. I never installed the app because it's an app for McDonald's.",
                              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmu04wb/",
                              "created": 1726177283,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lmuqkx2",
                      "score": 3,
                      "body": "I am but mcd app is good and gives discounts.  I get the 5 dollar meal and use the 25% coupon.  It's $4 bucks at that point.",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmuqkx2/",
                      "created": 1726187098,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lmvngpv",
                      "score": 1,
                      "body": "This is it. I don’t want all these apps. It’s just annoying. I don’t go often to get fast food as it is. All they are doing is making it more difficult for me to eat there. ",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmvngpv/",
                      "created": 1726200261,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lmsxs4c",
                  "score": 2,
                  "body": "I get the $5 meal and then a free Filet O Fish using points. Big meal for $5.28. I don’t always have the points, obviously, but I do enough to enjoy it.",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsxs4c/",
                  "created": 1726164941,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmufmzx",
                  "score": 3,
                  "body": "The point of fast food is that it's quick and easy. I never plan to go to MCD. Am I driving thru an town and am hungry and want to stop? Yes. Am I going to pull over first to order thru an app when I could just tell someone my order thru the drive thru? No. \n\nThey're testing the app to see if they can eliminate employees, therefore increasing profits and shareholder value. It's clearly working.",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmufmzx/",
                  "created": 1726182934,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmttcfs",
                  "score": 1,
                  "body": "The math isn’t this simple, but roughly if you can buy a meal w/o the app for $10 and the same meal is $5 with the app, they’re still making the other $5 off you somehow (using your data for marketing/targeted discounts/data selling/etc).",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmttcfs/",
                  "created": 1726175067,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmt2zkh",
                  "score": 1,
                  "body": "While I understand why some people dislike the app, I really do think it's great. I hate sitting in drive-thrus, so I love that I can just pull into a spot and have them bring my food out to me while I just sit and chill. If a fast food place gives me that option, I'll pretty much always take it.",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmt2zkh/",
                  "created": 1726166617,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmtcab5",
                      "score": 6,
                      "body": "I usually park my car and use my legs to get out of my car. I know, it's crazy and unamerican.",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtcab5/",
                      "created": 1726169642,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lmvnm0x",
                          "score": 4,
                          "body": "I can only imagine how fucking annoying it is to bring the food out to these lazy fucks lmao. When I worked McDonald’s years and years ago we were swamped enough without having to run orders out all day. ",
                          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmvnm0x/",
                          "created": 1726200334,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lmt36og",
                      "score": 1,
                      "body": "Same here. I'll sometimes go in to grab the food or just breeze through the drive thru lane, but the convenience of not having to order in person is great.",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmt36og/",
                      "created": 1726166681,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lmrlqp8",
          "score": 22,
          "body": "Well no shit? Do you think they are doing this for the good of the people? Their product itself is unethical.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrlqp8/",
          "created": 1726149524,
          "depth": 1,
          "replies": [
            {
              "id": "lmrzajb",
              "score": 7,
              "body": "Selling cheap food is unethical?",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrzajb/",
              "created": 1726154058,
              "depth": 2,
              "replies": [
                {
                  "id": "lms12uz",
                  "score": -8,
                  "body": "It’s not “cheap food” it’s the quality and ingredients in the food. A study a few years ago found phthalates, a chemical used in plastic softeners, in McDonald’s food.\n\nIf you eat that slop, you’re asking for bad health.",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lms12uz/",
                  "created": 1726154642,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lms48nu",
                      "score": 23,
                      "body": "Whenever I hear a chemical is found in a certain food, I google it to see if it’s in a lot of other foods and it usually is. Popular chains get a bad rap in that respect when articles point to just a single one.",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lms48nu/",
                      "created": 1726155665,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lmsg8im",
                          "score": 2,
                          "body": "Same, I also Google *how much* is found in the food. There's a major difference between a technical trace amount and an amount that will actually become a concern.",
                          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsg8im/",
                          "created": 1726159467,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lmsw6ol",
                          "score": 1,
                          "body": "The study I’m referring to notes the same chemical was in the food of other fast food companies, so you are correct in that sense.\n\nThe issue I have is that the chemical was in any food to begin with. It shouldn’t be okay for McDonalds to have plastic softeners in their food because Chipotle had the same plastic softeners in their food (per the study, chipotle did as well). The issue is that any food being sold to humans for their consumption has plastic softeners. \n\nI don’t understand why it’s controversial to want food to be free of plastic softeners…Is that where we really are as a society?",
                          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsw6ol/",
                          "created": 1726164429,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lmsfxrn",
                      "score": 3,
                      "body": "Really naive statement … any and every major food producer or mass market fast food restaurant, if tested, will show some minuscule traces of these plastics. So even when you virtuously abstain from McDonald’s, let’s get you tested to see if these plastics have absorbed into your body. We’re going to find them.",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsfxrn/",
                      "created": 1726159374,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lmswr4e",
                          "score": 3,
                          "body": "The issue isn’t with McDonalds specifically, it’s that foods with literal plastic softeners are being sold to humans. That stuff is not good for your endocrine system, look at what plastic chemicals like BPA do to male hormones and reproductive capabilities.\n\nIt’s easy to point the finger at McDonald’s because they are the face of the fast food industry, I won’t deny that. However the issue isn’t with McDonald’s as a company, it’s that plastic softeners shouldn’t be sold for consumption to humans, no matter the amount. Is that really a controversial take?",
                          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmswr4e/",
                          "created": 1726164613,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lmvxaq5",
          "score": 3,
          "body": "You pay $5 but they just shrink the size of your food",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmvxaq5/",
          "created": 1726205471,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lna28kw",
          "score": 3,
          "body": "So... good for the stock?\n\nThe labor is about the same whether they make a cheap ass McChicken or one of those premium chicken sandwiches. These $5 meals are not that profitable, they only serve purpose to drive traffic and win back some good will after the crazy Pandemic price increases.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lna28kw/",
          "created": 1726421721,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lms46lx",
          "score": 10,
          "body": "i made a large group order and my friend found a 20% off coupon on the app so we used it, the employee scanned it and it went through but it didn't take 20% of the order. after we paid and got the receipt we were like what the fuck dude and hes like \"oh yeah that happens sometimes theres nothing i can do about it\". \n\nliteral bait and switch. fuck mcdonalds and their fake coupons they use to scam customers, if i want to pay $12 for a fast food meal ill go to Cava or Chipotle",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lms46lx/",
          "created": 1726155647,
          "depth": 1,
          "replies": [
            {
              "id": "lmsghks",
              "score": 7,
              "body": "I bet if you refused to pay they'd fix the problem real fast rather than make $0.",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsghks/",
              "created": 1726159546,
              "depth": 2,
              "replies": [
                {
                  "id": "lmsnjl8",
                  "score": 9,
                  "body": "By the time you get the receipt, it’s usually difficult to refuse to pay",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsnjl8/",
                  "created": 1726161735,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmsu13x",
                      "score": 7,
                      "body": "That’s why it’s important to know how to do low level math. It isn’t difficult to figure out what 20% of something is. It takes a second or two of thinking about it.",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsu13x/",
                      "created": 1726163748,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lmtmvv5",
                          "score": 3,
                          "body": "i know how to do math but we were ordering for like 7 people and i didnt pay attention to the total i just assumed the coupon worked when they told us it worked",
                          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtmvv5/",
                          "created": 1726173035,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lmvvvwx",
                          "score": 3,
                          "body": "Sir this is /r/stocks, a math free zone",
                          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmvvvwx/",
                          "created": 1726204654,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lmtmooe",
                      "score": 3,
                      "body": "we stayed in the drive thru and they handed us someone elses order after they gave us ours so we just left with an additional 6 sausage egg mcmuffins",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtmooe/",
                      "created": 1726172973,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lmxixhy",
                      "score": 1,
                      "body": "But not difficult to get the manager and ask for a refund. If the store manager refuses, complain to head office via the website, that normally sorts it.",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmxixhy/",
                      "created": 1726236627,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lmtmia8",
                  "score": 3,
                  "body": "what ended up happening was me and my friend were waiting in the drive thru like what the fuck and they ended up handing us an entire additional order on accident. we got the food for the people behind us and i told my buddy go go go drive. it was like 6 sausage egg mcmuffins",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtmia8/",
                  "created": 1726172917,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmto53p",
                      "score": 1,
                      "body": "Winning!!",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmto53p/",
                      "created": 1726173429,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lmzk21k",
                      "score": 1,
                      "body": "You should've waited til they noticed and then gave em the \"oh yeah that happens sometimes.. sorry there's nothing I can do about it. Bye!\"",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmzk21k/",
                      "created": 1726260520,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lmro2lr",
          "score": 6,
          "body": "Theyre not exactly a charity nor have they ever claimed to be…",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmro2lr/",
          "created": 1726150334,
          "depth": 1,
          "replies": [
            {
              "id": "lmsv951",
              "score": 5,
              "body": "Does the Ronald McDonald foundation count?",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsv951/",
              "created": 1726164130,
              "depth": 2,
              "replies": [
                {
                  "id": "lmxksjx",
                  "score": 0,
                  "body": "Tax avoidance ploy to reduce corporate taxes.  Anytime any business asks you to \"round up\" to donate to a charity is just an effort for you to pay for their charitable contribution, when the company reaps.",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmxksjx/",
                  "created": 1726237254,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmtcja4",
                  "score": -3,
                  "body": "As much as the Trump Foundation",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtcja4/",
                  "created": 1726169723,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lms68p4",
              "score": 2,
              "body": "What is your point?",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lms68p4/",
              "created": 1726156304,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lmrst3x",
          "score": -6,
          "body": "I’m confused are you expecting them to give out free meals? No shit they’re gonna profit maximise they’re a company.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrst3x/",
          "created": 1726151937,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmspn3d",
          "score": -2,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmspn3d/",
          "created": 1726162383,
          "depth": 1,
          "replies": [
            {
              "id": "lmu2yua",
              "score": 2,
              "body": "This doesn't say what you think it says.   The profit margin of the franchisees is the statistic that would tell you the margin on the food they sell.  McDonald's corporate merely collects royalties and manages the franchise network.",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmu2yua/",
              "created": 1726178252,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmsrj1x",
      "score": 13,
      "body": "I remember the real $5 value meal back in the day was a large sweet tea and 4 McDoubles. McDonald's is crashing and burning and I, for one, am enjoying their suffering.",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsrj1x/",
      "created": 1726162973,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmr1it1",
      "score": 40,
      "body": "How does the economics behind it work? Are they just accepting the lower margins or are the franchisees eating up the costs?",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr1it1/",
      "created": 1726141362,
      "depth": 0,
      "replies": [
        {
          "id": "lmr28sk",
          "score": 166,
          "body": "They’re accepting the lower margins - because these margins are in line with where they were before. \n\nThey were gouging for as long as they could get away with it. Now it’s over.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr28sk/",
          "created": 1726141706,
          "depth": 1,
          "replies": [
            {
              "id": "lmrabzs",
              "score": 50,
              "body": "It's gouging still since it's barely food",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrabzs/",
              "created": 1726145237,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lmrmg82",
              "score": 20,
              "body": "In other words, they found they were priced higher than the market would bear and decreased accordingly.",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrmg82/",
              "created": 1726149772,
              "depth": 2,
              "replies": [
                {
                  "id": "lms1nih",
                  "score": -5,
                  "body": "They were price gouging far beyond inflationary levels and lying about it in the face of a cost of living crises.\n\nDont make this sound like capitalism correcting itself. They were the bad actors exploiting the flaws in capitalistic economic models due to no government oversight.",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lms1nih/",
                  "created": 1726154828,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmsj81s",
                      "score": 12,
                      "body": "A company can set pricing to whatever they want for any reason they want. They could charge $100 a hamburger and say it was due to the coming fall solstice. The whole idea of \"greedflation\" doesn't really stand up to rational scrutiny. Corporations aren't suddenly greedier than they used to be and will continue to charge as much as they can for their products.",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsj81s/",
                      "created": 1726160388,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lmtekby",
                          "score": 2,
                          "body": "Tbf we probably wouldn't still be having these conversations if the Fed hadn't decided to be spineless bitchess for so long when inflation started running wild - as a direct result of stimulus and QE - and manifested itself in idiotic asset prices from crypto, weed stocks, EV stocks, SPAC mania etc. Once corporations have higher equity, the management *must* seek a higher return on that equity or they will be fired.",
                          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtekby/",
                          "created": 1726170376,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lmtdkq4",
                      "score": 5,
                      "body": "The \"government oversight\" decided to jack up the money supply by 50% in barely 2 years. Markets are just doing what markets do. That's not a flaw in the model, it's a feature. The \"greedy corporations\" schtick has some truth to it, but corporations have always tried to get the most profit using all legal (or borderline) means.",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtdkq4/",
                      "created": 1726170057,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lmswtsh",
                      "score": -1,
                      "body": "> Dont make this sound like capitalism correcting itself.\n\nIt is quite literally the textbook definition of capitalism adjusting to the market. Nobody has to \"make it sound\" like that...it literally is that.",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmswtsh/",
                      "created": 1726164637,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lmtcv0t",
              "score": 3,
              "body": "They're probably going to do more experimentation with product segmentation. They are too dependent on poor people, so they can't lose the $5 crowd. But they *also* want the $15-20 crowd. Hard act to pull off and I don't think it's gonna work.",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtcv0t/",
              "created": 1726169828,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lmrhst2",
              "score": 3,
              "body": "Imagine thinking the gouging is over. We live in a society.",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrhst2/",
              "created": 1726148109,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lmu0xon",
              "score": 2,
              "body": "I wouldn't say its over just...delayed. They are frothing at the mouth to get back to their previous margins.",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmu0xon/",
              "created": 1726177555,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lmrwsuu",
              "score": -6,
              "body": "That's not really true at all. The problem for McDonalds and many other restaurant chains is that wages for their workers have shot up a lot post-COVID due to market forces. This is mainly because a bunch of people in their industry changed careers, so there's just less of a labor pool to hire from.\n\nThere's been analysis on if restaurants like McDonald's are price gouging or if rising expenses are the reason for their higher prices, and the conclusion is pretty strongly higher labor costs in most cases.",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrwsuu/",
              "created": 1726153243,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lms4ldu",
          "score": 3,
          "body": "Yes, they're aiming to regain marketshare by sacrificing some margin for volume. This is common for larger competitors to do in a contracting market. Their margins are still way better than they were because they cut costs on their product, labor, and overhead everywhere they could.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lms4ldu/",
          "created": 1726155779,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmr3xey",
          "score": 11,
          "body": "Probably to get people in the store and then they end up buying milkshakes, coffee, and all those other delicious goodies they sell..",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr3xey/",
          "created": 1726142475,
          "depth": 1,
          "replies": [
            {
              "id": "lmrcpq2",
              "score": 5,
              "body": "Not sure why this is being downvoted, it’s true lol",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrcpq2/",
              "created": 1726146172,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmr8xut",
      "score": 69,
      "body": "The problem with these “value meals” is that it seems like the quality has been cut in half from where it was already at. Went to Dunkin the other day and got their $6 meal which includes medium coffee, hash browns, and bacon egg and cheese on bagel. When I looked at the egg and bacon it looked absolutely disgusting. It was slimy and discolored. The bagel itself was dry and hard to chew. Hash browns were soggy. Only the coffee was good.",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr8xut/",
      "created": 1726144671,
      "depth": 0,
      "replies": [
        {
          "id": "lmr9dpk",
          "score": 115,
          "body": "You went to a cheap donut shop and got food, that's on you",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr9dpk/",
          "created": 1726144852,
          "depth": 1,
          "replies": [
            {
              "id": "lmsgs79",
              "score": 2,
              "body": "Excuse me sir but it's an expensive donut shop.",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsgs79/",
              "created": 1726159638,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lmratog",
              "score": 6,
              "body": "My point is it used to be good. Food at dunkin was one of the places I actually tolerated getting food at. Starbucks has always been awful with their food.",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmratog/",
              "created": 1726145431,
              "depth": 2,
              "replies": [
                {
                  "id": "lmrbnjc",
                  "score": 41,
                  "body": "dunkin hasn't had good food for as long as I've been able to consciously buy it and I'm 27. It's always been processed bullshit. You probably just grew up a bit. \n\nIronically Starbucks has a couple good items.",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrbnjc/",
                  "created": 1726145761,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmtcxa4",
                      "score": 2,
                      "body": "Dude same, 28 and I first tried dunkin donuts food when I was 14 or 15 and even my uncultured ass thought it was just shit",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtcxa4/",
                      "created": 1726169848,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lmskxv5",
                  "score": 3,
                  "body": "it's crazy how many ingredients are in their bagels and donuts, seriously look it up its literally a half page long. Bagels and donuts should have like 5-10 ingredients max",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmskxv5/",
                  "created": 1726160927,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmryp1c",
                  "score": 7,
                  "body": "Food at dunkin has always been terrible",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmryp1c/",
                  "created": 1726153862,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmrqpzw",
                  "score": -2,
                  "body": "Dunkin’ has always had terrible food. I haven’t had a crispy hash brown there in my entire life",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrqpzw/",
                  "created": 1726151239,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lmrf71n",
              "score": 2,
              "body": "It’s like getting tacos at the Chinese and being suprised they gave you pancakes instead of tortillas",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrf71n/",
              "created": 1726147134,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lmrrqv1",
              "score": -1,
              "body": "Stupid comment, Dunkin hasn’t been a donut shop for years. Also they’ve been selling breakfast sandwiches for decades and they even used to be pretty good",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrrqv1/",
              "created": 1726151582,
              "depth": 2,
              "replies": [
                {
                  "id": "lmrxhkz",
                  "score": 0,
                  "body": "Wait, dunkin donuts doesn't sell donuts?",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrxhkz/",
                  "created": 1726153468,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lms1gvn",
                      "score": 4,
                      "body": "They do, but they removed ‘donuts’ from their name a few years ago",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lms1gvn/",
                      "created": 1726154769,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lmrot3w",
          "score": 3,
          "body": "They're putting in about half of the eggs, bacon and cheese compared to pre-shrinkflation.  This is the trend across the board with most companies.  64oz juice is 59oz now, etc.  You'll know it's really bad once half gallon of milk isn't half gallon anymore.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrot3w/",
          "created": 1726150587,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmram5l",
          "score": 7,
          "body": "Dunkin has cost cut hard everywhere. Generally now only 1~ place actively bakes the goods in the area and its delivered to others. (Example around me theres 4 dunkins and 1 makes all baked goods for them). Then all those extras you are getting in a sandwich and such are microwaved/heat nuked. The only thing they still make fresh in each store is the coffee and thats it.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmram5l/",
          "created": 1726145349,
          "depth": 1,
          "replies": [
            {
              "id": "lmro83x",
              "score": 0,
              "body": "Only thing fresh in that coffee is the water. Those beans are absolutely not lol\n\n- an unnecessary coffee snob",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmro83x/",
              "created": 1726150387,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lmtepbf",
          "score": 1,
          "body": "Dunkin is a joke and needs to go out of business change my mind",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtepbf/",
          "created": 1726170421,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmrfcee",
          "score": 0,
          "body": "How do I think executives get compensated at a food company? You increase profits and cutting costs doesn’t take much imagination",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrfcee/",
          "created": 1726147190,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmr9cxu",
      "score": 20,
      "body": "Not taking the bait.",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr9cxu/",
      "created": 1726144843,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmtugzn",
      "score": 6,
      "body": "The $5 meal was nice when they had the 25% off purchases of $5+ so it made the meal 4$. Now they changed the deal to 25% purchase of $7+…",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtugzn/",
      "created": 1726175421,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmsdw0w",
      "score": 9,
      "body": "Take a look at McDonald’s NET profit margin. The biggest gougers of Covid. I’ll never buy a thing from there.",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsdw0w/",
      "created": 1726158730,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmr86pt",
      "score": 20,
      "body": "This shit is mid and the nuggets are smoller.\n\nFuck MCD’s.",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr86pt/",
      "created": 1726144359,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmugr6j",
      "score": 3,
      "body": "I hate that you can’t stack the app deals or your own points to the $5 meal deal. That meal is not enough for me",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmugr6j/",
      "created": 1726183347,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmrk50u",
      "score": 4,
      "body": "I go there for the meal deal, if they don't have it, I simply won't go. I'm not going to suddenly decide to spend twice as much money on the same amount of calories after December. Do they think trust and good will puts money in my account?",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrk50u/",
      "created": 1726148960,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmrx6ee",
      "score": 4,
      "body": "Wow, they are acting like they are doing us a favor but they should of never raised prices as fast as they should. It's pretty sad that to get good deals you need to use an app because MCD can now use all the data from customers to continue to squeeze every penny from consumers in the near future.",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrx6ee/",
      "created": 1726153366,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmsl3he",
      "score": 2,
      "body": "What are US markets? Isn't the US a single market? Do they mean different states? Cities? Regions?",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsl3he/",
      "created": 1726160976,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmtb2oy",
      "score": 2,
      "body": "Too late Ronald. I've moved on to much better restaurants that cost less, I'm not downloading your fucking app, and your special offers aren't fooling me. Same as most other people.",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtb2oy/",
      "created": 1726169248,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmtgx37",
      "score": 2,
      "body": "Move over Big Mac Index, we got the McChicken index now.",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtgx37/",
      "created": 1726171123,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ln6wp7q",
      "score": 2,
      "body": "idc dude have you seen how fkin thin their patties are in the big mac? I'm just eating 3 buns, lettuce and sauce at this rate",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/ln6wp7q/",
      "created": 1726369697,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lncd5xs",
      "score": 2,
      "body": "Mcdonald's should leverage their international presence into NA\n\nThey could introduce international flavor of the month - the Teriyaki Burger, Garlic naan burger, Bulgogi burger  etc etc.\n\nPeople are tired of the same boring NA menu",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lncd5xs/",
      "created": 1726449671,
      "depth": 0,
      "replies": [
        {
          "id": "lne349q",
          "score": 2,
          "body": "France did a global menu for the Olympics.  We sent them Szechuan Sauce.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lne349q/",
          "created": 1726484466,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmr81mi",
      "score": 4,
      "body": "I've been eating the $5 meal every week",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr81mi/",
      "created": 1726144298,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmr748p",
      "score": 7,
      "body": "I don’t even order this. I just order the McDouble or Spicy McChicken BOGO $1. Free medium fries with $2 purchase on the app.",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr748p/",
      "created": 1726143897,
      "depth": 0,
      "replies": [
        {
          "id": "lmrx3fj",
          "score": 17,
          "body": "I tried using their app once, but as soon as I saw the long list of permissions it demanded in order to run I noped right out there and uninstalled it.\n\nI'd rather go through the drive thru and just order my usual meal.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrx3fj/",
          "created": 1726153339,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmsec4y",
          "score": 3,
          "body": "You can only use one coupon at a time though. Ordering for a family? “fuck you!” says this system. I guess only one item can be reasonably priced in the app while every other item within the order is price gouged",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsec4y/",
          "created": 1726158872,
          "depth": 1,
          "replies": [
            {
              "id": "lmut0gc",
              "score": 5,
              "body": "Then use the 20% off one",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmut0gc/",
              "created": 1726188013,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lmr8b99",
          "score": -8,
          "body": "McDonalds is still a great deal if you use their app. 99 cents any size iced coffee is great. Usually get a sandwich to go with it.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr8b99/",
          "created": 1726144412,
          "depth": 1,
          "replies": [
            {
              "id": "lmrkrn7",
              "score": 12,
              "body": "I wish it didn't come to this though. I hate having to have an app for everything. Especially at the cost of giving Mc D your location, phone number, and any other device tracked data.",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrkrn7/",
              "created": 1726149184,
              "depth": 2,
              "replies": [
                {
                  "id": "lms171u",
                  "score": 10,
                  "body": "People who normalize apps for restaurants [to get deals] are a problem. They're feeding into these shit companies and their practices.",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lms171u/",
                  "created": 1726154680,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmsek9i",
                      "score": -6,
                      "body": "tf do I care? At Wendys you can get the Double stack meal with large fries and 10 nuggets for $5 on the app on Wednesdays. I'm not going to lose out on saving money to be stubborn. On top of that it makes the drive through experience quicker.",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsek9i/",
                      "created": 1726158943,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lms17k5",
                  "score": 2,
                  "body": "I hear your point, yet I still find it way easier to use than the in-store kiosks. And I always order on my way to the shop so I don’t have to wait.",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lms17k5/",
                  "created": 1726154685,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lmsk8bh",
              "score": 2,
              "body": "I tried it once. It took 4 fucking times as long to punch in a combo meal for 2 as opposed to simply speaking my order to someone. \n\nI cannot fucking stand this crap. I gave up at the point where it asked for my credit card info because I was done typing and tapping. I paid the higher price to order at the speaker and was done in 15 seconds. \n\nDon't even get me started on the kiosks. So God damned annoying.",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsk8bh/",
              "created": 1726160703,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmrz71c",
      "score": 3,
      "body": "What an amazing value for particle board protein, printed fries, and sugar water",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrz71c/",
      "created": 1726154026,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmr2b0k",
      "score": 2,
      "body": "Boycott",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr2b0k/",
      "created": 1726141735,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmr7y4n",
      "score": 2,
      "body": "They changed the 1$ breakfast deal to 2$ on the app for me…\n\nI will no longer eat at McDonald’s",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr7y4n/",
      "created": 1726144256,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmsxdt4",
      "score": 1,
      "body": "they're gonna remove it? terrible move, it's literally the only thing worth it now",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsxdt4/",
      "created": 1726164815,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmt828a",
      "score": 1,
      "body": "Great, that's 5 dollars quicker to diabeetus.",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmt828a/",
      "created": 1726168266,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmu8wkr",
      "score": 1,
      "body": "I haven't eaten McDonald's in over a decade their food disgusted me. I'd rather go to a mom and pa dinner for a burger or grill my own . ",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmu8wkr/",
      "created": 1726180389,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmxvq64",
      "score": 1,
      "body": "McDonalds uses tracking and numbers are going way up.  \n\nSorry to barge into a stock discussion with a bunch of people whining about their shit food.  I just care about the stock price, nothing more.",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmxvq64/",
      "created": 1726240826,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmr49n4",
      "score": -7,
      "body": ">The value meal offers a McDouble or McChicken sandwich, small fries, four-piece chicken nuggets and a small soft drink for $5.\n\nThat is not worth $5",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr49n4/",
      "created": 1726142632,
      "depth": 0,
      "replies": [
        {
          "id": "lmr56jq",
          "score": 19,
          "body": "You must not have been shopping lately.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr56jq/",
          "created": 1726143045,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmr7fxf",
          "score": 8,
          "body": "That's as good as it gets these days. Those prices of ten years ago are long gone.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr7fxf/",
          "created": 1726144040,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmr5jr5",
          "score": 14,
          "body": "Really? I don’t eat fast food but that comes out to 1.25 per part… seems like a pretty good deal imo",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr5jr5/",
          "created": 1726143209,
          "depth": 1,
          "replies": [
            {
              "id": "lmsz5ap",
              "score": 1,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsz5ap/",
              "created": 1726165379,
              "depth": 2,
              "replies": [
                {
                  "id": "lmtnm9h",
                  "score": 3,
                  "body": "> and it's really not even a good deal compared to their own other options. You can still get the BOGO big mac/quarter pounder deal, which is something like 5x more value than the value meal.\n\nI tried adding up the value meal items individually on the app to see what it would cost. It's over $10 for me. So you save $5.\n\nIf you could get a BOGO Big Mac/QPC (which isn't even a promotion that they have available at my location), you would only save about $4.",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtnm9h/",
                  "created": 1726173266,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmtr7gb",
                      "score": 0,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmtr7gb/",
                      "created": 1726174387,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lmrq63f",
          "score": 2,
          "body": "Without judging the quality of their food, that's a lot of calories for $5. Using the app you can usually get free medium fries or a free Big Mac with a $2 purchase, and that works with the $5 meal deal. A McChicken, small fries, 4 piece McNuggets, small soda, and a Big Mac is way more food than anyone should consume in 1 meal and it costs $2 less than 1 hour of work at the federal minimum wage.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrq63f/",
          "created": 1726151052,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmredqc",
      "score": 0,
      "body": "If your looking for sustenance at MCD.  That’s on you.  Make a lunch at home and save the money.",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmredqc/",
      "created": 1726146824,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmr2jjj",
      "score": -8,
      "body": "McD was becoming the most expensive fastfood joint. Good for them to get back to what made them a household name. Value.  Next bring back the dollar menus ❤️",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr2jjj/",
      "created": 1726141845,
      "depth": 0,
      "replies": [
        {
          "id": "lmr7a76",
          "score": 4,
          "body": "Wendy's, Chick-fil-A, and Subway would like a word. Then there's Taco Bell that may not be the most expensive but downright horrible value. McDonald's is not the worst by far.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr7a76/",
          "created": 1726143970,
          "depth": 1,
          "replies": [
            {
              "id": "lmrdfpl",
              "score": 4,
              "body": "Wendy's and Chick-fil-A are similarly inexpensive and much higher quality than McD n Tacobell. Subway is expensive compared to what it used to be. But McDonald's reach a point where It was the highest dollar amount for the least quality product.",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrdfpl/",
              "created": 1726146457,
              "depth": 2,
              "replies": [
                {
                  "id": "lmrftfv",
                  "score": 1,
                  "body": "Nah, Wendy's and CFA are a solid step up in price. Not similar at all.",
                  "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrftfv/",
                  "created": 1726147368,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lms8ur4",
                      "score": 3,
                      "body": "5$ biggie bag and 5$ meal deal are pretty similar in my opinion",
                      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lms8ur4/",
                      "created": 1726157133,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lmsciwh",
                          "score": 2,
                          "body": "My local Wendy's opts out of those. They just have meals starting at 10.99",
                          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsciwh/",
                          "created": 1726158295,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lmrdmzf",
              "score": 2,
              "body": "Taco Bell been keeping the $7 Chalupa box on the menu. Not great food but it's enough to fill me up, unlike the Mcds $5 meal. I personally also don't like mixing chicken and beef into one meal (if you can call their meats chicken and beef)",
              "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrdmzf/",
              "created": 1726146535,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmr5hyq",
      "score": -1,
      "body": "Let McDonald’s take the margin hit and look into buying shares or calls in LW who supplies their potatoes.\n\nLogic being, McDonald’s will take the margin hit to lower their prices to re-ignite demand but the suppliers are under no such obligation.",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr5hyq/",
      "created": 1726143186,
      "depth": 0,
      "replies": [
        {
          "id": "lms33td",
          "score": 2,
          "body": "Or they could just reduce executive pay and the shareholders accept less returns.\n\nThat’s how capitalism works. Shareholders and executives aren’t guaranteed hand over fist returns, sometimes they make bad investments and business choices and have to suffer.\n\nThis whole idea that the consumer is always the one that gets screwed is a relatively recent development. Costs always get passed on but there has been an unhealthy shift in how it’s handled versus earlier generations of business.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lms33td/",
          "created": 1726155299,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmr8fup",
          "score": 3,
          "body": "My assumption is that McD (like supermarkets) would have enough bargaining power to force suppliers own the supply chain into lower prices too and \"share the pain\".\n\nAlso wouldn't their margin still be high, just not as high? That small soda for example - very little cost there.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmr8fup/",
          "created": 1726144466,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmrpkto",
      "score": 0,
      "body": "Why did people move away from McD? And they moved to which company to replace McD? Isn’t McD the cheapest fast food company?",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrpkto/",
      "created": 1726150852,
      "depth": 0,
      "replies": [
        {
          "id": "lmsx5sv",
          "score": 4,
          "body": "Health reasons. Financial reasons. Ethical reasons.\n\nThere are many other (fast)food chains where you can quickly get a meal for a similar or cheaper price with better quality.",
          "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmsx5sv/",
          "created": 1726164744,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmwcl28",
      "score": 0,
      "body": "This is bad for the health of America, but I will damn well buy this. ",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmwcl28/",
      "created": 1726215562,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmrjbk2",
      "score": -3,
      "body": "Gross",
      "permalink": "/r/stocks/comments/1ff05du/mcdonalds_to_extend_5_value_meal_offer_into/lmrjbk2/",
      "created": 1726148666,
      "depth": 0,
      "replies": []
    }
  ]
}