{
  "title": "Uber and Waymo to offer driverless ride-sharing trips in Austin and Atlanta ",
  "score": 219,
  "selftext": "Uber announced Friday it is expanding its partnership with Alphabet’s Waymo to offer robotaxi rides in Austin, Texas, and Atlanta beginning in early 2025. Shares of Uber jumped 5% on the news while Alphabet rose about 1%.\n\nUber riders in those cities can be matched with a driverless Waymo car for some trips, according to the companies. The rides will only be available through Uber’s app, unlike in San Francisco and Los Angeles where riders book through the Waymo app. A Waymo spokesperson said it had no plans to partner with Uber in San Francisco and Los Angeles.\n\nThe expansion comes as Uber faces investor pressure to step up its autonomous vehicle strategy, especially ahead of Tesla’s planned robotaxi event slated for Oct. 10. Shares of Uber have fallen 9% since the Tesla event was announced and are off 17% from their 52-week highs. \n\nIt may also slow Waymo encroachment into Uber’s market share. An analysis from Bernstein estimated that, as of May 2024, Waymo’s 50,000 weekly paid rides made up approximately 2% of ride-sharing usage in San Francisco. Since then, Waymo has doubled its paid robotaxi trips to 100,000 a week, the company announced. \n\n“We’re thrilled to build on our successful partnership with Waymo, which has already powered fully autonomous trips for tens of thousands of riders in Phoenix,” Uber CEO Dara Khosrowshahi said in a release. \n\nUber’s initial agreement with Waymo in Phoenix also included autonomous Uber Eats deliveries in the city. The expansion into Austin and Atlanta won’t include Uber Eats at first, according to the Waymo spokesperson, but they’re exploring that possibility for the future. \n\nWaymo co-CEO Tekedra Mawakana said, “We’ve been delighted at the positive feedback from our Waymo One riders to date, and we can’t wait to bring the comfort, convenience, and safety of the Waymo Driver to these cities in partnership with Uber.” \n\nThe expansion into two more cities is another step in Uber’s advancement into the robotaxi space, after struggling to get a foothold and selling off its own self-driving division in 2020, now relying on partnerships with companies including Waymo, GM’s Cruise and the SoftBank-backed U.K. startup Wayve to gain ground. \n\nUber shares dipped in August after the company announced a multiyear partnership with Cruise to offer autonomous rides through its app next year. Wells Fargo analyst Ken Gawrelski cited Cruise’s previous safety challenges as a part of the investor skepticism, along with now-fulfilled hopes for a partnership with Waymo instead. \n\nWaymo has rapidly made strides in the self-driving race. It currently offers robotaxi services to the public in San Francisco, Los Angeles and Phoenix. It has logged more than 22 million miles through June of this year, and last week, it released a report that argued its vehicles are safer than human drivers. It began testing driverless cars on Bay Area freeways with Google employees in August.\n\nSome analysts were more hopeful for a potential Uber and Waymo expansion into San Francisco. But Atlanta and Austin, where Waymo has already begun testing, may still help sentiment. \n\nSource: https://www.cnbc.com/2024/09/13/uber-and-waymo-partnership-expanding-to-austin-and-atlanta.html",
  "link_flair_text": null,
  "id": "1ffw4rb",
  "num_comments": 83,
  "created_utc": 1726237757,
  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/",
  "comments": [
    {
      "id": "lmxzxby",
      "score": 31,
      "body": "This is really interesting to me because isn't LYFT mostly owned by GOOG?",
      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmxzxby/",
      "created": 1726242180,
      "depth": 0,
      "replies": [
        {
          "id": "lmy3n6j",
          "score": 47,
          "body": "It sold off its entire Lyft position in Nov 2023 so almost a year ago.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmy3n6j/",
          "created": 1726243372,
          "depth": 1,
          "replies": [
            {
              "id": "lmyy8hr",
              "score": 39,
              "body": "Lmao\n\nAnd google sold off Boston dynamics, arguable the most advanced robotics company in the world, right before this whole AI thing took off, which was *invented by Google*\n\nGoogle product leadership sucks",
              "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmyy8hr/",
              "created": 1726253299,
              "depth": 2,
              "replies": [
                {
                  "id": "lmyyicq",
                  "score": 33,
                  "body": "I’ve been praying for them to fire Sundar for years",
                  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmyyicq/",
                  "created": 1726253388,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmyywet",
                      "score": 27,
                      "body": "The day they fire him, stock will jump atleast 10%",
                      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmyywet/",
                      "created": 1726253516,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lmz9l64",
                          "score": 3,
                          "body": "Amen.",
                          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmz9l64/",
                          "created": 1726257070,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ln0d9hj",
                      "score": 30,
                      "body": "The decision to sell Boston Dynamics was made when Larry Page was still CEO. It was put up for sale in 2016 and sold in 2017\n\nSundar was CEO of Google, not Alphabet overall, back then, and Boston Dynamics wasn't under Google",
                      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln0d9hj/",
                      "created": 1726271252,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ln6giba",
                          "score": 8,
                          "body": "Don't let actual facts get involved here lol.",
                          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln6giba/",
                          "created": 1726362865,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ln16sda",
                          "score": -4,
                          "body": "I’ll give him that one but that doesn’t fundamentally change my opinion of google’s/alphabet’s current leadership",
                          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln16sda/",
                          "created": 1726283726,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ln1p9po",
                              "score": 14,
                              "body": "He has delivered to shareholders continuously and that's what he is paid to do. The people that infest this sub truly have no sense of what is what.",
                              "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln1p9po/",
                              "created": 1726293982,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ln4sluv",
                                  "score": 5,
                                  "body": "[removed]",
                                  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln4sluv/",
                                  "created": 1726342779,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ln4sv83",
                                      "score": 3,
                                      "body": "Reddit hivemind",
                                      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln4sv83/",
                                      "created": 1726342857,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "ln72b9g",
                                  "score": 2,
                                  "body": "I think Google under Sundar missed a lot of boats and squandered a lot of leads, killed great products before they could become great and shipped a lot of half baked products that were dead on arrival. I think they are mostly big right now due to inertia, and we’re already seeing them start to squeeze more money out of their existing revenue streams (YouTube ads, banning chrome ad blockers) rather than deliver a great product people love.",
                                  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln72b9g/",
                                  "created": 1726372282,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "ln4tm6e",
                                  "score": 2,
                                  "body": "He has lost Google's lead and that's the issue here. He's been parroting AI first for the last 7 years and yet Microsoft ends productizing LLMs in both consumer and commercial space !!??\n\nEvery single good thing that Google has was either bought by, or started under Larry Page. Every good thing that has either saved Google's ass or kept it in the lead : Android that saved Google when the world went mobile, YouTube that has kept Google relevant in the video and creator economy space, Waymo - a moonshot that seems to be paying off, Deepmind and general research into AI & specifically LLMs and ofc, Google Cloud.\n\nSunderp has just been pushing the levers to serve more ads on existing Google properties and that's how he is \"delivering to shareholders\". No long term vision or play from this dud and now Google for the very first time is in real danger of losing search share to AI agents from Apple, ChatGPT, Msft, Meta.",
                                  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln4tm6e/",
                                  "created": 1726343091,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ln4vjec",
                                      "score": 4,
                                      "body": "Seems like you're looking for reasons to be angry with him and not really talking about anything.\n\nAndroid is open source. It was acquired by Google in 2007. It didn't save anything. Lol",
                                      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln4vjec/",
                                      "created": 1726343673,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "ln4xlhj",
                                          "score": 0,
                                          "body": "> Android is open source. It was acquired by Google in 2007. It didn't save anything.\n\nYou might want to tell that to the DoJ - they seem to think Android is a pretty big deal.\n\n\nBut thanks for letting me know that I am talking to someone who has no idea what the fuck they are on about. Android is the most popular (by volume) OS in the world today. Android is the platform on which Google serves GMS. Android is the reason why Google even has a services business (that is growing). Android is the reason why Google is the default search app on more than half the mobile devices in the world. Android is the reason why Google maps, email, youtube etc etc come as prebundled (and often default) apps on most mobile devices in the world.",
                                          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln4xlhj/",
                                          "created": 1726344296,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ln3hsq9",
                  "score": 6,
                  "body": "boston dynamics was a good sell. that company will only eat cash for the next 10 years",
                  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln3hsq9/",
                  "created": 1726328095,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmz1p8t",
                  "score": 4,
                  "body": "Why did they sell of Boston Dynamics",
                  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmz1p8t/",
                  "created": 1726254437,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ln0cyhp",
                      "score": 4,
                      "body": "Because they didn't think it was ever going to be profitable\n\n> Bloomberg also highlighted \"tensions\" between the two sides as Boston Dynamics \"failed\" to come up with commercially viable products. In a November meeting, which was since been leaked online, Jonathan Rosenberg, adviser to Alphabet CEO Larry Page, said the company \"cannot spend 30 plus percent of our resources on things that take ten years\". \"There's some time frame that we need to be generating an amount of revenue that covers expenses and (that) needs to be a few years,\" he said.\n\nhttps://www.wired.com/story/google-selling-boston-dynamics/",
                      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln0cyhp/",
                      "created": 1726271131,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lmz4817",
                      "score": 1,
                      "body": "I believe Hyundai has owned it for awhile now.",
                      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmz4817/",
                      "created": 1726255285,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ln0hxxy",
                  "score": 1,
                  "body": "How do LLMs benefit robotics?",
                  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln0hxxy/",
                  "created": 1726273103,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lnhb2s0",
                  "score": 1,
                  "body": "BD doesn’t lead in anything except hype videos",
                  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lnhb2s0/",
                  "created": 1726525098,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ln0c4qy",
                  "score": 0,
                  "body": "Oh my god.... WHY did they do that?",
                  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln0c4qy/",
                  "created": 1726270806,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lmz4a8e",
              "score": 2,
              "body": "Good to know, I missed that one.",
              "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmz4a8e/",
              "created": 1726255306,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmyho7c",
      "score": 39,
      "body": "Clearly Waymo wants to license its technology instead of operating a rideshare service on its own. Uber already has the processes for dealing with customers at scale. I wonder who's going to own the fleet in the future. Clearly Uber doesn't.",
      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmyho7c/",
      "created": 1726247870,
      "depth": 0,
      "replies": [
        {
          "id": "lmzcc9l",
          "score": 17,
          "body": "The Jaguars are custom made for Waymo, the sensors are built for Waymo, the permits are given to Waymo specifically, Waymo has parking garages in cities just for their cars so they can service and charge them (they're EVs), and I wouldn't be surprised if the tech is built assuming certain dimensions of the car, what the sensors are seeing, etc. It's not impossible, but I don't think it's *that* easy for anyone but Waymo to own the fleet.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmzcc9l/",
          "created": 1726257976,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmzct4o",
          "score": 7,
          "body": "Isn't that a good thing if Uber is less capital intensive? And less competitors are trying to compete with their platform. \n\nWith owning the fleet of future. The car industry have never been a monopoly. There will always be multiple players.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmzct4o/",
          "created": 1726258130,
          "depth": 1,
          "replies": [
            {
              "id": "ln3yqhw",
              "score": 2,
              "body": "Whoever owns the cars can switch to a competitor, which limits how much Uber can earn for their services.",
              "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln3yqhw/",
              "created": 1726333477,
              "depth": 2,
              "replies": [
                {
                  "id": "ln5228l",
                  "score": 2,
                  "body": "Besides Lyft who is Uber Competitor that these companies will leave Uber for.",
                  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln5228l/",
                  "created": 1726345639,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ln5epmo",
                      "score": 1,
                      "body": "The people who own the cars could form their own company. Seems a lot cheaper to make an app than to buy a fleet of cars.",
                      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln5epmo/",
                      "created": 1726349682,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ln61f5c",
                          "score": 1,
                          "body": "That the weird thing with this sub. Outside of Mag 7 people think other companies dont have a moat. Uber is the term thought of when people think of ride hailing. That isnt easy to take away that verb/connection to the industry.\n\nThe other part is Uber already has partnerships with these companies that own the cars.",
                          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln61f5c/",
                          "created": 1726357058,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lmz6qiq",
      "score": 7,
      "body": "Despite the narrative that driverless tech is going to sink uber, I believe they stands to benefit more from driverless vehicles in the long run than almost any other company. If they can continue to be the dominant customer-facing solution for ride-sharing (probably soon a misnomer) they'll be able to ride this way from ideation to widespread adoption. Long $UBER",
      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmz6qiq/",
      "created": 1726256124,
      "depth": 0,
      "replies": [
        {
          "id": "lnc9sgq",
          "score": 4,
          "body": "Nah, the reason Uber had a moat is because they owned the supply (drivers). Uber did the hard work of recruiting drivers. Any startup competitor to Uber must spend tens of billions to acquire drivers to compete.\n\nIn a self-driving car world, you don't need to convince drivers. You just need to acquire self-driving cars, which is a lot easier. The moat for Uber will be gone. It will be a race to the bottom for pricing. The company that offers the cheapest self-driving car ride will win.\n\nArguably, the company that first acquires the infrastructure will win in the robo-taxi war. Think charging stations, repair shops, etc. Those can be more defensible moat. People don't have a loyalty to Uber. It's been proven time and time again that people will book the cheapest option if they have that option.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lnc9sgq/",
          "created": 1726448349,
          "depth": 1,
          "replies": [
            {
              "id": "lngol2g",
              "score": 3,
              "body": "Pretty solid reasoning. I think \"moat\" is probably the wrong word. I do think they'll be the early beneficiaries due to having the largest user base. They have a chance to navigate this as a key player via acquisitions and partnerships, but I think you're right to suspect that they'll have fierce competition and a possible upending of the industry.  \nI think their scale and ubiquity will offer them pricing power as well, so I don't really fear an early \"race to the bottom\". Only time will tell. Appreciate your thoughts either way.",
              "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lngol2g/",
              "created": 1726517613,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmxw2fk",
      "score": 16,
      "body": "Sort of related - month ago I mentioned (https://old.reddit.com/r/stocks/comments/1ecze5q/whats_the_next_asts/lf60un5/?context=3) self driving trucking co Aurora (AUR). Stock is up about 36% in the last month.\n\nThe CEO is the former Waymo CTO and one of the early leads that helped build it.\n\nThe CPO is the former product head for Tesla's autopilot. \n\nThe Chief Scientist was the former Head of Perception and Autonomy Architect at Uber's Advanced Technology Group\n\nIt's not Waymo, but for someone looking for something very speculative that is lead by the former Waymo CTO, it's something to consider on pullbacks.\n\nAurora discussion by T Rowe Price's CIO: https://x.com/TMTMoats/status/1812544683408605349",
      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmxw2fk/",
      "created": 1726240936,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmzo0cc",
      "score": 3,
      "body": "If successful, I hope either company decides to take on the company 100%. The tech could expand onto other vehicles.",
      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmzo0cc/",
      "created": 1726261849,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ln7i1xp",
      "score": 3,
      "body": "Waymo is a GOOG bet people are sleeping on. This is just the beginning. Imagine in 5 years. Hell, imagine being 80 and your daily ride to the Dr is via waymo. It's all automated. Dr office service, billed to insurance, paid for by my taxes.",
      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln7i1xp/",
      "created": 1726380783,
      "depth": 0,
      "replies": [
        {
          "id": "lncab29",
          "score": 1,
          "body": "When I'm 80, my personal AI assistant is my doctor. Why do I need to go to the doctor's office?",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lncab29/",
          "created": 1726448551,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmyf61a",
      "score": 5,
      "body": "\"It may also slow Waymo encroachment into Uber’s market share. An analysis from Bernstein estimated that, as of May 2024, Waymo’s 50,000 weekly paid rides made up approximately 2% of ride-sharing usage in San Francisco. Since then, Waymo has doubled its paid robotaxi trips to 100,000 a week, the company announced.\"\n\n\n50k weekly rides is 2% of users usage?\n\n\nSo uber is doing 2.5 million weekly rides in San Francisco?  That seems like an Insanely large number.",
      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmyf61a/",
      "created": 1726247098,
      "depth": 0,
      "replies": [
        {
          "id": "lmzz5zw",
          "score": 5,
          "body": "~800k population, and people use Uber/Lyft/Waymo way more in big cities than elsewhere.\n\nIdk, that number doesn't seem that crazy to me.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmzz5zw/",
          "created": 1726265845,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnj3sso",
          "score": 1,
          "body": "Waymo was doing 50k rides across two cities, so probably more like 25k is 2%",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lnj3sso/",
          "created": 1726551782,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmxthkz",
      "score": 5,
      "body": "Quick question on the tech. Are riders responsible for monitoring the vehicle's operation, or do we believe that we're at a full: \"I can make dumb reddit posts and watch porn while a robot drives me\" level of autonomy?",
      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmxthkz/",
      "created": 1726240095,
      "depth": 0,
      "replies": [
        {
          "id": "lmxtq86",
          "score": 38,
          "body": "The latter",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmxtq86/",
          "created": 1726240175,
          "depth": 1,
          "replies": [
            {
              "id": "lmxu4t1",
              "score": 5,
              "body": "Damn, didn't know it was anywhere near that yet. I generally don't follow the space because 1 I'm poor and 2 I have no social life. Pretty cool though, curious to watch how it goes.",
              "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmxu4t1/",
              "created": 1726240308,
              "depth": 2,
              "replies": [
                {
                  "id": "lmxv5oa",
                  "score": 17,
                  "body": "Well since a human driver is not involved this should actually make it cheaper to ride",
                  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmxv5oa/",
                  "created": 1726240642,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lmxz6m0",
                      "score": 14,
                      "body": "Depends on how expensive it is to run the tech. Waymo operates a model of vehicle that is $75k new, slaps on a bunch of sensors on it, and then needs to pay for always-on connectivity, data collection, and servers doing a bunch of processing. Plus the actual human labor of coordinating things that the tech can't do totally autonomously, like human intervention in certain driving conditions, or dealing with a previous passenger's puke. How long does it take to be cost competitive with a driver of a $20k Corolla collecting an average of $15/hour?",
                      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmxz6m0/",
                      "created": 1726241942,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lmycs7g",
                          "score": 3,
                          "body": "The servers do the processing? Really? Shouldn't it be the car doing the processing?\n\nSo if the internet were to go down, these cars suddenly just stop?",
                          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmycs7g/",
                          "created": 1726246323,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lmygk1o",
                              "score": 9,
                              "body": "All the driving is done by onboard computers. It does require internet to get ride information and assistance (when it gets stuck and whatnot), but it doesn’t just stop if there’s no connection.",
                              "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmygk1o/",
                              "created": 1726247533,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lmzb312",
                              "score": 1,
                              "body": "> So if the internet were to go down, these cars suddenly just stop?\n\nWell, I'd think the actual customer/fare/billing parts would naturally go down at that point, so a robotaxi would basically have to stop then when it can't find any fares. In other words, if a human Uber driver's cell phone loses its internet connection, you'd expect that they wouldn't be able to operate the full service until they get back online.\n\nI also think that even though offline maps are possible, I think they're still relying on real-time traffic and routing data to make real-time navigation decisions.\n\nAnd then throw in the fact that even with local processing, sometimes the system kicks it to a human for review/help, it'll always need an online connection to sensors and stuff.\n\nFinally, these aren't completed projects. They're still taking in a ton of information, including lots of sensor data, to help train and improve the systems. Those will need to be transmitted back to their big server farms.",
                              "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmzb312/",
                              "created": 1726257560,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lmy337j",
                      "score": 3,
                      "body": "The ride will cost exactly what people are willing to pay for it",
                      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmy337j/",
                      "created": 1726243191,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lmxz1fa",
                      "score": 2,
                      "body": "Lol nah - that just means margins are higher. They won't lower prices. Actually, it is likely to increase them due to the novelty at first.",
                      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmxz1fa/",
                      "created": 1726241896,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lmz78m4",
                          "score": 3,
                          "body": "Except it’s already available in a few cities and cheaper.",
                          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmz78m4/",
                          "created": 1726256293,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lmy5yuy",
                      "score": -2,
                      "body": "Sadly not true- the hardware costs on this technology is so high that it actually costs more in most markets even before you consider the cost of R&D.\n\nNvidia's price gouging has prevented AI from cutting costs for consumers.",
                      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmy5yuy/",
                      "created": 1726244120,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ln131uv",
                  "score": 6,
                  "body": "Take a look at some YouTube videos about it. They're currently operating in San Francisco and are doing 100,000 rides per week and sounds like they're getting positive feedback. \n\nYou book the ride through the waymo app, get in the car, and it just drives you. You don't have to pay any attention at all. Looks pretty cool.",
                  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln131uv/",
                  "created": 1726282001,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmy7kez",
                  "score": 4,
                  "body": "I live in SF and have seen cruise zoox and waymo all over the last 2 years. Got on a free trial of cruise and had 4 or 5 rides when it was pretty new. It was awesome. Rode a waymo recently to a concert as well. It was like $15?",
                  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmy7kez/",
                  "created": 1726244637,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmz3mqb",
                  "score": 3,
                  "body": "Yeah.its pretty wild. They're at 20 million total driverless miles and just hit 100k trips a week of literally no one or thing sitting in the driver's seat of the car.",
                  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmz3mqb/",
                  "created": 1726255085,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lmxyc0s",
                  "score": 2,
                  "body": "Yeah, it is doing that in Phoenix from what I have seen on news articles.\n\nSo they are progressing well.",
                  "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmxyc0s/",
                  "created": 1726241667,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lmxxcjv",
          "score": 12,
          "body": "They have this in Arizona. It’s good because it’s cheap, there is literally no driver (I imagine they will have drivers to start as Arizona required that) and having no driver is peaceful. It sucks because they’re extremely limited in areas they can and can’t go (I got stuck in a 52 min ride home which should have been 23 because they weee taking backroads. Can’t find alternate route or tell driver where to go). And they go the speed limit which can be infuriating at times. \n\nI would highly recommend still as they continue to learn and build out slowly over the country. It is eerie the first ride when not one driver is in and you’re in the backseat and it’s driving better than a human would.\n\nE: you can do anything in the car as long as seat belt is on. Read news. Get a BJ. Do both.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmxxcjv/",
          "created": 1726241349,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmyky7e",
          "score": 4,
          "body": "I work in a downtown neighborhood of Austin.  Daily I see Waymo and whatever Ford is up to.  Lately Waymo seems to be parked on the side of the road simply collecting data of cars passing.  It's kind of weird seeing the SLAM lidar twirly devices spinning just sitting there. \n\nAlso, Chic-fil-a has a delivery robot rolling around. I ordered from it for my birthday just to say hey i did that... it was worked well enough to normalize.\n\nI just don't want to be paying human wages for these services.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmyky7e/",
          "created": 1726248947,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmywisk",
          "score": 6,
          "body": "People are having sex in the backseat while they Waymo drives them around.  If you don’t buckle your seat, a live agent will hop on the speaker and tell you buckle up",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmywisk/",
          "created": 1726252736,
          "depth": 1,
          "replies": [
            {
              "id": "lmz5063",
              "score": 4,
              "body": "Live agents get to watch live porn?",
              "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmz5063/",
              "created": 1726255547,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ln07jxa",
          "score": 2,
          "body": "> Are riders responsible for monitoring the vehicle's operation, \n\nIf that's the case Uber should be paying *me*.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln07jxa/",
          "created": 1726269041,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ln02bn5",
          "score": 2,
          "body": "> Are riders responsible for monitoring the vehicle's operation\n\nThe rider isn't in the driver seat, and there is no steering wheel.  The riders are not responsible for what the vehicle does.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln02bn5/",
          "created": 1726267045,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmxukvt",
          "score": -5,
          "body": "People can have sex in it kind of autonomy, happens all the time in San Francisco.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmxukvt/",
          "created": 1726240453,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmy07br",
      "score": 1,
      "body": "Uber and Waymo will provide driverless ride-sharing services in Austin and Atlanta soon.",
      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmy07br/",
      "created": 1726242269,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmyy2da",
      "score": 1,
      "body": "If waymo truely is at level 4 autonomy already ( meaning no person actually needed behind the wheel), why don’t they focus on making cars to the general public already?",
      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmyy2da/",
      "created": 1726253243,
      "depth": 0,
      "replies": [
        {
          "id": "lmz7b1r",
          "score": 11,
          "body": "It's better for liability and financial reasons to not let anyone own this tech on personal vehicles and rather sell it as a service.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmz7b1r/",
          "created": 1726256316,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ln26kod",
          "score": 3,
          "body": "Because Waymo has an expensive sensor suite that's not worth it for consumers (who can just drive themselves), but worth it for commercial operations to save wages?",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln26kod/",
          "created": 1726306026,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ln7eo71",
          "score": 2,
          "body": "Because it technically isn't, the system will contact operators under certain circumstances.\n\nOthers have listed other reasons as well.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln7eo71/",
          "created": 1726378838,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lmy1cwp",
      "score": -14,
      "body": "This stuff may make for good headlines, but IMO there's just no way that Waymo's methodology is going to scale long term, and I'm skeptical that they're ever going to be profitable at this rate given that they've been working on this for like 15 years with most of those being revenue-less years.\n\nIt takes WAY too long and way too much work for them to get their robotaxi's to work in each new area, and they need to constantly do work to keep it working in the existing areas. And the fact that they only work in a few small geo-fenced areas greatly limits the value of the product, and basically makes it useful ONLY for robotaxi's, even though there's countless other use cases for it that could be just as if not even more lucrative. For example:\n\n* What if I want my semi-trucks to drive my cargo across the US? There's no way Waymo can ever do that. \n\n* What I'm a really rich person who likes the idea of buying a car where I can just let the AI drive me to work/etc. while I just sleep? Unless you happen to live in one of a few cities Waymo has chosen and don't need to travel outside of that geo-fenced area tough luck, it's not happening.\n\nIMO Waymo's methodology only makes sense if you have an unlimited budget supplied by a wealthy government to get it to work nationwide for the public good, which they don't have.",
      "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmy1cwp/",
      "created": 1726242638,
      "depth": 0,
      "replies": [
        {
          "id": "lmysudh",
          "score": 8,
          "body": "> no way that Waymo's methodology is going to scale long term\n\nYou do realize that the geo-fence is them working from a safety first position, right? Road conditions are constantly changing, the geo-fence exists purely for them to train their AI to recognize things in real time without needing to do a Doppler radar level evaluation of the location they will operate in. Soon enough, it will be rolled out without the geo-fence, then you Tesla people will move the goalposts again about how Tesla is actually ahead in the robot car business because Elon said so.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmysudh/",
          "created": 1726251531,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmy8cd8",
          "score": 8,
          "body": "15 years ago people like you would have said “robo taxis will never be a thing. They won’t be able to drive in a city.” Now they drive in cities. \n\nRiding fairly consistent highways across the country isn’t that shocking. \n\nImagine a freight company has stations across the U.S. as well. Remote truck makes it halfway then gets confused by route and pulls over. Someone 20 minutes away comes and gets it back on track, then it’s off to finish. Like there are ways to do anything, and 15 years from NOW technology and the data will only be better.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmy8cd8/",
          "created": 1726244887,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmyusf4",
          "score": 3,
          "body": "Your semi trucks?  This isn't about semi trucks this is about an evolving technology for vehicles.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmyusf4/",
          "created": 1726252165,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmyw022",
          "score": 3,
          "body": "> there's countless other use cases for it that could be just as if not even more lucrative.\n\nThe geo-fence limitations can reduce use cases, but there's still opportunities like:\n\n* Municipal services like trash pickup, street cleaning, parking enforcement, low-intensity police patrol, etc.\n\n* If the city is near a big logistics hub like an airport or port, they can do port-to-warehouse first/last leg transportation.\n\n* Public transportation. Shuttle services between tourist attractions or civic centers.\n\n* Last leg local deliveries for Amazon and other ecommerce services.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmyw022/",
          "created": 1726252566,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmy6f48",
          "score": 3,
          "body": "But they don't have to work nationwide, work in all cases or even work in all cities for it to be meaningful. \n\nTo your semi-truck example, I am fairly confident we will see autonomous trucks on interstates within 3-5 years. Closer to their exit from interstate, they will stop a rest area where a local driver will take over for the final miles. There is significant benefit in this since the longest part of the trip is done autonomously and you don't have to wait for driver resting etc.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmy6f48/",
          "created": 1726244264,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmyo0tr",
          "score": 2,
          "body": "The tech is waayyy more complex than anyone could have ever imagined, especially once you consider the state infrastructure in the US. Google has that unlimited money lol. One idea I saw was that China was building roads that could communicate with the cars. If there is construction or some sort of detour that's necessary, the cones and any barriers could, \"talk\", to the car.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/lmyo0tr/",
          "created": 1726249953,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ln03696",
          "score": 2,
          "body": ">  And the fact that they only work in a few small geo-fenced areas greatly limits the value of the product\n\nConversely, they only spent time/energy on providing a robotaxi where it was allowed by law.\n\nCan't really call their approach a failure unless 10+ new cities allow robotaxis and they fail to enter those markets because their solution doesn't scale to them.",
          "permalink": "/r/stocks/comments/1ffw4rb/uber_and_waymo_to_offer_driverless_ridesharing/ln03696/",
          "created": 1726267371,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}