{
  "title": "Verizon puts price tag on buyouts and says nearly 5,000 employees are leaving",
  "score": 303,
  "selftext": "Verizon Communications Inc. said Thursday it expects charges of up to $1.9 billion in its third quarter in connection with employee buyouts.\n\nAbout 4,800 employees will leave the telecommunications giant by March under the voluntary separation program that Verizon announced in June. Half of those employees are leaving in September, the company said.\n\nVerizon said that it expects to record severance charges in a range between $1.7 billion and $1.9 billion, or $1.3 billion and $1.4 billion in after-tax charges, in the third quarter.\n\nIn a filing in February, Verizon said it had about 105,400 full-time employees as of December, with 89% of them based in the U.S.\n\nVerizon also said that as part of ongoing cost-savings initiatives, it plans to stop using certain offices and leave “non-strategic portions” of certain businesses, without giving more details.\n\nAs a result, it also expects to record asset and business rationalization charges in the range of $230 million to $380 million, or $170 million to $290 million after tax, in the quarter.\n\nAnalysts polled by FactSet expect Verizon to report in mid-October adjusted earnings of $1.18 a share on sales of $33.7 billion for its third quarter.\n\nIn the third quarter of 2023, the company reported adjusted earnings per share of $1.08 on sales of $33.3 billion.\n\nVerizon earlier this month announced plans to buy Frontier Communications Parent Inc. in a $20 billion all-cash deal, a play for a fiber-internet provider in the U.S.\n\nVerizon shares have gained more than 15% this year, slightly underperforming an advance of around 16% for the S&P 500\n\nhttps://www.marketwatch.com/story/verizon-puts-price-tag-on-buyouts-and-says-nearly-5-000-employees-are-leaving-d29f4c15",
  "link_flair_text": null,
  "id": "1fg7760",
  "num_comments": 57,
  "created_utc": 1726266031,
  "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/",
  "comments": [
    {
      "id": "ln00fip",
      "score": 162,
      "body": "Somethings never change. As someone who worked for them 17-18 yrs ago, it was the same even back then. Layoffs when times were good, and layoffs when times were bad. They never did small layoffs either, every six months it was over a 1000+ being let go, and it accelerated after VDSI, their India operations.",
      "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln00fip/",
      "created": 1726266326,
      "depth": 0,
      "replies": [
        {
          "id": "ln09we5",
          "score": 111,
          "body": "Modern management theory is you need to turn staff over every few years to keep productivity up.",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln09we5/",
          "created": 1726269946,
          "depth": 1,
          "replies": [
            {
              "id": "ln0bwl1",
              "score": 89,
              "body": "GE was one of the originators of this mentality. I believe it was during Jack Welch’s tenure at the company when this initially took place. Many companies will look to his results while CEO for their performance metrics. Very few look at the effects once he left.",
              "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0bwl1/",
              "created": 1726270719,
              "depth": 2,
              "replies": [
                {
                  "id": "ln0igpa",
                  "score": 34,
                  "body": "Jack Welch was the originator of this. Highly recommend the Behind the Bastards episodes on him if you feel like being angry.",
                  "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0igpa/",
                  "created": 1726273311,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ln15fh1",
                      "score": 1,
                      "body": "I really hate that show. Mostly because they hate literally everyone.",
                      "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln15fh1/",
                      "created": 1726283091,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ln1l9i8",
                          "score": 17,
                          "body": "I mean it IS a podcast about bastards.",
                          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln1l9i8/",
                          "created": 1726291473,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ln2rqq5",
                          "score": 7,
                          "body": "It's literally a podcast covering the worst human beings to ever live of course they hate everyone",
                          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln2rqq5/",
                          "created": 1726318354,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ln0cvgz",
              "score": 27,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0cvgz/",
              "created": 1726271099,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ln3x6vw",
              "score": 4,
              "body": "Isn't this how Microsoft operates? One of their gaming studios (343) certainly operates this way with a revolving door of contractors.",
              "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln3x6vw/",
              "created": 1726332996,
              "depth": 2,
              "replies": [
                {
                  "id": "ln7xzj2",
                  "score": 6,
                  "body": "[MS stopped stack ranking in 2013](https://money.cnn.com/2013/11/13/technology/enterprise/microsoft-stack-ranking/index.html).",
                  "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln7xzj2/",
                  "created": 1726391358,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ln4vovq",
                  "score": 5,
                  "body": "Not generally. No. Microsoft is known for having lots of log tenured folks. When I worked there, retirement parties were pretty common.",
                  "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln4vovq/",
                  "created": 1726343719,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ln6ko69",
                  "score": 5,
                  "body": "Amazon is famous for this. PIP.",
                  "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln6ko69/",
                  "created": 1726364593,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ln2ip8a",
              "score": 4,
              "body": "As much as I personally dislike \"corporate America\", if a business is developing new products/services the reality of staff turnover for the products/services that aren't viable is inevitable. \n\nEspecially for products/services using niche technologies, e.g. dbt for cloud ETL work. The tooling is so niche you can't simply \"move X person with Y niche skills\" to another position easily.\n\nI understand why people wouldn't like that theory though.",
              "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln2ip8a/",
              "created": 1726313982,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ln1bmnv",
              "score": -1,
              "body": "did you just make this up? if not, source?",
              "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln1bmnv/",
              "created": 1726286096,
              "depth": 2,
              "replies": [
                {
                  "id": "ln3de9y",
                  "score": -2,
                  "body": "I work in senior management.",
                  "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln3de9y/",
                  "created": 1726326653,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ln0g0jx",
          "score": 22,
          "body": "Gosh, and they wonder why their employees have *zero* loyalty to the company. These fucks expect their employees to buy into the corporate culture and devote their lives to padding the bottom dollar, while cutting their throats at the drop of a hat. I’m a capitalist through and through, but these companies have absolutely destroyed the social contract with their employees.",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0g0jx/",
          "created": 1726272332,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ln12jp8",
          "score": 34,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln12jp8/",
          "created": 1726281776,
          "depth": 1,
          "replies": [
            {
              "id": "ln14lty",
              "score": 24,
              "body": "I was with VZ when Ivan Seidenberg was the CEO. They targeted union-affiliated employees for most of the RIFs. They began outsourcing to India in the early 2000s, but around 2006, Verizon opened a fully captive unit in India called VDSI. After that, there was a deluge of layoffs in tech. To give you an idea how bad RIFs are at VZ, the total employee count in the US was over 250k in the early 2000s, today their global headcount is 105k! Seidenberg and every subsequent CEO took home over $20m/yr in pay while firing rank and file by the thousands!",
              "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln14lty/",
              "created": 1726282709,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ln6mdpr",
              "score": 5,
              "body": "Outdated H1B visa policies are the main cause for this shit show.\n\nForeign workers can't be unemployed for more than 3 months. So, they're less likely to leave when being overworked and are more likely to compromise on total comp. The minimum mandated wage for a H1B worked is only $60k/year and this hasn't been updated in a long time.\n\nAnd in the current lottery system, someone making $350k/year has the same odds as someone with a $60k/year job offer.\n\nBoth Trump and Biden tried to change these policies but were blocked by Chamber of Commerce aka greedy corporations that want wages to remain stagnant.",
              "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln6mdpr/",
              "created": 1726365300,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ln3pjpr",
          "score": 0,
          "body": "To be clear, this wasn't a layoff.",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln3pjpr/",
          "created": 1726330569,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ln0yl10",
          "score": -2,
          "body": "They are paying people to leave. Stop complaining",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0yl10/",
          "created": 1726280012,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ln0sc2m",
      "score": 88,
      "body": "Voluntary severance?    So all the employees who are highly skilled and can get another job instantly will take the package, leaving behind the less able.    What a great way to run a company!   \n\nI really wonder what these managements are thinking.",
      "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0sc2m/",
      "created": 1726277344,
      "depth": 0,
      "replies": [
        {
          "id": "ln0x0fg",
          "score": 25,
          "body": "Assuming what they are offering is, if you're interested, you can take the severance package and leave? Basically, sign up for it?",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0x0fg/",
          "created": 1726279333,
          "depth": 1,
          "replies": [
            {
              "id": "ln1070u",
              "score": 18,
              "body": "Yes that’s generally what voluntary severance is, or something like the employer wants a return to office for WFM employees but offers voluntary severance for those who don’t wish to comply. Basically, we know we gotta let a shit ton of you go, so does anyone wanna go anyway? After the volunteer rounds comes the being told rounds",
              "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln1070u/",
              "created": 1726280726,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ln35hyj",
          "score": 14,
          "body": "At my company (listed top 20 US by revenue) whenever there was a voluntary departure program like that, top performers were explicitly excluded from it :)\n\nAlso, whenever there was a divestiture of part of the business, word on the street is that they would arrange to move the low performers to the to-be divested branch, and the top performers back to the core business, ahead of divesting! (ofc not proven but several obvious cases of seemingly weird last minute assignment change made people speculate).",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln35hyj/",
          "created": 1726323905,
          "depth": 1,
          "replies": [
            {
              "id": "ln3co8u",
              "score": 10,
              "body": "That is a popular corporate game, even within an operating company.   If you have bad employees, have them apply for a job in another department, and give them a ringing endorsement!",
              "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln3co8u/",
              "created": 1726326413,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ln3ldh5",
          "score": 10,
          "body": "Basically. The offer was 3 weeks pay for every year of service, capped at 60 weeks, plus full yearly bonus, whatever unvested stock was still pending, plus (not sure number of) months of health coverage. \n\nAnybody with 20 years who was eligible would have been looking at considerably more than a year's salary in a lump payment. The last time they offered it company-wide, they lost something like 11% of the workforce. The offer was limited to specific organizations this time around, otherwise the numbers would have been similar.\n\nBut yeah, the ones with decades of service and institutional knowledge have an offer that's hard to refuse, especially if they're confident of getting another job quickly. This practically ensures that the best and brightest jump ship leaving a knowledge vacuum.\n\nWhat management is thinking is that they replace those leaving with recent grads making a third of the person taking the package. Makes the numbers look good when it comes time for the quarterly financials. Good numbers mean good times for C-Suite. It's shortsighted for sure.",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln3ldh5/",
          "created": 1726329236,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ln5d14a",
          "score": 3,
          "body": "It is always the same.\n\nMy old manager left Unilever with a severance and the next day was working for another company in another sector.",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln5d14a/",
          "created": 1726349139,
          "depth": 1,
          "replies": [
            {
              "id": "ln8q16q",
              "score": 2,
              "body": "Ha!   I was working for a bank in 1990, and they offered 5 years on your age and 5 years on you service.  A guy who was 46 took the package, and for a big severance and a fat pension.   Two weeks later, he was back as a contractor at $600 a day.   He was there another 19 years, the original double-dipper.",
              "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln8q16q/",
              "created": 1726406422,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ln87bta",
          "score": 1,
          "body": "My mom worked for Verizon I bet it's a lot of the union workers. It'd be all based on time in the company. I bet most of these people looking or being offered the buyout are near retirement age",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln87bta/",
          "created": 1726397839,
          "depth": 1,
          "replies": [
            {
              "id": "ln8ide3",
              "score": 1,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln8ide3/",
              "created": 1726403479,
              "depth": 2,
              "replies": [
                {
                  "id": "ln8on62",
                  "score": 1,
                  "body": "Interesting I didn't know that",
                  "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln8on62/",
                  "created": 1726405908,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lnelsfd",
          "score": 1,
          "body": "Automation. Ai. No need to pay humans. The remaining few can collect billions. You know. Scummy disgusting putrid pompous fa&$oty deceitful people like they are. Like I keep saying. It’s them versus us. Rich against poor. That money don’t mean a damn thing if they aren’t able to spend it.",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/lnelsfd/",
          "created": 1726492966,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ln1u2bk",
          "score": 1,
          "body": "I don’t think there were any competent people left to begin with. Anyone decent was already working elsewhere",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln1u2bk/",
          "created": 1726297131,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ln02qwf",
      "score": 41,
      "body": "Is that $400,000 an employee????",
      "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln02qwf/",
      "created": 1726267206,
      "depth": 0,
      "replies": [
        {
          "id": "ln0k2lf",
          "score": 57,
          "body": "That's 1,000,000 for upper management and above, tree fiddy for everyone else.",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0k2lf/",
          "created": 1726273958,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ln11xsv",
          "score": 11,
          "body": "It usually includes health insurance",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln11xsv/",
          "created": 1726281503,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ln12v2c",
          "score": 15,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln12v2c/",
          "created": 1726281917,
          "depth": 1,
          "replies": [
            {
              "id": "ln2ocyj",
              "score": 8,
              "body": "If you're close to retirement that's a solid package.",
              "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln2ocyj/",
              "created": 1726316824,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ln0rb3k",
      "score": 21,
      "body": "Sucks that telecom is basically a huge anticompetitive cartel of companies.",
      "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0rb3k/",
      "created": 1726276911,
      "depth": 0,
      "replies": [
        {
          "id": "ln3n001",
          "score": 3,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln3n001/",
          "created": 1726329749,
          "depth": 1,
          "replies": [
            {
              "id": "ln3s2z4",
              "score": 3,
              "body": "https://arstechnica.com/information-technology/2022/08/google-fiber-plans-multi-state-expansion-5-years-after-pausing-buildouts/\n\nImo something like this is an issue. 2 companies in Nashville (the NES being public) own all of the utility poles in the city. Google Fiber wants to expand, bringing more competition. So they take advantage of a city ordinance so they and other new ISPs can set up on utility poles quicker. Telecom execs get scared, launch suits to slow Google down. Getting rid of anticompetitive actions isn't a full solution but it's a start. A company owning the infrastructure that all ISPs rely on is also a conflict of interest... but that's the classic American tale of lesser evils between \"monopolistic company abuses conflict of interest\" and \"muni/federal govts are completely inefficient\".",
              "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln3s2z4/",
              "created": 1726331379,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ln0jdtn",
      "score": 24,
      "body": "Didn’t they sell their FIOS fiber Internet to frontier? now they are buying back?",
      "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0jdtn/",
      "created": 1726273683,
      "depth": 0,
      "replies": [
        {
          "id": "ln14jue",
          "score": 18,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln14jue/",
          "created": 1726282684,
          "depth": 1,
          "replies": [
            {
              "id": "ln3n5zr",
              "score": 8,
              "body": "It's almost like they have no idea what they're doing. Probably have a chicken in the boardroom picking squares on a bingo board. It's the only thing that could explain the Yahoo purchase.",
              "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln3n5zr/",
              "created": 1726329805,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ln0ojf7",
          "score": 9,
          "body": "Verizon is buying Frontier",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0ojf7/",
          "created": 1726275755,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ln0mnx9",
      "score": 13,
      "body": "Dinosaurs leaders and lame compensation.  What a cesspool of mediocrity. \n\n\nNever understood why they bought Yahoo/AOL/Bluejeans. Hans and his minions have no clue",
      "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0mnx9/",
      "created": 1726274995,
      "depth": 0,
      "replies": [
        {
          "id": "ln11fan",
          "score": 6,
          "body": "My office calls with their corporate guys was the only time I had even heard of Bluejeans.",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln11fan/",
          "created": 1726281274,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ln0hvri",
      "score": 12,
      "body": "Worked for Verizon India division and it was toxic AF. Overworked employees that were laid off every couple of years so they didnt have to pay bonus, raises and always bought on fresh employees old ones needed to train all over again.",
      "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0hvri/",
      "created": 1726273079,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ln35j88",
      "score": 3,
      "body": "All companies go through this, once the service is commoditized there is no value left in it. The key to staying in technology is to make sure that you are at the cutting edge of any technology, if you fall behind you are outdating yourselves slowly.",
      "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln35j88/",
      "created": 1726323918,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ln0r97r",
      "score": 6,
      "body": "Pretty sure my uncle drew over 2 million from a pension through Verizon , installed telephones and retired in 2000",
      "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0r97r/",
      "created": 1726276888,
      "depth": 0,
      "replies": [
        {
          "id": "ln0z0f5",
          "score": 14,
          "body": "Your uncle drew 2 million from a pension plan? Pressing x to doubt.",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0z0f5/",
          "created": 1726280199,
          "depth": 1,
          "replies": [
            {
              "id": "ln3nok0",
              "score": 5,
              "body": "If he was climbing poles for one of the Bells in the 70's and 80's, it's possible. The union employees used to have a very good pension.\n\n**EDIT:** If retired in 2000 means he was 60 and worked there his whole career (40 years) back to the 60's, $2 mil over 20+ years of retirement is plausible.",
              "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln3nok0/",
              "created": 1726329970,
              "depth": 2,
              "replies": [
                {
                  "id": "ln5c9b6",
                  "score": 3,
                  "body": "100k a year! I suppose. Damn",
                  "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln5c9b6/",
                  "created": 1726348890,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ln294g0",
          "score": 3,
          "body": "My uncle as well, not sure rmthe dollar amount, but he didn’t hurt for money. He was part of the teleworkers union. Retired around 2004",
          "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln294g0/",
          "created": 1726307873,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ln3mmyj",
      "score": 2,
      "body": "not only does it suck for those being laid off, but the people that stay get to do even more for the same pay",
      "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln3mmyj/",
      "created": 1726329636,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ln0yvzr",
      "score": -2,
      "body": "Lmao I'm on the opposite side of this. Verizon has  6% dividend while rates are about to get cut. It's been on a bull run for a bit now and is one of the biggest cellular companies in the USA. Price target $50-60 over the next year easily.",
      "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln0yvzr/",
      "created": 1726280146,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ln106cl",
      "score": 0,
      "body": "#VZ 📈",
      "permalink": "/r/stocks/comments/1fg7760/verizon_puts_price_tag_on_buyouts_and_says_nearly/ln106cl/",
      "created": 1726280718,
      "depth": 0,
      "replies": []
    }
  ]
}