{
  "title": "Curious About Opinions on Small Mining Stocks",
  "score": 36,
  "selftext": "[removed]",
  "link_flair_text": "Discussion",
  "id": "1fgcpro",
  "num_comments": 7,
  "created_utc": 1726283005,
  "permalink": "/r/wallstreetbets/comments/1fgcpro/curious_about_opinions_on_small_mining_stocks/",
  "comments": [
    {
      "id": "ln247a4",
      "score": 1,
      "body": "Thanks for your submission! \n\nTo prevent terrible and illiquid companies from flooding our subreddit, we've instituted a minimum market cap threshold.\n\nThis threshold is $500MM and is automatically enforced by a bot. \n\nSometimes however, it gets things wrong. If that's the case, please [send us a message](https://old.reddit.com/message/compose/?to=/r/wallstreetbets) and we'll look into it right away.\n\nThe bot will unspam tickers when their market cap is >500MM and re-spam them after they sink to under 400MM. (Roughly, and sometimes it takes a day or two to update)\n\nIf you need some guidance, don't hesitate to [reach out to modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets) and we'll give you some pointers!",
      "permalink": "/r/wallstreetbets/comments/1fgcpro/curious_about_opinions_on_small_mining_stocks/ln247a4/",
      "created": 1726304267,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ln1mp4v",
      "score": 3,
      "body": "depends on the company, most of the small juniors are just hoping to make enough noise to get bought out by the BHP's of the world.  They pay for the exploration, if they find something attractive enough they become instant millionaires, but most of them disappear and then reappear under a new name.\n\n  \nIf you have a junior mining company that says they won't sell and want to build the mine and mill (refinery), run away because they are looking to waste money and will dilute your stock with new investors as much as they can.\n\n  \nYou can dig into people who have had good success selling off to the big companies and see where they are, usually a good indication that they have contacts and can actually sell their dream.  alternatively look for metals that are at a low point but are on the uptick and pick some juniors.  Uranium is popping right now, might be too late to hop on that ship, but there are a few smaller companies that have some really good ore bodies up in Canada that might end up with something bigger.",
      "permalink": "/r/wallstreetbets/comments/1fgcpro/curious_about_opinions_on_small_mining_stocks/ln1mp4v/",
      "created": 1726292353,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ln1zzg6",
      "score": 3,
      "body": "Honestly man stay away from cherry picking in junior mining unless you have insider information.\n\nGDXJ is what you want.\n\nYou need to pay attention to the jurisdiction, drill results, royalties, property options, financing, debt. Who's the ceo whats the end goal. \n\nI like anything in Nevada for early stage at this time.\n\nNKG\nHYMC\n\nBut yea this market is so depressed right now it really sucks. Some nice project being evaluated at 6$/oz its crazy.",
      "permalink": "/r/wallstreetbets/comments/1fgcpro/curious_about_opinions_on_small_mining_stocks/ln1zzg6/",
      "created": 1726301226,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ln15926",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1fgcpro/curious_about_opinions_on_small_mining_stocks/ln15926/",
      "created": 1726283009,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ln22aku",
      "score": 1,
      "body": "Check out American Battery Technology Company (ABAT)!... They're trying to build America's largest lithium mine on a haunted Indian burial ground, and getting sued by native Americans in the process, they're like the Scooby Doo villains of small cap mining stocks... But that's not all, as if it's not capital intensive enough to build a lithium mine using unproven technology, they're also trying to build a battery recycling ecosystem too, with even more unproven technology... They're down 99% from all time highs, it's basically like the worst investment opportunity of all time... they're about a dollar share right now with a market cap of 50ish million, they're absolutely running on fumes and have basically no cash left... Only someone highly regarded would consider them a buy... Luckily their CEO is on the spectrum... SEC filings reveal large insider buying from their highly regarded CEO... They're announcing revenue from their recycling business soon, and one large commercial partnership could make them pop... or they'll end up in the toilet... I bought in last month at $1.01 and I could not be more bullish 🍆🍆🍆🚀🚀🚀",
      "permalink": "/r/wallstreetbets/comments/1fgcpro/curious_about_opinions_on_small_mining_stocks/ln22aku/",
      "created": 1726302881,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ln25qz7",
      "score": 1,
      "body": "Try following Rick Rule, he seems to know some stuff about this. As far as I can tell, doing one's own research is really hard in this sector.",
      "permalink": "/r/wallstreetbets/comments/1fgcpro/curious_about_opinions_on_small_mining_stocks/ln25qz7/",
      "created": 1726305419,
      "depth": 0,
      "replies": []
    }
  ]
}