{
  "title": "PACS: Prestige acquisition finalized so earnings will soar",
  "score": 50,
  "selftext": "PACS operates skilled nursing facilities in the western US.  The company had its IPO in April of this year and is up 77% since then.  But it’s still undervalued.\n\nPACS generally leases facilities. They pay rent, taxes, maintenance and wages.  Revenue comes from insurance reimbursement based on number of residents and services provided to those residents.\n\nThe largest 9 skilled nursing facility (SNF) operators only manage 11% of total SNFs in the USA.  This means that the vast majority of SNFs are managed by small operators or are individually owned.  Some of these facilities are well run and efficient, but many of them aren’t.  So, there are incredible opportunities for large operators, like PACS, that can take over leases of poorly run facilities and greatly improve income.  These turnarounds generally take around 18 months.  \n\nENSG is another company in the same business as PACS.  ENSG is up around 1000% in 10 years.  This just shows that there’s a lot of potential in SNF consolidation.\n\nPACS announced, just this week, that they finalized a huge acquisition.   [https://www.businesswire.com/news/home/20240910499494/en/PACS-Group-Extends-Footprint-Services-to-Pacific-Northwest-and-Other-States](https://www.businesswire.com/news/home/20240910499494/en/PACS-Group-Extends-Footprint-Services-to-Pacific-Northwest-and-Other-States) They have now taken over operations of Prestige Care’s entire SNF portfolio: 53 facilities.  PACS operated 220 facilities before the acquisition, so this is a 24% increase in facility count.  \n\nThe 53 new facilities are mostly located in the Pacific Northwest: near Portland and in Washington state.  I was able to find occupancy data for most of the new facilities from CMS.  I calculated an average occupancy rate of only 69%.  According to the most recent 10-Q report, PACS has an occupancy rate of 94% for all facilities they have managed for more than 18 months.  Based on this: occupancy, revenue and earnings should all greatly improve for the 53 new facilities in upcoming quarters.\n\nA high percentage of new facilities (operated for less than 18 months) indicates greater potential for earnings growth.  Before the acquisition, 65 out of 220 (29%) PACS facilities were new.  Now 118 out of 273 facilities (43%) are new.\n\nPotential labor shortages, and especially skilled labor shortages are important to consider when forecasting how quickly PACS can turnaround the 53 new facilities.  The availability of nurses and other healthcare professionals varies greatly by region.  Rural areas generally have much more difficulty finding and keeping nurses.  \n\nThe 53 new facilities are mostly located near major cities like Portland and Seattle. We would expect staffing to be much less of a problem than if they were mostly located in rural areas.  And job openings on PACS careers website backs that up.  I checked openings for as many of the 53 new facilities that I could find.  Total number of openings (including cleaners, meal prep, etc.) at each facility was generally in the single digits.  Nurse openings were mostly around 3 per facility. \n\nAverage total staff at SNFs is 150 to 200 employees and average number of Registered nurses is around 15-20 (according to Meta AI anyway).  So the job openings at the new facilities probably only represent a small portion of total staff.\n\nOnly 1 of the 53 facilities appeared to be having great difficulty finding qualified staff: a facility in Carson City Nevada that was offering sign-on bonuses for nurses.  While in many rural areas of the country, sign-on bonuses and other incentives are the norm.  My point is staffing problems are not likely to limit occupancy and earnings growth at the 53 new facilities.\n\n**Facility shortage**\n\nThe pandemic caused construction of new facilities to slow dramatically.  First covid increased the death rate, which decreased occupancy directly and also decreased new admissions because facilities were viewed (correctly) as too dangerous.  Then, a severe labor shortage greatly affected the elderly care industry because it is very labor intensive.  Because the elderly care industry was so troubled, investors did not want to risk capital on new construction projects.  And construction still has not recovered, even with the first baby boomers approaching the age of 80.  New facilities construction rate is at its lowest level since 2014. Analysts are now projecting a shortage of 500,000 individual units for the elderly by 2030.  \n\nAnd that shortage is probably going to be worse than what analysts are currently projecting.  Death rates will be lower because of a herd-thinning effect in 2020-22.  Many more frail people died in those years than normal leaving a relatively more robust population.  USA death rates for the elderly were around 8% lower than expected levels in July.  This lower than expected death rate for the elderly is likely to continue for many months and years.  \n\nAlso, dementia rates are increasing because much of the population suffered at least some degree of brain injury from covid.  Here’s what is happening in the UK, where they are tracking the rates: [https://www.england.nhs.uk/2024/07/dementia-diagnoses-in-england-at-record-high/](https://www.england.nhs.uk/2024/07/dementia-diagnoses-in-england-at-record-high/)\n\nSo both of these factors are going to further strain Elderly care facilities and increase occupancy.  This benefits nursing home operators, like PACS, directly because occupancy rates will increase more quickly.  But it also means medicaid & medicare must keep reimbursement rates high to incentivize the construction and operation of new units.\n\n**Valuation**\n\nPACS revenue growth is very strong at 29.1% and I think this is likely to continue or accelerate due to their new acquisitions.Their earnings growth is a bit difficult to figure out because they just had their IPO and there were a lot of expenses related to that. Net income was $38.2 million in first 6 months of 2024 vs. $58.8 million for first 6 months of 2023.  But if you adjust for the one time expenses (on page 35 of their most recent 10-Q), I get earnings of $124.5million for first 6 months of 2024 vs $62.6 million for first 6 months of 2023.  This gives 98% earnings growth. \n\nFor earnings per share, I get: ($124.5million\\*2)/129 million shares = 1.93.  Current price is 40.72 so for trailing PE ratio I get 21.1.  And for PEG ratio: 21.1/98 = 0.21.  So the stock looks incredibly undervalued based on p/e ratio and past earnings growth. And that doesn’t even include the potential of the new acquisitions.\n\nIf someone wants to check me on my numbers and math, that would be great! I definitely could have made some mistakes or I could even be completely wrong here so please check me.\n\nElderly care positions: ADUS: 300 shares, PACS: 426 shares, OHI:  459 shares, ENSG: 125 shares",
  "link_flair_text": "DD",
  "id": "1fgnku5",
  "num_comments": 32,
  "created_utc": 1726324812,
  "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/",
  "comments": [
    {
      "id": "ln3815t",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 8 months ago\n**Total Comments** | 78 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1cwobk1/fmc_may_soar_on_a_spike_in_pesticide_demand/) [x](https://www.reddit.com/r/wallstreetbets/comments/1f0374m/ohi_7_yield_and_nav_will_moon/) [x](https://www.reddit.com/r/wallstreetbets/comments/1fbwgxe/as_public_school_quality_deteriorates_lrn/) [x](https://www.reddit.com/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/) \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln3815t/",
      "created": 1726324818,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ln423qs",
      "score": 15,
      "body": "this is actually pretty excellent lmao, need to first get out of my satellite radio position",
      "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln423qs/",
      "created": 1726334515,
      "depth": 0,
      "replies": [
        {
          "id": "ln4b26i",
          "score": 4,
          "body": "Oh brother, you And me both",
          "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln4b26i/",
          "created": 1726337267,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ln5n9vp",
          "score": 2,
          "body": "Ticker?",
          "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln5n9vp/",
          "created": 1726352421,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ln4ide8",
      "score": 10,
      "body": "Didn’t read. I’m in",
      "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln4ide8/",
      "created": 1726339591,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ln3bqpc",
      "score": 3,
      "body": "How about WELL?  They look pretty strong lately.",
      "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln3bqpc/",
      "created": 1726326097,
      "depth": 0,
      "replies": [
        {
          "id": "ln3cyrx",
          "score": 4,
          "body": "PACS is an operator, and WELL is an owner of facilities.  Both are good.  I wrote a post about OHI, which is another owner, a few weeks ago.  Owners are going to benefit from more stable tenants (operators) as occupancy increases. And they'll also benefit from asset value increases as facility shortages emerge.",
          "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln3cyrx/",
          "created": 1726326512,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ln3jw9m",
      "score": 3,
      "body": "Positions?",
      "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln3jw9m/",
      "created": 1726328765,
      "depth": 0,
      "replies": [
        {
          "id": "ln3pzxv",
          "score": 1,
          "body": "426 shares so $17K.  Not sure if options are available.",
          "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln3pzxv/",
          "created": 1726330714,
          "depth": 1,
          "replies": [
            {
              "id": "ln3wl25",
              "score": 6,
              "body": "Options are available…",
              "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln3wl25/",
              "created": 1726332805,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ln47wt8",
              "score": 2,
              "body": "They are... I have them on my watchlist... Was supposed to play them for earnings... Plan on getting in after last reportings",
              "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln47wt8/",
              "created": 1726336293,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lo61a6c",
              "score": 1,
              "body": "SS positions please. How do you have $17K worth of stock and don't know if options are available?",
              "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/lo61a6c/",
              "created": 1726896482,
              "depth": 2,
              "replies": [
                {
                  "id": "lo6afnu",
                  "score": 2,
                  "body": "Because the plan is to buy and hold, of course.  Added more yesterday.\n\nhttps://preview.redd.it/l1x4q6q634qd1.jpeg?width=873&format=pjpg&auto=webp&s=f574ab32a5c89e426dbbc28aa3b1a7756e6d899e",
                  "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/lo6afnu/",
                  "created": 1726902310,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ln50fai",
      "score": 3,
      "body": "I think $ENSG is largely a safer and more consistent investment option. They have a longer track record and consistent growth, $PACS has much worse debt to equity and recently in Q2 2024 had a net loss. Net income declined from about 60M to 40M six months ended June 2024 compared to 2023, and from 21M to -10M three months ended June 2024 compared to 2023. PACS appears to be acquiring aggressively and taking on a lot more debt which can be a risk.",
      "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln50fai/",
      "created": 1726345146,
      "depth": 0,
      "replies": [
        {
          "id": "ln5yddt",
          "score": 1,
          "body": "ENSG is great and I hold it, so I agree with you there.  But PACS just had their IPO in April so one time expenses from that appear in the Q2 reports.  If you look at the adjustments on the most recent 10-Q form you will see that normalized earnings greatly increased in Q2 2024 vs Q2 2023.",
          "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln5yddt/",
          "created": 1726356010,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnzs2cc",
      "score": 2,
      "body": "Dude I'm in. So my building was just acquired by PACS. There's this coked out Filipino dude that just took our rates from $400-500 a day to fucking $700-900 a day. And theyre getting there with all their recently acquired buildings. It will take time but this dude goes \"I've been a part of multiple acquisitions, if whoever the current staff are can't manage it, PACS WILL find people to get it done.\"\n\nI literally cornered him today as he was leaving and asked about if he is invested too. He said this his active plan is to put as much as possible into the company at least until January. In January they are planning to release their employee stock program thing where its 15% cheaper for employees to purchase.",
      "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/lnzs2cc/",
      "created": 1726800381,
      "depth": 0,
      "replies": [
        {
          "id": "lo13712",
          "score": 1,
          "body": "Wow sounds like they are already really pushing services for residents not just occupancy.  Hope your working conditions don't get too much worse. Good luck.",
          "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/lo13712/",
          "created": 1726828242,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvealfa",
      "score": 3,
      "body": "What do you think of Hindenbergs report on PACS??",
      "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/lvealfa/",
      "created": 1730748190,
      "depth": 0,
      "replies": [
        {
          "id": "lvg9gtx",
          "score": 1,
          "body": "https://preview.redd.it/959mxcu5mzyd1.jpeg?width=894&format=pjpg&auto=webp&s=83600148ba5acd322e13c36742181329a58f8413\n\n\"An SNF residents skilled care is considered to be emergency related unless it is altogether unaffected by the covid19 emergency\"\n\nSo unless the patients got the very same course of treatment before and after covid-19 outbreaks, they would be eligible for Medicare benefits.\n\nIt is very difficult to prove a patient was altogether unaffected by a covid outbreak.  And this standard is what is needed to find PACS liable. Also some of these assignments of patients to Medicare happened nearly five years ago, in 2020.\n\nI'm still holding and I'm hopeful a great earnings report on Thursday will boost confidence.",
          "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/lvg9gtx/",
          "created": 1730770789,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ln3nzlj",
      "score": 1,
      "body": "Positions??? Calls??",
      "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln3nzlj/",
      "created": 1726330067,
      "depth": 0,
      "replies": [
        {
          "id": "ln3q1az",
          "score": 1,
          "body": "426 shares so $17K.  Not sure if options are available.",
          "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln3q1az/",
          "created": 1726330726,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ln3xvut",
      "score": 1,
      "body": "This business model is a long-term play for sure with the raise in life expectancy projections in the future. Where do you think their fair value is at right now?",
      "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln3xvut/",
      "created": 1726333216,
      "depth": 0,
      "replies": [
        {
          "id": "ln3z1fa",
          "score": 5,
          "body": "I don't know how to calculate fair value but if trailing p/e is 21 and growth is at least 30%, then I think it's greatly undervalued.  Also, debt/EBITDAR is only 1.6X.",
          "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln3z1fa/",
          "created": 1726333575,
          "depth": 1,
          "replies": [
            {
              "id": "ln41i7o",
              "score": 2,
              "body": "How does that compare to the industry standard? We can work it out backwards…",
              "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln41i7o/",
              "created": 1726334332,
              "depth": 2,
              "replies": [
                {
                  "id": "ln425az",
                  "score": 3,
                  "body": "ENSG has been around since 2007. ENSG has revenue & earnings growth of around 12% and a ttm p/e of 39 according to Yahoo.  Probably not entirely fair comparison because I think ENSG owns a higher percentage of facilities vs PACS.",
                  "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln425az/",
                  "created": 1726334528,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ln8ao2n",
                      "score": 2,
                      "body": "Why is it that PACS has such a higher projected growth rate compared with ENSG? don't you think would be more reasonable to assume something slightly above the 12% you mentioned, perhaps 15% growth? Market cap of ENSG is only 2B above that of PACS, and they're around since 2007 as you mentioned, so do you really see such that big of a room for additional expansion ?",
                      "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln8ao2n/",
                      "created": 1726399802,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ln8dlq3",
                          "score": 1,
                          "body": "It looks like 16% of ENSG's facilities are new acquisitions (<18 months) vs. 43% for PACS.  New facilities have better earnings growth by far vs. mature.  12 or 15% is definitely reasonable to assume in 2 years or so for PACS. But I think growth is likely going to be significantly higher than that in upcoming quarters.  There's definitely more downside risks too though with PACS because it just had IPO.  For example they just did an additional public offering of shares a couple of weeks ago.",
                          "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln8dlq3/",
                          "created": 1726401349,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ln4cqn4",
                      "score": 1,
                      "body": "I’ll do some research as well, but it really seems like a good find. Cheers!",
                      "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln4cqn4/",
                      "created": 1726337786,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ln4l70s",
                          "score": 1,
                          "body": "Let me know if you find out anything. Yes do your own research because I'm not completely confident in the accuracy of the numbers I gave in the post![img](emote|t5_2th52|8882).  Good luck.",
                          "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/ln4l70s/",
                          "created": 1726340500,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvvsovu",
      "score": 1,
      "body": "This didn’t age well.",
      "permalink": "/r/wallstreetbets/comments/1fgnku5/pacs_prestige_acquisition_finalized_so_earnings/lvvsovu/",
      "created": 1730980652,
      "depth": 0,
      "replies": []
    }
  ]
}