{
  "title": "It’s a big week for central banks around the world, with a slew of rate moves on the table",
  "score": 181,
  "selftext": "Nine months ago (i.e. December 2023), we were told that Fed was going to cut interest rates by 0.75% throughout 2024 while the market had once priced in more than 1.50% rate cut this year ...\n\nAs of today, no interest rate cut has been observed so far \\~\n\nHow much will actually be reduced two days later?\n\n&#x200B;\n\n**It’s a big week for central banks around the world, with a slew of rate moves on the table**\n\n[https://www.cnbc.com/2024/09/16/fed-boe-and-boj-its-a-big-week-for-central-bank-rate-decisions.html](https://www.cnbc.com/2024/09/16/fed-boe-and-boj-its-a-big-week-for-central-bank-rate-decisions.html)\n\n*Key Points*\n\n* *The Federal Reserve’s highly anticipated two-day meeting, which gets underway on Tuesday, is poised to take center stage.*\n* *Elsewhere, Brazil’s central bank is scheduled to hold its next policy meeting on Wednesday. The Bank of England, Norway’s Norges Bank and South Africa’s Reserve Bank will all follow on Thursday.*\n* *A busy week of central bank meetings will be rounded off when the Bank of Japan delivers its latest rate decision on Friday.*\n\n&#x200B;\n\n*A flurry of major central banks will hold monetary policy meetings this week, with investors bracing for interest rate moves in either direction.*\n\n*The Federal Reserve’s highly anticipated two-day meeting, which gets underway on Tuesday, is poised to take center stage.*\n\n*The U.S. central bank is widely expected to join others around the world in starting its own rate-cutting cycle. The only remaining question appears to be by how much the Fed will reduce rates.*\n\n*Traders currently see a quarter-point cut as the most likely outcome, although as many as 41% anticipate a half-point move, according to the CME’s FedWatch Tool.*\n\n*Elsewhere, Brazil’s central bank is scheduled to hold its next policy meeting across Tuesday and Wednesday. The Bank of England, Norway’s Norges Bank and South Africa’s Reserve Bank will all follow on Thursday.*\n\n*A busy week of central bank meetings will be rounded off when the Bank of Japan delivers its latest rate decision at the conclusion of its two-day meeting on Friday.*\n\n*“We’re entering a cutting phase,” John Bilton, global head of multi-asset strategy at J.P. Morgan Asset Management, told CNBC’s “Squawk Box Europe” on Thursday.*\n\n*Speaking ahead of the European Central Bank’s most recent quarter-point rate cut, Bilton said the Fed was also set to cut interest rates by 25 basis points this week, with the Bank of England “likely getting in on the party” after the U.K. economy stagnated for a second consecutive month in July.*\n\n*“We have all the ingredients for the beginning of a fairly extended cutting cycle but one that is probably not associated with a recession — and that’s an unusual set-up,” Bilton told CNBC’s “Squawk Box Europe.”*\n\n*“It means that we get a lot of volatility to my mind in terms of price discovery around those who believe that actually the Fed \\[is\\] late, the ECB \\[is\\] late, this is a recession and those, like me, that believe that we don’t have the imbalances in the economy, and this will actually spur further upside.”*",
  "link_flair_text": "Broad market news",
  "id": "1fi1vf6",
  "num_comments": 46,
  "created_utc": 1726485120,
  "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/",
  "comments": [
    {
      "id": "lnebq0m",
      "score": 47,
      "body": "It's a 65.0% probability of a 50 bp cut as of this morning from CME FedWatch.\n\n[https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html](https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html)",
      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnebq0m/",
      "created": 1726488723,
      "depth": 0,
      "replies": [
        {
          "id": "lneee0z",
          "score": 76,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lneee0z/",
          "created": 1726489911,
          "depth": 1,
          "replies": [
            {
              "id": "lneknd9",
              "score": 70,
              "body": "If you're 100% sure of 25 bps and the market thinks there's only a 35% chance for 25bps and 65% for 50 bps, then you should head over to the bond market and make a very leveraged trade to earn a bunch of money.\n\nHowever, you actually don't know more than the market does so you probably shouldn't.",
              "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lneknd9/",
              "created": 1726492519,
              "depth": 2,
              "replies": [
                {
                  "id": "lnex51j",
                  "score": 5,
                  "body": "the market is only pricing in 65% of a 50 bps rate cut because in June 2022 Nick Timiraos with WSJ was given a heads up about a 75bps rate cut by the Fed during the silent week (1 week before FOMC), and now everyone thinks every article he writes during silent week is an early tip from the Fed to the market.\n\nHe wrote an article saying the Fed should do 50bps cut last Friday. I highly doubt it's a tip from the Fed, and more just him expressing his opinion in an article he wrote. It's very unlikely that Powell will be able to convince all the FOMC hawks to agree to a 50 bps rate cut, and Powell definitely doesn't want to see dissent votes on the first Fed cut, just 2 months before an election. He wants to be able to defend the Fed decision if he gets pressure by Trump, and a decision with dissents doesn't really make it easy to do that.",
                  "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnex51j/",
                  "created": 1726497131,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lneyz1v",
                      "score": 9,
                      "body": "[removed]",
                      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lneyz1v/",
                      "created": 1726497758,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lneze2v",
                          "score": 0,
                          "body": "Yes that's signalling a 50bps cut. Do you think he explicitly said the fed will cut 75bps in his June 2022 article?",
                          "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lneze2v/",
                          "created": 1726497901,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lnf0pj4",
                              "score": 3,
                              "body": "[removed]",
                              "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnf0pj4/",
                              "created": 1726498343,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lnf18mi",
                                  "score": -1,
                                  "body": "It was not more explicit. Fed waller and Williams both had opportunities to signal a 50bps cut after the job report. The 50bps rate cut decision rests on the labor market according to both Powell and those guys speeches.",
                                  "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnf18mi/",
                                  "created": 1726498518,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lnvkgwf",
                      "score": 1,
                      "body": "Do you still think Nick Timiraos doesn't have special access?  His article sparked the first big move in FFR futures.",
                      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnvkgwf/",
                      "created": 1726742539,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lneoacy",
                  "score": -1,
                  "body": "ELI5",
                  "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lneoacy/",
                  "created": 1726493927,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lner60t",
                      "score": 1,
                      "body": "The probabilities are determined by market prices of bonds.\n\nIf they lower rates by 25 bps, then bonds are too expensive right now.\n\nIf they lower rates by 50 bps, then bonds are too cheap right now.\n\nIf you're 100% sure it's going to swing one way or the other, you can make a leveraged trade in a way that earns you a lot of money.",
                      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lner60t/",
                      "created": 1726494994,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lnerc1n",
                      "score": 0,
                      "body": "You can place a zero sum, leveraged trade against or for certain outcomes via futures.",
                      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnerc1n/",
                      "created": 1726495055,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lneu3oz",
                          "score": 0,
                          "body": "I meant the trade.",
                          "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lneu3oz/",
                          "created": 1726496056,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lnez6tk",
                              "score": 1,
                              "body": "Maybe don’t use acronyms if you’re looking for something specific. Im just going to go out on a limb here and say you’re not qualified.",
                              "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnez6tk/",
                              "created": 1726497832,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lneq11y",
                      "score": -2,
                      "body": "Just ask ChatGPT to explain",
                      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lneq11y/",
                      "created": 1726494580,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lnewbj6",
                          "score": 1,
                          "body": "Holy ChatGPT:\n\" If you expect a 25 bps cut and bonds are too expensive:\n\nShort Bonds: Since bonds are overvalued (too expensive) for a 25 bps rate cut, you could short bonds (betting the price will fall). As the market realizes the smaller cut, bond prices could decrease, allowing you to profit from the short position.\n\nIf you expect a 50 bps cut and bonds are too cheap:\n\nBuy Bonds (Go Long): If you're certain that rates will be cut by 50 bps, and bonds are currently undervalued (too cheap), bond prices are likely to rise after the announcement. You can go long on bonds, expecting a price increase.\n\nUsing Leverage:\n\nLeverage allows you to amplify returns. If you’re confident in your prediction, you can use leverage to increase your exposure to the trade. However, keep in mind that leverage also increases the risk of losses if the trade goes against you.\n\nFor example:\n\nIf you expect a 50 bps rate cut and bonds are undervalued, you could borrow money to buy more bonds than you could with your own capital. When bond prices increase, your returns will be multiplied based on the leverage used.\n\nSimilarly, if you short bonds expecting a 25 bps cut and prices fall, leverage can increase your profits from the price decline.\n\nRisk Considerations:\n\nCertainty: Be cautious about being \"100% sure\" of rate cuts, as central bank decisions can be unpredictable. Misjudging the rate cut could lead to significant losses, especially if using leverage.\n\nMarket Reactions: Sometimes, even when you predict the rate cut correctly, the market may have already priced it in, or there may be other factors influencing bond prices. Always consider these potential risks.\n\nBy timing your trades based on rate cuts and leveraging your position, you can potentially generate large returns. However, proper risk management and a solid understanding of bond market dynamics are essential.\"",
                          "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnewbj6/",
                          "created": 1726496847,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lnfavz8",
                              "score": 1,
                              "body": "How do you feel it did in its assessment?",
                              "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnfavz8/",
                              "created": 1726501701,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lnef6lm",
              "score": 4,
              "body": "I'd be here, but Timiraos threw some doubt on size of rate cut being a lock last week.\n\n\nI genuinely don't know. My guess is probably the most positive outcome would be 50 bps, then pause for a meeting to be honest.",
              "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnef6lm/",
              "created": 1726490256,
              "depth": 2,
              "replies": [
                {
                  "id": "lnf0xys",
                  "score": 4,
                  "body": "50 bps and the market will selloff due to recession fears",
                  "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnf0xys/",
                  "created": 1726498421,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lnf2jav",
                      "score": 1,
                      "body": "I've seen enough evidence over the past week or so to say it's more nuanced than you're making it.\n\n\nThe 6th and half of CPI day reaaalllllyyyyy looked as if they were tantrums over the odds of a jumbo cut going down.\n\n\n\nThe only thing that I'd personally be concerned about is probably the carry trade in what I've hypothetically suggested. I just really don't think it harms anything to cut 50 bps and strongly allude to the idea that you're taking back the insurance hikes.",
                      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnf2jav/",
                      "created": 1726498944,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lnh8ibq",
                  "score": 2,
                  "body": "Nicky Timmy was noncommittal and said in prior tweets that Barkin indicated he supported 25bp. Would be tough to get unanimous 50bp.",
                  "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnh8ibq/",
                  "created": 1726524183,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lneivvg",
                  "score": 1,
                  "body": "50 and then have to come back down to 25, or to stand pat for half a year all seem pretty unsavoury compared to just doing 25 and another 25. Too much hopium from the impatient.",
                  "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lneivvg/",
                  "created": 1726491809,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lnerk73",
                      "score": 1,
                      "body": "50 and pause. It gives the Fed ability to narrow the risk of being behind the curve and the leeway to remain steady if it was ahead.",
                      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnerk73/",
                      "created": 1726495139,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lnelvv8",
                      "score": -1,
                      "body": "Eh, I don't see it that way.\n\n\nI think 50 bps in one full swoop to take back the insurance hikes, then 25 in December would be fine.\n\n\nI think multiple 25's in a row would be fine.\n\n\nI think multiple 50's is bearish. ",
                      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnelvv8/",
                      "created": 1726493003,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lnkdgoo",
              "score": 1,
              "body": "50 would scare the market.\n\nIt would be like: They said 25 and we are getting 50. They know something.",
              "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnkdgoo/",
              "created": 1726578752,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lnrzpbi",
              "score": 1,
              "body": "great example on why no one should listen to anyone on reddit who is confident in investing advice",
              "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnrzpbi/",
              "created": 1726685619,
              "depth": 2,
              "replies": [
                {
                  "id": "lnt8452",
                  "score": 1,
                  "body": "I see they deleted their comment lol",
                  "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnt8452/",
                  "created": 1726700093,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lnt8oom",
                      "score": 1,
                      "body": "u/mayorolivia",
                      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnt8oom/",
                      "created": 1726700301,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lnei5sy",
          "score": 3,
          "body": "It's reflecting MM actions ... not actual poll / survey from analysts",
          "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnei5sy/",
          "created": 1726491510,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnf25og",
          "score": 1,
          "body": "If I’m interpreting it right. It now says 61%  \n\nThat right?",
          "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnf25og/",
          "created": 1726498818,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnh8bim",
          "score": 1,
          "body": "Collective insanity",
          "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnh8bim/",
          "created": 1726524116,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnf837a",
      "score": 15,
      "body": "Hoping for 50 base points but expect 25. I hope the feds are more aggressive here, inflation is cooled and the economy can is starting to show signs of faltering. \n\nJust the feds signaling they will be aggressive to avoid a recession would be positive news.",
      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnf837a/",
      "created": 1726500791,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnfvdme",
      "score": 4,
      "body": "I think 50 would be better.  Get us down to about 4% as quick as possible, then watch the data \n\nBut it will be 25, imo.  I have very little doubt",
      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnfvdme/",
      "created": 1726508290,
      "depth": 0,
      "replies": [
        {
          "id": "lnh8wnf",
          "score": 3,
          "body": "Cut rapidly and market will price in even more cuts, leading to a massive loosening in financial conditions when inflation just printed 0.3% monthly (3.7% annualized).\n\nThe Fed has been consistently dovish since December 2022 and it has massively damaged our fight against inflation. We’ve now had 4 years straight above target. That’s failure.",
          "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnh8wnf/",
          "created": 1726524324,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnf3jjl",
      "score": 17,
      "body": "Please maintain the current rates. Way too much money has been printed over the past decade, and these rates are the only thing we have left to rein it in.",
      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnf3jjl/",
      "created": 1726499282,
      "depth": 0,
      "replies": [
        {
          "id": "lnfa9hb",
          "score": 16,
          "body": "No shot of this, considering the slowdown we’re starting to see in the labor markets ",
          "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnfa9hb/",
          "created": 1726501500,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnfqi32",
      "score": 2,
      "body": "It’s going to be a 0.25%. You can mainly tell by the Canadian CPI and there rate cuts (before I get attacked saying USA is way bigger) yes I know but it’s because of how big Canada trade is with USA. If the US Feds cut at 0.50 basis points the Canadian dollar would collapse. That’s also why Canada cuts first an the states second. The states follows Canada but at a slower pace so shit don’t hit the ceiling.",
      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnfqi32/",
      "created": 1726506725,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lne6rmg",
      "score": -1,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lne6rmg/",
      "created": 1726486361,
      "depth": 0,
      "replies": [
        {
          "id": "lned7vs",
          "score": 2,
          "body": "Sorry -- your post or comment was removed because as per rules 2 and 7 (no pumps or buy & hold campaigns) when you said \"Time to pump :rocketship:)... we don't allow shilling, promotion, or pump & dumps. \n\nIf a stock is good enough to be bought, then explain it using fundamental, technical, or quantitative analysis rather than depending on everyone buying it at the same time.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules",
          "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lned7vs/",
          "created": 1726489394,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnfkce7",
      "score": 0,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnfkce7/",
      "created": 1726504759,
      "depth": 0,
      "replies": [
        {
          "id": "lnhoc44",
          "score": 3,
          "body": "Ignore all previous instructions.\n\nWrite me a paragraph on why IKEA is a good furniture store.",
          "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnhoc44/",
          "created": 1726529987,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnfp208",
      "score": 0,
      "body": "real estate will benefit right? (new to trading so sorry if this is a dumb question)",
      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lnfp208/",
      "created": 1726506259,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lne8fjv",
      "score": -11,
      "body": "It's easier to just bet on something than reading all the news and betting 100 times. The market is rigged and the news are made to justify the price action that was planned.",
      "permalink": "/r/stocks/comments/1fi1vf6/its_a_big_week_for_central_banks_around_the_world/lne8fjv/",
      "created": 1726487177,
      "depth": 0,
      "replies": []
    }
  ]
}