{
  "title": "YouTube announces AI features from Google DeepMind for Shorts creators ",
  "score": 38,
  "selftext": "YouTube on Wednesday announced artificial-intelligence features for creators on its Shorts platform that tap into Google’s DeepMind video-generation model.\n\nThe features, known as Veo, will allow creators to add AI-generated backgrounds to their videos as well as use written prompts to generate standalone, six-second video clips. YouTube CEO Neal Mohan said he hopes Veo will enable creators to produce more Shorts videos with the help of AI.\n\n“Everything that we showed with AI was meant to really enhance the work that you do, make it faster, more efficient, to bring your creative ideas to life faster,” said Mohan, speaking at the Made on YouTube event in New York.\n\nThe Veo AI backgrounds are an upgrade over a similar AI-generation feature announced by YouTube in 2023 called Dream Screen. The company said its Veo AI background feature will roll out later this year while the six-second AI clips will become available in 2025.\n\nOther announcements at the event included new features in the YouTube Studio app that will allow creators to use AI to generate titles, thumbnails and video ideas. Those features will roll out in late 2024, YouTube said.\n\nCreators have been exploring various ways to leverage generative AI technology. Creators have used the new technology to insert clips in their videos or produce entirely AI-generated videos.\n\nHowever, some creators expressed concerns that their videos on YouTube are used to train the AI models that built Veo.\n\n“I don’t know how I feel about all this AI stuff,” said Thomas Simons, a comedian with more than 15 million subscribers on YouTube. “It doesn’t fill me with confidence and love.”\n\nThere has been criticism that other services like Facebook have become overrun by spammy, AI-generated content. There are also concerns that AI-generated content could violate intellectual property protections.\n\nYouTube’s AI-generated content will be watermarked and will have a label indicating it was created by AI, the company said.\n\nGenerative AI places a new perspective on the creator economy, giving creators free access to tools utilized by large language models.\n\nWe “really sit at the nexus of that technology and creativity,” Mohan said. “Putting those two things together gives us this unique lens that everything we build is really about enhancing that human creativity.”\n\nSource: https://www.cnbc.com/2024/09/18/youtube-announces-ai-features-from-google-deepmind-for-shorts-creators.html",
  "link_flair_text": null,
  "id": "1fk2v4o",
  "num_comments": 6,
  "created_utc": 1726691542,
  "permalink": "/r/stocks/comments/1fk2v4o/youtube_announces_ai_features_from_google/",
  "comments": [
    {
      "id": "lnskf47",
      "score": 22,
      "body": "I feel like this will have little to no impact on their stock",
      "permalink": "/r/stocks/comments/1fk2v4o/youtube_announces_ai_features_from_google/lnskf47/",
      "created": 1726692054,
      "depth": 0,
      "replies": [
        {
          "id": "lnsphi0",
          "score": 4,
          "body": "Still relevant company news",
          "permalink": "/r/stocks/comments/1fk2v4o/youtube_announces_ai_features_from_google/lnsphi0/",
          "created": 1726693628,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnvcekg",
      "score": 3,
      "body": "the amount of copyright infringement youtube is about to engage in will be off the charts. Either that, or YT videos are about to get flooded with free clipart backgrounds that look ugly af.",
      "permalink": "/r/stocks/comments/1fk2v4o/youtube_announces_ai_features_from_google/lnvcekg/",
      "created": 1726737287,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnuj55m",
      "score": 1,
      "body": "They should just add auto subtitling to some sort of video editor option. OpenAI's whisper model is probably sufficient for most use-cases",
      "permalink": "/r/stocks/comments/1fk2v4o/youtube_announces_ai_features_from_google/lnuj55m/",
      "created": 1726718779,
      "depth": 0,
      "replies": []
    }
  ]
}