{
  "title": "Are European automakers headed for a death spiral?",
  "score": 137,
  "selftext": "I don't intend to exaggerate, but I am getting the sense that the auto industry in Europe (Germany especially) is on its death bed. \n\n## Falling Euro EV Sales / Shrinking EV Share\n\n[Bloomberg:](https://www.bloomberg.com/news/articles/2024-09-19/germany-s-slump-in-ev-sales-drags-on-europe-s-auto-market) \n\n> EV deliveries in the region’s biggest car market [(Germany)] fell 69% during August, fueling a 36% drop across the region, the European Automobile Manufacturers’ Association said Thursday. [...] With the battery-car market share shrinking to 14% in August — down from just over 15% last year \n\n[Figure of the above statistics](https://i.imgur.com/5eFiBdk.png). Germany cutting subsidies was a big blow to the industry. [New car registrations also dropping](https://i.imgur.com/w9SKOjh.png). From same [Bloomberg article:](https://www.bloomberg.com/news/articles/2024-09-19/germany-s-slump-in-ev-sales-drags-on-europe-s-auto-market) \n\n> Across Europe, new-car registrations dropped 16.5% compared to a year ago to 755,717 million units last month with declines also in France and Italy. The UK was the only major market where EV sales rose, gaining 10.8%.\n\nEuropean plants are underutilized because they make more than they need. [From DW:](https://www.dw.com/en/volkswagens-crisis-how-can-europes-car-industry-survive/a-70231806)\n\n> One in three European factories of carmaking behemoths like BMW, Mercedes, Stellantis, Renault and Volkswagen is underutilized. In some of their plants, less than half of the vehicles that could theoretically be produced are actually being made. \n\n## Examples of hard-hit companies\n\nVW is planning to layoff 15K, possibly closing 2-3 plants in Germany (for the first time). Ending job security program that prevents layoffs through 2029. VW union workers are not happy and are threatening strikes. BMW cutting guidance for operating margins by 200 basis points (to 6-7%). [An Audi plant in Brussels facing closure](https://europe.autonews.com/automakers/audi-brussels-plant-closure-threat-sparks-belgium-national-strike). Stellantis plant in Italy facing 60% fall in production in 2024.\n\n\n## The Threat of Chinese Exports to US/Europe\n\nMeanwhile, China is the new auto giant. [This graph of exports by country is from early 2024](https://i.imgur.com/nPAd2wh.jpeg)--China is the Japan of the 1980s. The threat of Chinese competition is so high that EU is considering 50% tariffs (currently 15% on Chinese EVs), while the US is at 100%. In past years, I've always heard that Chinese cars are junk. Junk cars wouldn't need to need to have their price doubled to keep consumers from buying them. In other countries, Chinese brands are taking over the nascent EV market: \"Chinese automakers accounted for 88% of the EV market in Brazil and 70% in Thailand in the first quarter of this year.\"\n\nIn Europe, despite tariffs: \"Chinese carmakers' share of passenger car sales in Europe rose to 17% in the first seven months of 2024 from 12% a year earlier, according to data from automotive consultancy Inovev, and Chinese car exports have reached record highs this year.\" [(Reuters)](https://www.reuters.com/business/autos-transportation/china-auto-suppliers-ev-makers-flood-major-trade-fair-germany-2024-09-10/).\n\n## Shifts in China's Domestic Markets \n\nThe Chinese automobile renaissance is killing foreign producers in China, yet another sign that these cars in China are actually comparable quality. \n\n> Foreign brands’ market share of Chinese auto sales is tracking at a record low of 37 per cent in the first seven months of 2024, down from 64 per cent in 2020, according to data from Automobility, a Shanghai consultancy. So far this year, US brands are down more than 23 per cent while Japanese, Korean and German carmakers have also suffered double-digit declines, the data showed. By contrast, sales of Chinese brands are up nearly 22 per cent with Chinese companies overwhelmingly dominating sales of the EV market.\n\n[Here's Ford CEO/CFO](https://www.businessinsider.com/ford-ceo-cfo-left-shocked-after-chinese-ev-test-drive-2024-9) being shocked by the quality of Chinese EVs in a test drive. [Longer article here](https://www.wsj.com/business/autos/ford-china-ev-competition-farley-ceo-50ded461?st=86lo43cq3ccgaz6&reflink=article_copyURL_share).\n\n## Technological Edge in EVs for China?\n\n[Nearly 40% of Chinese auto sales are of EVs](https://i.imgur.com/cqX6jts.png) versus 10% for the US and 21% for Europe. Aren't the US/EU supposed to be championing the green revolution in autos? BYD had a 5% share of Chinese cars in 2022--today it's 20%.  That's a big threat to Tesla for instance, who gets 20% of its revenue from China.\n\n## Possible Bull Case\n\nSo  is there a bull case for VW? Here is a [Sum of the Parts](https://x.com/StanphylCap/status/1832096596319727717) bull case for Volkswagen. VW owns stakes in Porche, Traton in addition to owning Audi, VW cars, Skoda, Seat, Cupra Lamborghini, Bentley and Ducati. I don't fully understand how the debt impacts the analysis here, though. OP claims the debt is held by a captive finance arm and fully secured by leased cars + non-recourse (only collateral can be pursued, nothing more).\n\n## Closing Thoughts\n\nHow are European automakers going to handle the competitive threat of a new Chinese auto juggernaut along with massive fiscal support in the US (from the IRA)? Their energy prices face much higher spikes [than in the US and China](https://www.forbes.com/sites/eliasferrerbreda/2023/09/21/energy-europes-big-disadvantage/). Labor unions are much more powerful in Europe, making cost cuts difficult. Autos are already a very difficult sector to invest in, but I suspect European cars brands may be uninvestible and they are rightfully cheap on a P/E basis (if earnings are even positive).\n\n---\n\nArticles used in this post:\n\n- [Bloomberg: Europe’s EV Sales Plunge Has Carmakers Seeking EU Relief](https://www.bloomberg.com/news/articles/2024-09-19/germany-s-slump-in-ev-sales-drags-on-europe-s-auto-market).\n- [DW: Volkswagen's crisis: How can Europe's car industry survive?](https://www.dw.com/en/volkswagens-crisis-how-can-europes-car-industry-survive/a-70231806)\n- [Automotive News Europe: Threatened Audi plant closure sparks broad Brussels protest](https://europe.autonews.com/automakers/audi-brussels-plant-closure-threat-sparks-belgium-national-strike)\n- [Reuters: China auto suppliers, EV makers flood major trade fair in Germany](https://www.reuters.com/business/autos-transportation/china-auto-suppliers-ev-makers-flood-major-trade-fair-germany-2024-09-10/)\n- [Business Insider: Ford's CEO and CFO took a drive in a Chinese EV. What they said about it reveals a lot about the state of the US auto industry.](https://www.businessinsider.com/ford-ceo-cfo-left-shocked-after-chinese-ev-test-drive-2024-9)\n- [WSJ: What Scared Ford’s CEO in China](https://www.wsj.com/business/autos/ford-china-ev-competition-farley-ceo-50ded461)\n- [Gavekal Research on X](https://x.com/Gavekal/status/1626512012196081664)\n- [Stanphyl Capital on X](https://x.com/StanphylCap/status/1832096596319727717)\n- [Forbes: Energy: Europe’s Big Disadvantage?](https://www.forbes.com/sites/eliasferrerbreda/2023/09/21/energy-europes-big-disadvantage/)",
  "link_flair_text": "Industry Discussion",
  "id": "1fkmnbf",
  "num_comments": 155,
  "created_utc": 1726757229,
  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/",
  "comments": [
    {
      "id": "lnwzs3e",
      "score": 220,
      "body": "Nah man the EU will print trilions of Euros and destroy the middle class way before they will let any of these big auto makers go out of business. That is the reason they are so poorly managed. They know they will always get bailed out.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwzs3e/",
      "created": 1726762367,
      "depth": 0,
      "replies": [
        {
          "id": "lnxo1sp",
          "score": 41,
          "body": "Good for the management, good for the unions, good for the government officials, terrible for taxpayers and investors. ",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxo1sp/",
          "created": 1726769968,
          "depth": 1,
          "replies": [
            {
              "id": "lo12gpe",
              "score": 3,
              "body": "Let’s not invest into these firms plz",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo12gpe/",
              "created": 1726827806,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lnxg9na",
          "score": 99,
          "body": "-> Be EU car maker\n\n-> Lobby about a decade against EV\n\n-> USA, China and Japan makes cheap EV that are decent cars\n\n-> People buy them instead of EU gaz cars\n\n-> Ask Government for subsidies to catch up",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxg9na/",
          "created": 1726767526,
          "depth": 1,
          "replies": [
            {
              "id": "lny143n",
              "score": 95,
              "body": "I mean, its not like USA carmakers have not been getting multiple bailouts over the years.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lny143n/",
              "created": 1726777710,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lo07cun",
              "score": 12,
              "body": "USA makes cheap decent EV cars?",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo07cun/",
              "created": 1726807622,
              "depth": 2,
              "replies": [
                {
                  "id": "lo164z3",
                  "score": 5,
                  "body": "quarrelsome abundant lush fanatical touch market handle saw money rain\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo164z3/",
                  "created": 1726829917,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lo1fu36",
                      "score": 12,
                      "body": "Cheap?",
                      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo1fu36/",
                      "created": 1726834538,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lo1gslh",
                          "score": -8,
                          "body": "tan noxious snow spectacular humorous glorious longing aware cough ask\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo1gslh/",
                          "created": 1726834951,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lo1ufah",
                              "score": 9,
                              "body": "No it cannot.  You can literally go through the steps to see what you would pay.  Here's the results per Tesla.  \n   \nBase Price (No Credits):            635/m for 72m = $45,720  \nBase Price (If granted credits): 515/m for 72m = $37,080\n  \nKeep in mind, the second number is Tesla saying what you would effectively be paying if you got full government credits back.  Most people don't get maximum so it's more realistic to say this is a $40k-$45k car.",
                              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo1ufah/",
                              "created": 1726840213,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lo1zmvb",
                                  "score": 0,
                                  "body": "zonked worm head swim file impolite depend six humor correct\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo1zmvb/",
                                  "created": 1726842004,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lo1q6e7",
                              "score": 3,
                              "body": "Not bad that! \n\n UK price is $60000 for the base model",
                              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo1q6e7/",
                              "created": 1726838680,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lo9sas3",
                              "score": 2,
                              "body": "Teslas average 55k in Europe. It is a luxury brand. EV demand will increase once we get sub 30k products. \n\nMost ev Models are in the 50-100k range.",
                              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo9sas3/",
                              "created": 1726954671,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lo2e2d6",
                      "score": 1,
                      "body": "Decent?",
                      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo2e2d6/",
                      "created": 1726846691,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lny07u7",
              "score": 12,
              "body": "I can see cheap and decent chinese EV cars.\n\nBut what US and Japan EV cars??\nUS car makers cancel their EV plans and japans Toyota is betting on hydrogen not EV.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lny07u7/",
              "created": 1726777425,
              "depth": 2,
              "replies": [
                {
                  "id": "lnzl3uu",
                  "score": -4,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnzl3uu/",
                  "created": 1726797601,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lo0514h",
                      "score": 8,
                      "body": "Rivian isn’t cheap. Tesla is cheap but mostly with quality and interior",
                      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo0514h/",
                      "created": 1726806397,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lny7jri",
              "score": 13,
              "body": "This analysis has me lol honestly.\n\nChina's cars are cheap and (half) decent. Not good. Decent. I wouldn't trust them on the road but if you don't have any alternative.\n\nUSA cars, if you mean Tesla, are trash AND overpriced. They're also massively subsidised, like the Chinese brands by the way. I live in an European country and people here tend to despite Teslas for good reason (unless you got a lot of money, and even then).\n\nJapanese cars are good ish (Toyota at least) but definitely not cheap. No particular reason to pick them over German or French brands as they compete in the same price and quality segment. Most of them are also massively behind on the EV transition. \n\nIn fact, the entire industry is in crisis. Even within China, the transition combined with the economic slowdown is causing a production glut that is flooding the market with subpar cars and killing all but a handful of large brands.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lny7jri/",
              "created": 1726779711,
              "depth": 2,
              "replies": [
                {
                  "id": "lnzynnf",
                  "score": 16,
                  "body": ">This analysis has me lol honestly.\r  \n\r\n\nAs a rule of thumb, if an analysis is formatted like 4chan greentext, it's not much of an analysis.",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnzynnf/",
                  "created": 1726803278,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lo1112b",
                  "score": 4,
                  "body": "I was at Shanghai Auto Show last year. There is such a huge span in Chinese car brands with quite a few quite expensive and seemingly good quality making the European brands look dull. American cars including Tesla has very little to offer if you don’t look at nostalgia. Also if Eu puts tariffs on Chinese EV they will kill the German brands depending on exports to China. If you can’t beat them, join them, I think is where we are now. Biggest owner of Volvo and Mercedes is Mr Li Shufu",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo1112b/",
                  "created": 1726826933,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lnz8hoh",
                  "score": 8,
                  "body": "[removed]",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnz8hoh/",
                  "created": 1726792824,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lnzjik5",
                      "score": 1,
                      "body": "This is absurd. I've driven Mercedes and Nio. The comparison isn't even close. Nio is close to VW, but not even remotely close to Audi, or BMW for that matter. The Chinese cars are good, but most importantly, they're cheaper. They absolutely are not better, not even close.   \n     \nFrench? Lol. That's not relevant, mate.   \n    \nEdit: btw, I'm in China every year or every other year. I've driven a bunch of brands. None were as good as German cars.",
                      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnzjik5/",
                      "created": 1726796993,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lo11q6g",
                          "score": 1,
                          "body": "Nah, I've driven the newest EV S Class, it's chock full of plastic. The software of any chinese car is better than all german cars",
                          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo11q6g/",
                          "created": 1726827358,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lo12w1g",
                              "score": 1,
                              "body": "Utter nonsense. Not that German cars have great software, but the Chinese cars have much worse. Imo, all cars have crap software, tho.",
                              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo12w1g/",
                              "created": 1726828061,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lo14fjj",
                                  "score": 0,
                                  "body": "That tells me you haven't driven a single chinese one lmao.",
                                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo14fjj/",
                                  "created": 1726828965,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lo14s0d",
                                      "score": 2,
                                      "body": "Incorrect. I've driven dozens. Your comments tell me a lot about you, tho. So does your history.",
                                      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo14s0d/",
                                      "created": 1726829163,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lnzs4op",
                      "score": 0,
                      "body": "Trolling, insults, or harassment, especially in posts requesting advice, is not tolerated.  Please try to keep discussions on /r/stocks civil by providing straightforward responses without including any insults or harassment.\n\nContinual abuse of /r/stocks rule #5 regarding trolling, insulting and harassment will result in your account being banned.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules",
                      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnzs4op/",
                      "created": 1726800408,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lnzou6q",
                      "score": -7,
                      "body": "This is reddit where people who can barely afford a low end car talk about how bad Tesla is because Elon isn't an NPC like they are.\n\nThen again a high end German car is obviously better than a way lower end American/Japanese car, you're paying a premium for that after all. I'm not surprised that my BMW is better than my Volkswagen, it also cost x3 more so it's kind of expected.",
                      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnzou6q/",
                      "created": 1726799077,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lo0gltz",
                  "score": 3,
                  "body": "You underestimate Chinese car especially BYD. They are way more than decent and are the reason that western tarifs on china don't want to lower it.",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo0gltz/",
                  "created": 1726813014,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lo0jumw",
                      "score": -3,
                      "body": "BYD is copy and paste, heavily subsidized and a company weaponized for political purposes.",
                      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo0jumw/",
                      "created": 1726815113,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr63utg",
                          "score": 0,
                          "body": "Lies",
                          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lr63utg/",
                          "created": 1728515389,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lo0jzkc",
                          "score": 1,
                          "body": "Oh Jesus ofc.",
                          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo0jzkc/",
                          "created": 1726815203,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lo03j0u",
              "score": 0,
              "body": "China has cheap EVs. US and Japan do not stand well here. I think the big question is how much money put in the last 10 years the chinese guvernment in the EV industry (how many free money poured in the EV companies). How much it costs the chinese to make the batteries and at what environmental price. How their workers are paid, and how much of the current car price is supporte by the chinese guverment. \n\nEuropean car producers received some support from the EU countries in the form of cost sharing at the car putchaae. They did not receive help\nfor developing batteries and the EV cars. The EU and US do not have a battery producing industry. Not by far at the scale the Chinese have. They do\nnot destroy their environment like chinese do.\n\nCompeting with the chinese in these conditiions\nis impossible. And with the China market almost dead to the European and US car manufacturers, their fate is not good at all. They were making most of their profits there, and now they make none.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo03j0u/",
              "created": 1726805629,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lnzalj5",
          "score": 0,
          "body": "Exactly!",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnzalj5/",
          "created": 1726793614,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnyonmh",
          "score": -1,
          "body": "Germany literally can't because of their constitution.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnyonmh/",
          "created": 1726785466,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnwrh1j",
      "score": 108,
      "body": "Automakers in Europe are 'too big to fail'. Taxpayer money will be thrown to bail them out indefinitely - too many votes depend on their survival.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwrh1j/",
      "created": 1726759670,
      "depth": 0,
      "replies": [
        {
          "id": "lnxljoq",
          "score": 13,
          "body": "So why are they at 3x-6x earnings?\n\nI agree with what you're saying, just don't understand why they're so cheap if there's an unofficial government backstop",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxljoq/",
          "created": 1726769177,
          "depth": 1,
          "replies": [
            {
              "id": "lnxnuff",
              "score": 19,
              "body": "Cause surviving and thriving are two different things. \n\n\nEU governments, Germans particularly, would rather pay subsidies to these entities than pay unemployment and deal with the social issues.\n\n\nThat doesn't mean they are going to be profitable.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxnuff/",
              "created": 1726769903,
              "depth": 2,
              "replies": [
                {
                  "id": "lnyde79",
                  "score": 2,
                  "body": "But the government is shutting off the competition and bailing them out that way?",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnyde79/",
                  "created": 1726781577,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lnyyilu",
                      "score": 2,
                      "body": "No competition still doesnt mean profitable. \n\nWhy would they be profitable? Particularly if it requires hard work and making hard decisions?\n\nThe management can do the hard thing and be profitable or do the easy thing and never go bust.",
                      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnyyilu/",
                      "created": 1726789058,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lo0qaj1",
                          "score": 3,
                          "body": "Well how can you not be profitable if you can put the price wherever you need it and customers don't have much choice but to buy from you?",
                          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo0qaj1/",
                          "created": 1726819523,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lo1ob0u",
                              "score": 2,
                              "body": "Cost overruns. \n\nSee pretty much any and all government owned industrial firms across the world.",
                              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo1ob0u/",
                              "created": 1726837982,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "locmkjy",
                  "score": 1,
                  "body": "Just look at how the US government screwed GM’s owners. They stole it and paid out only 11% on their corporate bonds. ",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/locmkjy/",
                  "created": 1727006882,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lny60ic",
              "score": 3,
              "body": "Because often a government will wipe out the shareholders and convert bond holders when bailing out a company. Bailouts ant too big to fail are irrelevant to investors because we get wiped out even if there is no bailout.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lny60ic/",
              "created": 1726779240,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lnxjsru",
          "score": 3,
          "body": "That doesn't mean shareholders don't take big losses.  Maybe buy their bonds but not the stocks?",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxjsru/",
          "created": 1726768628,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnxvzcv",
          "score": 3,
          "body": "Death spiral in the equity*, I should have said. Like with INTC, bankruptcy is off the cards, but shareholders get slammed with losses. Hence they may be uninvestible.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxvzcv/",
          "created": 1726776022,
          "depth": 1,
          "replies": [
            {
              "id": "lny0ezj",
              "score": 3,
              "body": "Yes, I'd agree to that. I wouldn't risk a single euro on our domestic auto makers.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lny0ezj/",
              "created": 1726777489,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lo1k8am",
          "score": 0,
          "body": "No one is too big to fall. If huge business is not generating any real value to the real world and they are not relevant anymore, they going to zero.\nJust a matter of time for the big short :)",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo1k8am/",
          "created": 1726836389,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnwye91",
      "score": 39,
      "body": "I'm from Germany but ethnically Chinese. \n\nI think a huge issue is that German automakers relied on China for juicy profits.... That paid for those plushy , high paid jobs in Germany. \nIn the next few years china will stop buying European cars... That's for sure. \n\nBut... The industry is so important for Europe and Germany that we will definitely defend our home turf, bail out, invest, subsidy in any way necessary to save this industry. \nAlso German/European  EVs are not half bad... For sophisticated buyers I can see people prefer a European car over a chinese one.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwye91/",
      "created": 1726761920,
      "depth": 0,
      "replies": [
        {
          "id": "lnx2z79",
          "score": 14,
          "body": "VW software has been garbage. Idk what the hell management was doing for years in their software sub-company. They pretty much gutted it. Software is huge in EVs since hardware is simplified in an EV. Hopefully, Rivian pulls through for the both of them. I have not heard China's software being bad, guess they know how to use Android.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnx2z79/",
          "created": 1726763383,
          "depth": 1,
          "replies": [
            {
              "id": "lo0jzuv",
              "score": 3,
              "body": "MIB4 is now a better software than MIB3 or previous versions of MIB4",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo0jzuv/",
              "created": 1726815209,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lo1d4c6",
          "score": 1,
          "body": "My coworkers VW Atlas had two gaskets start leaking at 5,000 miles and the part is on backorder for 6months so its a common problem.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo1d4c6/",
          "created": 1726833335,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnwzz7e",
          "score": 0,
          "body": "I'm quite sure that the bigger issue is really the export of cheap government subsidised Chinese EV's.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwzz7e/",
          "created": 1726762430,
          "depth": 1,
          "replies": [
            {
              "id": "lo14671",
              "score": 3,
              "body": "[BYD cars are 11-fold more profitable in Europe vs. China](https://fortune.com/europe/2024/04/29/eu-unwinnable-price-war-chinese-evs-byd-cars-11-times-more-profitable-in-europe-than-in-china/)",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo14671/",
              "created": 1726828814,
              "depth": 2,
              "replies": [
                {
                  "id": "lo1n0mb",
                  "score": 1,
                  "body": "Paywall",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo1n0mb/",
                  "created": 1726837491,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lo1ptun",
                      "score": 4,
                      "body": "The car sells for €20,500 ($21,950) in China and €42,000 ($45,000) in the EU. \n\nChinese automakers are moving to extract higher profits in Europe as a price war back home pushes their margins to the floor. This pricing mechanism means the Seal U makes BYD a €14,300 ($15,300) profit in the EU, but just a €1,300 ($1,400) profit in China.",
                      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo1ptun/",
                      "created": 1726838552,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lnx17r2",
              "score": 1,
              "body": "I think these are a threat but can be managed in Europe.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnx17r2/",
              "created": 1726762828,
              "depth": 2,
              "replies": [
                {
                  "id": "lnxcfey",
                  "score": 7,
                  "body": "The same subsidies affect the Chinese market too. Bottomline is without those subsidies Chinese EV's would have a much harder time competing with German import.",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxcfey/",
                  "created": 1726766331,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lnxe26f",
                      "score": 0,
                      "body": "Well it is how is. \nChina will always be a state driven model not a free market.",
                      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxe26f/",
                      "created": 1726766838,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lnxnxqi",
                      "score": 1,
                      "body": "Yes because Europe has definitely not been subsidizing its automotive industry right? Right? \n\nAnd basing your entire business model on milking the Chinese cash cow without seeing the market was shifting to EVs was totally not their fault either.",
                      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxnxqi/",
                      "created": 1726769932,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lnxqno2",
                          "score": 3,
                          "body": "Not even close to the level of subsidies Chinese EV makers have received, $231 billion in the last 15 years.\n\nhttps://www.bloomberg.com/news/articles/2024-06-21/china-s-ev-makers-got-231-billion-in-aid-over-last-15-years\n\nBesides most subsidies in Europe have come in the form of tax incentives for the buyers. \n\nMilking the Chinese cash cow?\n\nIt's just that China has a huge population and is relatively wealthy.\n\nPer capita other countries spend far more on German cars. \n\n20 billion in sales in China in 2023 for roughly 1,4 billion inhabitants and 17 billion in sales in the US for roughly 340 million inhabitants.\n\nJust face it, it's unfair competition. \n\nThe only point I partly agree with is that German car manufacturers hould have had more foresight. \n17",
                          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxqno2/",
                          "created": 1726770789,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lo3lswb",
                              "score": 3,
                              "body": "[Germany to pump in €3 billion in ailing car industry(2020)](https://www.dw.com/en/germany-to-pump-additional-3billion-in-ailing-automotive-industry/a-55641102)\n\n[The German government has spent a total of 9.5 billion euros to subsidise the purchase of two million electric cars(2023)](https://www.cleanenergywire.org/news/germany-has-subsidised-total-two-million-electric-cars)\n\n[German EV subsidies more than doubled in 2021 to $3.1bn](https://autovista24.autovistagroup.com/news/german-ev-subsidies-more-than-doubled-in-2021/)\n\n\n[Renault’s €5bn bailout gets EU go-ahead](https://www.euractiv.com/section/transport/news/renaults-e5bn-bailout-gets-eu-go-ahead/)\n\n[France to inject almost $9 billion into ailing auto industry 2020](https://edition.cnn.com/2020/05/26/business/france-auto-industry-bailout/index.html)\n\n\n...and that's what I found just from 2/3 minutes doing a couple of google searches, this isn't even me investigating it thoroughly and I've found $30.6 billion in subsidies from just Germany and France since 2020, so in the last 4 years from just two of the EU's big automakers. I have no doubt whatsoever, if I went thoroughly over the last 15 years of EU auto industry subsidies, I would find an amount equal to or possibly exceeding China's total.",
                              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo3lswb/",
                              "created": 1726860839,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lo3uicd",
                                  "score": 1,
                                  "body": "Sure but the the 231 billion figure that is quoted is conservative and doesn't include incentives for locals to switch to EV's among others. Whereas that's what the majority of the European car subsidies have been for. So you're really comparing apples to oranges. \n\nAnyway, I am not passing any value judgements, if China can compete that way then why shouldn't they. Just stating the facts. It has helped them scale up and develop quickly allowing them low production costs for what are quality vehicles as it looks now. \n\nAnd I won't deny that European countries have heavily subsidized their car industry, but there are some differences in the forms of subsidies and motives. A bailout is not the same as an export boost.",
                                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo3uicd/",
                                  "created": 1726863685,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lr64d2r",
                                      "score": 1,
                                      "body": "Throwing a fit over nothing.",
                                      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lr64d2r/",
                                      "created": 1728515582,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "lnxsksd",
                              "score": -1,
                              "body": "that $231bn number is bs, just look at how it’s calculated. And that’s to get an entire industry off the ground. If you knew this industry you’d know very well that pales in comparison to the number of times the European auto industry has been bailed out over the years (these companies would have been long bankrupt without it).",
                              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxsksd/",
                              "created": 1726771392,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lnxtccx",
                                  "score": 3,
                                  "body": "Easy to call BS without backing up any of your own claims",
                                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxtccx/",
                                  "created": 1726771632,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lnzzt30",
              "score": 0,
              "body": "Because low-income countries cannot build large-scale charging piles. The radius of use of electric vehicles is very narrow and cannot be used for long-distance driving. Therefore, the internal combustion engine is still the mainstream. But China also has cheap Geely and Great Wall fuel vehicles to compete with Japanese and German brands",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnzzt30/",
              "created": 1726803817,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lnwojm5",
      "score": 13,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwojm5/",
      "created": 1726758686,
      "depth": 0,
      "replies": [
        {
          "id": "lnwswlc",
          "score": -10,
          "body": "And ugly.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwswlc/",
          "created": 1726760146,
          "depth": 1,
          "replies": [
            {
              "id": "lnxho84",
              "score": 9,
              "body": "But not as ugly as BMW's.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxho84/",
              "created": 1726767965,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lnxgwxe",
              "score": 4,
              "body": "Audi people dont care as long as it has the 5 zeros",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxgwxe/",
              "created": 1726767727,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lnz9weu",
      "score": 13,
      "body": "Honestly, VW deserves to go bust. They were founded to make cheap cars for everyone, nowadays there's not a single cheap car in their lineup. Their \"cheap\" Golf costs double to a Dacia that also takes you from A to B.\nAdditionally, they haven't innovated the last 10 years, did the same boring old designs and just copied Tesla poorly in terms of EVs.\nTheir software is still stuck in 2014 which is embarassing. Their employees are overpaid and lazy, they're leading the company like a soviet committee.\n\nThey are sitting on a fat pile of cash, but are still too arrogant to change their ways, even if that pile is burning right now.\n\nGod I hate VW so much",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnz9weu/",
      "created": 1726793352,
      "depth": 0,
      "replies": [
        {
          "id": "lo2imk5",
          "score": 4,
          "body": "Their firing if Diess is really what sent them spiraling downhill in recent years IMO. They had one of the most innovative CEOs pushing their EV transition, but they decided to fire him because the transition was too much short term pain.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo2imk5/",
          "created": 1726848155,
          "depth": 1,
          "replies": [
            {
              "id": "lo3st4i",
              "score": 2,
              "body": "Intel shareholders are trying to do the same thing with Pat Gelsinger at the moment, shareholders are the worst, they only care about quarterly earnings reports and the stock price, they couldn't give two shits about long term goals if they effect the money here and now.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo3st4i/",
              "created": 1726863124,
              "depth": 2,
              "replies": [
                {
                  "id": "lo41mmy",
                  "score": 1,
                  "body": "Tbh Gelsinger said some pretty idiotic stuff recently that makes many people question him. Said Core speed is less important now, they want to focus on their products to be used as connecting AI cards. Core Speed and efficiency is all that fucking matters to private Consumers and normal businesses",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo41mmy/",
                  "created": 1726866062,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lnwncko",
      "score": 16,
      "body": "If European countries keep the laws in place or even add new ones to outlaw ICEs, probably yes.\n\nI assume they'll either extend those deadlines or scrap them completely at some point, though. Same with the subsidies, which already happened partially. For Germany in particular, the AfD, a party that openly denies climate change, is gaining more and more voters and the Green Party is losing voters, which points to a clear cultural shift. Those are two smaller parties, but between the \"big two\", CDU, conservatives, and SPD, more left, a similar change occurred.\n\n>OP claims the debt is held by a captive finance arm and fully secured by leased cars + non-recourse (only collateral can be pursued, nothing more).\n\nIt is. It's funny how so many people still parrot the idea that VW is heavily indebted. You can literally just look at their reports and see the distinction between automotive and financial. It takes like a minute. VW has more cash (+ short term investments) than debt in its automotive segment iirc, I think it was like 30b vs 25b or something.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwncko/",
      "created": 1726758281,
      "depth": 0,
      "replies": [
        {
          "id": "lnylr8d",
          "score": 0,
          "body": "But the problem arise from the fact that Automakers do not sell enough EV's. The factories are there and the billions in R&D are invested, the only thing missing are the costumers. It's not like people are buying less ICE's only because they are offering more EV's. \n\nI'm afraid that going easy on EV regulation and scrapping the outlaw of newly sold ICE are doing more harm to the companies than doing good in the next decade. They can still use any ICE technology in Hybrids from now one, so the only investment that needs securing are EV's. \n\n  \nAlso parties like the Afd are profiting of a recession, the unhappiness with Corona and immigration, once the economy gets back on track and people forget about getting the vaccines, these parties are going back to the hole they deserve to be in.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnylr8d/",
          "created": 1726784434,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnwt38f",
      "score": 31,
      "body": "In all honesty, would you rather have a BMW or a xpeng ?",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwt38f/",
      "created": 1726760207,
      "depth": 0,
      "replies": [
        {
          "id": "lnx1ff7",
          "score": 65,
          "body": "Wrong comparison.\n\nThe real one is: would you rather buy  1.0 Kia Piacanto for 15,000 Euro base model econobox.\n\nOr a Xinchinchang Bambalam for 4,000 Euros that does the same economic job.\n\nIf you have 50K you go for the BMW. But 90% of people just need a ride form A to B.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnx1ff7/",
          "created": 1726762896,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnx1wrq",
          "score": 31,
          "body": "Stupid take. Would you rather have a Ferrari or BMW? \n\nIf BMW cost the same as Xpeng than I would take BMW but those are not competitors.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnx1wrq/",
          "created": 1726763048,
          "depth": 1,
          "replies": [
            {
              "id": "lnx5u36",
              "score": -1,
              "body": "It's two different classes you can't really compare. A brand like xpeng is set out as a direct competition to bmw or polestar, they say so themselves.\n\nBut Europe is selling luxury, build quality and maybe something a bit more conservative in terms of looks ( I like them way better, Mercedes ev is ugly though)",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnx5u36/",
              "created": 1726764278,
              "depth": 2,
              "replies": [
                {
                  "id": "lnzp7yg",
                  "score": 6,
                  "body": "You can say whatever you want, doesn't make it true.",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnzp7yg/",
                  "created": 1726799229,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lnwzj24",
          "score": 16,
          "body": "I’d rather have a BMW, but xpeng is selling for half the price with more options included. For now china is taking over in Norway. BYD, polestar and Xpeng have really established themselves",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwzj24/",
          "created": 1726762286,
          "depth": 1,
          "replies": [
            {
              "id": "lny8msa",
              "score": 9,
              "body": "The best selling cars in Norway are VW, Volvos, and Toyotas with a (declining) share of Teslas. No Chinese brands in sight. Norwegians can afford better.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lny8msa/",
              "created": 1726780051,
              "depth": 2,
              "replies": [
                {
                  "id": "lnyghiz",
                  "score": 2,
                  "body": "Actually the best selling car in Norway is Tesla. I never said Chinese cars were dominant, but they have established themselves. They have much more brands available and a lot more volume than they had earlier. Byd are really gaining traction. They just released 2 new models, seal U and another one that i’m pretty sure will receive decent traction.",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnyghiz/",
                  "created": 1726782607,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lnzuyob",
              "score": 1,
              "body": "Polestar is Chinese?",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnzuyob/",
              "created": 1726801611,
              "depth": 2,
              "replies": [
                {
                  "id": "lnzwznr",
                  "score": 2,
                  "body": "Yes, like Volvo, it belongs to Geely.",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnzwznr/",
                  "created": 1726802510,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lnzzdml",
                      "score": 1,
                      "body": "Wow had no idea, last i heard it was owned by Ford. Ill hit up the wiki, thanks.",
                      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnzzdml/",
                      "created": 1726803613,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lnx1bdg",
              "score": -8,
              "body": "I went to a mazda dealership for my new car and I saw 12 used polestars on the lot. People are getting it then trading it in for better cars",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnx1bdg/",
              "created": 1726762860,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lo23tq3",
          "score": 2,
          "body": "This question would track more 20 years ago. People dont care about badges as much now or if they do its not BMW.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo23tq3/",
          "created": 1726843391,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnxlysn",
          "score": 1,
          "body": "Saying this as a BMW fan. \nIf I were to chose an EV, good chance I would take a Xpeng or a Zeekr above the BMW. And don’t even get me started on Mercedes",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxlysn/",
          "created": 1726769309,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lo0l292",
          "score": 1,
          "body": "Almost anything but a BMW, really",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo0l292/",
          "created": 1726815911,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnz1fkl",
          "score": 1,
          "body": "BMW make good or even great EV's.  \nWhen comparing to VAG the picture is a bit different. Looks nice and handles nice, but soo many errors ang bugs.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnz1fkl/",
          "created": 1726790151,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnwmljk",
      "score": 3,
      "body": "they just double down on ice sales in the rest of the world.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwmljk/",
      "created": 1726758024,
      "depth": 0,
      "replies": [
        {
          "id": "lnxwgb3",
          "score": 5,
          "body": "I think China is eating Europe's lunch in both EVs and ICEs, though. Their auto exports are skyrocketing but it is still 60% ICE, so it's not just EV exports that are booming.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxwgb3/",
          "created": 1726776195,
          "depth": 1,
          "replies": [
            {
              "id": "lo2j1mf",
              "score": 3,
              "body": "The Chinese are doubling down on EV's, not really ICE vehicles. EV's are China's chance to rise in the auto market and steal a bunch of market share, ICE vehicles aren't since the incumbents are too good at them and have too much of a moat.\n\nChina wants to be the #1 leader in EV's, and they basically are outside of Tesla. Just about all the top 20 or so best selling EV's worldwide are made by either Tesla or a Chinese company.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo2j1mf/",
              "created": 1726848292,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lnzl8e3",
      "score": 3,
      "body": "I think you’re right about China quietly becoming a world powerhouse automaker much like Japan did in the 80’s.  I would want to add Chinese / Swedish parent-sister relationships Geely / Polestar and Geely / Volvo to the conversation though.  Especially given both Polestar and Volvo make cars in the US, EU, and even South Korea for the new Polestar 4 Coupe.\n\nThese strategic moves by Geely were well head of the tariffs, and I would say some prescient thinking to avoid or mitigate both US and EU Chinese import tariffs on EVs.  Interestingly, EVs Polestar 3 SUV and the 3 row Volvo EX90 are both made in Volvo’s South Carolina plant which is in a free trade zone, giving additional duty free benefits on certain imported parts and components for exported vehicles, and in turn exports will earn tariff credits in the US to offset imports of the new EVs Polestar 4 from South Korea, and the compact Volvo EX30 from Ghent, Belgium coming early 2025.  Just a brilliant strategic play by Geely for their Polestar and Volvo brands in the US that makes them the only Chinese-owned EVs manufactured in the US and possibly North America, likely for years to come.\n\nhttps://www.autoweek.com/news/a46989952/polestar-volvo-ownership-changes/",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnzl8e3/",
      "created": 1726797650,
      "depth": 0,
      "replies": [
        {
          "id": "lnzpfdt",
          "score": 2,
          "body": "I don't see Volvo Cars as a Chinese brand, it's listed on Nasdaq Stockholm and has it's HQ in Sweden, so it's technically a european brand, it's however majority owned by Geely, but you can buy shares in it right now.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnzpfdt/",
          "created": 1726799312,
          "depth": 1,
          "replies": [
            {
              "id": "lnzrjsv",
              "score": 2,
              "body": "Yes you are correct…Geely has about 78% ownership.  They bought them from Ford in 2010 for a ridiculously low $1.8b and did a partial IPO a few years ago.  R&D is in Sweden, corporate offices, etc.  EV production on the EX30 is in a new plant north of Beijing.  Polestar 2 also is made in China.  I also think this branding was smart b/c at least for Volvo, and soon more widely Polestar, there is a solid reputation for quality in the west, and these are seen as EU brands.  That is not by accident.  Yes, both are traded on US OTC.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnzrjsv/",
              "created": 1726800170,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lo0rq50",
      "score": 3,
      "body": "As someone who watches closely Volkswagen, Mercedes and BMW, I'd say not yet. They are on a slow descending trend after a bounce off. The only thing that they have to do is **do something**. Now they are doing nothing to prevent the descending slope. They could all start to switch to 48V architectures and make everything cheaper. They could introduce gigcasting. They could also pool all their resources together to build and standardize battery sizes and capacities, they could also put everything together and standardize invertors and even engines and leave the software, interior and outlook as differentiating factor. By doing this, they could easily drive costs down for EVs to a level where they are below gas powered cars and even below Tesla's costs. But... they need strong leadership, people who are not afraid to fire incompetent managers and incompetent teams. And that kind of leadership is missing at whole Germany level. Not only in the EV sector. And would say... it's missing at EU level.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo0rq50/",
      "created": 1726820532,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lo13ux3",
      "score": 3,
      "body": "Who the heck wants a new car in this environment. No thanks",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo13ux3/",
      "created": 1726828635,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lo0kikq",
      "score": 2,
      "body": "Didn’t VW get hit so hard because they lied and manipulated to make their EV cars look for eco-friendly?  I believe that case just panned out recently and that might be a big reason for the downturn.  Maybe they’ll bounce back",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo0kikq/",
      "created": 1726815548,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lo1k20h",
      "score": 2,
      "body": "Of course they are, regardless of what anyone tells you about government bailouts or whatever bs, if companies don't adapt and are not relevant to the modern world bringing real value, they useless AKA they going to 0",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo1k20h/",
      "created": 1726836317,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnwsgph",
      "score": 12,
      "body": "All European carmakers have been heavy lobbying against BEV for years now.  European media are  full off \"BEV will never work\".   Never mind the fact that they do work IRL (see Norway).   Anti-EV examples make a good stories daily.  EV's on fire?  People stranded on their way to southern France?  Cars being too expensive?  Battery deteriorating? Battery replacement impossible?  Name all the clichés, they appear in large quantities over the media.\n\nToday in Belgium there was a large newspaper article about that EV's are not selling, and the fact that plugin hybrids are the future and are a far better solution.  What - have - they - been - smoking?   Plug in hybrids are simply the worst possible solution to a problem.  It's better to have normal ICE's or full hybrid (like Toyota I mean), but not those underpowered PHEV...\n\nIt's just unbelievable what a mess the car-sector has made here (VW diesel scandal anyone?).   Investing in EV, at the same time making bad news about EV's.   And then yelling at the EU that BEVs don't sell.   Well they sure did their utmost best not to sell them in the first place.  And now the sector is screaming at the EU to double down on measures.?  I really hope the EU does not.\n\nHonestly.  It's a disaster bcs topmanagement will collect their bonuses as always,  ditch the hardware,  sell of the brand to another company,  install some big \\*ss consultants to save what can be saved.  And blue collar workers will be left with nothing, except a exceptional cost that has to beared by society.   As always \"Profits for the shareholders, loss for the society\".   Look at how Audi Brussels will turn out (I'm involved, I'm Belgian).\n\nIn my honest opinion: let them drown, do it quickly.  Let it be done with.  Sorry, I have no mercy for that kind of behaviour.\n\nPS: my respect for Stellantis CEO Tavares to stand up today , and say that the call for postponing the EU measures is unneccessary!  At least one decent person in this circus. \n\nPPS: sure you can downvote me,  but be sure to sell off your stock...",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwsgph/",
      "created": 1726760000,
      "depth": 0,
      "replies": [
        {
          "id": "lnx5h2a",
          "score": 7,
          "body": "> Plug in hybrids are simply the worst possible solution to a problem. It's better to have normal ICE's or full hybrid (like Toyota I mean), but not those underpowered PHEV...\n\nMy PHEV has as much electric power as some fully electric cars, and can drive at highway speeds without using the gas engine. Then on long trips I don't have to deal with charging infrastructure issues, which in the US are a hot mess. So for me it's been a good solution to current circumstances, on the way to a fully electrified transportation future. And since the original post mentioned China, note that one-third of their electrified vehicles are PHEVs. \n\nAs far as stocks are concerned, no argument that these are tough times for older automakers. But if they're allowed to fade away, what takes their place in economies where they've been big contributors?",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnx5h2a/",
          "created": 1726764163,
          "depth": 1,
          "replies": [
            {
              "id": "lnxaqz4",
              "score": 1,
              "body": "I have a BEV since March 23.  I had zero charging inftrastructure issues up to today.   Examples are no data I'm aware.   The experience I had with PHEV is underwhelming.  A 1.4l or even 1.2l underpowerd engine, combined with a small 14kwh battery with equally small powertrain, combined with a 30l fuel tank.  Putting it togetter having an astmatic car (and no, I do not point at Rav4 prime here) , with a range of 400km at max. Less than my EV now.  When travelling no possibility to have fast charging.   Still having to go to a dealer for maintenance.  I see only disadvantages.   And imho: the resale value will be next to nothing.   If not a BEV, I would rather buy a classic ICE now.\n\nAs far as \"what takes their place in economies where they've been big contributors?\".\n\nHave they been contributors?  Of course they are.   But to what extent?    Taking into account every single cost.  Big subsidies (Audi Brussels).  Pre-pension regulations waiving cost on the society.    Not to forget environmental cost.   Promoting car-centric societies.   Deductibility of cars (typically for my country).  Having exported our know how to China (the boomerang is coming in).    Etc Etc.\n\nI'm not even starting on dealerships.  Many of them being good people squeezed by carmakers.\n\nMy compassion is very low.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxaqz4/",
              "created": 1726765812,
              "depth": 2,
              "replies": [
                {
                  "id": "lnxsghx",
                  "score": 2,
                  "body": "I've been on roads in the US where it's over 250 miles (400 km) between EV fast chargers, unless you have a Tesla - and even their charging network has a few weak areas. The situation will improve now that Tesla is finally opening up some of their chargers to other EVs here, but that's a slow process. \n\nAccording to the following article from last year, the European auto industry directly accounts for four million jobs and 3% of Europe’s GDP: \n\n[https://www.bcg.com/publications/2023/european-auto-industry-is-under-pressure](https://www.bcg.com/publications/2023/european-auto-industry-is-under-pressure)",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxsghx/",
                  "created": 1726771355,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lnx9gve",
      "score": 8,
      "body": "Most probable reasons not only VW failing:\n- manufacture moved to China as it is cheaper - they provided China manufacture academy practically for free - who is responsible for this? Are those responsible for this still employed and earning X-figures salaries?\n- Green Deal with almost impossible emission targets (is this China subvention via EU parliament ? Maybe somebody was well paid..).\n- China has been preparing fo e-mobility far longer than others in the World (they have 'stolen' africa -> resources)\n\n\nChina (in mentality) is very very aggressive - delusional Western world not forseeing this - yay.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnx9gve/",
      "created": 1726765410,
      "depth": 0,
      "replies": [
        {
          "id": "lnze2kq",
          "score": 13,
          "body": "The actual reason is much simpler. The Germans can't get cheap Russian gas anymore, and you can't have an industrial economy without cheap energy. So their manufacturing sector will die a slow death as a consequence. \n\nChina has cheap energy. The US has cheap energy. France has cheap energy. India, Vietnam, Indonesia, etc. etc.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnze2kq/",
          "created": 1726794917,
          "depth": 1,
          "replies": [
            {
              "id": "lo12gvh",
              "score": 1,
              "body": "Causality...\n\nI mentioned reasons that are far more distant in past than 'cheap energy' and theese are most probably more related to the current issues than energy prices (which are only one of the last nails in the...)",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo12gvh/",
              "created": 1726827810,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lo0o2l1",
              "score": 0,
              "body": "China does not have cheap energy, it imports 60% of oil and coal. That's why China is all in on green energy",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo0o2l1/",
              "created": 1726817964,
              "depth": 2,
              "replies": [
                {
                  "id": "lo14wx5",
                  "score": 2,
                  "body": "China imports less than 10% of coal",
                  "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo14wx5/",
                  "created": 1726829240,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lo3vn9o",
          "score": 2,
          "body": "> China (in mentality) is very very aggressive\n\nHere's me thinking the country that has 800 military bases all over the world and has been involved in every war going for the last 70 years is the aggresive one.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo3vn9o/",
          "created": 1726864067,
          "depth": 1,
          "replies": [
            {
              "id": "lo3w6lc",
              "score": 1,
              "body": "Definitely - different sort of aggreasion.\nChina is like hydra - it eats from inside without being fully aware of whats going on.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo3w6lc/",
              "created": 1726864248,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lnxthgy",
          "score": 2,
          "body": "Same for US IT companies.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxthgy/",
          "created": 1726771677,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lo0837q",
      "score": 1,
      "body": "Think so",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo0837q/",
      "created": 1726808014,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lo0bxe0",
      "score": 2,
      "body": "European automakers can watch my 21 year old car keep running with a fraction of the yearly cost that would inply buying a new/2nd hand equivalent car nowadays and I say this coming from a higher position of income than the average taxpayer.\n\n\nEither prices go down or, if and when I am forced to change car, I will probably go to cheapest manufacturers. \n\nOut of curiosity I customized an A series from Mercedes on its site recently and it quickly went to over 60K.\n\nThe car I drove right now costed 18K (minus the trade in value of a previous car) to my parents in 2003.\n\nI wont be paying 4x for a 1.3 engine, a star on the front grill and less space in the trunk. Fuck EU manufacturers.\n\nThe first manufacturer that sells a decent 4 door sedan at a normal cost will have my business whenever it happens. I am currently against EVs for my personal situation but the BYD Seal is the closest car to my price point + what I would like a car to look like (costing between 35/46K depending on some conditions are met).\n\nI would even roll a dice and risk getting a Alfa Romeo Giulia if it wasn't so fucking expensive.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo0bxe0/",
      "created": 1726810173,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lo35mlj",
      "score": 1,
      "body": "Renault seems to be doing well and BMW EVs are arguably among the better offerings from legacy OEMs. There will be a mix of protectionist policies and legitimate technological advancement in due time but I suspect they’ll find a way to adapt and PHEVs may be part of that. German (or German owned brands) are leading the way with some of the most performance-oriented hybrids around. Think Lamborghini, Audi, Porsche… Audi just won Dakar with an EV and has been using hybridization in world championship racing for a long time now. Let alone Formula E. They will find a way. ",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo35mlj/",
      "created": 1726855559,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lo5xxfd",
      "score": 1,
      "body": "If the EU puts tariffs on Chinese Automotive exports, then China will put tariffs on EU Automotive exports.\n\nIn 2023, China imported $20 billion worth of cars from the EU.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo5xxfd/",
      "created": 1726894521,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loh8mag",
      "score": 1,
      "body": "European and US carmakers have been death spiraling for decades. It's just a question of who will survive a little longer.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/loh8mag/",
      "created": 1727065484,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnwnqx3",
      "score": 2,
      "body": "looking to buy a car, considering only ICE. ev is over-hyped. I'm buying the dip.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwnqx3/",
      "created": 1726758418,
      "depth": 0,
      "replies": [
        {
          "id": "lnwsv8j",
          "score": -6,
          "body": "BEV is the only way. \n\nDon't trust media or car lobby over it.  \n\nBut you are right that an ICE is better than a plug in EV.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwsv8j/",
          "created": 1726760134,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lo0d6aa",
      "score": 1,
      "body": "How the west is believing Chinese numbers is mindblowing. Chinese manufacturers are so heavily subsidized by their government that foreign companies don’t stand a chance.\n\nHowever especially German manufacturers missed consumer demands spectacularly. Both ev and ice are way too expensive for what they offer. Add insane options pricing, too complex product lines, bad software and a push vor ev nobody had asked for.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo0d6aa/",
      "created": 1726810909,
      "depth": 0,
      "replies": [
        {
          "id": "lo0ohy0",
          "score": 2,
          "body": "\"Chinese manufacturers are so heavily subsidized by their government that foreign companies don’t stand a chance.\"\n\nhow so? I'm in China and I just bought a Tesla, I don't get any extra incentives from buying domestic car brands. The real killer here is battery supply chain and software integration, not subsidies.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo0ohy0/",
          "created": 1726818266,
          "depth": 1,
          "replies": [
            {
              "id": "lo0pley",
              "score": 1,
              "body": "China subsidizes on the supply side while US and Euros subsidize on the demand side.  It's the same for solar panels for example.  China subsidizes solar panel manufacturers while US subsidizes panel buyers.  End result is a steady flow of cheap panels from China to US while American solar panel factories go out of business.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo0pley/",
              "created": 1726819036,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lnwxkuy",
      "score": 1,
      "body": "All this hinges on Europeans not going \"you know what? Fuck EV's\".",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwxkuy/",
      "created": 1726761654,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnzixxf",
      "score": 1,
      "body": "The Chinese cars really aren't comparable in quality, but they have an attractive price/quality mix. They're decent cars, and they're cheap. The European/German cars are fantastic but expensive. China likes cheap, especially if it's decent *and* cheap. CCP also likes to incentivise their people to buy Chinese.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnzixxf/",
      "created": 1726796775,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lo16ce0",
      "score": 1,
      "body": "The future for most european car makers is not very bright. But the chinese EV's will be kept away because of the geopolitical reasons. China is an aggressive dictatorship that supports faschist russia. It would be mad to allow them export millions of remote controlled combustible (if crashed on purpose or fried by OTA command) robots with cameras and microphones to the streets of europe/US.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo16ce0/",
      "created": 1726830029,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnwoeqq",
      "score": 1,
      "body": "I think calling it a death spiral is an overexaggeration but the outlook definitely isn't rosy.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwoeqq/",
      "created": 1726758640,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnxsrcr",
      "score": 1,
      "body": "European carmakers are not on their deathbed but they’ve made some extremely poor choices. VW discontinued its best selling Audi model and overpaid for rivian despite massive debt and unproven ev sales. I would never invest with them. They are setting your money on fire.\n\nThe clients that were easy to convince to buy ev’s have already bought one. Now the dealership has to argue with the customer that isn’t sold on the idea to begin with why as to why he should spend 10k more on the car and another 5k on gear. It’s a very hard sell. Car executives should have expected this. Did they not do ANY market research at all?\n\nLastly, Everybody wanted to move production to China to save money and now everybody is surprised that the Chinese are branding their own cars and selling them in Europe. What did you think was gonna happen?",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxsrcr/",
      "created": 1726771449,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnylpa3",
      "score": 1,
      "body": "People are over thinking this.European carmakers are screwed because they can't compete on cost. \n\n\nChinese companies are putting out a wide array of affordable EV models, many that have features found in European model 3x the price. Tariffs will help keep Euro carmakers alive, but they will be effectively zombies, that will have their global reach heavily deminished.\n\n\nBest thing for Europe is to build/maintain a strong value play in ICE. That is a segment Chinese manufacturing hasn't been able build credibility in. Europe needs to stop artificially limiting themselves with regulations. \n\n\nIt's very obvious, that just because Europe makes rules and it's companies abide by them, doesn't mean other countries will do the same. Happened in Tech (with the US) and now Cars (with China).",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnylpa3/",
      "created": 1726784415,
      "depth": 0,
      "replies": [
        {
          "id": "lo756f4",
          "score": 3,
          "body": "\"Europe needs to stop artificially limiting themselves with regulations. \"\n\nThis is the main issue with the EU, and not just regarding cars. The bureaucracy is pathetically complicated, and it's not even effective.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo756f4/",
          "created": 1726921852,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnyv59e",
      "score": 1,
      "body": "What a joke is this, I am looking for an ev in europe and both Bmw ix3 and Audi q4 etron were my first choices, but to my disappointment the earliest that they can be delivered is in February 2025, as I need the car immediately I am going with Tesla Model Y most probably.\n\n On one side 5 months waiting period for every single model and on the other side complaining they are not selling well.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnyv59e/",
      "created": 1726787810,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnxbbgm",
      "score": 2,
      "body": "Due to EU's regulations the European car makers are making shitboxes that very few people want.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxbbgm/",
      "created": 1726765989,
      "depth": 0,
      "replies": [
        {
          "id": "lny8zi5",
          "score": 6,
          "body": "Europe makes the most desirable vehicles in the world. That they also happen to make small econoboxes doesn’t mean shit. If there’s a market for it, the big boys like VW will go for it.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lny8zi5/",
          "created": 1726780163,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnymb6c",
          "score": 2,
          "body": "Ah yes, shitboxes such a BMW or Porsche or Audi, really unliked brands these. I would hate to have to drive a Range Rover or an X5, crappy little ecoboxes as they are.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnymb6c/",
          "created": 1726784631,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnxxudv",
          "score": 0,
          "body": "Which regulations? [I have simultaneously seen people in this thread/elsewhere complaining about Europe being too far behind with switching to EVs and also about regulators pushing companies too hard about switching to EVs]",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxxudv/",
          "created": 1726776659,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnxq0n8",
      "score": 0,
      "body": "1) Nobody wants EV's now - maybe in the future when charging stations are more ubiquitous and range is improved.\n\n2) EU and US have done a good job imposing steep tariffs on Chinese EV's.  I think it's reasonable to expect this to continue or otherwise it's going to put some EU/US makers out of business.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxq0n8/",
      "created": 1726770585,
      "depth": 0,
      "replies": [
        {
          "id": "lo2jfjk",
          "score": 2,
          "body": "> I think it's reasonable to expect this to continue or otherwise it's going to put some EU/US makers out of business.\n\nIf the tariffs are so good for the EU automakers then why are pretty much all of them opposing the tariffs?\n\nThey know full well that this will just cause them to start losing market share in China even faster then they already are.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lo2jfjk/",
          "created": 1726848420,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnyttnb",
          "score": 1,
          "body": "Cars altogether. Biking is the way. And walking. And public transport.",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnyttnb/",
          "created": 1726787322,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnxcys8",
      "score": -3,
      "body": "The biggest headwind they are facing right now, as is the case with industry in the EU (esp. Germany) generally, is that they decided to trade cheap energy for a failed Nato project in eastern Europe.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxcys8/",
      "created": 1726766498,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnxrgtl",
      "score": -1,
      "body": "Yes they are, until the governments step in to help.  Tesla and the Far East will (are) taking over.\n\nOnly Alfa Romeo will survive intact as they employ car designers who actually know how to design a good looking car rather than cater for the nouveau riche.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxrgtl/",
      "created": 1726771044,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnyehse",
      "score": 0,
      "body": "Well, good luck to their marketing teams.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnyehse/",
      "created": 1726781940,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnz51gh",
      "score": 0,
      "body": "It’s not just Europe, the legacy auto makers in US are facing the same music. \n\nThe US and Europe manufacturers are lost their competitive edge. The demise is just a natural progression. Raising tariffs could buy these automakers some time. But the end is inevitable.",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnz51gh/",
      "created": 1726791525,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnwm6wa",
      "score": -8,
      "body": "Okay this might sound like a joke, but I think AI will save them (or some of the at least). It will have to if we are to be able to compete with the Chinese. ",
      "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnwm6wa/",
      "created": 1726757888,
      "depth": 0,
      "replies": [
        {
          "id": "lnxwsm6",
          "score": 3,
          "body": "What's the relevance of AI here? Self-driving cars? China (XPeng + BYD) + Tesla + Waymo are already making large strides here. No reason to think Europe will have a sudden edge here (nor that there is a moat per se here).",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxwsm6/",
          "created": 1726776314,
          "depth": 1,
          "replies": [
            {
              "id": "lnyqoup",
              "score": 1,
              "body": "Factory automation. Only way to compete with Chinese labour.",
              "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnyqoup/",
              "created": 1726786200,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lnxgtdr",
          "score": -1,
          "body": "people downvoting this have no idea how right you are",
          "permalink": "/r/stocks/comments/1fkmnbf/are_european_automakers_headed_for_a_death_spiral/lnxgtdr/",
          "created": 1726767697,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}