{
  "title": "Nike CEO John Donahoe is out, replaced by Elliott Hill ",
  "score": 423,
  "selftext": "Nike on Thursday announced that its CEO John Donahoe is stepping down and longtime company veteran Elliott Hill will take the helm of the sneaker giant.\n\nDonahoe, who has been Nike’s CEO since Jan. 2020, will retire from his position on Oct. 13. He will stay on as an advisor through the end of January. Hill is slated to take over on the following day.\n\n“I am excited to welcome Elliott back to NIKE. Given our needs for the future, the past performance of the business, and after conducting a thoughtful succession process, the Board concluded it was clear Elliott’s global expertise, leadership style, and deep understanding of our industry and partners, paired with his passion for sport, our brands, products, consumers, athletes, and employees, make him the right person to lead Nike’s next stage of growth,” said Mark Parker, Nike’s Executive Chairman. “Personally, I have worked with Elliott for more than 30 years and I look forward to supporting him and his senior management team as they seize the opportunities ahead.”\n\nNike is in the midst of a broader restructuring effort after its shifted its strategy to sell directly to consumers. Critics say in the process of building out sales at Nike’s stores and website, it lost sight of innovation and failed to churn out the types of sneakers the company was known for.\n\nSource: https://www.cnbc.com/2024/09/19/nike-ceo-john-donahoe-is-out-replaced-by-elliott-hill.html",
  "link_flair_text": null,
  "id": "1fku61e",
  "num_comments": 76,
  "created_utc": 1726777535,
  "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/",
  "comments": [
    {
      "id": "lny7exq",
      "score": 161,
      "body": "make better sneakers and sell them at footlocker",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lny7exq/",
      "created": 1726779669,
      "depth": 0,
      "replies": [
        {
          "id": "lny8qkm",
          "score": 121,
          "body": "Make better everything they make and don’t charge $100 for a graphic tee with a single swoosh on it too",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lny8qkm/",
          "created": 1726780085,
          "depth": 1,
          "replies": [
            {
              "id": "lnyzdld",
              "score": 32,
              "body": "All of their items are so much more expensive now compared to 5 years ago but their stock price hasn’t moved. This has been a horrible trade.",
              "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnyzdld/",
              "created": 1726789378,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lo4pazc",
              "score": 3,
              "body": "i was in europe two trips over the summer, 5 weeks total, and I looked at foot wear, and stupid t-shirts.  i really don't care but I learned two things, Nike was not worn a lot, and funny how even effing adults will wear a t-shirt with a hip logo on it.  Jack and Jones was really big.  This is my surveying from Paris to Strasbourg to Nimes, to Montpellier, to Marseille, and Barcelona.  People are so stupid.  They'd be better off buying happy Hawaiian short sleeved shirts, that give a good vibe, without a logo.",
              "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo4pazc/",
              "created": 1726874679,
              "depth": 2,
              "replies": [
                {
                  "id": "lo51t1u",
                  "score": 3,
                  "body": "Do you think Nike has lost its appeal because of design or because of price?",
                  "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo51t1u/",
                  "created": 1726879677,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lo8hh8d",
                      "score": 4,
                      "body": "I think both. They started designing their products based solely on the fact that the \"swoosh\" will carry the item and would also justify the overpriced item",
                      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo8hh8d/",
                      "created": 1726938825,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lo6j7kd",
                  "score": 2,
                  "body": "Hawaiian shirts were in trend 2-3 years ago, that’s when people into clothes wore them. Jack and Jones is a department store brand so people that don’t care about clothes might buy their jeans from the brand then just buy the matching t-shirt. Same is often with Tommy Hilfiger or Levi’s.  \nAll in all it very depends on the social circle, I personally only see that being a thing for teens or younger people.",
                  "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo6j7kd/",
                  "created": 1726908389,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lnz43ru",
          "score": 13,
          "body": "They won’t. They’ll continue to dilute their market by milking as many colorways on the same shoes",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnz43ru/",
          "created": 1726791166,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnygque",
          "score": 26,
          "body": "Make it easy to understand why you have 18 different workout tank tops and how they are different so I don’t have to order all of them and return 15.\n\nI also used to love tiger woods gear. Then I bought a sweater and it had a see thru back. Tiger woods would never wear that kind of sweater. I posted a review. It was deleted. These people are idiots. Whoever designed that sweater probably works from home.",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnygque/",
          "created": 1726782696,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lo1mm85",
          "score": 4,
          "body": "And that don’t fall apart. My most expensive shoes ever are Nike running shoes. I wanted to exercise more to get healthier and about the fifth time I wore them, a piece came loose from the bottom and tripped me badly. Since then all of the other pieces of rubber have fallen off so the bottoms of the shoes are very slick. I had a limp for about a month and messed up my favorite exercise pants. \n\nThe Nike outlet wouldn’t let me exchange them because they had been worn. They are going to get sued. ",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo1mm85/",
          "created": 1726837334,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnzz6m9",
          "score": 2,
          "body": "Are they not at foot locker? Lol",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnzz6m9/",
          "created": 1726803520,
          "depth": 1,
          "replies": [
            {
              "id": "lo0147x",
              "score": 6,
              "body": "https://www.retaildive.com/news/nike-moves-away-from-foot-locker-in-shift-to-dtc/619441/",
              "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo0147x/",
              "created": 1726804439,
              "depth": 2,
              "replies": [
                {
                  "id": "lo04hkf",
                  "score": 3,
                  "body": "Okay then. Haha. I don’t even remember the stores I been seeing Nike and Jordan shoes in. But they’re in stock and some even discounted lol",
                  "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo04hkf/",
                  "created": 1726806115,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lo507tq",
                  "score": 1,
                  "body": "That's pretty funny, considering last year they closed their New Zealand online store, and the few brick and mortar stores they actually have don't stock athletics gear, not will they take orders.\n\nThere's no other running shoe company in the world that doesn't ship to New Zealand.",
                  "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo507tq/",
                  "created": 1726879033,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lny0wq2",
      "score": 269,
      "body": "Shares up 10% afterhours.\n\nSpeaks volumes about how much of a disaster Donahoe's tenure was.",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lny0wq2/",
      "created": 1726777645,
      "depth": 0,
      "replies": [
        {
          "id": "lnygmjt",
          "score": 117,
          "body": "Not all managers are created equally. When people ask “why does this guy make x million????” It’s because the wrong guy can cost you billions.",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnygmjt/",
          "created": 1726782656,
          "depth": 1,
          "replies": [
            {
              "id": "lnywfp8",
              "score": 14,
              "body": "I’m not defending the outgoing CEO but how much of it’s attributable to him versus attributable to selling sneakers that cost far more than they’re worth during a cost of living crises?\n\nI imagine the core buying demographic for Nike (younger people, mostly men) are the ones impacted the most by inflation and the accompanying cost of living crises.\n\nAs much as corporations wish they were the exception, not all goods are elastic like food. If a company is selling a product that is not necessarily (like overpriced athletic shoes), and the consumer is financially constrained, the logical consumer won’t purchase the overpriced unnecessary good, no matter who is the CEO.\n\nHaving a chimp or Gordon Gecko as your CEO won’t change that. .",
              "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnywfp8/",
              "created": 1726788289,
              "depth": 2,
              "replies": [
                {
                  "id": "lnz16gr",
                  "score": 40,
                  "body": "This guy made terrible strategic decisions like giving up floor space - also known as prime advertising - because he wanted the juicier margins of DTC.  He also has no idea who the customer is. Lots of people who used to spend thousands a year on conservative Nike stuff now shop at lululemon because they don’t want to look like a 16 year old.",
                  "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnz16gr/",
                  "created": 1726790056,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lnywzyh",
                  "score": 50,
                  "body": "You’d be wrong. Nike’s competitors have dramatically outperformed it over the last several years, and athletic clothing and shoes are becoming more popular, not less. You shouldn’t make investment decisions based on the doomposting that you see on reddit.",
                  "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnywzyh/",
                  "created": 1726788497,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lnz07xl",
                      "score": 14,
                      "body": "100%. Im from New Zealand so we are hardly a focus for Nike, but accessing their clothes (especially the more premium stuff) is a nightmare, we cant even buy online.\n\nGo to anymore gym here and youll see lululemon, alo, new balance",
                      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnz07xl/",
                      "created": 1726789694,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lo0c4sn",
                          "score": 6,
                          "body": "In the US it’s a lot of On Cloud and Hoka, too.",
                          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo0c4sn/",
                          "created": 1726810292,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lo0kqb5",
                              "score": 1,
                              "body": "God, On Cloud is a blight.",
                              "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo0kqb5/",
                              "created": 1726815689,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lo50pkw",
                          "score": 1,
                          "body": "I boycotted them on principle after they shut down the online store. \n\nLike they're the major supplier of athletics kit for track and field, and they shut up shop in the whole country. The Australian online store still ships from the Netherlands, like what difference does it make?",
                          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo50pkw/",
                          "created": 1726879232,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lnz24cc",
                      "score": 0,
                      "body": "But do Nike’s competitors sell their products at the same premium as Nike? \n\nI could be wrong but I think it has more to do with Nike’s price point than anything else.\n\nI personally have sifted to Adidas, not because I love adidas (or any athletic brand) but because adidas offers a similar product(in terms of quality and brand perception)  to Nike at a better price.",
                      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnz24cc/",
                      "created": 1726790410,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lnzid1c",
                          "score": 14,
                          "body": "I did very little reading on this recently so take this with a grain of salt.  Nikes biggest competitors are often selling at higher price points. Lulu and OnCloud being two examples.  Then on the cheaper side you've got Reebok and New balance grabbing the younger generations attention.  So they're getting pinched from both sides. Flatly, Nike just isn't what the younger generations are buying at any price point.",
                          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnzid1c/",
                          "created": 1726796553,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lo0gjo4",
                          "score": 5,
                          "body": "you’re wrong, nike’s competitors sell at a higher premium and are doing well too\n\nalso i just went to an adidas and nike store today and they’re very similar priced so not sure what you are on about (looking mainly at shoes)",
                          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo0gjo4/",
                          "created": 1726812976,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lnz7lx8",
                  "score": 4,
                  "body": "Plenty of people are in shitty situations but also suck at their job. Doesnt matter. Im sure the board evaluates it as objectively as possible.",
                  "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnz7lx8/",
                  "created": 1726792497,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lnzoxyc",
                  "score": 1,
                  "body": "The sneaker price is a CEO decision.",
                  "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnzoxyc/",
                  "created": 1726799119,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lo28qb0",
                  "score": 1,
                  "body": "He took the piss with limited editions which seems to have caused resentment, 'fakes' are basically acceptable amongst young people now whereas when I was a kid you'd have been ribbed mercilessly for wearing them.\n\nSeems to have lost one of their biggest sellers and the most watched sports team on the planet to Adidas - [https://www.reddit.com/r/LiverpoolFC/comments/18958t2/liverpool\\_top\\_shirt\\_sales\\_in\\_20222023\\_season/](https://www.reddit.com/r/LiverpoolFC/comments/18958t2/liverpool_top_shirt_sales_in_20222023_season/)\n\nI normally swear by Nike but just bought my first pair of Brooks after my last pair of Nikes lasted all of four months before I started getting foot pain in them - price has gone up, quality has seemingly gone down. \n\nI don't know if their designs consciously got 'younger' or I just got too old but when I look on their site it seems like their clothes are designed by someone who's entire knowledge of the world comes from early 90s snowboarding/skateboarding videos.\n\nThey seem to have tried to make inroads into a higher end market they're not equipped for - why would I pay £250 for a Nike winter coat when I can get one for the same price (or less) from Carhartt and be confident in it's quality.",
                  "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo28qb0/",
                  "created": 1726844975,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lo0klyo",
                  "score": 0,
                  "body": ">cost of living crisis\n\nLOL",
                  "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo0klyo/",
                  "created": 1726815610,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lo0kkgj",
              "score": 2,
              "body": "While I agree in theory, studies show very little correlation between executive pay and company performance.",
              "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo0kkgj/",
              "created": 1726815582,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lo1oghh",
              "score": 2,
              "body": "Nah, CEO’s make too much and are never held accountable for their actions. John will leave with more money than almost any other person could dream of. That’s the consequence of “losing billions” of shareholder value.",
              "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo1oghh/",
              "created": 1726838040,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lnz34nc",
              "score": 1,
              "body": "but you see that's not the popular narrative on reddit",
              "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnz34nc/",
              "created": 1726790791,
              "depth": 2,
              "replies": [
                {
                  "id": "lnz494c",
                  "score": -1,
                  "body": "Bc it’s wrong    It’s about the DTC push Donohue made (bc it’s the part he was comfortable with) that others have mentioned",
                  "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnz494c/",
                  "created": 1726791224,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lnz94uo",
                      "score": 5,
                      "body": "That’s called being a bad manager of the business. He had bad judgment.",
                      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnz94uo/",
                      "created": 1726793065,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lnyh0qe",
          "score": 18,
          "body": "He also coasted at eBay on PayPal's success when it was their subsidiary",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnyh0qe/",
          "created": 1726782789,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnyfutf",
          "score": 3,
          "body": "The last few years have been brutal",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnyfutf/",
          "created": 1726782394,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnykng2",
          "score": 3,
          "body": "Curious to see his severance package.",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnykng2/",
          "created": 1726784043,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnz2o86",
          "score": 2,
          "body": "Sold it all after market🙏",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnz2o86/",
          "created": 1726790617,
          "depth": 1,
          "replies": [
            {
              "id": "lnzmwc5",
              "score": 2,
              "body": "Sold it all on Monday. Bad luck",
              "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnzmwc5/",
              "created": 1726798306,
              "depth": 2,
              "replies": [
                {
                  "id": "lnzv654",
                  "score": 2,
                  "body": "Happen to me on Goog.",
                  "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnzv654/",
                  "created": 1726801704,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lnz5lbx",
          "score": 1,
          "body": "Stock reached its all time highs under Donahoe.  He's more or less leaving where the company was at when he took over.  \n\nNike products are stale - that is why they losing market share.  I think the generation that grew up with Nike is starting to age out, and the younger generations are going with other brands as they have no attachment ot Nike.",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnz5lbx/",
          "created": 1726791738,
          "depth": 1,
          "replies": [
            {
              "id": "lo03uej",
              "score": 4,
              "body": "The stock price is significantly lower than it was when he took over while the rest of the market has soared. I don’t know how you can say his tenure has been anything but a complete failure. If the products are stale then that’s ultimately on him",
              "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo03uej/",
              "created": 1726805787,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lo10q8f",
              "score": 2,
              "body": "Many stocks were at ATHs during that same period. The problem was always what happens when the world exits COVID and reality smacks at stock prices.",
              "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo10q8f/",
              "created": 1726826748,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lnyhy2b",
      "score": 36,
      "body": "Weird how waging war on all your long term, well established retail partners at a time when multiple other competitors are growing in popularity could have back fired. Huh.",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnyhy2b/",
      "created": 1726783103,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnyiwni",
      "score": 22,
      "body": "Distribution really matters. The only reason Celsius grew as well as it did is because of Pepsi's network. The same applies to sneaker brands. Without the space enabled by Nike due to their move to DTC, competitors like Hoka and On would have little traction. Physical and mental availability is extremely important.",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnyiwni/",
      "created": 1726783433,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lny3jdz",
      "score": 29,
      "body": "Thank fuck - Ackman doing the lords work",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lny3jdz/",
      "created": 1726778476,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnz3v7m",
      "score": 14,
      "body": "The first time I heard Donahoe open his mouth I knew it wouldn’t work out.  Whoever hired him should be fired as well.  He does not fit with Nike culture in any way.",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnz3v7m/",
      "created": 1726791073,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnya7mk",
      "score": 10,
      "body": "Looks like most investors like the move. Up 10%.",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnya7mk/",
      "created": 1726780551,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnyrvks",
      "score": 35,
      "body": "Despite being objectively terrible at his job he earned $29 million just last year.  CEO compensation is out of control.",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnyrvks/",
      "created": 1726786626,
      "depth": 0,
      "replies": [
        {
          "id": "lnziotx",
          "score": 3,
          "body": "I should be worse at my job....",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnziotx/",
          "created": 1726796679,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lny81o3",
      "score": 29,
      "body": "Ahh my bags are feeling lighter.",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lny81o3/",
      "created": 1726779866,
      "depth": 0,
      "replies": [
        {
          "id": "lo0px9d",
          "score": 2,
          "body": "I bought in the low 70s when people were panicking. No ragrets",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo0px9d/",
          "created": 1726819263,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnzul3g",
      "score": 8,
      "body": "He was a hack at ServiceNow too.",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnzul3g/",
      "created": 1726801446,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnyrc9s",
      "score": 5,
      "body": "My cost basis of $72 feeling reaaaal good right now",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnyrc9s/",
      "created": 1726786435,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnzotlh",
      "score": 5,
      "body": "This guy isn’t gonna determine whether we buy shoes or not in the next 12-24 months. No change to NKE imo",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnzotlh/",
      "created": 1726799071,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lny8vvl",
      "score": 12,
      "body": "Poor guy, probably went out for a coffee and BOOM replaced",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lny8vvl/",
      "created": 1726780131,
      "depth": 0,
      "replies": [
        {
          "id": "lnydntm",
          "score": 8,
          "body": "CEOs usually get millions in cash/stocks as part of any separation. Even if they get fired for sheer incompetence.",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnydntm/",
          "created": 1726781667,
          "depth": 1,
          "replies": [
            {
              "id": "lnyjrxm",
              "score": 5,
              "body": "The ole golden parachute. Everyone else gets fired (or should be) for incompetence.",
              "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnyjrxm/",
              "created": 1726783737,
              "depth": 2,
              "replies": [
                {
                  "id": "lnz7wf1",
                  "score": 3,
                  "body": "If you work at nike corporate you get severance for being fired.",
                  "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnz7wf1/",
                  "created": 1726792608,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lnyyue6",
          "score": 3,
          "body": "Poori guy?? Lol",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnyyue6/",
          "created": 1726789179,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lny8526",
      "score": 7,
      "body": "Starbucks effect 💪🏻, i manage to ride both, i sold SBUX but i will hold Nike",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lny8526/",
      "created": 1726779896,
      "depth": 0,
      "replies": [
        {
          "id": "lnyhytl",
          "score": 6,
          "body": "You think NKE is going to get as big of boost as SBUX did after the transition was announced? I bought a ton of NKE after seeing what happened with SBUX knowing Donahoe was on a very short leash",
          "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnyhytl/",
          "created": 1726783110,
          "depth": 1,
          "replies": [
            {
              "id": "lo092xd",
              "score": 3,
              "body": "True, i dont know but i love to buy marvelous components when sentiment is bad. I did with Facebook, Netflix, Tesla… there is always people telling “company is deab, bla bla…”, these companies are huge monsters capable of turning around, check chart. Nike brand is like coca cola, people will buy its products even in recession. Put a stop lost and let it run",
              "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo092xd/",
              "created": 1726808558,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lnzows3",
      "score": 3,
      "body": "Looks like he managed himself out",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnzows3/",
      "created": 1726799106,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnzrs65",
      "score": 3,
      "body": "Donahoe has done some hoes on the downlow.",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnzrs65/",
      "created": 1726800265,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnyhjo0",
      "score": 6,
      "body": "They changed the product name 12 times across 10 years ensuring no on can remain loyal to a product line even if they tried.  Their marketing strategy was idiotic.  They need someone thats not a Nike veteran.",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnyhjo0/",
      "created": 1726782967,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lny36ae",
      "score": 4,
      "body": "good riddance",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lny36ae/",
      "created": 1726778363,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnyorg8",
      "score": 2,
      "body": "I was eyeing that call option at noon...fk me",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnyorg8/",
      "created": 1726785505,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lo0fwnq",
      "score": 2,
      "body": "All I read was the hoe is out",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo0fwnq/",
      "created": 1726812569,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnye1lz",
      "score": 2,
      "body": "You know,  not that I ever put it together before, but The article says Donahoe started as CEO IN January 2020.\n\nBy March 2020, the entire world shut down.\n\nHmmm.    Makes you wonder just how much power Nike REALLY has.![gif](emote|free_emotes_pack|feels_good_man)",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnye1lz/",
      "created": 1726781792,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnyyfn8",
      "score": 1,
      "body": "Great, I'll be in the green now",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnyyfn8/",
      "created": 1726789028,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lo5zabh",
      "score": 1,
      "body": "He’s probably on the Diddy tapes.",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lo5zabh/",
      "created": 1726895295,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnyptyn",
      "score": 1,
      "body": "Kinda funny my last comment also mention this dude and why he sucks",
      "permalink": "/r/stocks/comments/1fku61e/nike_ceo_john_donahoe_is_out_replaced_by_elliott/lnyptyn/",
      "created": 1726785891,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "Nike CEO John Donahoe is stepping down, to be replaced by Elliott Hill.",
    "companies": [
      "Nike"
    ],
    "tickers": [
      "NKE"
    ],
    "main_ticker": [
      "NKE"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Nike CEO John Donahoe is stepping down and will be replaced by Elliott Hill as the new CEO amid a broader restructuring effort at the company.",
    "stock_recommendations": "The post does not contain any recommendation to buy or sell Nike stock.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": "none",
    "sentiment_summary": "The sentiment is neutral as the post describes a leadership change at Nike without any stock recommendation.",
    "sentiment": "neutral"
  }
}