{
  "title": "Mercedes cuts FY guidance by 25%. First of many profits warnings to come..",
  "score": 183,
  "selftext": "MBG has cut FY24 guidance today at 9pm Reducing FY24 guidance by over 25% with FY EBIT margin from 10-11% to 7.5%-8.5%. Main driver is weakness is China where MB gets lots of its profit.\n\nI think this is the first of many profit warnings we will get this September from Autos and Luxury companies. China is very weak and consumer to buying big ticket items globally.\n\nAs always germany leads the way on profit warnings given their strict reporting requirements:\n\n\nfull release below:\n\nMercedes-Benz Group AG adjusts full-year guidance for the year 2024 based on current market outlook\n\nStuttgart, Germany - As a result of recent developments, Mercedes-Benz Group AG today adjusted its earnings outlook for the year 2024 for Mercedes-Benz Cars and Mercedes-Benz Group.\n\nThis was triggered by a further deterioration of the macroeconomic environment, mainly in China. GDP growth in China lost further momentum amid weaker consumption as well as the continued downturn in the real estate sector. This affected the overall sales volume in China including sales in the Top-End segment. Overall, the sales mix in the second half of 2024 is expected to remain unchanged versus the first half, and therefore weaker than originally expected.\n\nAdditionally, the second half of 2024 is expected to be impacted by various valuation adjustments. Furthermore, the dynamic pricing environment is expected to continue.\n\nTherefore, Mercedes-Benz Group has updated its full-year outlook:\n\nMercedes-Benz Cars now expects the adjusted Return on Sales to be between 7.5% and 8.5% (previously: 10% to 11%). This implies an expected adjusted Return on Sales of around 6% for the second half of the year. The valuation adjustments are expected to have an impact of around 1 percentage point in the second half of this year.\nMercedes-Benz Vans’ expected adjusted Return on Sales (14% to 15%) and Mercedes-Benz Mobility’s expected adjusted Return on Equity (8.5% to 9.5%) remain unchanged.\nMercedes-Benz Group’s EBIT is now expected to be significantly below the prior year level (previously: slightly below the prior-year level).\nFree cash flow of the industrial business for the Mercedes-Benz Group is now expected to be significantly below the prior-year level (previously: slightly below the prior-year level).\n",
  "link_flair_text": null,
  "id": "1fkxtir",
  "num_comments": 51,
  "created_utc": 1726787258,
  "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/",
  "comments": [
    {
      "id": "lnzkmw6",
      "score": 96,
      "body": "Mercedes is honestly just too fucking expensive. Their EV lineup even more…. So amongst the top luxury brands, getting customers to choose you over the others is just a knife fight",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lnzkmw6/",
      "created": 1726797421,
      "depth": 0,
      "replies": [
        {
          "id": "lo0d206",
          "score": 58,
          "body": "their EV lineup are absolute ugly shit abdomination",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo0d206/",
          "created": 1726810838,
          "depth": 1,
          "replies": [
            {
              "id": "lo0rmtw",
              "score": 26,
              "body": "And are absolutely unreliable. We ordered 50 company cars and all of them had problems. Either not delivered as ordered (color, options) or technical issues (battery not charging on AC).  They became too arrogant when cars became scarce.",
              "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo0rmtw/",
              "created": 1726820467,
              "depth": 2,
              "replies": [
                {
                  "id": "lo23hfl",
                  "score": -6,
                  "body": "All European cars are made to break. I used to sell cars, and let me tell you if it wasn’t for people wanting a status symbol Mercedes and Audi would have all been out of business years ago. I’ve seen these things have check engine lights sitting on the showroom floor. It’s literally something people buy for a status symbol (which is hilarious to me because all it does is announce you either value the wrong things in life, or you aren’t actually great with your money).",
                  "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo23hfl/",
                  "created": 1726843280,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lo1bscq",
              "score": 8,
              "body": "EQB is one of the ugliest vehicles. It looks like a cab from the rear quarter panel.",
              "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo1bscq/",
              "created": 1726832732,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lo1gxqx",
              "score": 2,
              "body": "Look like QA failed legos",
              "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo1gxqx/",
              "created": 1726835012,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lo19ty6",
          "score": 12,
          "body": "I used to love the german brands like MB, BMW, and VW but it seems to me all of them have dropped the ball badly the past several years already.",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo19ty6/",
          "created": 1726831813,
          "depth": 1,
          "replies": [
            {
              "id": "lo23knh",
              "score": 13,
              "body": "Porsche is obviously nice, but also completely unaffordable for the vast majority of people.",
              "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo23knh/",
              "created": 1726843309,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lo3ehlg",
          "score": 3,
          "body": "Mercedes is the bestselling brand in my country among the luxury car makers, but then the volumes here are a line item compared to global volumes.\n\nHowever the problem is that Mercedes has decided that they want to be tagged as an even more premium offering than BMW and Audi, and this means a C Class here on the road is almost as expensive as an Audi A6 is on the road.",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo3ehlg/",
          "created": 1726858445,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lo14py3",
          "score": 6,
          "body": "It is one thing when you make great engines that are reliable, but EVs killed that whole thing. Also their interiors have become absolute low quality plastic rubbish lol",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo14py3/",
          "created": 1726829130,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lo00bs6",
          "score": 5,
          "body": "Hey, but MB's have beautiful interior led lights.  /s",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo00bs6/",
          "created": 1726804062,
          "depth": 1,
          "replies": [
            {
              "id": "lo0ccpp",
              "score": 5,
              "body": "Interior design is hard, software is easy",
              "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo0ccpp/",
              "created": 1726810421,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lnyvaif",
      "score": 55,
      "body": "Either MB totally sucks or Tesla went too far today.",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lnyvaif/",
      "created": 1726787863,
      "depth": 0,
      "replies": [
        {
          "id": "lnywajo",
          "score": 41,
          "body": "Tesla deliveries in China are up… but many buyers are switching away from ICE vehicles in China, even at the luxury segments and Mercedes isn’t competitive with EVs.",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lnywajo/",
          "created": 1726788235,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lnzx9pa",
      "score": 56,
      "body": "I’ll never forget the CFO proudly proclaiming they would artificially limit production so they could keep overcharging consumers just because they can.",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lnzx9pa/",
      "created": 1726802637,
      "depth": 0,
      "replies": [
        {
          "id": "lo0s26r",
          "score": 16,
          "body": "That's a wild thing to say as a CFO, wow.",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo0s26r/",
          "created": 1726820771,
          "depth": 1,
          "replies": [
            {
              "id": "lo1re2a",
              "score": 3,
              "body": "Quoted in Financial Times.",
              "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo1re2a/",
              "created": 1726839125,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lo116bt",
          "score": 6,
          "body": "Hubris always comes back to bite.",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo116bt/",
          "created": 1726827024,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lo2m34s",
          "score": 5,
          "body": "A lot of auto companies were being really idiotic post-COVID thinking that the artificially increased prices caused by the shortages could be kept up forever by just continuing to limit production after the shortages were gone. As if there aren't 30+ automakers in the world, some of whom will see such an idiotic strategy as an opportunity to increase their sales and market share.",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo2m34s/",
          "created": 1726849287,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loh4k4i",
          "score": 1,
          "body": "Wasn’t that Toyota ?!",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/loh4k4i/",
          "created": 1727063419,
          "depth": 1,
          "replies": [
            {
              "id": "loh6yiu",
              "score": 1,
              "body": "Nope! It was the Mercedes CFO. I was in the market for a sprinter van. Everywhere in California was adding $15k above msrp for the 4x4 model. And then I read the CFO is gloating about it.",
              "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/loh6yiu/",
              "created": 1727064618,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lnyxf1h",
      "score": 58,
      "body": "China's economy might be slowing \n\nBy China's own domestic ev car market is selling cars at half the price of not just Mercedes but all the legacy auto makers.\n\nThey are literally selling them buy the boat load in South america.\n\nChina represents not only a big chunk of premium car brands executive models...the car makers make big bucks selling Chinese only models.\nMercedes long wheel based e class is sold as alternative to a s class for a significant premium over a standard e class in Europe.\n\nAnd whilst the domestic ev product isn't exactly polished is sure beats a Mercedes a class with its Renault ice engine lumped into it\n\nMercedes ev plant is literally in China too...because china has full vertical integration on ev batteries from resource mine to battery pack.\n\nThe luxury market has been resilient since 2010...the idea being that even if it's just a small treat consumers flock to high end goods to treat themselves.\nThink of people buying $30 lipstick when they can not afford the $300 belt shirt or whatever else they see in a high end store.\n\nUnless Mercedes start selling bucket loads of coffee mugs in China they don't have that option\n\nAnd when the domestic product matches or outperforms them for half the price....Mercedes situation seem quite played out\n\nThe EU can America can only levy 100% tariffs on Chinese evs for so long.\n\nLegacy car makers are all on borrowed time especially in Europe...unless Serbia literally agrees to becoming the open cast lithium mine for Europe and starves China of its battery dominance",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lnyxf1h/",
      "created": 1726788650,
      "depth": 0,
      "replies": [
        {
          "id": "lnzqlk2",
          "score": 6,
          "body": "This is better than anything I’ve heard from big boy investment firms dedicated EV market analysts. Thanks!",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lnzqlk2/",
          "created": 1726799782,
          "depth": 1,
          "replies": [
            {
              "id": "lo10ssb",
              "score": 4,
              "body": "There are quite a few strategy calls available in the ev market that will give you covered exposure \n\nNone of them include buying into individual automaker stocks.\n\nI wouldn't want to choose winners and loosers....even tesla. Especially with a stock run by elmo. Who could implode the stock or send it to literally to Mars based on a tweet.\n\nMercedes are also not the only one putting out financial warnings so are vw that situation is even more dire.\n\nWhilst China is spreading its wings for its manufacturing base despite how the economy is moving.\n\nGermany...who's high precision manufacturing base (if you believe that German cars are better made) had been subsidised  through cheap energy costs from Russia upto this decade.\n\nThat's all gone now...so production costs will remain high. \n\nAnd it's not a case of oh let's just whack some solar panels on the plant factory roof.\nThe whole country needs to upgrade its infrastructure\n\nAnd this is where China being an autocratic state has the advantage.\n\nIf the cccp decide that evs will be  prioritised over ice engines. There ain't nothing anybody in the country can do about it. China not only has populatuon scale but they have relatively quick pace for change....mainly becuase power is wilded through an iron fist.\n\nBut basing financial calls on that isn't easy. Which is whet the strategy call is to be throughout the production chain rather than just one stock",
              "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo10ssb/",
              "created": 1726826792,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lnyyuxy",
      "score": 13,
      "body": "TSLA up?",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lnyyuxy/",
      "created": 1726789184,
      "depth": 0,
      "replies": [
        {
          "id": "lnzy478",
          "score": 7,
          "body": "Their sales are up but I suspect their margins are terrible",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lnzy478/",
          "created": 1726803029,
          "depth": 1,
          "replies": [
            {
              "id": "lo0aoen",
              "score": 3,
              "body": "1.99 % financing in doing it in Canada.",
              "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo0aoen/",
              "created": 1726809454,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lnzhj7w",
      "score": 17,
      "body": "It seems like the companies having the most difficulty are companies that sell their products at a premium (often on credit) to people that are currently experiencing a cost of living crises.\n\nMiddle class office workers aren’t trying to spend $63k (before taxes and dealer fees) for the lowest priced Mercedes available. Especially in a cost of living crises.\n\nCompanies need to learn their goods aren’t always elastic. Just because “inflation” is up (corporate price gouging) doesn’t mean consumers will pay the high costs companies are trying to justify.",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lnzhj7w/",
      "created": 1726796242,
      "depth": 0,
      "replies": [
        {
          "id": "lo18q0r",
          "score": 5,
          "body": "Luxury and leisure are always the first to experience a slow down during a recession",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo18q0r/",
          "created": 1726831271,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loh4xh0",
          "score": 1,
          "body": "The same guys will buy an 83k truck instead",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/loh4xh0/",
          "created": 1727063599,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lo0d01m",
      "score": 8,
      "body": "nah MB really sucks with the latest models and EQ design fiasco. that shit just doesn't sell at all",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo0d01m/",
      "created": 1726810805,
      "depth": 0,
      "replies": [
        {
          "id": "loxw4ip",
          "score": 1,
          "body": "Their enthusiast lineup is also cratering when they got rid of v8 and v6 and replaced with hybrid, nobody wants them",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/loxw4ip/",
          "created": 1727308418,
          "depth": 1,
          "replies": [
            {
              "id": "loxwovi",
              "score": 2,
              "body": "they absolutely fucked it up. I was looking forward to getting GLC 63s Coupe but they put 4 cyl in there. If BMW didn't fuck up their new X3 line, I would go with them. But MB and BMW are both racing to the bottom. I was at MB dealership yesterday placing an order for GLE AMG (that still have i6/v8 and physical buttons for climate control thank god!) and they had C 63s in showroom. I asked the manager if they ever sold one - he said \"yes, we sold one\". I asked you sold \"one\" this month? He said, no, we sold \"one this year\". This is an absolute fuck up and this 4 cyl shit costs like v8 PLUS 20% on top.",
              "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/loxwovi/",
              "created": 1727308625,
              "depth": 2,
              "replies": [
                {
                  "id": "loy8pfx",
                  "score": 1,
                  "body": "bmw just fired their head design executive lol, also pretty sure mercedes is walking back the hybrid shit also 2025-2026, absolutely butchered the c63 \n\n2024 was a terrible year for German cars",
                  "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/loy8pfx/",
                  "created": 1727313079,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lnzhy1m",
      "score": 18,
      "body": "Not all automakers focused on the chinese market.\n\nMercedes, BMW and Volkswagen did, and they will suffer the most from chinese weakness. It was a short-sighted strategy. \n\nToyota's sales - mostly to NA and Japan. \n\nFerrari - Middle East, EU and NA.\n\nPorsche - EU and NA.\n\nFord basically makes all their profit from NA.\n\nIt's a test of how exposed the automaker is to China than anything else.",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lnzhy1m/",
      "created": 1726796395,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lo405wo",
      "score": 3,
      "body": "The only car company stock worth buying is RACE.",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo405wo/",
      "created": 1726865587,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loapppo",
      "score": 2,
      "body": "Honestly drove most of their cars last week for testing \n\nMany great cars sure but many also felt cheap and plastic ish \n\nWasn’t impressed honestly been a while since I tested the cars - felt like down hill",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/loapppo/",
      "created": 1726967765,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lo11suj",
      "score": 4,
      "body": "Mercedes is boring now. They need desperately an advertsing campaign to make their cars desirable again. The Mercedes is now the 1990s equivalent of the Ford Mondeo.\n\nGet that Alla Bruletova to tap her fingers on the bonnet of a radical new model of a Mercedes and you'll will be onto a winner.\n\nThe cybertruck love or hate it, makes news headlines in social media every week. If people aren't talking about your brand, it's dying.",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo11suj/",
      "created": 1726827404,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lo1a87q",
      "score": 4,
      "body": "Chinese Just by more domestic brands in all areas including cars. China is slowing for mercedes. Their products arent competitive",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo1a87q/",
      "created": 1726832004,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnztjd2",
      "score": 3,
      "body": "MB suck now.",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lnztjd2/",
      "created": 1726800999,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnz8k67",
      "score": 4,
      "body": "Mercedes just sucks\nAnd people are beginning to see",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lnz8k67/",
      "created": 1726792850,
      "depth": 0,
      "replies": [
        {
          "id": "lnzogvg",
          "score": -1,
          "body": "Why would you say this?\n\nFirst of all I don't own the stock, but saying Mercedes sucks is at least subjective \n\nMy brother just bought a GLC and that car seems like it was made in heaven",
          "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lnzogvg/",
          "created": 1726798931,
          "depth": 1,
          "replies": [
            {
              "id": "lnzopdt",
              "score": 9,
              "body": "And on the other hand my GLC got bought back under the lemon law within a year\n\n2024 C classes were filling up service departments with broken hybrid systems for the first 6 months of being released\n\nS classes and G wagons are rattle boxes because everything’s plastic",
              "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lnzopdt/",
              "created": 1726799024,
              "depth": 2,
              "replies": [
                {
                  "id": "lnzphrm",
                  "score": 0,
                  "body": "I don't know if it matters but we're from Europe \n\nI am not an axpert but I've driven quality cars, and the only car I liked more than the GLC is the Lexus LS\n\n\nNot saying you're wrong but if you bought a GLC yourself... that is because you liked or appreciated the brand. You were willing to pay good money for it. It went bad for you, and you know some cars are like watermelons, some just are bad. \n\nBut man don't say Mercedes is shit when yourself bought a 90k Mercedes car this year",
                  "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lnzphrm/",
                  "created": 1726799338,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "loa1aq6",
      "score": 1,
      "body": "Ok their EV are really really bad but personally, I believe that Mercedes and others car manufactures will have a different futur than Tesla. At least, I’m invested in MBG so I hope… :)\n\nMy reason is : Mercedes is involved in racing and this benefits of getting the new technology and innovation in terms of power units. In Formula 1 for example, with the help of ARAMCO and others companies / federation, they aim for 100% sustainable fuels for 2026… Is it possible ? Will it be really sustainable ? The futur will tell us but at least Mercedes is a brand that is involved on those subjects in the present and competition. And new cutting-edge technologies often end up being adapted to daily objects as the cars.",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/loa1aq6/",
      "created": 1726958024,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lotqifd",
      "score": 1,
      "body": "Mercedes Benz was always below average car maker, surviving mostly on a heavy promotion of its brand name. BMW started its way a decade ago, and will soon follow that suit.",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lotqifd/",
      "created": 1727253433,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lo1nf4t",
      "score": -3,
      "body": "Who the fuck would invest in automobiles knowing what's around the corner in China? Everything in the US and Europe is dead company operating solely based on unpopular protectionist laws",
      "permalink": "/r/stocks/comments/1fkxtir/mercedes_cuts_fy_guidance_by_25_first_of_many/lo1nf4t/",
      "created": 1726837647,
      "depth": 0,
      "replies": []
    }
  ]
}