{
  "title": "Is Private Equity a bubble? ",
  "score": 270,
  "selftext": "I came across this white paper from this guy. I really liked it. He talked about PE industry went from 500 billion to 8 trillion in 20 years mainly because of their „financial engineering“ similar to that of mortgage securities in 08. \n\nHe claimed unwinding in imminent and only a matter of time when. \n\nWhat do you think? I myself have seen one too many people obsess about this profession recently, especially ex investment bankers. \n\n One of the point I really liked from the paper was, PE firms care short term returns but the owner of a business actually cares long term. PE owners have no trouble firing people and raising prices but the owner on the other had do care about jobs pf the people etc. I have heard buffet shit about PE too in the past, saying they are dishonest. \n\nNow am having confirmation bias or is there a real interesting story underneath?! Plus all the PE firms are at all times high, Ik that doesn’t mean anything but how long can a thing stay bullish?! Forever?! \n\n**Edit: Holy dear jesus, this blew up. Here's the source of the white paper: https://www.jareddillianmoney.com/street-freak/next-big-short",
  "link_flair_text": "Discussion",
  "id": "1fmh7zc",
  "num_comments": 169,
  "created_utc": 1726965739,
  "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/",
  "comments": [
    {
      "id": "loaktay",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 178 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaktay/",
      "created": 1726965744,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loalpe9",
      "score": 226,
      "body": "It reminds me of the foreclosure market in Chicago post 2008. We were buying houses for cheap and making a killing on them. Eventually the competition grew and the supply dwindled. Now that whole thing we were doing is gone. \n\nPE is similar. It's unsustainable in its current form. Sooner or later there will be nothing left to buy and chop up.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loalpe9/",
      "created": 1726966110,
      "depth": 0,
      "replies": [
        {
          "id": "loapo2e",
          "score": 55,
          "body": "When interest rates were at their low, there were essentially no buyout deals left to do, everything had been scraped. There's still 2-3 trillion left in dry powder.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loapo2e/",
          "created": 1726967746,
          "depth": 1,
          "replies": [
            {
              "id": "loaquai",
              "score": 91,
              "body": "I've been seeing PE funds buy up a lot of smaller local hvac, plumbing, etc, businesses. It leads me to believe that they're running out of stuff to do with the cash.",
              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaquai/",
              "created": 1726968227,
              "depth": 2,
              "replies": [
                {
                  "id": "loasffl",
                  "score": 88,
                  "body": "You have no clue how much cash they have and nothing to buy. I’m involved in PE and I have been told to look for acquisitions. I have been told every single possible company that seems to make a profit is a potential target.\n\nEach company we come up goes into a maybe bucket. When the bucket fills up they get looked at again. Then smaller buckets get combined and they see what the profit portfolio looks like as a group. Then they quietly buy thru 3rd/4th tier acquisition companies and then bring them into equity group. This keeps the ratios small and margins massive.",
                  "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loasffl/",
                  "created": 1726968896,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "loauxab",
                      "score": 46,
                      "body": "So my edible kitty detergent company is in possibly in the maybe pile ? 🥹 I am gonna be so rich .",
                      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loauxab/",
                      "created": 1726969960,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "loavfad",
                          "score": 56,
                          "body": "You are joking,  but I made my first mil by selling a tiny business to a company that was bought for $700 mil by a fund that had $14 bil under management, which later was merged into a houshold name fund that's two orders of magnitude bigger.\n\n\nThat's how it works.",
                          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loavfad/",
                          "created": 1726970172,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lodlvv8",
                              "score": 4,
                              "body": "Congrats! What kind of business if you don’t mind me asking?",
                              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodlvv8/",
                              "created": 1727020314,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "loiatjh",
                              "score": 1,
                              "body": "how tf did this happen",
                              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loiatjh/",
                              "created": 1727090141,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "loj5txa",
                                  "score": 3,
                                  "body": "Received an email saying \"Please don't disregard this email, this a real offer....\". Followed by them saying how they want to buy my business.\n\nThey had me at \"Please don't\", so naturally I trashed the email without reading the rest of it.\n\nA few days later, I fished it out of trash, looked up the company name, discovered that they are actually aggressive in acquiring smaller projects like mine and that they grow through acquisitions.\n\nSo I replied to them. Then, they asked for all my key metrics. Then they made the offer. A few phone calls to negotiated the details. Then, the due diligence process was a breeze. Then we signed. On the closing day I was sitting there refreshing my bank's page to see when the wire comes in.\n\nIt was taking forever, so I called them. They were like \"oh, yeah, I forgot to ask Mike to sign off on the wire, hold on, I think I saw him leaving for lunch let me grab him now\". Like it's nothing to them.\n\nThen an hour or so later the wire came in. And my low five digit account balance changed to seven digit balance after a refresh of a page.\n\nThen the panic set it. So I started another business literally a week later (which a few years later I sold for seven fig to a competitor of the guys that bought this one. Different niche, so non-compete didn't apply but similar business model.) Six months later I started another business, which I still have 15 years later.\n\nIt was a fun ride. But I was a regard and didn't invest the money, so I pretty much live off of my current business ventures now instead of having several mil in s&p500 and being semi-retired, if I just weren't a moron.\n\nBut back then the market was in this giant sideways mode, so I just didn't believe it would grow in the time horizon for which I planned. I was wrong on both counts. The market eventually started to grow, and time horizons of young people are way too short to be realistic.\n\nThe moral of the story is don't be a regard and invest. Think decades not years.  You'll thank yourself later. Now I'm must excuse myself to go cry a little and get back to work.",
                                  "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loj5txa/",
                                  "created": 1727102532,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "loj69ir",
                                      "score": 2,
                                      "body": "holy shit",
                                      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loj69ir/",
                                      "created": 1727102675,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "lok8z3i",
                                      "score": 1,
                                      "body": "What was the general idea / area of the business?",
                                      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lok8z3i/",
                                      "created": 1727114995,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lobnuxz",
                          "score": 11,
                          "body": "You had me at kitty",
                          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobnuxz/",
                          "created": 1726984367,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "loavqhb",
                          "score": 20,
                          "body": "You would be shocked at what they buy, why, and at what price. I can see them buying edible\nKitty litter company if they want to get into kitty litter game. They will be like, this edible kitty litter sells x amount for price y so we can get price y for regular and then up the price of the fancy stuff.",
                          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loavqhb/",
                          "created": 1726970304,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lodmnuc",
                              "score": 6,
                              "body": "I need a PowerPoint with a curve that goes up. ",
                              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodmnuc/",
                              "created": 1727020546,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "loecv1f",
                                  "score": 1,
                                  "body": "You made me laugh! So true. Any flat or downward line is concerning to them. Even if that line is cost!",
                                  "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loecv1f/",
                                  "created": 1727028340,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lof8dhy",
                                      "score": 1,
                                      "body": "Have you considered changing the scale?\n\nOr maybe using a stop light report of red/yellow/green?",
                                      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lof8dhy/",
                                      "created": 1727037883,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lobe2ef",
                      "score": 11,
                      "body": "How do they find businesses to buy? I have a small business that has gross income close to 7 figures, and mid 6 figure net if I didn't deduct equipment. I would be interested in selling because generally I'm tired of kissing client ass.",
                      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobe2ef/",
                      "created": 1726978763,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lobeuwo",
                          "score": 12,
                          "body": "[deleted]",
                          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobeuwo/",
                          "created": 1726979187,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lobfnjv",
                              "score": 9,
                              "body": "Nope. I would need to be there for the transition. My HVC staff usually contact me directly instead of the usual means of  through admin staff. But my HVC are quite important, whether they are CEOs of fortune 500 companies, sports stars, or just children of the richest people in the world.",
                              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobfnjv/",
                              "created": 1726979613,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lodmvbl",
                                  "score": 6,
                                  "body": "That’s the problem.  \n\n*YOU* are the business. ",
                                  "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodmvbl/",
                                  "created": 1727020608,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lofvcdc",
                                      "score": 1,
                                      "body": "My book of business should be worth quite a lot.",
                                      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lofvcdc/",
                                      "created": 1727045621,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lofxxax",
                                          "score": 2,
                                          "body": "Depends on whether they actively choose you for their business, or they don’t actually care whether it’s you or some other guy who shows up. \n\nIs the value of your business from your personal trust and experience, or is the value of your business in a Rolodex of suckers?",
                                          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lofxxax/",
                                          "created": 1727046537,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "loasq6w",
                      "score": 13,
                      "body": "I have a very good idea. You're describing the problem they have. Tons of cash and it's getting harder and harder to spend it.\n\nEdit: I misread this as you disagreeing with me - but realized you were providing additional context.",
                      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loasq6w/",
                      "created": 1726969022,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lob52el",
                      "score": 5,
                      "body": "Fascinating 🤔 In your opinion, how difficult would it be to create a company that would be a viable acquisition to a PE firm with as little overhead as possible? Would you say the environment is saturated enough that a brand new business with poor fundamentals could get a big buyout?",
                      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lob52el/",
                      "created": 1726974381,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "locvxk6",
                          "score": 2,
                          "body": "You need revenue",
                          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locvxk6/",
                          "created": 1727011149,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "loef1v3",
                              "score": 2,
                              "body": "And “AI” helps too. Or just marketing with “AI” on it.",
                              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loef1v3/",
                              "created": 1727029000,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lokitsn",
                                  "score": 1,
                                  "body": "This is PE not VC. PE wants real businesses that make real sales and profit.",
                                  "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lokitsn/",
                                  "created": 1727118077,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "locwnv5",
                  "score": 11,
                  "body": "They did this before and it was a colossal failure.  \n\nThey don’t understand the business and hack at it with a bunch of freshly minted MBAs\n\n  \nThen 3 years later, after all the good will is gone, key people have left and the buisness has been run into the ground, they sell back to the original owners of 10cents on the dollar",
                  "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locwnv5/",
                  "created": 1727011454,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "loeeo1b",
                  "score": 2,
                  "body": "Most of these companies are so shit as well. Try getting a call back from one then imagine paying 8 million for one.",
                  "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loeeo1b/",
                  "created": 1727028884,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lod5ykz",
          "score": 10,
          "body": "PE’s will just buy each other’s business instead when there’s nothing left",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lod5ykz/",
          "created": 1727014924,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lodmbmq",
          "score": 6,
          "body": "PE makes a killing by raising prices.  \n\nThe last few years have been really conducive to this.  \n\nPE also seems to be finding a profit in the gap between small businesses (who can’t run a business) and customers (who can’t tie their own shoes). \n\nSo buy the small businesses.   Consolidate them, institute business practices, raise prices.   Profit. \n\nPeople bitch about paying $15k for a new HVAC but what are they going to do?",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodmbmq/",
          "created": 1727020448,
          "depth": 1,
          "replies": [
            {
              "id": "loec7wk",
              "score": 5,
              "body": "Until key employees get pissed at more work and lower compensation, leave, start up a new company, take key clients and workers.  PE backed Co hires cheap, low quality employees, Profit margins suffer as even with best practices as having a numb nuts running work causes profit erosion, loses rest of existing buisness as customers aren’t being serviced.  Is forced to cut prices to compete on low dollar.",
              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loec7wk/",
              "created": 1727028148,
              "depth": 2,
              "replies": [
                {
                  "id": "lof8klh",
                  "score": 5,
                  "body": "You’re not expecting the PE to actually hold these companies, are you?",
                  "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lof8klh/",
                  "created": 1727037945,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lofieqa",
                      "score": -1,
                      "body": "No, they’ll wind up selling them back to the old owners for dimes on the dollar",
                      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lofieqa/",
                      "created": 1727041126,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lofc250",
          "score": 1,
          "body": "Yep. the taxpayer can only cover your losses for so long until there are no more tax payers",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lofc250/",
          "created": 1727039044,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loixlm8",
          "score": 2,
          "body": "There’s always something to buy.  They just sell them amongst themselves.  “PE” in itself can’t be a bubble because it’s such a broad descriptor.  It encompasses everything BUT public markets.  PE firms vary wildly on geography, strategy, sector, direct/secondaries etc.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loixlm8/",
          "created": 1727099720,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loallra",
      "score": 252,
      "body": "You're a bubble. ",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loallra/",
      "created": 1726966069,
      "depth": 0,
      "replies": [
        {
          "id": "lobgw04",
          "score": 9,
          "body": "Boom, roasted",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobgw04/",
          "created": 1726980286,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loankpx",
          "score": 21,
          "body": "Came here to say this",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loankpx/",
          "created": 1726966875,
          "depth": 1,
          "replies": [
            {
              "id": "loaqxw6",
              "score": 13,
              "body": "Man of culture",
              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaqxw6/",
              "created": 1726968270,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "loaqwu8",
          "score": 4,
          "body": "bubbly bubbly bubbly",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaqwu8/",
          "created": 1726968257,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lobal08",
          "score": 4,
          "body": "Your Mum's a bubble.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobal08/",
          "created": 1726976980,
          "depth": 1,
          "replies": [
            {
              "id": "lobbe8a",
              "score": 11,
              "body": "It’s pronounced mom you redcoat.",
              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobbe8a/",
              "created": 1726977372,
              "depth": 2,
              "replies": []
            },
            {
              "id": "locth3g",
              "score": 1,
              "body": "I'm ok with that.",
              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locth3g/",
              "created": 1727010108,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "loaukw7",
          "score": 8,
          "body": "GOT EM",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaukw7/",
          "created": 1726969814,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lobdbfv",
          "score": 1,
          "body": "https://images.app.goo.gl/DFwnEodDFhpQTJvy5",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobdbfv/",
          "created": 1726978366,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loaqky7",
      "score": 22,
      "body": "Source?",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaqky7/",
      "created": 1726968119,
      "depth": 0,
      "replies": [
        {
          "id": "lodj0mk",
          "score": 1,
          "body": "Trust me bro",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodj0mk/",
          "created": 1727019402,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lodhr2t",
          "score": 0,
          "body": "Yes wheres the paper?",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodhr2t/",
          "created": 1727018993,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loam2yu",
      "score": 70,
      "body": "So the primary difference between private and public equity is obviously that they don’t have to mark to market and therefore appear less volatile and therefore higher sharpe ratio investments than public equity, but this is more due to opaque valuation versus any real risk/reward benefits.\n\nIf you need to liquidate private equity in a hurry you are gonna take a haircut.\n\nThat said it is a very broad umbrella of which there is a universe of both good and bad investments. It’s a category not an asset class, so it can’t pop like a bubble.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loam2yu/",
      "created": 1726966267,
      "depth": 0,
      "replies": [
        {
          "id": "loaxnx2",
          "score": 21,
          "body": "\"It’s a category not an asset class, so it can’t pop like a bubble\" I wouldn't be so sure of that assumption. Despite it being a collection of different investments in different asset classes it can still pop simply because if things go wrong the banks and investors might not want to be exposed to such category of investment anymore due to its idiosyncratic risk and that alone can pop the bubble. No Bank out there wants to become dependent on the survival of another investment firm that they have no control of.\n\n  \nYou pointed out two important points that detracts from your initial assumption and that's the systemic risk with these folks:\n\n\\[1\\] Opaque valuations: no one knows their true position including the banks.\n\n\\[2\\] If things go bad, they can't liquidate without a massive haircut.\n\nAdd to that\n\n\\[3\\] If they go down, they can instigate a recession on their own due to significant Bank and 401k exposure.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaxnx2/",
          "created": 1726971123,
          "depth": 1,
          "replies": [
            {
              "id": "locy8qq",
              "score": 3,
              "body": "Most of the PE firms are in targeted areas, it too difficult to have that much expertise across multiple sectors unless you‘re huuuuge\n\n  \nPensions are a much bigger risk than 401ks - Looking right at you, Calpers\n\n  \nGuessing the OP was reading Cliffy Asness or someone at AQR",
              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locy8qq/",
              "created": 1727012095,
              "depth": 2,
              "replies": []
            },
            {
              "id": "locb91j",
              "score": 1,
              "body": "Well, the one thread through most, if not all, of PE are borrowing costs for their underlying companies (i.e., their investments). With rates still being high, the PE firms may have to spend their own $$s to support these investments.\nHigh interest rates (borrowing costs) are one reason why there's money on the sidelines. But how do we figure out how risky these companies are and how to measure their risk is the real question.",
              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locb91j/",
              "created": 1727000200,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "locvlab",
          "score": 3,
          "body": "I thought they had to do an MTM for their LPs?",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locvlab/",
          "created": 1727011009,
          "depth": 1,
          "replies": [
            {
              "id": "locyevs",
              "score": 3,
              "body": "LOL, who’s doing the MTM?  You can get firms to write an analysis to say what you want it to say",
              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locyevs/",
              "created": 1727012163,
              "depth": 2,
              "replies": [
                {
                  "id": "lodi5mz",
                  "score": 2,
                  "body": "Agreed, there is no consensus valuation, just what the company thinks they can get away with. Auditors aren’t impartial, just like credit ratings weren’t.",
                  "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodi5mz/",
                  "created": 1727019123,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "loek1xv",
                      "score": 2,
                      "body": "\"we divided sales by full time employees and then multiplied by the number of hot secretaries divided by the number of coffee pouches in the break room.\"",
                      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loek1xv/",
                      "created": 1727030520,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "loejo5i",
          "score": 1,
          "body": "I think you're confusing the word \"opaque\" with the word \"completely Goddamn f****** fake\"",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loejo5i/",
          "created": 1727030402,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loam9d1",
      "score": 12,
      "body": "More money will be printed before that happens",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loam9d1/",
      "created": 1726966339,
      "depth": 0,
      "replies": [
        {
          "id": "loap4a9",
          "score": 5,
          "body": "Yes.  The bubble always bursts when euphoria is high.  Right now, there are too many skeptics.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loap4a9/",
          "created": 1726967518,
          "depth": 1,
          "replies": [
            {
              "id": "loiazt5",
              "score": 1,
              "body": "skeptics? where? it's just a bunch of regard bulls with money they can't even read the word skeptic or know what it means",
              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loiazt5/",
              "created": 1727090232,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "loapw04",
      "score": 46,
      "body": "PE has been lying about their returns for years since the investments aren’t marked to market.  One day it’ll correct",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loapw04/",
      "created": 1726967836,
      "depth": 0,
      "replies": [
        {
          "id": "lobvzu4",
          "score": 5,
          "body": "Yeah, it's basically a ponzi scheme. As long as more investors pour in they can always continue buyouts and grow.. but they aren't magicians and in a severe recession most of their buyout targets (who are probably dogshit wrapped in catshit companies) are gonna fail and they will be holding the bag.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobvzu4/",
          "created": 1726989660,
          "depth": 1,
          "replies": [
            {
              "id": "lod3731",
              "score": 12,
              "body": "This is categorically incorrect. PEs continuously close funds and then raise new funds. When they close funds, and before raising their next, they return to all of their investors. Real cash that’s exactly as substantial as they stated. I’m sure there are exceptions given how many PEs there are. But not mega cap or mid market players.",
              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lod3731/",
              "created": 1727013893,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "loaoq7s",
      "score": 17,
      "body": "This PE trope is way over-stated. Buy with excessive debt. Tax deductibility of debt juices cash flow Fire half the workforce. Sell off all the assets. Pass it on.\n\nNot saying it doesn’t happen, but much more likely is to double the sales force and marketing spend to grow the top line. Remember PE deals are rarely held for less than 5 years. And of course someone has to buy it off you (more(?) often another PE. And they will be wise to your little ruse of firing all the staff to make the books look good.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaoq7s/",
      "created": 1726967355,
      "depth": 0,
      "replies": [
        {
          "id": "loatihu",
          "score": 1,
          "body": "Mercedes to Cerberus to government",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loatihu/",
          "created": 1726969358,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loaml1y",
      "score": 10,
      "body": "Plain bagel just did a video",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaml1y/",
      "created": 1726966469,
      "depth": 0,
      "replies": [
        {
          "id": "loap154",
          "score": 11,
          "body": "Yup literally came across this post right after watching that video lol\n\nWendover Productions and How Money Works published similar videos in the last few weeks too.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loap154/",
          "created": 1726967482,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lobfq2t",
      "score": 6,
      "body": "I work for a company that was acquired by PE company. PE is driving the company into the ground and it is obvious by some recent actions. I know there is a playbook, but the playbooks doesn’t work for all companies, which is a mistake PE make at times but it costs them real money.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobfq2t/",
      "created": 1726979650,
      "depth": 0,
      "replies": [
        {
          "id": "loce5z8",
          "score": 3,
          "body": "I worked for a acquired portco. PE came in talking about playbook this playbook that. Except for a few efficiency moves, it was a Lotta talk not much. I hope these guys are not representative of the industry.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loce5z8/",
          "created": 1727002138,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loi9qje",
          "score": 1,
          "body": "The playbook is to drive the company to the ground\n\nThere's plenty of strategies, but they're essentially capable of loaning money to buy the company. Offload the loan to the company, while stripping it of profits. \n\nIt's a dirty setup, but it can't really fail provided the current laws.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loi9qje/",
          "created": 1727089576,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loawiy9",
      "score": 9,
      "body": "From a very smart guy who was in PE when it began (behind the FT paywall though): [https://on.ft.com/3XBbc8Z](https://on.ft.com/3XBbc8Z) \n\nHis opinion (from two years ago) is that PE is very possibly the source of the next financial crisis.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loawiy9/",
      "created": 1726970639,
      "depth": 0,
      "replies": [
        {
          "id": "lodj90g",
          "score": 4,
          "body": "I agree. I haven’t really read much about it but work in financial services with friends/family working for PE firms. My observations:\n\nThe TCJA introduced 163(j) which limits tax deduction of interest and only recently (mid 2021) finalized regs. More pressure on tax reporting, although probably won’t hit until 3-5 years once IRS audits kick in. The reporting rules are complicated and were designed to ensure excessive interest deductions aren’t taken at the partner level.\n\nIn 2023 alone there was over $1 T of new capital. There simply aren’t enough good investments. Now PE is searching for anything with reliable fees, even hitting up accounting firms or any kind of service provider.\n\nWorse yet is the zombie funds, and general lack of liquidity with these fee inducing holdings for unhappy investors. This will start to get worse unless investors continue to keep buying and eventually PE owns virtually everything, with fund of funds and new funds churning out liquidity to needy investors. Thus continuing the cycle of bad valuations for the sake of making new funds.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodj90g/",
          "created": 1727019478,
          "depth": 1,
          "replies": [
            {
              "id": "lodj91p",
              "score": 3,
              "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodj91p/",
              "created": 1727019478,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "loap68e",
      "score": 4,
      "body": "Bubble butt",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loap68e/",
      "created": 1726967542,
      "depth": 0,
      "replies": [
        {
          "id": "loapvpp",
          "score": -1,
          "body": "Cigar butt bubble",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loapvpp/",
          "created": 1726967833,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loaxjrb",
      "score": 4,
      "body": "Mortgages can unwind when home buyers default. Lots of defaults means foreclosures, lots of foreclosures causes prices to drop. There is a feedback loop.  \n  \nWhat catastrophic event will cause mediocre overvalued private equity companies to fall like dominoes? There isn't one. PE is often considered lower volatility but the truth is there is just less price transparency and information available.\n\nYou can get away with more bullshit with PE because shorting the companies is harder.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaxjrb/",
      "created": 1726971075,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lobgabk",
      "score": 4,
      "body": "Private equity is worthless, end of story, period",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobgabk/",
      "created": 1726979955,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loc3abm",
      "score": 5,
      "body": "There's no trigger though. \n\n\n2008 crash happened because of the forced rate hike from the junk ARM Mortgages that got bundled up. \n\n\nARM loans make up about 5% of the current market. Even then, it's highly regulated. \n\nThe obvious thing is a recession hits, and no one can pay there 7% mortgages. Causing a small sell off of homes bought post covid. \n\n\nYou gotta ask yourself what spark would cause the unraveling of the \"financial engineering\" that he's talking about.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loc3abm/",
      "created": 1726994669,
      "depth": 0,
      "replies": [
        {
          "id": "locdtv5",
          "score": 3,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locdtv5/",
          "created": 1727001922,
          "depth": 1,
          "replies": [
            {
              "id": "loeyfmb",
              "score": 2,
              "body": "I could see that. Lots of insurance providers already left california and don't provide fire or earthquake coverage anymore.",
              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loeyfmb/",
              "created": 1727034825,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lodmjyh",
      "score": 4,
      "body": "The private equity boom was caused largely by sarbanes oxley.  The cost of being private is many millions of dollars less per year than being public so it is rational for companies up to extraordinary sizes to stay private now even with lower valuations.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodmjyh/",
      "created": 1727020516,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loaudj7",
      "score": 7,
      "body": "PE is a mess because there is no real accountability like you have with public companies. A public company has transparency, meanwhile PE well they can fuck off however they want. ",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaudj7/",
      "created": 1726969727,
      "depth": 0,
      "replies": [
        {
          "id": "lobqh0e",
          "score": 1,
          "body": "Add backs after add backs all BS.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobqh0e/",
          "created": 1726986030,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lobrq96",
          "score": 1,
          "body": "This is painfully true in the world of healthcare from what I'm hearing",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobrq96/",
          "created": 1726986853,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loauiz9",
      "score": 9,
      "body": "\"I came across this white paper from this guy.\" Can you share the link to the white paper from this guy???\n\nPrivate equities business model is, buy a business, fire people, stimulate and simulate short term growth and then sell the business. It's a more sophisticated pump and dump scheme that idiots are still buying into.  So yeah it will probably come crashing down but when, is the real question.\n\nIn essence if you see lots of profits with no value creation it means it is a Ponzi or fraud scheme like all sophisticated Ponzi schemes it is hard to predict when it will collapse. general it will crash when they can't or find it harder to expand any further. I am not sure how many trillions would that be. \n\nThey are also extremely secretive and use fairly dodgy tactics to get what they want. They pay really well though, so it attracts lot of Douch bags including bankers.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loauiz9/",
      "created": 1726969791,
      "depth": 0,
      "replies": [
        {
          "id": "locxocy",
          "score": 3,
          "body": "Yep. Link please OP. A few of us here can read.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locxocy/",
          "created": 1727011869,
          "depth": 1,
          "replies": []
        },
        {
          "id": "locceek",
          "score": 1,
          "body": "Mostly PE buying from other PE. They did however manage to unload a lot of assets on common people during the 2021 IPO boom. Just look at how those stocks performed...",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locceek/",
          "created": 1727000969,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loarm5t",
      "score": 7,
      "body": "Every fucking thing is always a bubble by friend.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loarm5t/",
      "created": 1726968551,
      "depth": 0,
      "replies": [
        {
          "id": "loc8x6y",
          "score": 0,
          "body": "Capitalism is a bubble",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loc8x6y/",
          "created": 1726998596,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loauxai",
      "score": 3,
      "body": "what white paper? where is it? and what guy? do they have a name, a company? \n\nother than a fucking bullshit trust me bro here , you have given zero evidence",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loauxai/",
      "created": 1726969960,
      "depth": 0,
      "replies": [
        {
          "id": "lodkjdv",
          "score": 2,
          "body": "If bro says he has seen The white paper, I trust bro has seen the white paper. Albeit, I also believe gay turtles exist , so there is that",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodkjdv/",
          "created": 1727019890,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lob0hia",
      "score": 3,
      "body": "It’s worth noting that financial reporting for companies with a significant PE sponsor can be as rigorous (in some ways even more so) than it is for companies in public markets.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lob0hia/",
      "created": 1726972344,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loarf7s",
      "score": 14,
      "body": "I work for a PE owned mature tech company. \n\nAll of the assumptions people have about it are true, albeit sensationalised. I work with a lot' of smart commercially minded people.\n\nPE people are fantastic at creating efficiencies within businesses. Less so growing them.\n\nWould I sell my own company to PE? Unlikely, I wouldn't want my staff to ensure the worst of PE practices. \n\nAt the end of the day, it's up to governments to regulate PE or company owners to be more selective about who they exit to.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loarf7s/",
      "created": 1726968470,
      "depth": 0,
      "replies": [
        {
          "id": "loaxuzz",
          "score": 16,
          "body": "\"It's up to the government to regulate the people providing all of their campaign funding...\"",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaxuzz/",
          "created": 1726971206,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loamn9o",
      "score": 2,
      "body": "Yea Apollo is a bubble for sure. Maybe Hindenburg can release a short report on it.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loamn9o/",
      "created": 1726966495,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loaq2bw",
      "score": 2,
      "body": "Underlying assets are physical. Supply is finite and demand increases with population. You can always invest in raytheon to hedge. I wouldnt worry until the nukes start dropping.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaq2bw/",
      "created": 1726967907,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lob7xvf",
      "score": 2,
      "body": "You didn’t say what the white paper was though?",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lob7xvf/",
      "created": 1726975708,
      "depth": 0,
      "replies": [
        {
          "id": "lodkpri",
          "score": 1,
          "body": "ah with the questions .. bro says he saw white paper written by a guy, what else do you need to know",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodkpri/",
          "created": 1727019949,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loco05f",
      "score": 2,
      "body": "It’s only a bubble if it pops",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loco05f/",
      "created": 1727007594,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lod77wp",
      "score": 2,
      "body": "Buffet is PE lol",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lod77wp/",
      "created": 1727015381,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lobf1y1",
      "score": 2,
      "body": "My older brother worked for capstone a mid size pe fund  and these guys were leveraged to the tits and literally borrowed money to move their office they bought my dads business and decreased revenue by 6x they were throwing money at things that didn’t need it and didn’t really understand the business they were very pretentious and just slowly killed the business my brother after looking through their portfolio working there said most of the companies the bought go tits up but occasionally they get a big winner but it’s a fragile industry lots of money being thrown around but if rates get raised again these guys are so addicted to borrowing money it will slow their growth",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobf1y1/",
      "created": 1726979291,
      "depth": 0,
      "replies": [
        {
          "id": "lodaavy",
          "score": 7,
          "body": "Please learn to use punctuation.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodaavy/",
          "created": 1727016478,
          "depth": 1,
          "replies": [
            {
              "id": "lodhj69",
              "score": 2,
              "body": "Nah bro the amount of time I save not using punctuation is enough to bust out 3 hand jobs extra every day behind the Wendy’s dumpster",
              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodhj69/",
              "created": 1727018921,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "loia2jq",
          "score": 1,
          "body": "They don't care about loans, as they can transfer loans to companies about to go bankrupt.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loia2jq/",
          "created": 1727089751,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loamwve",
      "score": 1,
      "body": "It's starting to get a bad name, in a way that could snowball. Regardless of the actual fundamentals, people might not want to touch private equity because it's private equity and it's Bad.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loamwve/",
      "created": 1726966603,
      "depth": 0,
      "replies": [
        {
          "id": "loaz9hm",
          "score": 2,
          "body": "Totally agree with that. They are not too careful about their reputation, and it is taking a big hit. More people a paying attention and soon they could see a Boycott or some sort of divestment from the pension funds and others.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaz9hm/",
          "created": 1726971810,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loas1de",
      "score": 1,
      "body": "We all wish…",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loas1de/",
      "created": 1726968729,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loase39",
      "score": 1,
      "body": "PE firms have different time horizons when it comes to fund cycles, they typically follow fundraising, investing, and exit. Some of it is firm mandate, client driven, business model (think agriculture vs software), etc. If there is a bubble in private equity, it's not because of the holding period. It has to do with the fact that many firms are sitting on dry powder and have to deploy cash quickly to generate returns. The underlying problem with has to do with valuation inflation. The offset to this is if a firm is truly creating operational value add to the business and focused on EBITDA expansion rather than arbitrage in valuation multiples, then it works out. On the flip side, it can create a bubble, essentially it becomes \"flipping\" when they focus on multiple arbitrage, which has happened more recently due to the availability of cash.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loase39/",
      "created": 1726968879,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loat6eh",
      "score": 1,
      "body": "Current portfolio cos bought with cheap debt. Exits will see multiple contraction.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loat6eh/",
      "created": 1726969214,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loawi5u",
      "score": 1,
      "body": "![img](emote|t5_2th52|4259)",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loawi5u/",
      "created": 1726970630,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loawilk",
      "score": 1,
      "body": "How long can the bullish times last? \n\n\nThe market can remain irrational longer than you can............remain behind the Wendy's dumpster.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loawilk/",
      "created": 1726970635,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lob1etw",
      "score": 1,
      "body": "Yea they have bubbles in their head instead of brain matter",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lob1etw/",
      "created": 1726972750,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lob208p",
      "score": 1,
      "body": "I agree with the concerns. Most of these investments are used to play accounting games. Avoid investing in entities that invest in the space.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lob208p/",
      "created": 1726973011,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lob4ck4",
      "score": 1,
      "body": "You present a bit of a false dilemma. What if PE can be full of greedy short term bastards that overstate returns, portfolio values and leverage, and also they can keep doing it without any bubble bursting. Maybe this is just the way PE works.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lob4ck4/",
      "created": 1726974053,
      "depth": 0,
      "replies": [
        {
          "id": "lobq1ef",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobq1ef/",
          "created": 1726985747,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lob9sai",
      "score": 1,
      "body": "Can you send a link to the paper? Interesting take",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lob9sai/",
      "created": 1726976590,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lobfmtp",
      "score": 1,
      "body": "Nope, private equity is private equity.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobfmtp/",
      "created": 1726979602,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lobh2uz",
      "score": 1,
      "body": "A lot of small biz owner boomers looking at retirement - pe is the go to sell route, and lots of businesses are small and localized that can get gobbled up and put together for growth. Lots of big pe liabilities piling up from too much leverage. That being said, for pe, 10 deals, 9 go south, 1 10x+ and they’re positive. Not to mention, fees, fte payments and all the other bs they take during their holds. Keep an eye on it but unless the economy really tanks and their portcos fail enmass, I don’t see them liquidating anytime soon now that lots of investment funds like pensions can invest in pe. After selling a biz to pe and running it for a few years, I’m looking forward to a day that I can scoop something up from them on the cheap!",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobh2uz/",
      "created": 1726980391,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lobsszg",
      "score": 1,
      "body": "Private equity is shit. The only people making money are the ones catching the fees from your investment. For the investor therefore is huge risk, huge fees, no liquidity and no transparency. The only way to invest smartly in PE is to buy BDC, asset managers and holding company",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobsszg/",
      "created": 1726987556,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lobvr4j",
      "score": 1,
      "body": "Everyone and their mother is sitting on cash to deploy. Take that as a sign of where inflation stands in reality",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobvr4j/",
      "created": 1726989494,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loc0gsd",
      "score": 1,
      "body": "I agree with u, people invest in PE mostly for short term profit.\nImo the market is overvalued. We also need to remember that for every seller, there is a buyer. So there may not be as much buyers for houses if the prices keep rising",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loc0gsd/",
      "created": 1726992722,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loc3eb9",
      "score": 1,
      "body": "Pe is not a bubble. Pe is not just about buying companies, making them more efficient, merging them, etc. Sometimes it’s buying companies and destroying them into pieces that are sold off.\n\nYes there  are a lot of pe firms now a days. And you will probably see a smack down on vc and pe as because everyone and their mom either has a firm or they are part of a firm.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loc3eb9/",
      "created": 1726994745,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loca5y9",
      "score": 1,
      "body": "Source?",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loca5y9/",
      "created": 1726999457,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lochc8s",
      "score": 1,
      "body": "It is a bubble but it will ‘pop’ in a very different way to the GFC. Won’t be as rapid but more gradual .. how to gauge how or on what exactly the impact will be imo. \n\nCause these ‘dealmakers’ will try and delay the inevitable as much as possible through all the financial engineering in the world. \n\nThere will also be a consolidation of these firms amongst the biggest, which has already started.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lochc8s/",
      "created": 1727004063,
      "depth": 0,
      "replies": []
    },
    {
      "id": "locjay4",
      "score": 1,
      "body": "I'm sorry \"this white paper by this guy\"? Is there a link I'm not seeing somewhere?",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locjay4/",
      "created": 1727005177,
      "depth": 0,
      "replies": []
    },
    {
      "id": "locmoba",
      "score": 1,
      "body": "Let’s hope so. Fuck all those greedy shits",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locmoba/",
      "created": 1727006937,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loco7fh",
      "score": 1,
      "body": "It's rampantly buying up and destroying the trades. PE comes in and turns everyone into salesmen with barley any technical training. The residential side of every trade has become a bloated minefield of sales companies.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loco7fh/",
      "created": 1727007693,
      "depth": 0,
      "replies": []
    },
    {
      "id": "locoeum",
      "score": 1,
      "body": "Private equity is horrible for everyone except private equity",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locoeum/",
      "created": 1727007793,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loctzo7",
      "score": 1,
      "body": "Yeah but they have so much extra cash on hand",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loctzo7/",
      "created": 1727010331,
      "depth": 0,
      "replies": []
    },
    {
      "id": "locu5nk",
      "score": 1,
      "body": "White paper source? My two scents is we most certainly are in a bubble. The fact that there is only one- to two mark to market events (if any, mostly in RE) a year and even then the methodology varies, means you won’t know what the value of your holding is worth until you shop around for a buyer. \n\nYou are getting still crazy high valuations for new deals but now the investors are a bit more mindful in what they invest when rates are higher. The likes of moonshot will rarely materialise for retail investors. By the time we get access to it, all value has been extracted. There is a real opportunity for tokenised PE.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locu5nk/",
      "created": 1727010403,
      "depth": 0,
      "replies": []
    },
    {
      "id": "locuq4h",
      "score": 1,
      "body": "I work in trading professionally, and everyday my positions are marked to market and scrutinised by market risk, heads of desks and c-suites and these are positions that may have a notional value of like 50-100m.\n\nHow PE can get away with making up their own marks on illiquid positions in excess of billions of dollars and then handing them to investors with quarterly updates and then taking their 2/20 on top should be nothing short of illegal.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locuq4h/",
      "created": 1727010646,
      "depth": 0,
      "replies": []
    },
    {
      "id": "locwfvt",
      "score": 1,
      "body": "# Private Equity",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/locwfvt/",
      "created": 1727011360,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lod4z7m",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lod4z7m/",
      "created": 1727014562,
      "depth": 0,
      "replies": [
        {
          "id": "lod4z8r",
          "score": 1,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lod4z8r/",
          "created": 1727014563,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lod53p2",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lod53p2/",
      "created": 1727014608,
      "depth": 0,
      "replies": [
        {
          "id": "lod543l",
          "score": 1,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lod543l/",
          "created": 1727014612,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lod573o",
      "score": 1,
      "body": "\n### Why PE & VC exist:\n\nOver the past 50 years, huge amounts of money have piled up in the hands of big institutions like pension funds, sovereign wealth funds, and high-net-worth individuals (HNWI). This money has to go somewhere to grow. However, **public stock markets** just aren't big enough to handle all this cash. If too much money floods the public market, prices would go crazy due to simple supply and demand (more money chasing the same number of stocks). It's like if everyone in a huge city wanted to buy just one house—prices would skyrocket.\n\nSo, these big money players needed an alternative. That's where **private markets** come in, specifically **Private Equity (PE)** and **Venture Capital (VC)**:\n\n- **VC** is for startups or early-stage companies. They fund high-risk, high-reward businesses hoping to strike it big.\n\n- **PE** buys out more mature companies, often aiming to restructure and make them more profitable.\n\n### Why the PE & VC industry exploded:\n\nPE and VC offer access to these private markets, and institutions were eager to jump in because public markets alone couldn't absorb all their money. The PE industry, in particular, has ballooned from managing $500 billion to a whopping $8 trillion in 20 years. This explosion is simply because ***PE firms*** managed to convince big institutions to pour in cash to them by selling them the promise of high returns.\n\n### The problem\n\nIn **VC**, things are looking rough. A lot of opportunists jumped into VC, promising big returns but actually delivering poor or even negative results. However, **VC firms** still made money off management fees, while investors were left holding the bag with bad returns. Even if **PE** is facing the same destiny, the **bubble burst** is simply people getting bad returns.\n### What’s the \"unwinding\"?\n\nI think you have misunderstood the \"Unwinding\". It isn't a bubble burst, it just means that eventually, investors and the public will catch on to the fact that PE/VC firms may not have been as good at delivering returns as promised. The issue is that many of these firms have found ways to **make themselves rich** through **management fees** (taking a cut from the funds they manage) and **carried interest** (taking a chunk of profits, but not suffering equally from losses). The risk is heavily one-sided—investors take most of it, while the fund managers make money regardless of the results.\n\n\nAnd remember - who have funds the investors from the beginning? It's common people like you and me – either through pensions funds, taxes, HNWI (who in their turn often have made money from being exited by PE). So it's ordinary people who are left holding the bag when this is all said and done.\nTLDR/ELI5, The world has created a lot of money supple & wealth, and we need places to invest it, but there isn't enough public stocks for it. People in Private Equity (PE) and Venture Capital (VC) have made money on the shared wealth we have created in society regardless of the fund returns and people are finally taking about it.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lod573o/",
      "created": 1727014642,
      "depth": 0,
      "replies": [
        {
          "id": "lod5751",
          "score": 1,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lod5751/",
          "created": 1727014643,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lod8jyn",
      "score": 1,
      "body": "Buffett literally made his money doing middle market PE before Berkshire.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lod8jyn/",
      "created": 1727015860,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lodpwch",
      "score": 1,
      "body": "Also, did you know *Kim Kardashian* has a PE Fund?! Yes, she does! She is a fucking PE owner, and this can't go tits up!!!",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodpwch/",
      "created": 1727021557,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lodqzcw",
      "score": 1,
      "body": "Yes, private equity (PE) is a bubble. Rehypothecation is a word you should be familiar with--PE firms reuse collateral across multiple loans, sometimes up to 140% of their original value, expanding leverage without increasing underlying assets. When liquidity tightens or asset values drop, multiple creditors claim the same collateral, leading to forced liquidations. The industry’s size-growing from $500 billion to $8 trillion in 20 years-has been driven by financial engineering as you said, debt-financed buyouts (LBOs), and structured financial products akin to mortgage-backed securities (MBS), such as SLABS (Student Loan Asset Backed Securities), CLOs (Collateralized Loan Obligations), and CMBS (Commercial MBS), which all contributed to the 2008 crisis. With shadow banking providing unregulated capital, and central banks managing liquidity in complex ways (50bps cut at ATHs…?), the bubble is increasingly fragile and at risk of unraveling. Liquidity injections will keep it from collapsing for a while, but the FED will have to get increasingly more intrusive to keep assets elevated, such as using Japan’s creation QQE (Qualitative-Quantitative Easing). It’s inevitable that it crashes, but if the FED pull off a soft landing is yet to be seen",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lodqzcw/",
      "created": 1727021892,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loejirx",
      "score": 1,
      "body": "I have been an employee at two companies that were owned and operated by the founders. In both cases when they sold to PE, the entire f****** situation went to absolute dog s***. Layoffs, cost cuts, flatlining a budget but expecting double-digit growth. I'm convinced that people who are in PE are either literally pure f****** evil, or they are the stupidest human beings in the entire universe.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loejirx/",
      "created": 1727030356,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loemw0y",
      "score": 1,
      "body": "I really like this piece because since I first read about PE, I just hated it. It is solely based on greed.\n\nAlso I want to ask couple of questions:\n- What would be the impact of bubble and post-bubble events on average/working class people?\n- What is stopping non-PE firms from using (some of) the practices of PE firms? This, I believe, is happening and is one of the reasons for greedflation.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loemw0y/",
      "created": 1727031371,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loerkvb",
      "score": 1,
      "body": "Eventually the ouroboros eats its own head.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loerkvb/",
      "created": 1727032771,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loex7nw",
      "score": 1,
      "body": "Everything’s a bubble given enough time",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loex7nw/",
      "created": 1727034460,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lofbr0f",
      "score": 1,
      "body": "If you have to ask, yes.\n\n\nIt's driving all the unsustainable practices and is funnelling money up to the very top, and is why business and the middle class is slowly collapsing. People who do no real work getting massively wealthy off of everyone. I do not mean \"hey look at this capitalist pig running a big company\" because even those people work. These are people who leverage money that isn't theirs, drain out companies with actual value of their liquid assets, and leave the husk to the taxpayer to deal with. The loan they take out is paid by everyone who pays taxes.\n\n\nThe question is, what happens when the people who pay taxes can no longer pay taxes to pay for your loan? Money gets printed to cover it, and inflation keeps going up. the economy tanks because you needed more numbers in a bank account.\n\n\nPrivate equity is quite literally a parasite on a capitalist system. No work or actual risk is put in. These firms are written loans and run off with real cash. They buy up commodities and treat them as stores of value, like housing and farm land, and sit on them to drive prices up.\n\n\nIt's a losing game that causes everything to collapse.\n\n\nThe bubble popping means everyone is going to be facing unemployment and homelessness. The only way it's popping early is if leveraged buyouts and other PE tricks get banned. Otherwise we're headed for a nosedive.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lofbr0f/",
      "created": 1727038942,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lofhcmk",
      "score": 1,
      "body": "There’s some truth in these comments but not completely on target. PE transactions are priced on multiples of EBITDA, with transactions today around 12x. Compare this to public equities that can trade at 50x earnings with no one even batting an eye. People have made the case that PE is more rational than public equity, and I think there’s some truth there. \n\nNext, realizations in PE have historically happened at around a 20% premium to carrying value. Now, are they smoothing returns? Yes. Is it a complete show like people are making it out to be? Nope. \n\nLate stage growth equity is where the real mess is right now. But that’s not a contagion risk",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lofhcmk/",
      "created": 1727040783,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lofwf7e",
      "score": 1,
      "body": "What raises my spidey senses is that there is little oversight. So if they make a slew of bad bets, then we're likely to have liquidity in the market dry up. What bets are they making and how do we invert?",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lofwf7e/",
      "created": 1727046003,
      "depth": 0,
      "replies": []
    },
    {
      "id": "log1jyu",
      "score": 1,
      "body": "Companies aren't going public as fast so growth equity is likely to keep growing.  \n\nWhether current valuations are reasonable - they seem a little out of whack to me. \n\nWhether the 2/20 (or more like 1.6/20) fee structure with commitment/investment/return model should be as big as it is - that's another question.  ",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/log1jyu/",
      "created": 1727047826,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loggltk",
      "score": 1,
      "body": "Very shallow analysis hardly convincing. \n\nPE does have an opaque structure which makes them prone to fraud. Add to that how big they have become, their collapse could trigger a financial crisis, but you need a more thorough analysis that would show some huge drop in equity due to businesses being overvalued systematically.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loggltk/",
      "created": 1727053529,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loaos55",
      "score": 1,
      "body": "Even if it isn't a bubble, the business acquired by private equity probably would turn bad. So rather than the private equity you should care more about their impact on overall business. You should research Red Lobster and how private equity destroyed it, and they're doing the same in a lot of sectors. So even if there's no bubble in private equity, you should still be worried because the products and services you get would get worse. And the longer the  schemes that private equity runs could work, the worse it would be because it proves that it's profitable for them and would keep destroying quality.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaos55/",
      "created": 1726967378,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loalpz3",
      "score": 1,
      "body": "I find deeper delving very interesting, personally. But can’t speak so broadly. (They get in and hopefully get out, business be damned, as far as I can tell.)",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loalpz3/",
      "created": 1726966116,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loamk5x",
      "score": 1,
      "body": "The reason PE has gotten so big is because technology has made investing in PE more accessible and more liquid. \n\nAlso the demand for PE has rose since it’s good for diversifying away from public equity. The actual demand for PE is huge compared to the actual market size so the valuations in the PE market will naturally be high and continue to grow higher",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loamk5x/",
      "created": 1726966459,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loao7fj",
      "score": 1,
      "body": "In healthcare I think so, but income is limited by insurance reimbursement. I’m not sure that’s the case in industries that can pass cost to the consumer",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loao7fj/",
      "created": 1726967138,
      "depth": 0,
      "replies": [
        {
          "id": "loapcbh",
          "score": 8,
          "body": "Private equity in healthcare is definitely looking like a ticking time bomb. Doctors hate it. Patients hate it. At some point one too many patients are gonna die and it’s all gonna come crumbling down.\n\nJust scroll through any medical subreddit, you’ll see what I mean.",
          "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loapcbh/",
          "created": 1726967612,
          "depth": 1,
          "replies": [
            {
              "id": "loaqad7",
              "score": 8,
              "body": "I’m one of those drs that hates it (not working for private equity though) the patients don’t need to die for it to crumble. They try to dominate the market by throwing money around and eventually they just can’t afford it. Since reimbursement is fixed the only thing they can do is pressure for more patients per hr but we have hit that limit. A Dr with all the support in the world can’t do much more that the 10 min appointments that are being pushed",
              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loaqad7/",
              "created": 1726967999,
              "depth": 2,
              "replies": []
            },
            {
              "id": "loapyld",
              "score": 1,
              "body": "It’s not a matter of if but when. Which makes me wonder how can retail investors short private equity funds that are involved in healthcare?",
              "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loapyld/",
              "created": 1726967865,
              "depth": 2,
              "replies": [
                {
                  "id": "lobf6e6",
                  "score": 1,
                  "body": "Ohhhh. Interesting question.",
                  "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/lobf6e6/",
                  "created": 1726979359,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "loam9am",
      "score": 0,
      "body": "Private Equity is pretty much for tax right offs",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loam9am/",
      "created": 1726966338,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loazdtl",
      "score": 0,
      "body": "Bot even posting a link to the paper.. hm, looks a lot like opinion shaping.",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loazdtl/",
      "created": 1726971862,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loawzz7",
      "score": -1,
      "body": "You are ....need to ...\n\n\nMental health is a serious problem.\n\n\nPlease go seek help",
      "permalink": "/r/wallstreetbets/comments/1fmh7zc/is_private_equity_a_bubble/loawzz7/",
      "created": 1726970841,
      "depth": 0,
      "replies": []
    }
  ]
}