{
  "title": "Are the institutional traders (smart money) also the market makers?",
  "score": 60,
  "selftext": "When a stock is transacted I believe it goes like this right?\n\nBuyer <---> Market Maker <---> Seller\n\nThe Market Maker sells from their inventory to the buyer. Then the Market Maker will buy from the Seller.\n\nWhen institutional traders buy and sell stocks, are they the Market Makers or are they the buy (or seller) who also has to go through a Market Maker just like a retail trader does?",
  "link_flair_text": null,
  "id": "1fmihh6",
  "num_comments": 34,
  "created_utc": 1726970058,
  "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/",
  "comments": [
    {
      "id": "locobkd",
      "score": 38,
      "body": "No. Absolutely not. They're in offices separated by a central hallway.",
      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/locobkd/",
      "created": 1727007750,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lob00iy",
      "score": 30,
      "body": "No.\n\n\nThey may belong to the same overall organization in some situations, but they have very different goals and methods of execution.",
      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lob00iy/",
      "created": 1726972139,
      "depth": 0,
      "replies": [
        {
          "id": "lob3l33",
          "score": 7,
          "body": ">They may belong to the same overall organization in some situations\n\nThank you for pointing that out",
          "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lob3l33/",
          "created": 1726973707,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lob21y9",
      "score": 29,
      "body": "Supposed to be separate but as you could imagine not always the case",
      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lob21y9/",
      "created": 1726973031,
      "depth": 0,
      "replies": [
        {
          "id": "lob88r0",
          "score": 16,
          "body": "Citadel?",
          "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lob88r0/",
          "created": 1726975851,
          "depth": 1,
          "replies": [
            {
              "id": "locmsda",
              "score": 10,
              "body": "Yup",
              "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/locmsda/",
              "created": 1727006996,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "loc9l0k",
          "score": 4,
          "body": "Its a 100% rigged game we all know it.",
          "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/loc9l0k/",
          "created": 1726999052,
          "depth": 1,
          "replies": [
            {
              "id": "loczwbi",
              "score": 10,
              "body": "It's not \"rigged\".\n\nThe worst thing MM's do is they scalp and front run retail, passive buying, ESPP's etc. a decent amount.\n\nOccasionally they take a directional bet as well.\n\nThere's really no widespread \"manipulation\" that many think.  A buy and hold investor is barely impacted by MM's.",
              "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/loczwbi/",
              "created": 1727012747,
              "depth": 2,
              "replies": [
                {
                  "id": "lohg4vf",
                  "score": 9,
                  "body": "high frequency trading algos are definitely used by MMs push prices in any direction on tickers with low volume. There's a reason why they pay such high prices for those systems/developers, and have the machines directly connected to the exchange, with the fastest possible execution times. \n\nThis only started after 2005 btw, so it hasn't always been that easy. Also the world of high finance is definitely not based on fundamentals and 'fair play' imo.",
                  "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lohg4vf/",
                  "created": 1727069728,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "loieujr",
                      "score": 4,
                      "body": "Correct, it's not based on fundamentals, it's based on liquidity.\n\nHowever, fundamentals still determine relative valuations between assets.",
                      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/loieujr/",
                      "created": 1727092118,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "loiezoq",
                      "score": 1,
                      "body": ">high frequency trading algos are definitely used by MMs push prices in any direction on tickers\n\nThere's really zero evidence of this besides pinning towards expiration.  On a widespread scale this simply doesn't happen.",
                      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/loiezoq/",
                      "created": 1727092187,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lojy7dm",
                          "score": 4,
                          "body": "90% of trades on the market are done with HFTs, they are spamming at all times, in bursts of 100 shares. It is not always \"just to maintain best price discovery\". Goldman Sachs has been known to spoof orders forever, it just doesn't 'matter' that much because the gravy train keeps rolling. There were so many Chinese tickers like HKD that showed that bots can push prices in one direction for a long period of time, without any fundamentals behind it. Retail/pumpers were not the only ones to walk away from that with big gains. I really don't trust MMs to be ethical, because why would they be? If Russian and Chinese markets are known to be untrustworthy, what makes you think the US markets are pure?",
                          "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lojy7dm/",
                          "created": 1727111669,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lojzrgr",
                              "score": 1,
                              "body": "Yes MMs are basically HFT firms scalping and front running.\n\nBut there is scant evidence they simply move the price for the sake of moving the price.  They don't need to do that.\n\nThey make so much god damn money being mostly neutral.",
                              "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lojzrgr/",
                              "created": 1727112146,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lopezbo",
                  "score": 1,
                  "body": "I always hate these stupid ass comments. If institutions or MMs could perfectly manipulate stocks \\*without slippage\\*, wouldn't it be easy to imagine that stocks would be a hell of a lot more volatile?\n\nYes, MMs with volume can push the price of a stock down temporarily with large sells/short sells, or push it up temporarily with large buys, but if the market disagrees with their sentiment, then they will either lose money or lose opportunity doing so.\n\nE.g. if MMs think they can just sell a ton of calls and then push the price down by short selling a huge volume, they might succeed, but if the market suddenly decides that the underlying stock is worth a hell of a lot more, and they push it up, the MMs cannot do shit without increasing risk further.\n\nI mean really. If markets were so heavily rigged, why did they let $GME get up to 400+ during the jan 2021 squeeze to begin with?\n\nIt's such a moronic take",
                  "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lopezbo/",
                  "created": 1727192413,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lopf8m3",
                      "score": 2,
                      "body": ">why did they let $GME get up to 400+ during the jan 2021 squeeze to begin with?\n\nDon't you understand, when stocks get completely detached from reality it is efficient market not rigged. /s",
                      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lopf8m3/",
                      "created": 1727192493,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "loo591z",
                  "score": 0,
                  "body": "This is just a bunch of gme cultists stroking eachother, dont bother.",
                  "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/loo591z/",
                  "created": 1727174887,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "loe3ocd",
                  "score": -3,
                  "body": "You can looks at GME & AMC which makes it pretty clear how market makers control the stock price until they can't that is but then just shut off the buy button that is straight up manipulation by market makers. Holding long term no really doesn't matter but for those playing the trading game your odds stacked up against you.",
                  "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/loe3ocd/",
                  "created": 1727025687,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lofihpe",
                      "score": 5,
                      "body": "Who made them meme stocks?",
                      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lofihpe/",
                      "created": 1727041152,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "logcrx2",
                      "score": 4,
                      "body": "Keep your conspiracy theories to your conspiracy subreddits. ",
                      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/logcrx2/",
                      "created": 1727052066,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lojvz3r",
                      "score": 0,
                      "body": "You have no idea what market makers actually do.",
                      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lojvz3r/",
                      "created": 1727110967,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lopfzd8",
                      "score": 0,
                      "body": "Lol?\n\nif $GME was manipulated, why did they let it go into the 400s (pre-split) in jan 2021 at all?\n\nthey didn't \"turn off the buy button\", you need to look into what the DTCC is and how stock trades are actually settled.",
                      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lopfzd8/",
                      "created": 1727192725,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lof1kst",
      "score": 2,
      "body": "Typically the market makers are there for large purchases to not cause a significant price swing in the stock. They provide liquidity and a means to where a large buyer or large seller can move money around and obtain a position or lower their position. The market maker solves a liquidity issue for a fee.",
      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lof1kst/",
      "created": 1727035778,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loovd0z",
      "score": 2,
      "body": "Depending on the situation they could be wearing any and or all of those hats at the same time. “LEGALLY” there is separation/barriers in the institution, at least when the SEC asks. Some are better than others ",
      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/loovd0z/",
      "created": 1727186015,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lorelqv",
      "score": 2,
      "body": "The market maker basically sells to the buyer from what they have, and then turns around and buys from the seller. Institutional traders, just like regular retail traders, usually deal with market makers when they trade stocks. But since they trade in much bigger amounts, they sometimes use other methods, like dark pools or DMA, to skip market makers. That said, they still end up working with market makers most of the time.",
      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lorelqv/",
      "created": 1727214943,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lod2s2s",
      "score": 3,
      "body": "Yes, institutional traders and market makers can operate under the same entity, but there is a strict regulatory framework enforced by the SEC that mandates an ethical separation between their operations. This is primarily to avoid conflicts of interest.\n\nThe consolidation of the financial services industry plays a large role in this overlap. In the current environment, where economies of scale and risk diversification favor larger institutions, firms are under continuous pressure to merge and consolidate. The larger a firm's assets under management (AUM) or total value of assets under management (TVAUM), the more competitive they can be across different business lines. This is because larger firms can leverage their capital reserves to offer more favorable pricing, better liquidity, and lower transaction costs for their clients.\n\nThe combination of increased AUM and access to capital instruments—whether in cash equivalents, credit, or warehoused financial instruments—gives large institutions significant advantages in investing activities and market making. This drives firms toward a “bigger fish” strategy, where larger players are better equipped to handle high-volume transactions and market demand, further reinforcing consolidation in the financial sector.\n\nMarket makers provide the liquidity needed in today's markets, particularly for highly leveraged investors who need access to large volumes of stock or bonds. Smaller fintech firms or brokerages cannot always match this volume or the speed required by institutional traders, especially when dealing with synthetic multiples of underlying assets, such as derivatives or leveraged products.\n\nWithout a market maker’s support, smaller firms would face slippage—the risk that executing a large trade would move the market price unfavorably, eroding profitability. To address this, market makers step in to provide float on demand—the necessary liquidity to match both sides of a trade and stabilize the market for these large transactions.\n\nEven when no-trade fee policies are advertised, fintech brokerages still generate revenue through payment for order flow (PFOF)—a practice where order data is sold to market makers. This allows market makers to anticipate order flows and adjust their spreads accordingly. While retail traders may not pay an explicit fee for trades, they are indirectly paying through wider spreads, which represents the market order premium.\n\nLarger institutions and market makers manage this by setting spread premiums—the difference between the bid and ask prices—which account for their risks and the costs associated with providing liquidity. As a result, retail traders often experience slightly less favorable prices than what is available to institutional investors.\n\nIn essence, while institutional traders and market makers may operate under the same umbrella (e.g., large financial conglomerates), their operations are ethically separated by law. The size of the institution plays a key role in determining liquidity and pricing advantages, and fintech firms often rely on market makers to fulfill large orders at competitive prices.\n\nUltimately, market makers enable retail traders and smaller firms to access liquidity that would otherwise be unavailable, albeit at a premium embedded in the market spread.",
      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lod2s2s/",
      "created": 1727013737,
      "depth": 0,
      "replies": []
    },
    {
      "id": "locya0e",
      "score": 2,
      "body": "Look at me <---- I'm the market maker now.",
      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/locya0e/",
      "created": 1727012109,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loaxxh0",
      "score": 1,
      "body": "I think market makers and institutional investors are different.",
      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/loaxxh0/",
      "created": 1726971235,
      "depth": 0,
      "replies": []
    },
    {
      "id": "locuc0a",
      "score": 1,
      "body": "Market makers are just market makers, their job is to be neutral and provide liquidity to both sides. Banks, funds, trading firms are the big whales but their objectives could be different from each other.",
      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/locuc0a/",
      "created": 1727010479,
      "depth": 0,
      "replies": [
        {
          "id": "lod17fs",
          "score": 1,
          "body": "In theory, yes.  But I would say their job is more to scalp and front run far more than provide liquidity.\n\nSome research such as this MIT paper seems to indicate MM's are net liquidity-takers more than providers:\n\nhttps://web.mit.edu/finlunch/Fall03/AlbertWang.pdf\n\nBut I agree they do not \"manipulate\" markets.  Despite occasionally making a directional bet, they generally seek to be neutral and make consistent money.",
          "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lod17fs/",
          "created": 1727013171,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lob2cwx",
      "score": 0,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lob2cwx/",
      "created": 1726973164,
      "depth": 0,
      "replies": [
        {
          "id": "locl8k6",
          "score": 1,
          "body": "No, they don't. \n\nInstitutional and retail desks go through a broker on the floor.\n\nMarket makers make markets on orders the brokers bring to Market.\n\nSource: I was a market maker on the floor for many years (not securities) before they closed.",
          "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/locl8k6/",
          "created": 1727006205,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lob4ag9",
          "score": 1,
          "body": ">but can negotiate floor trades\n\nDoes a floor trade mean that the institutional trader can bypass the MMs?\n\nIf so, who takes the other side of the trade? Retail traders or other institutional traders?",
          "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/lob4ag9/",
          "created": 1726974026,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loefy65",
      "score": 0,
      "body": "The Pimps buy the Dips",
      "permalink": "/r/stocks/comments/1fmihh6/are_the_institutional_traders_smart_money_also/loefy65/",
      "created": 1727029262,
      "depth": 0,
      "replies": []
    }
  ]
}