{
  "title": "Selling Amazon - Jassy is a failure grasping at a scapegoat",
  "score": 216,
  "selftext": "I'm overweight Amazon but considering selling at least at least half. I don't see innovation and growth coming after Jassy resorted to old school command and control management and has angered the top talent. Contrast Nvidia relies on leadership rather than power and has been able to continue to innovate with flexible work policies. I'm more optimistic moving more money to a company with motivated employees and a leader with a vision for innovation.\n\nJassy is a failure grasping at a scapegoat. I hope the board sees this soon and replaces him for the sake of shareholders.\n\n  \nUpdate: My investment premise is:\n\n1. Work has evolved. CEOs who spend resources such as time and energy attempting to run time backwards will eventually hurt profits. \n\n2. Resorting to authoritarian type leadership is almost always disguising something rotting under the surface. ",
  "link_flair_text": "Discussion",
  "id": "1fo999z",
  "num_comments": 101,
  "created_utc": 1727173906,
  "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/",
  "comments": [
    {
      "id": "loo3kva",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 1 week | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loo3kva/",
      "created": 1727173909,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loo4848",
      "score": 92,
      "body": "He's easily replaced if the stock suffers, so far it looks like the market likes/is indifferent to the bean counter lizard man",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loo4848/",
      "created": 1727174293,
      "depth": 0,
      "replies": [
        {
          "id": "loo4g7n",
          "score": 46,
          "body": "I think it's going to start showing up in earnings in 3-4 quarters. The savings from reduced headcount will offer a short-term boost. The damage after that will last years.",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loo4g7n/",
          "created": 1727174424,
          "depth": 1,
          "replies": [
            {
              "id": "looc86b",
              "score": 40,
              "body": "Unfortunately (former Amazon Employee here) - this happened additionally under Jeff Bezos.  My job was transported to another state and made obselete. This was 6 years ago - they still maintain the same principles.  The market wants growth AND profit.  It also likes momentum - Jassy uses the playbook from Bezos (trust me - I'm a professional).\n\nThe stock has split since the Bezos time - and still reaches all time highs.  No, it doesn't move the same as Nvidia, but share holders expect xyz anyway.  I hold because there is more upside - even though I don't like the adversarial position drawn between employyes and employer plus customers and sellers (the main advantage is cloud here - not ai).",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/looc86b/",
              "created": 1727178426,
              "depth": 2,
              "replies": []
            },
            {
              "id": "looznt8",
              "score": -15,
              "body": "Yeah it killed X/Twitter\n\n  \nSorry you're butthurt over having to RTO or were fired.  \n\n\n\nAWS is king",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/looznt8/",
              "created": 1727187493,
              "depth": 2,
              "replies": [
                {
                  "id": "lopsolg",
                  "score": 4,
                  "body": "Twitter revenue is down massively so maybe not your best example",
                  "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopsolg/",
                  "created": 1727196705,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lopt7qa",
                      "score": -1,
                      "body": "Nice try but that wasnt the claim \n\n  \nThe claim was there wa no way the Twitter would be able to operate with the large RIF\n\n  \nWould Twitter be in a better/worse position with a higher headount?",
                      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopt7qa/",
                      "created": 1727196869,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "loq15ml",
                          "score": 4,
                          "body": "At this point or right when Elon took over? Because driving advertisers away, plummeting revenue, and being forced to fire people is not really an ideal situation. The answer really depends too on who the higher headcount is and when. I'm not sure retaining their top developers could save advertisers from leaving, but losing them surely didn't help anything except short term budgeting.",
                          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loq15ml/",
                          "created": 1727199323,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "loq2ffp",
                              "score": -1,
                              "body": "Again, you are being willfully obtuse.  You are confused by correlation not equaling causation\n\n  \nBeing \"forced\" to fire staff is an interesting choice of words, do you have some proof that he was \"forced\" to do this?  \n\n  \nThe original claim was that there was no way Twitter could be operational with such a RIF. It sure doesnt seem any worse and tbh seems to be much better from a reliability standpoint",
                              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loq2ffp/",
                              "created": 1727199713,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "loq8zoi",
                                  "score": 3,
                                  "body": "I don't think you have any idea what correlation and causation is or how they are related tbh. If you have to ask why losing advertisers would lead to layoffs at Twitter then I won't be able to convince you at any point, there is no data you are willing to be convinced by. I never said Twitter would not function, I said their revenues declined massively (Elon stated this), they were not profitable before the purchase and now they have large debt to service + declining revenues, which again Elon admits I'd not addressed by their current subscription/ad model.",
                                  "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loq8zoi/",
                                  "created": 1727201741,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "loqa1ro",
                                      "score": 0,
                                      "body": "And I know you can read.\n\n  \nI never stated that Twitter wasnt losing money.  I didnt say \"You claimed\"\n\n  \nSo must companies that are profitable are OK with a bloated staff levels?\n\nInteresting theory",
                                      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loqa1ro/",
                                      "created": 1727202073,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "loqccuy",
                                          "score": 4,
                                          "body": "Sure you said sarcastically, \"yeah it killed X/Twitter\" \n\n\nId say massively declining revenue, high debt, and a lack of profit will eventually do that yes. I also said losing top developers didn't help. I didn't say there wasn't bloat anywhere. There is rarely one single thing that determines big revenue drops...it's not a gotcha to be functioning when you're still drowning slowly despite an 80% reduction in workforce. ",
                                          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loqccuy/",
                                          "created": 1727202790,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lop935g",
                  "score": 4,
                  "body": "You're right; killing company morale has zero impact on your products!\n\nAWS has competitors everywhere. Azure is at their heels.\n\nI don't think AMZN is going to slide as much as OP thinks but I do see slowed growth at best.",
                  "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lop935g/",
                  "created": 1727190562,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lopbppp",
                      "score": -5,
                      "body": "Oh no, laying off some scrum PMs and HR drones, how will they ever recover...\n\n  \nBloat is real and as you note, growth is going to slow therefore you dont need the same office overhead.",
                      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopbppp/",
                      "created": 1727191395,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lop9e45",
          "score": 1,
          "body": "But if they lose a year now, that’s pretty critical.",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lop9e45/",
          "created": 1727190659,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loo4q5n",
      "score": 99,
      "body": "Jazzy sucks, fuck even spelling his name right.  Andiii",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loo4q5n/",
      "created": 1727174587,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lopdxr0",
      "score": 22,
      "body": "Assy knows exactly what he is doing on top of phantom job listing's and stirring up workplace drama so that they have people quitting and not having to pay off severance. I'm Amagone from these positions.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopdxr0/",
      "created": 1727192087,
      "depth": 0,
      "replies": []
    },
    {
      "id": "looc7b2",
      "score": 50,
      "body": "Strange, he was the one who built AWS which is Amazon's cash cow.\n\nBusiness is pioneer and innovating data center, cloud, etc still today.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/looc7b2/",
      "created": 1727178415,
      "depth": 0,
      "replies": [
        {
          "id": "lopngx4",
          "score": 3,
          "body": "Ive always wondered if AWS split from retail how each stock would do? I know people who work for AWS and they are always quick to point out which division they aren’t in.",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopngx4/",
          "created": 1727195072,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loodvic",
          "score": 18,
          "body": "Aws is entirely different business to amazon retail. Andy has no clue how to operate warehouses, run trucks on the roads, and manage many people. His biggest failure is to trust his shitty HR advisors",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loodvic/",
          "created": 1727179167,
          "depth": 1,
          "replies": [
            {
              "id": "loomzeu",
              "score": 28,
              "body": "What a bunch of bullshit, Amazon is the king of logistics imo.",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loomzeu/",
              "created": 1727182941,
              "depth": 2,
              "replies": [
                {
                  "id": "loopa43",
                  "score": 15,
                  "body": "Of course, thanks to Benzos who was really smart. Jazzy knows how to operate aws but not logistics",
                  "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loopa43/",
                  "created": 1727183816,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "loowzv8",
                      "score": 9,
                      "body": "Please.. jeff didn't oversee logistics operations, that's probably the job of the lowest guy on the executive chart, amazon has more room to grow, with retail and with cloud, I don't see how you guys think it's going downhill the guy is CEO and it's job culture or whatever doesn't change much or anything at all, sure some people are going to flee but amazon was never built on the backs of a few guys, but on being able to get new people in and keep moving forward, they are going to keep doing that, more so when the job market is as rough as it is today, you got thousands of graduates that are smart but have no experience, they'd love an amazon job even if it has no remote days.. and a lot of people who might want to flee amazon offices will find themselves without much better offers.. this isnt 2021 when everyone was over-hiring.\n\nI also think the RTO mandate was to trim down jobs without actually firing people, but that's my conspiracy persona speaking..",
                      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loowzv8/",
                      "created": 1727186580,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "loqszly",
                          "score": 7,
                          "body": ">Please.. jeff didn't oversee logistics operations, that's probably the job of the lowest guy on the executive chart\n\nAaaaaand this is the kind of ignorance which eventually brings down the best and biggest companies. Ego, ego, ego, everyone wants to be important and nobody does any work. \n\nOn andys watch the company mushroomed, the middle management empire building became byzantine, and he doesn't have the balls to deal with it, instead hides behind some bs rto policy from his truly regarded hr team.\n\nIts a steady decline and insiders are only offloading their stakes",
                          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loqszly/",
                          "created": 1727207975,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lorx3ue",
                          "score": 3,
                          "body": "> jeff didn't oversee logistics operations\n\napparently all the logistics execs left in recent years because they couldn't stand Jassy",
                          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lorx3ue/",
                          "created": 1727221603,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lopmc6h",
              "score": 3,
              "body": "Rufus is a dud.  Really poor integration of AI with retail, IMO.",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopmc6h/",
              "created": 1727194714,
              "depth": 2,
              "replies": [
                {
                  "id": "lorx6pn",
                  "score": 2,
                  "body": "it was clearly a failed catch-up product",
                  "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lorx6pn/",
                  "created": 1727221631,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "los7atr",
                      "score": 1,
                      "body": "100%; implementation is really poor.",
                      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/los7atr/",
                      "created": 1727225392,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "loof1q1",
              "score": -3,
              "body": "Drink water",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loof1q1/",
              "created": 1727179689,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "loonwmm",
          "score": 4,
          "body": "Success in one role often doesn't translate to being the optimal candidate for another. I think there's a consensus he's always been lacking something as Bezos replacement.",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loonwmm/",
          "created": 1727183298,
          "depth": 1,
          "replies": [
            {
              "id": "loosw0t",
              "score": 11,
              "body": "Every company eventually transitions from the visionary to the ops guy. Jobs->Cook, Brin/Page->Sundar, Bezos->Jassy, etc.",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loosw0t/",
              "created": 1727185143,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "loq5vbl",
      "score": 15,
      "body": "As long as Andy has the approval of Jeff, he is safe. Jeff is the only person on the Amazon board who can oust Andy at will. But he picked him himself and Jeff knew what he was doing when giving the reigns to Andy. Hopefully sooner than later Amazon will get rid of him though. He is not a visionary, all he can do is cut costs left and right. \n\nBut the biggest difference: Jeff Bezos was LIKED at Amazon. Andy is disliked across the company.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loq5vbl/",
      "created": 1727200769,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loomepy",
      "score": 28,
      "body": "Walk through how you see this move hurting the stock? Its basically a 4D chess layoff round. Amazon's days of big growth and innovation are over, it's a $2T market cap company. They are just a cash generation machine now, so putting a galaxy brain spin on regular old cost cutting is a logical move.\n\nDont get me wrong, as a human being and remote worker this move makes me scowl, but from a business POV it makes sense.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loomepy/",
      "created": 1727182719,
      "depth": 0,
      "replies": [
        {
          "id": "loploxw",
          "score": 21,
          "body": "The whole “this is so smart it’s cost cutting without severance” is not galaxy brain, it is a pretty short sided take.  I quit because of the first RTO push, and what i did was put in 5-10 hours a week for 6 months while looking for a new job.  I basically took 5 months of severance instead of 2.  At amazon it takes at least 6 months to fire someone and the employees know that, they are going to coast hard not work at 100% then all of a sudden quit.",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loploxw/",
          "created": 1727194510,
          "depth": 1,
          "replies": [
            {
              "id": "loq86go",
              "score": 3,
              "body": "I'm not saying it's smart, it's just a way to control the messaging. Amazon is a mature company, they don't have any runway for big bold ideas. But if they say they're doing layoffs that sends a signal that they're in trouble. But if they push an RTO mandate it looks like a flex. Either way they are reducing headcount/cost, just in a very passive aggressive way. Again I dont agree with it or admire it but Im just looking at it from their perspective.",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loq86go/",
              "created": 1727201488,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lop726i",
          "score": 23,
          "body": "I work there. They're going to lose talent from this that they don't want to lose. The world has simply changed since Covid, and no tech company the size of Amazon has ever done what they're doing now (RTO 5-day post-covid). They just put a +$50,000 on all their competitor's base offers.",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lop726i/",
          "created": 1727189913,
          "depth": 1,
          "replies": [
            {
              "id": "lopovb3",
              "score": 14,
              "body": "The talent was leaving anyways. Amazon has always been a grinder and most people leave to an easier job at Microsoft/Google/Meta  when they can.",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopovb3/",
              "created": 1727195512,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "loq9khj",
          "score": 5,
          "body": "This is such a deadbrain take. \n\nWhen you force a layoff with the intention of people quiting, guess who is more likely to quit: “top senior talent that can easily find a job elsewhere”. \n\nWhen you do a targeted layoff, sure you are paying some severance, but a couple million in severance is pennys to Amazon. Seems worth it to be able to layoff the divisions that make sense to layoff. \n\nThis is not a stealth layoff. I think they just truly believe being in the office is better for innovation.",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loq9khj/",
          "created": 1727201923,
          "depth": 1,
          "replies": [
            {
              "id": "loqwziz",
              "score": 2,
              "body": "You overestimate the value Amazon puts on senior talent",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loqwziz/",
              "created": 1727209224,
              "depth": 2,
              "replies": [
                {
                  "id": "lor2clm",
                  "score": 2,
                  "body": "What advantage would there to be to all your top performers leaving lol",
                  "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lor2clm/",
                  "created": 1727210904,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "loqv1l5",
              "score": 1,
              "body": "I agree with you.",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loqv1l5/",
              "created": 1727208618,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "loopl2u",
          "score": 2,
          "body": "Looks like their Big Blue phase to me. It doesn't have to be. It's not inevitable.",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loopl2u/",
          "created": 1727183930,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lotiryi",
          "score": 1,
          "body": "Strike?",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lotiryi/",
          "created": 1727248004,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lopkfsq",
      "score": 12,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopkfsq/",
      "created": 1727194117,
      "depth": 0,
      "replies": [
        {
          "id": "low3md0",
          "score": 2,
          "body": "He perhaps is unfairly maligned as the long-term consequences of Jeff’s reign are what he is currently handling (insane headcount and bureaucracy created from COVID, managing the remnants of the PIP factory, the initial movers and shakers all slowly moving out of Amazon). Biggest thing of all IMO though was when Jeff sealed Amazon’s Day 2 death sentence when he went all in on ads in ~2018 as a huge strategic focus. Ads is mega profitable, but the one of the biggest strengths of Amazon was the general indifference to profits and instead the messianic focus of organizational focus and delivering value. This organizational mentality is what created all the innovation and value (and ultimately sky high profits) to begin with. I stopped hearing of the “?” emails around this time, and I suspect Jeff had been looking to eject out of the CEO seat for some time before he finally did during COVID.\n\nNot to take away from Jassy, of course. I agree with you that he has been bad. But honestly, he was set up to fail and could never fulfill the big shoes and personality of Jeff.\n\n(Former Amazonian here as well)",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/low3md0/",
          "created": 1727287232,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loor1sq",
      "score": 8,
      "body": "I don’t know about your prediction but I’d beat the shit out of Andy if I could",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loor1sq/",
      "created": 1727184474,
      "depth": 0,
      "replies": [
        {
          "id": "loqxgje",
          "score": 2,
          "body": "Based",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loqxgje/",
          "created": 1727209373,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lorxfqd",
          "score": 2,
          "body": "everyone who commutes in Seattle and other cities with an Amazon corporate presence has a reason to",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lorxfqd/",
          "created": 1727221723,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lopbn07",
      "score": 4,
      "body": "I just sold mine so it’s gonna go up.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopbn07/",
      "created": 1727191372,
      "depth": 0,
      "replies": [
        {
          "id": "lopdewb",
          "score": 3,
          "body": "ty",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopdewb/",
          "created": 1727191923,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "looygjy",
      "score": 3,
      "body": "The board will agree with him. That is the Amazon culture.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/looygjy/",
      "created": 1727187082,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loq40dl",
      "score": 3,
      "body": "AMZN is my biggest position. I wasn’t happy with this news but still bullish for now. If top talent leaves, it will take a couple of years to affect the cashflows so there is time to sell",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loq40dl/",
      "created": 1727200197,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loq6nz3",
      "score": 3,
      "body": "I think it’s only a question of capex, and if they can control their spending spree.\n\nAmazon has basically the same ebitda as MSFT, I know it’s not a good proxy the so called bullshit earnings, but Amazon has a market cap which is 1trn smaller than MSFT.\n\nFurthermore, they have reached a capillarity in their retail service that many business will cease to exist, like physical pharmacies to name one. And in the last year their margins exploded due to an excellent management of capex. FCF passed from -5bln to 50bln. \n\nThey also have no real competition, but only should worry about the doj knocking and moderate their abusive behavior.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loq6nz3/",
      "created": 1727201017,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lor8i0t",
      "score": 3,
      "body": "I predict jassy will be the next starbux ceo",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lor8i0t/",
      "created": 1727212884,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loola38",
      "score": 5,
      "body": "Well i mean take that bet if you want. I’m sure it will be a mistake in the long term.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loola38/",
      "created": 1727182279,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lop17fb",
      "score": 4,
      "body": "Amazon used to be customer driven. But now they’re an AI company instead. Trying to fit everything into AI with a tech first approach.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lop17fb/",
      "created": 1727188008,
      "depth": 0,
      "replies": []
    },
    {
      "id": "looky85",
      "score": 11,
      "body": "So you are selling because he wants people to work in person…. Nice choice",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/looky85/",
      "created": 1727182151,
      "depth": 0,
      "replies": [
        {
          "id": "loonl8y",
          "score": 8,
          "body": "Almost every company has taken a more balanced posture than Amazon. I dislike authoritarian leadership styles and my opinion is it won't offer the best long term growth prospects. I'm moving money to CRM, ORCL, SAP, NOW, MSFT, GTLB, PLTR and AAPL.",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loonl8y/",
          "created": 1727183175,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "looctkc",
      "score": 12,
      "body": "Tech guy here. Every company I know is doing this, if not fully partially. And usually full RTO for new employees",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/looctkc/",
      "created": 1727178696,
      "depth": 0,
      "replies": [
        {
          "id": "looogct",
          "score": 10,
          "body": "i work tech too but in finance and we're mostly WFH with some people being hybrid. lots of people we hired recently also full remote and many times many states away. even the bankers are remote 2-3 days a week",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/looogct/",
          "created": 1727183505,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loooenn",
          "score": 8,
          "body": "This is an overly generalized statement that doesn't take into account that these things are on a sliding scale and many possibilities exist between 0 and 100.",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loooenn/",
          "created": 1727183487,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lopnwwn",
      "score": 3,
      "body": "Most companies innovate when founders are leading. Amazon and Apple are not going to be innovative in the long run! Someday they will be replaced by a new startups.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopnwwn/",
      "created": 1727195212,
      "depth": 0,
      "replies": [
        {
          "id": "lor5ncb",
          "score": 5,
          "body": "Amazon could become the next IBM. Making money on legacy business, and nothing new to get really excited about.",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lor5ncb/",
          "created": 1727211949,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loq0w3d",
      "score": 5,
      "body": "I don't disagree with cutting Amazon, but the reason I did it is their most profitable business (AWS) has completely lost it's edge and has a declining head-to-head winrate. For the first time in years they are offering enterprise discounts on EC2/Lambda and other core services.\n\n\"Authoritarian Leadership\" isn't something new there, if anything it's taking them back to their explosive growth days.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loq0w3d/",
      "created": 1727199241,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lop08zo",
      "score": 6,
      "body": "Yea screw these guys:\n\n\n\n**Strong BuyBased on 47 analysts offering recommendations for 'AMZN'.**\n\n#",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lop08zo/",
      "created": 1727187690,
      "depth": 0,
      "replies": [
        {
          "id": "lop0m5f",
          "score": 5,
          "body": "Analysts are always right.",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lop0m5f/",
          "created": 1727187812,
          "depth": 1,
          "replies": [
            {
              "id": "lop3bhm",
              "score": 3,
              "body": "didn't say they were... 47 have a strong buy, so they're all wrong you're right though... you should sell fr see you at $500",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lop3bhm/",
              "created": 1727188703,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lopjqwv",
      "score": 7,
      "body": "I work at Amazon. I think there’s some things outsiders don’t understand. \n\nAmazon was a growth company that went all out during Covid and over stretched. They did some layoffs which I don’t love, but a lot of those people were working a couple hours a day max. Many had transferred from other roles when they saw these sweet gigs working from home and no real work, which should’ve been a red flag as you easily become no longer needed. Then they got laid off. \n\nI still work with a lot of people whose job it is to support our buildings. Most of them are supporting a region with 6-10 buildings. Working from home, these folks are more often than not, extremely hard to get ahold of. Supporting my site should be 1/8th of your job, but you take 4-5 hours to respond to my message or I don’t hear from you for weeks at a time. What’re you doing during that time? \n\nA lot of folks work really hard from home, but Amazon knows a lot of folks aren’t putting remotely close to 40 hours of deliverables out. RTO will weed out those who aren’t working, or in some cases working a second job at the same time, and not see deliverables drop by much. \n\nPeople supporting my business line were part of the layoffs and I saw almost zero change in the support we were getting. This is what Amazon is aiming for because there’s still a lot of bloat. \n\nIt sucks for a lot of people for sure. I’d be pissed. But my guess is we will see Amazon get rid of more bloat, see very little change in productivity (if not an increase) and spend less money. I honestly don’t have an opinion on jassy, but the stock price has about doubled in his time in charges and is currently just below the ATH (which was hit under him). Operationally we’re doing better than ever, and we’re continuing to cut more bloated cost.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopjqwv/",
      "created": 1727193898,
      "depth": 0,
      "replies": [
        {
          "id": "lopnm4k",
          "score": 13,
          "body": "\" RTO will weed out those who aren’t working, or in some cases working a second job at the same time, and not see deliverables drop by much.\"  \nI just don't understand this position, people can fuck around in office as well. How is this not just poor accountability management from their bosses? Location shouldn's matter.",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopnm4k/",
          "created": 1727195118,
          "depth": 1,
          "replies": [
            {
              "id": "lopwtmx",
              "score": -2,
              "body": "It’s significantly more difficult to hold someone accountable through a computer screen than in person. \n\n“I’m so overwhelmed and you’re asking me to complete this task in way less time than is realistic”:\n\nBy computer: “ok… is there any way I can help you?”\n\nIn office: “well, if you maybe spent less time talking to Steve about football, and every time I turn around you’re on your phone…”\n\nThis is an egregious example, but as someone who has managed both ways, managing in person, having in person interactions, and getting the team together to contribute to a meeting is so much more effective in person.",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopwtmx/",
              "created": 1727197986,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lopu99l",
          "score": 9,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopu99l/",
          "created": 1727197188,
          "depth": 1,
          "replies": [
            {
              "id": "lopyw44",
              "score": -1,
              "body": "Holy shit I thought it was 22. I can’t believe it’s been that long. \n\nYeah it’s not performed as well as some tech stocks but also had a way bigger drop in valuation as it rode as massive covid wave it was coming down from. Amazon dropped back yo pre-Covid price at one point which no other tech stock came close to. You can certainly blame it on jassy, but from the actual low it did hit its recovered way better than most tech stocks. \n\nLike I said- no opinion on jassy. But ops reasoning lacks some insight.",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopyw44/",
              "created": 1727198629,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lovri9i",
          "score": 1,
          "body": "Doesn't amazon use KPIs for ICs everywhere? If your not working, it's gonna get noticed?",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lovri9i/",
          "created": 1727283506,
          "depth": 1,
          "replies": [
            {
              "id": "lowoxq5",
              "score": 1,
              "body": "Not like what you’d see in an operable site. You often have deliverables and timelines which are super subjective. Support often track kpis from sites but aren’t held accountable to them, which is crazy. A lot of their work doesn’t have super clear time it should take you.",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lowoxq5/",
              "created": 1727293859,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "looh0pg",
      "score": 4,
      "body": "The market and fundamentals do not care about RTO.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/looh0pg/",
      "created": 1727180535,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lootiao",
      "score": 3,
      "body": "This was meta’s script in 2023 which propelled meta to ATH",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lootiao/",
      "created": 1727185366,
      "depth": 0,
      "replies": [
        {
          "id": "loourz7",
          "score": 4,
          "body": "It wasn't Meta's script. There's a 60% difference between 40% and 100%.",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loourz7/",
          "created": 1727185812,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lopyc9v",
      "score": 4,
      "body": "I have no skin in the game with Amazon. Jassy sucks not because of his work from home policies, but because of his allowance of stagnation with Amazon, and even reversal of progress. \n\nAmazon is just Temu, but with worse customer service and massive overhead. \n\nThis is not good for business long term.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopyc9v/",
      "created": 1727198460,
      "depth": 0,
      "replies": [
        {
          "id": "lorxp6s",
          "score": 5,
          "body": "Amazon is much faster than Temu and has more convenient return policies\n\ntheir real profit is in AWS, which has already reached the limits of growth",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lorxp6s/",
          "created": 1727221820,
          "depth": 1,
          "replies": [
            {
              "id": "lovrp98",
              "score": 1,
              "body": "Apart from still doing 20% yoy growth?",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lovrp98/",
              "created": 1727283565,
              "depth": 2,
              "replies": [
                {
                  "id": "loz2iko",
                  "score": 1,
                  "body": "anything under 30% YoY is considered mediocre by the irrational market and investors",
                  "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loz2iko/",
                  "created": 1727325836,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lopltoi",
      "score": 4,
      "body": "Bring back daddy Bezos",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopltoi/",
      "created": 1727194552,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lopzadf",
      "score": 1,
      "body": "cheerful far-flung foolish lock racial grey pathetic paltry mindless quack",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopzadf/",
      "created": 1727198750,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loqlf5q",
      "score": 1,
      "body": "He has turned the company into a TeMu lite and in the process severely damaged the brand value of AMZN. Undoing it will take years",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loqlf5q/",
      "created": 1727205628,
      "depth": 0,
      "replies": []
    },
    {
      "id": "losilok",
      "score": 1,
      "body": "I was just posting in one of the Kindle subreddits about  how their software quality is going into the toilet. I have $700+ worth of Kindle hardware that is freezing or super slow since July. It’s like someone at Amazon decided, “you know what? Fuck all these people who like to read”",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/losilok/",
      "created": 1727229713,
      "depth": 0,
      "replies": []
    },
    {
      "id": "losxm2u",
      "score": 1,
      "body": "Not much data here\n\nJust feelings, and buzz words like “command management”",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/losxm2u/",
      "created": 1727235990,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lot3k3t",
      "score": 1,
      "body": "AWS has a reputation for strict management, and amazon shipping logistics are worse",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lot3k3t/",
      "created": 1727238968,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp19f5e",
      "score": 1,
      "body": "LOL...",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lp19f5e/",
      "created": 1727364966,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loqj0aa",
      "score": 1,
      "body": "I’d be worried about any business that relies on imports until the port worker strike situation has a clear end. Right now there demanding an 80% pay raise and it’s set to star October 1st. I think it’s only effecting east coast ports from Texas to Maine but still will be a big supply chain disruption if it does happen.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loqj0aa/",
      "created": 1727204867,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lophwzm",
      "score": -4,
      "body": "RTO is the norm in tech now rather than the exception. I started a new position at a midsize company in January and I'm in the office 5 days a week. I was at a tier-2 tech shop before that and we were in the office 4 days a week.\n\nWorkers who claim they are so much more efficient at home remind me of college students who claim they were so much more efficient at home during COVID. If you asked the vast majority of students, they'd say they preferred remote. They could attend class in their pajamas, and review lectures asynchronously, and all that. But their exam scores during that time tanked. They weren't actually learning shit without someone there to hold them accountable. And I don't think wagies are that different. \n\nFoot soldiers like us don't have productivity data for remote workers, but the guys cutting our checks do, and they don't seem to be enamored with WFH.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lophwzm/",
      "created": 1727193325,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lopj9ry",
      "score": -1,
      "body": "This return to office is much ado about nothing imo. Buy AMZN.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lopj9ry/",
      "created": 1727193746,
      "depth": 0,
      "replies": []
    },
    {
      "id": "losjieg",
      "score": 0,
      "body": "AWS and Amazon's other businesses are polar opposites. AWS is growth and innovation. Amazon various retail is lean margins and efficiency. He is from AWS but with a retail mindset. They should just spin off AWS and let it be a startup mentality. Granted - some could say AWS really is just a commodity business, about supply chain management of data centers and looks more like retail than you think with thin margins and lots of capex.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/losjieg/",
      "created": 1727230063,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loobg8t",
      "score": -5,
      "body": "He's just a nice guy.  He is giving all the employees prime for free starting next year.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loobg8t/",
      "created": 1727178069,
      "depth": 0,
      "replies": [
        {
          "id": "looj1r0",
          "score": 6,
          "body": "Warehouse workers.",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/looj1r0/",
          "created": 1727181380,
          "depth": 1,
          "replies": [
            {
              "id": "lrjaei8",
              "score": 1,
              "body": "Yea.  We don't get treated any better than you do.  Probably worse.",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lrjaei8/",
              "created": 1728718956,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "loome07",
          "score": 6,
          "body": "Worth, what, like $15 a month? Bro...",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/loome07/",
          "created": 1727182712,
          "depth": 1,
          "replies": [
            {
              "id": "lrjaav4",
              "score": 1,
              "body": "Go buy it.  Cost more than that.",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lrjaav4/",
              "created": 1728718884,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lorxthi",
          "score": 1,
          "body": "it'll be offset through the bathroom allowance",
          "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lorxthi/",
          "created": 1727221864,
          "depth": 1,
          "replies": [
            {
              "id": "lrj9qnx",
              "score": 1,
              "body": "Sorry for the late reply.  I just has to train my manager to copy and paste an excise for time of task and told him not to reach out till he ran out of excuses.",
              "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lrj9qnx/",
              "created": 1728718490,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrslnl8",
      "score": 2,
      "body": "This is sad to hear, but not surprising. Jassy seems like the kind of CEO who reached this level because he knows how to tell the board what they want to hear. Aggressive cost-cutting measures and RTO are what boards like to hear.\n\nAmazon will probably get away with this for a few more years if they give Wall Street the numbers they want, even if they're not as spectacular as they once were. If they don't take steps to keep good talent and make good products (especially with AWS), they'll go the way of Intel, it just might take a while to show. Tale as old as time.",
      "permalink": "/r/wallstreetbets/comments/1fo999z/selling_amazon_jassy_is_a_failure_grasping_at_a/lrslnl8/",
      "created": 1728860106,
      "depth": 0,
      "replies": []
    }
  ]
}