{
  "title": "The insanity that is $SNOW's capital allocation",
  "score": 331,
  "selftext": "Snowflake has recently announced raising $2 bn of convertible debt to buy back $ 575m of stock with the rest for general corporate purposes. Sure, why not.\n\nExcept $SNOW has already repurchased more than $1.4 bn at higher prices. In addition, they have $3 bn in cash with (previously) $0 debt.\n\nIn the 6 months ending in 2024, they've already repurchased 5,939k shares at an average cost @ 154.30, for a total of $916 million.  In the past 18 months alone they've spent $1.4 bn on share repurchases alone at higher share prices. Shares are down 40% YTD so maybe not the best move. They've now tarnished their balance sheet just to buy back overpriced shares.\n\nWhat's worse is their shares are pretty overvalued, trading at 37x forward FCF. In addition, their growth metrics are weakening, with revenue growth rates, gross margins, operating margins, and FCF margins dropping across the board. What in the world is management doing?",
  "link_flair_text": "Company Discussion",
  "id": "1fot1gn",
  "num_comments": 126,
  "created_utc": 1727228096,
  "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/",
  "comments": [
    {
      "id": "losk69c",
      "score": 376,
      "body": "Why invest in products or talent when you can invest in your own overvalued stock?",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/losk69c/",
      "created": 1727230320,
      "depth": 0,
      "replies": [
        {
          "id": "losrj2e",
          "score": 81,
          "body": "God I hope this is a theme in the next market crash, only way I see this practice changing for the better.",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/losrj2e/",
          "created": 1727233293,
          "depth": 1,
          "replies": [
            {
              "id": "loubpg5",
              "score": 27,
              "body": "I don't agree. Buybacks aren't necessarily evil. In fact, they're often a better alternative to dividends (which very few people seem to rail against). The problem is not the buyback itself, it's the incompetent/greedy management that doesn't know how to allocate capital correctly. \n\n  \nIf SNOW eventually fails, that will be the reason why. The buybacks are merely a symptom of a larger problem.",
              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loubpg5/",
              "created": 1727265825,
              "depth": 2,
              "replies": [
                {
                  "id": "louf8ox",
                  "score": 16,
                  "body": "Why not just issue dividends? The whole buyback structure sucks and makes it impossible to have a company reach fair valuations",
                  "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/louf8ox/",
                  "created": 1727267340,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "loumkru",
                      "score": 11,
                      "body": "Tax free profit. In my country dividents have 15% tax. Selling stocks after 3 years 0% tax. Neigbours have tax free money only after just 1 year.",
                      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loumkru/",
                      "created": 1727270201,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "louo6zd",
                          "score": 2,
                          "body": "I understand this. I’m suggesting that instead of allowing companies to pump their stock tax free by buying back shares, we should force people to actually pay taxes via dividends. We wouldn’t need this ongoing conversation about taxing unrealized gains if we did this",
                          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/louo6zd/",
                          "created": 1727270801,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lovjtci",
                              "score": 1,
                              "body": "That is interesting, but as long as laws allow not to pay taxes. There will be incentive to do this.",
                              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lovjtci/",
                              "created": 1727281121,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "loulqxe",
                      "score": 16,
                      "body": "From a strictly mechanical standpoint, both buybacks and dividends return value to shareholders. They just do it in different ways. \n\nThe main things that make buybacks \"more efficient\" than dividends is 1) they are more tax efficient for shareholders, and 2) they are more flexible for companies.\n\nAs far as taxes, shareholders are taxed when they receive a dividend (unless you automatically reinvest it in the stock). There are no taxes paid during a buyback. \n\nAnd from a flexibility standpoint, a company can start, pause, and resume a buyback pretty much at will. Whereas with dividends, once you start paying one, you're basically locked into it forever. Investors HATE it when a company cuts or stops its dividend.",
                      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loulqxe/",
                      "created": 1727269888,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "loumpgy",
                          "score": 2,
                          "body": "I understand that buybacks are better because they are more tax efficient. I’m saying they should be illegal for this reason. \n\nInvestors hate when dividends are cut, so they sell the stock. This makes the price line up with the actual value of the business. Allowing buybacks is just setting up long term market volatility by obfuscating the cash flow of the business",
                          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loumpgy/",
                          "created": 1727270249,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lov1og3",
                              "score": 4,
                              "body": "How does it obfuscate cash flow?  If you only look at price, I suppose that is true, but if you look at all the financials of a company, nothing is hidden assuming reporting is being done accurately.",
                              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lov1og3/",
                              "created": 1727275410,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "loxtmjz",
                                  "score": 4,
                                  "body": "I think he means that buying back shares boosts EPS/FCF per share by reducing the share count instead of boosting the earnings/free cash flow. Though given, the stock price is reflective of what a company earns in free cash flow, and that owning a greater portion of a company thereby entitles to you a greater share of the profits, share buy backs still provide shareholder value by increasing your ownership of the company.",
                                  "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loxtmjz/",
                                  "created": 1727307501,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lowqbhn",
                              "score": 1,
                              "body": "Why should they be illegal? Companies issue shares, why shouldn't they be allowed to buy those shares back?",
                              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lowqbhn/",
                              "created": 1727294278,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lound6g",
                              "score": 0,
                              "body": "Sorry, but that's probably a pipe dream. Wall Street is too high on its own supply and they'll fight tooth and nail to keep it that way.",
                              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lound6g/",
                              "created": 1727270497,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "louo3xj",
                                  "score": 4,
                                  "body": "I mean you aren’t wrong, but also it’s as simple as passing legislation. Just need to put decent people in charge. Maybe we should have a rule if a candidate thinks the government is useless, maybe they shouldn’t be allowed to work for the government. If I wanted a job at FedEx and I deeply believed that supply chains using primarily air travel are inefficient, that’s not a job I should apply for because I’m going to be really bad at it based on my beliefs.",
                                  "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/louo3xj/",
                                  "created": 1727270770,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lowwlqx",
                                      "score": 2,
                                      "body": "Acting like stock buybacks are some inherently evil thing belies a complete lack of understanding of financial markets and basic economics.",
                                      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lowwlqx/",
                                      "created": 1727296210,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lox0177",
                                          "score": 0,
                                          "body": "I didn’t say they were evil. It’s the same as eating an apple. An apple a day is good for you, eating nothing but apples and consuming 50 a day isn’t healthy. Corporate America has become addicted to buybacks and it’s the fix all for all woes. That’s the issue. If every company did them occasionally from time to time after really good quarters or the stock price is down for whatever silly reason. Thats a good usage. \n\nThe issue becomes when that’s the only answer they have, and they feel like they have to do them ALL THE TIME. The issue is that it’s become something that once these companies start doing it, if they ever stop for even legitimate reasons such as the stock is up 40% in 2 years on no changes to fundamentals. I get that a CEO can’t come out and say, “Idk what yall are smoking, but it’s not worth that much”, but that doesn’t mean you need to make decisions based on the story you tell the public.",
                                          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lox0177/",
                                          "created": 1727297263,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "loulqay",
                      "score": 8,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loulqay/",
                      "created": 1727269882,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "loumhaj",
                          "score": 3,
                          "body": "That doesn't make them 'better' there was a reason that stock buybacks were banned from 1934 to 1982 as a form of stock manipulation. Definitely does not make it a better option for the long run, short term profits, sure.\n\nTo the unwashed masses down voting: yes in the cleanup from the Great depression the newly formed Securities and Exchange commission made it illegal in 1934 as a form of stock manipulation. \n\nThis was undone in the 80's de-regulation era in 1982. Since then we have seen a concentration of capital into a few extremely large companies, at the expense of market breadth. Who knew it would lead to the exact same problem they were trying to prevent 90 years ago.",
                          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loumhaj/",
                          "created": 1727270165,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "loumueh",
                              "score": -4,
                              "body": "False—they were not banned before 1982.",
                              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loumueh/",
                              "created": 1727270301,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lov2u44",
                                  "score": 3,
                                  "body": "Even a cursory look can show you that yes they were de facto banned by the Securities and Exchange act of 1934. Not sure why you would argue that.",
                                  "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lov2u44/",
                                  "created": 1727275781,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lowciv9",
                                      "score": 2,
                                      "body": "There’s another term for “de facto banned”. And that would be “not banned”. Because they weren’t. There was looming liability for market manipulation, sure, and they were rare as a result. But the notion that they were categorically banned is wrong as a matter of law.",
                                      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lowciv9/",
                                      "created": 1727290010,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "loum78b",
                          "score": -1,
                          "body": "Yes, this is why the buyback structure sucks. Why are we rewarding companies for obfuscating their return to investors?",
                          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loum78b/",
                          "created": 1727270058,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "loun4wj",
                              "score": 9,
                              "body": "[deleted]",
                              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loun4wj/",
                              "created": 1727270410,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lovvo90",
                                  "score": 0,
                                  "body": "My problem with buybacks is that it's hard to determine exactly how much impact they have on the end share price. At least, from the outside looking in.",
                                  "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lovvo90/",
                                  "created": 1727284794,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "loun1pa",
                      "score": 1,
                      "body": "Because any good company to work for these days offers RSUs, so if you don't buyback stock the price will go down because you issue more and more shares. Used to be only executives who got shares through options, but when an individual contributor can get them it's a game changer. Take a look at SNOW as an example: https://companiesmarketcap.com/snowflake/shares-outstanding/#:~:text=Number%20of%20shares%20outstanding%20as,company%20had%20334%2C071%2C000%20shares%20outstanding.",
                      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loun1pa/",
                      "created": 1727270377,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lov894q",
                      "score": 1,
                      "body": "Dividends use the company's cash to take equity out of the business and give to shareholders as cash.  Buybacks use the company's cash to increase the shareholders equity in the business by buying down the share count.  They are two different things and both can be valid uses of the company's cash.\n\nBoth can also be bad uses of the company cash and shareholders can make their opinions known on this by selling the stock.",
                      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lov894q/",
                      "created": 1727277499,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "louwahw",
                      "score": 0,
                      "body": "Because dividends force your hand to declare them in future quarters (in increasing amounts), buybacks don't.\n\nAlso, better tax treatment for the shareholder buy receiving cash from a buyback (return **of** capital) vs dividend (return **on** capital)",
                      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/louwahw/",
                      "created": 1727273641,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "louy8r1",
                          "score": 0,
                          "body": "My post should have read “why not make buybacks illegal and force companies to issue dividends?” - you say “tax efficient” and I say “skipping taxes”",
                          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/louy8r1/",
                          "created": 1727274288,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "louhh5o",
          "score": 9,
          "body": "It's almost like tying executive compensation to stock price causes inefficient allocation of resources to chase those targets which don't really align with long term stability huh?",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/louhh5o/",
          "created": 1727268247,
          "depth": 1,
          "replies": [
            {
              "id": "loujkr1",
              "score": 4,
              "body": "Yea...good luck trying to convince a C-suite to not do this though. It sucks but it's our reality.",
              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loujkr1/",
              "created": 1727269061,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lotva8f",
          "score": 3,
          "body": "Another Buffet bad bet?",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotva8f/",
          "created": 1727256801,
          "depth": 1,
          "replies": []
        },
        {
          "id": "louw550",
          "score": 2,
          "body": "Wouldn't buying back shares imply that management thinks their shares are undervalued rather than overvalued....?",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/louw550/",
          "created": 1727273591,
          "depth": 1,
          "replies": [
            {
              "id": "louzl5t",
              "score": 0,
              "body": "In theory, yes. In practice, management often doesn't know shit about the value of their shares. \n\n  \nAlso, shouldn't you be in prison Mr Skilling?",
              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/louzl5t/",
              "created": 1727274730,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "loujlk6",
          "score": 1,
          "body": "Big brained take.",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loujlk6/",
          "created": 1727269070,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lotjvpt",
          "score": -14,
          "body": "\\*GME vibes\\*",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotjvpt/",
          "created": 1727248745,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "losfs00",
      "score": 120,
      "body": "I was bag holding this shit for months and sold recently. Its one of those stocks which will dump to sub 100 soon and prob dip down to 70s",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/losfs00/",
      "created": 1727228634,
      "depth": 0,
      "replies": [
        {
          "id": "lot2xrs",
          "score": 23,
          "body": "I got rid of all mine around 155. I saw the writing on the wall. Glad I did that, yikes this stock tanked hard really fast.",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lot2xrs/",
          "created": 1727238643,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loslqu0",
          "score": 16,
          "body": "Same thought. Would you reenter if it breaks 120 in next couple of days?",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loslqu0/",
          "created": 1727230936,
          "depth": 1,
          "replies": [
            {
              "id": "lotdfeq",
              "score": 6,
              "body": "That sounds like a buy high sell low mentality",
              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotdfeq/",
              "created": 1727244563,
              "depth": 2,
              "replies": [
                {
                  "id": "lou8gjq",
                  "score": 1,
                  "body": "So the answer would be yes, then.",
                  "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lou8gjq/",
                  "created": 1727264338,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "losn2pz",
              "score": 6,
              "body": "Nah. I dont think so. I've been rocking chinese stonks and they have way more upside atm",
              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/losn2pz/",
              "created": 1727231464,
              "depth": 2,
              "replies": [
                {
                  "id": "loszyyz",
                  "score": 12,
                  "body": "I don't blame you. There's huge upside right now across many different Chinese stocks. \n\nYou have to be able to stomach china, tho",
                  "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loszyyz/",
                  "created": 1727237129,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lotxncs",
                      "score": 2,
                      "body": "Such as?",
                      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotxncs/",
                      "created": 1727258373,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "louna6z",
                          "score": 2,
                          "body": "BABA, YMM, NTES, TME, PDD",
                          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/louna6z/",
                          "created": 1727270466,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "loswkj3",
                  "score": 8,
                  "body": "You might rethink that Chinese stonk one. Their markets are whatever the CCP says their markets are. Just ask PDD and BYD, both of which should be at double what they are.",
                  "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loswkj3/",
                  "created": 1727235504,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "loup52k",
                      "score": -1,
                      "body": "CCP says their economy should expand exponentially and their markets should go to the moon. Hopefully it will go as CCP wills it.",
                      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loup52k/",
                      "created": 1727271151,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "low75mp",
                          "score": 1,
                          "body": "Lol. And you... believe the CCP? What, were you just born today? \n\nTheir property bubble is bursting, deflation is spiralling, foreign companies are frantically pulling investments out, and they have 286% debt to GDP. Nothing in China is \"going to the moon\" for at least the next 10 years. They are 1990s Japan now.",
                          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/low75mp/",
                          "created": 1727288335,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lox9ire",
                              "score": 0,
                              "body": ">Their markets are whatever the CCP says their markets are.\n\nYou said it, not me, regard.",
                              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lox9ire/",
                              "created": 1727300322,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "loxm4fe",
                                  "score": 1,
                                  "body": "Folks like you are signs of a market top. Wild eyed and frantic exuberance.",
                                  "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loxm4fe/",
                                  "created": 1727304758,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "loxsip4",
                                      "score": 1,
                                      "body": "Lol I mostly short, sounds good regard. Better take your own advice liquidate yourself.",
                                      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loxsip4/",
                                      "created": 1727307091,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lotflsl",
          "score": 8,
          "body": "There is reason Warren Buffett dumped all his shares at a loss and got out",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotflsl/",
          "created": 1727245940,
          "depth": 1,
          "replies": [
            {
              "id": "lotzjmy",
              "score": 3,
              "body": "This makes me feel better, I just did this my own self.",
              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotzjmy/",
              "created": 1727259571,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lou8kou",
              "score": -3,
              "body": "I thought he was still holding, and I was actually pretty pissed about it. I hold BRK. Everybody was acting like his brain was gigantic and my brain was tiny, but it just seemed like it couldn’t possibly be worth it. Glad I didn’t invest.",
              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lou8kou/",
              "created": 1727264393,
              "depth": 2,
              "replies": [
                {
                  "id": "lou9b51",
                  "score": 3,
                  "body": "https://www.forbes.com/sites/petercohan/2024/08/15/warren-buffett-dumps-61-million-snowflake-shares-stock-slips/",
                  "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lou9b51/",
                  "created": 1727264737,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lou9qt1",
                      "score": 2,
                      "body": "I definitely believed you, I just hadn’t heard about it. That’s barely over a month ago, so I guess as a shareholder I’m still pissed. Rounding error though in the grand scheme.",
                      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lou9qt1/",
                      "created": 1727264937,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "losmyvt",
      "score": 47,
      "body": "they're a train wreck. not touching this w a ten foot stick​",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/losmyvt/",
      "created": 1727231423,
      "depth": 0,
      "replies": [
        {
          "id": "lotdtve",
          "score": 6,
          "body": "Buy long dated puts?",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotdtve/",
          "created": 1727244811,
          "depth": 1,
          "replies": [
            {
              "id": "louih6l",
              "score": 2,
              "body": "RemindeMe! 1 year",
              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/louih6l/",
              "created": 1727268639,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lou5owh",
              "score": -3,
              "body": "I bough PLTR at IPO and tried but couldn’t get my orders filled for SNOW by the time it was on open market it had ballooned to an insane valuation. Did some additional DD on it and from what I read and had heard on some tech podcasts their SW and business can be disrupted easily with AI/ LLM models and there will be startups that will try and do that . Recently CRM was listed as another potential company granted they have a major foothold with their tech in a lot of large corporations. Let’s see how next few quarters look",
              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lou5owh/",
              "created": 1727262982,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "loumffy",
          "score": 7,
          "body": "I fucking looove that Warren Buffett/BH bought SNOW\n\nShows they even they are fucking cluuueless at times. They bought a PowerPoint presentation lmao",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loumffy/",
          "created": 1727270145,
          "depth": 1,
          "replies": [
            {
              "id": "louuuy0",
              "score": 5,
              "body": "Yup",
              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/louuuy0/",
              "created": 1727273158,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "losunmj",
      "score": 59,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/losunmj/",
      "created": 1727234643,
      "depth": 0,
      "replies": [
        {
          "id": "lot3xis",
          "score": 33,
          "body": "Probs just forgot to say shares in thousands, pretty normal assumption",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lot3xis/",
          "created": 1727239163,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lot7u3k",
          "score": 7,
          "body": "They gave out a lot of equity pre ipo to individuals",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lot7u3k/",
          "created": 1727241258,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lotgr4u",
          "score": 7,
          "body": "Is the issue that employee comp is high or that it's heavily stock-weighted? Their levels.fyi page for SWE pay (https://www.levels.fyi/companies/snowflake/salaries/software-engineer?country=254) shows that they are relatively equity-heavy (compared to Google or Meta), but not by a significant amount.",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotgr4u/",
          "created": 1727246678,
          "depth": 1,
          "replies": [
            {
              "id": "lou694w",
              "score": 4,
              "body": "That’s some insane compensation",
              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lou694w/",
              "created": 1727263261,
              "depth": 2,
              "replies": [
                {
                  "id": "low130o",
                  "score": 1,
                  "body": "Welcome to the high end of software engineer comp",
                  "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/low130o/",
                  "created": 1727286456,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lotlpc5",
              "score": 4,
              "body": "That user is incorrect, in the past 2 years Snowflake shares outstanding has increased by 5% in total which is pretty normal for growth companies",
              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotlpc5/",
              "created": 1727250017,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lowxj9p",
          "score": 2,
          "body": "5939K shares lol",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lowxj9p/",
          "created": 1727296494,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "losnawf",
      "score": 46,
      "body": "Management clearly thinks the stock is undervalued. Either they come out looking like geniuses or absolute buffoons. No middle ground really.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/losnawf/",
      "created": 1727231556,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lotf56h",
      "score": 13,
      "body": "This shit got me fucked this year a little bit. This is my only loss I made this year. Got it at 150 something sold at 120 something.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotf56h/",
      "created": 1727245646,
      "depth": 0,
      "replies": [
        {
          "id": "lotqjqp",
          "score": 2,
          "body": "Buy high, sell low ",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotqjqp/",
          "created": 1727253458,
          "depth": 1,
          "replies": [
            {
              "id": "lotqmsy",
              "score": 4,
              "body": "That’s what happened yeah. It’s good that I sold because I made back up the losses if I held now I would’ve been even with more losses.",
              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotqmsy/",
              "created": 1727253518,
              "depth": 2,
              "replies": [
                {
                  "id": "lotulx3",
                  "score": 3,
                  "body": "They are priced at like 10 EV/SALES with 68% gross margin and projected revenue growth of ~25% for the next 3-4 years. Their balance sheet is also clean, even with this loan they hold more cash than liabilities.\n\n\n\n\nFor example, Microsoft has an EV/SALES ratio of 13, similar gross margin ( 1% higher ) and about half the projected revenue growth. \n\n\n\n\nAt this price, I think it's not that bad. I don't own any but I am  considering to sell some cash secured puts at strike price of 90-100. The negative sentiment here makes it even more enticing.\n\n\n\n\nBesides, it will always be a decent buyout target for some of the trillion dollar companies ",
                  "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotulx3/",
                  "created": 1727256337,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lowqj3g",
                      "score": -1,
                      "body": "nothing is a buyout target anymore of this size in lina khan's FTC. that's why software is decimated. everyone knows.",
                      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lowqj3g/",
                      "created": 1727294344,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lotlhcl",
      "score": 9,
      "body": "Pump and dump by Warren Buffet",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotlhcl/",
      "created": 1727249861,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lotmcik",
      "score": 7,
      "body": "This stock is one of my worst investments of 2024. It’s a shame because I work adjacent to Snowflake and see it a lot.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotmcik/",
      "created": 1727250475,
      "depth": 0,
      "replies": [
        {
          "id": "lp4pab5",
          "score": 1,
          "body": "Ditto 100% of this",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lp4pab5/",
          "created": 1727407089,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lovslel",
      "score": 6,
      "body": "As someone who attends Snow events. Don’t be fooled by overthinking. Snow will reverse its 2024 in the next few years. They are clearly in a good position financially.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lovslel/",
      "created": 1727283841,
      "depth": 0,
      "replies": [
        {
          "id": "lp0ali3",
          "score": 1,
          "body": "You think we're going to see a bump in re-platforming projects as rates come down? or do they actually have stuff coming up that will let them retake momentum from Databricks?",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lp0ali3/",
          "created": 1727352731,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lotum55",
      "score": 11,
      "body": "I remember a few years back when several people told me to dump PLTR and get on this.. glad I didnt",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotum55/",
      "created": 1727256341,
      "depth": 0,
      "replies": [
        {
          "id": "lovqzw6",
          "score": 4,
          "body": "And now everyone’s telling you to dump SNOW and get on PLTR 🤔",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lovqzw6/",
          "created": 1727283353,
          "depth": 1,
          "replies": []
        },
        {
          "id": "louo93u",
          "score": 1,
          "body": "When pltr was trading at 6 and snow at 230, yes. Now pltr has like 30 EV/SALES ratio will less yearly revenue and less annual growth/projects growth. Their gross margin is a bit better ( 68 to 78 iirc ) but still ",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/louo93u/",
          "created": 1727270822,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loshxky",
      "score": 53,
      "body": "U know what’s extremely funny? I spoke about this issue when they put that dumbass from google in charge. People wanted to suck ramaswamy so badly. Where are they now? \n\n I sold off my position from this shit stock when he was brought on. He is a loser who worked at a successful company but people act like he made google what google is. If I work at Apple and Apple boosts up that doesn’t mean it’s cause of me, it’s because everyone at the company collectively brought the value up. \n\n I do have a bias against Indian CEOS, but it’s not to do with race as it is to do with consult companies such as McKinsey, BCH, and BAIN. These guys put dogs in charge so that these dogs can hire these “consultants” for help. It’s literally quid pro quo. \n\n If they would put people who know the industry and have a track record of amazing innovation I’d love to get behind them. But they hire dogs who will look out for them, not shareholders/ employees/ investors. He’s literally going to get a golden parachute and get a new job at a different company.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loshxky/",
      "created": 1727229457,
      "depth": 0,
      "replies": [
        {
          "id": "lost5gq",
          "score": 30,
          "body": "This exact thing happened with the recent Starbucks CEO, golden parachute and all.",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lost5gq/",
          "created": 1727233986,
          "depth": 1,
          "replies": []
        },
        {
          "id": "losn8do",
          "score": 11,
          "body": "Blind hates his guts",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/losn8do/",
          "created": 1727231528,
          "depth": 1,
          "replies": []
        },
        {
          "id": "losk23v",
          "score": -3,
          "body": "The consulting firm placing a CEO and then that CEO using them has nothing to do with a persons race.",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/losk23v/",
          "created": 1727230275,
          "depth": 1,
          "replies": [
            {
              "id": "losqktb",
              "score": 10,
              "body": "It’s a question of what network they are in and such networks correlate a lot with what elite school you have been to.",
              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/losqktb/",
              "created": 1727232895,
              "depth": 2,
              "replies": []
            },
            {
              "id": "loslfey",
              "score": 33,
              "body": "No, but the only ones getting ceo and board positions as of late are unusually high number of Indian. For every 1 satya you have 10 ramaswamys. Look at Starbucks…. But that’s just an example. I did say I have a bias against them because I don’t believe they got their positions on merit. So take my argument with a mountain of salt.",
              "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loslfey/",
              "created": 1727230811,
              "depth": 2,
              "replies": [
                {
                  "id": "loswq34",
                  "score": 21,
                  "body": "Being Indian and in IT I agree with it. About 70-80% that’s what happens.",
                  "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loswq34/",
                  "created": 1727235576,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lovrys9",
                  "score": 1,
                  "body": "I fully agree. All the big tech companies have this problem. It's rampant and getting worse. At a previous big tech employer I saw the brown nosing and back stabbing first hand.",
                  "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lovrys9/",
                  "created": 1727283645,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "loww20i",
                      "score": 3,
                      "body": "I know it’s the case because I’m in aerospace and keep seeing incompetent managers telling machinists and engineers how to do our job 🫠🫠. They don’t even know what we do. They just know how much we make.",
                      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loww20i/",
                      "created": 1727296044,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "loxug25",
                      "score": 2,
                      "body": "DEI should replace nepotism. Nepotism will destroy a company.",
                      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loxug25/",
                      "created": 1727307801,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lp06v9n",
                          "score": 1,
                          "body": "DEI can get abused too. And just because a company hired minority workers doesn't mean they will all get promoted, or that they will deserve the promotions. I watched someone (minority woman) with zero experience in my niche get a director role, clearly by brownnosing the retired in place SVP who liked to claim he was DEI supportive and really wasn't unless you were sucking up to him, and then she expected the rest of us to train her.  I didn't play along and got laid off. Why should I train someone who is supposed to be my manager? Maybe I should have had the job. \n\nGo look at the org charts of the leaders of most big cap companies and they aren't filled minorities, with FAANG as the exception now that big tech has flooded the USA with h1bs from India.",
                          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lp06v9n/",
                          "created": 1727351037,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lotsyo8",
          "score": -5,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotsyo8/",
          "created": 1727255174,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lot6ogc",
      "score": 5,
      "body": "IF they are certain and they are right about not spending more in R&D and talent pool because of the maturity of cloud data then it can repay well. FCF is irrelevant and honestly if we stick to FCF based valuation, how much did we miss out for the past 10 years and the next 10 years?\n\nIf their NOC doesn’t decline then it might work out, still, it’s not a stock for anyone to invest heavily even if you’re confident. They are not in the essential part but a support role.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lot6ogc/",
      "created": 1727240615,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp4pinj",
      "score": 4,
      "body": "The funny part is their product adoption is only continuing to go through the roof",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lp4pinj/",
      "created": 1727407186,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lovqlsz",
      "score": 3,
      "body": "Another case of horrible stock wonderful product. Using snowflake has saved me countless hours at work I love it. A great tool for businesses, not investors",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lovqlsz/",
      "created": 1727283235,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lotuzas",
      "score": 4,
      "body": "Or they think the stock is super undervalued right now. With lower rates and their current valuation buying back their own stock is a steal. I get the negative sentiment, but imo the valuation was way too high and lots of people got caught bag holding. 110 is a bargain and I'm not going to be surprised if it takes off in these next few months.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotuzas/",
      "created": 1727256593,
      "depth": 0,
      "replies": []
    },
    {
      "id": "losnwu4",
      "score": 9,
      "body": "Insiders selling not a good sign",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/losnwu4/",
      "created": 1727231800,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lotuv9u",
      "score": 2,
      "body": "This was such a hot stock when it IPO'd - Berkshire was in, Slootman is so highly regarded, etc. Now, Slootman is no longer CEO, there's the concerns about security incidents, Berkshire is out, the stock has cratered and they are buying back stock in a manner that's questionable at best.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotuv9u/",
      "created": 1727256517,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lovpuev",
      "score": 2,
      "body": "I'm bag holding 100 shares. Been selling CCs for whatever price it goes for and roll. Snow allocation in my portfolio is small enough that I can carry it for a few years hoping it goes above my cost basis (130). So not booking losses for now.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lovpuev/",
      "created": 1727282998,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp0mivk",
      "score": 2,
      "body": "The only reason for buybacks is when management feels that the ROI is greater than investing in their own product lines.  This can happen when a stock's price is overly depressed, which a case could be made for in SNOW's situation.  A one time data breach is not the end of the world.  However, when management is buying back a fully valued share, that is an admission that they have run out of ideas.  That is the more worrisome situation.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lp0mivk/",
      "created": 1727357436,
      "depth": 0,
      "replies": []
    },
    {
      "id": "louu9mx",
      "score": 1,
      "body": "When it comes to buying back, it's not something we can decide",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/louu9mx/",
      "created": 1727272954,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lowrgr0",
      "score": 1,
      "body": "It's possible they are doing it to finance their own stock-based compensation. I haven't looked at the 10-k so this isn't even a guess, just stating a possibility.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lowrgr0/",
      "created": 1727294631,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lowtvwp",
      "score": 1,
      "body": "Problem with this rant: it hinges on your estimate of intrinsic value being accurate…",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lowtvwp/",
      "created": 1727295378,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loxqxjb",
      "score": 1,
      "body": "So glad that I never took the bait of buying SNOW on the dip.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loxqxjb/",
      "created": 1727306511,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loz9jbe",
      "score": 1,
      "body": "Buybacks helps senior management more than stockholders. Watch for Insider transactions post buy backs. Buy back helps stock retain value and insiders can offload stocks. My past employer they kept buying back and kept stock value high, and slowly CFO and CEO kept selling their stocks. And now company needs cash so they are issuing convertible notes.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loz9jbe/",
      "created": 1727329783,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lph64ft",
      "score": 1,
      "body": "I have 33 shares with a $115 cost basis. Buying whenever it dips to $110 or below. I believe the company has potential, but it’s going to take some time. Hopefully, I can accumulate at least 50 shares before it starts climbing. I hope I’m not wrong, but we’ll see.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lph64ft/",
      "created": 1727609096,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lub3c7b",
      "score": 2,
      "body": "They are like PLTR 4 years ago. Most earnings went to Stock Based Compensation.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lub3c7b/",
      "created": 1730181234,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lotjly5",
      "score": 1,
      "body": "Sold myself on the news, managed to break even and didn’t want to turn it into a losing trade",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotjly5/",
      "created": 1727248562,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lotkrb1",
      "score": 1,
      "body": "Probably the management have bonuses on some stock target",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotkrb1/",
      "created": 1727249351,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lot8fc7",
      "score": 0,
      "body": "Glad I sold this pos for a loss and allocated else where",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lot8fc7/",
      "created": 1727241591,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lotdi40",
      "score": -1,
      "body": "Stock buybacks should be illegal again",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotdi40/",
      "created": 1727244609,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lou7lie",
      "score": 0,
      "body": "5,939 x 154.3 = 916k, not 916m ...",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lou7lie/",
      "created": 1727263920,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lotpw96",
      "score": -2,
      "body": "Wouldn't trust snowflake - data warehouse area has so much competition rn an they haven't innovated. the new stuff they've come up with is very poor and they have stiff competition from databricks",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lotpw96/",
      "created": 1727252995,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loumvl8",
      "score": 0,
      "body": "SNOW is an easy short. They’re going to be delisted.",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/loumvl8/",
      "created": 1727270314,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lot0szl",
      "score": 0,
      "body": "Buying your way through valuation",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lot0szl/",
      "created": 1727237547,
      "depth": 0,
      "replies": []
    },
    {
      "id": "louoc52",
      "score": 0,
      "body": "Terrible management",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/louoc52/",
      "created": 1727270853,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lowkm2x",
      "score": 0,
      "body": "Horrible company with a great product, databricks will be the winner here",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lowkm2x/",
      "created": 1727292535,
      "depth": 0,
      "replies": []
    },
    {
      "id": "losrfoi",
      "score": -1,
      "body": "Holy shit how are the leadership still intact?",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/losrfoi/",
      "created": 1727233252,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lou8l0m",
      "score": -1,
      "body": "it's not really a company, it's a feature",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lou8l0m/",
      "created": 1727264398,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lovd8kw",
      "score": -1,
      "body": "Man these crappy companies are a result of Fed bailouts",
      "permalink": "/r/stocks/comments/1fot1gn/the_insanity_that_is_snows_capital_allocation/lovd8kw/",
      "created": 1727279063,
      "depth": 0,
      "replies": []
    }
  ]
}