{
  "title": "Unity’s Epic Comeback? Betting Big on AI and a New CEO! $U",
  "score": 41,
  "selftext": "I threw a small bet on Unity’s June 2025 call option with a $35 strike. Mainly betting on the upcoming Unity 6 launch that’s supposed to come with AI features—figured I’d try to ride the AI hype. Plus, the new CEO from Zynga seems promising. Dropped $800 on the bet, hoping he can turn things around. The guy’s got solid gaming industry experience, and most of Unity’s clients are in gaming anyway.\n\nAlso thinking the Fed rate cuts and China’s stimulus will help push things up. I’m shooting for a 5x return at least. Unity’s stock has tanked over 90%, so I’m hoping it’s time for a comeback, maybe even a big one if the new CEO nails it.\n\nhttps://preview.redd.it/z4p3ioxzbxqd1.png?width=353&format=png&auto=webp&s=5f50adf539ba3c98f23bd81a59d0f5772a991e71\n\n",
  "link_flair_text": "Discussion",
  "id": "1fozsnx",
  "num_comments": 37,
  "created_utc": 1727254177,
  "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/",
  "comments": [
    {
      "id": "lotrk7h",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 26 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lotrk7h/",
      "created": 1727254180,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lousxzr",
      "score": 26,
      "body": "They fired the whole old director board and Unity 6 is promising. New pricing model is half what Unreal costs. Everytime I see a unity bear they speak of old news and vague terms that business doesn't care. Trust them if you want but in a year nobody remember the old scanal anymore.",
      "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lousxzr/",
      "created": 1727272502,
      "depth": 0,
      "replies": [
        {
          "id": "lovfhkj",
          "score": 10,
          "body": "No, but the trust is still gone from developers, who have moved to other platforms, that’s a one way, one time decision. You aren’t getting those people back. The market isn’t Unitys customer base, developers are.\n\nThe new CEO is from ZYNGA. Bearish.",
          "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovfhkj/",
          "created": 1727279763,
          "depth": 1,
          "replies": [
            {
              "id": "lovkg4n",
              "score": 2,
              "body": "There is no metric for \"trust\". Perhaps some indie developers you know and the reddit comments from people who dont even make games. But big corps with their mobile and VR projects dont care about anything other than revenues. The engine is also easy to learn and train for staffs with good documentation. Unity 6 is missing only that nice LOD generation feature of Unreal 5. In exchange it offers competitive pricing and the dev team has been listening very well to their userbase. If Godot was so good, Unity will be screwed hard by now but from what we have seen, it just serves as a cheap, non-intuitive, slow and buggy alternative with a mental head lead dev.\n\nI hope it gets acquired by META or MFST actually, but the company and their product are not going away anytime soon.",
              "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovkg4n/",
              "created": 1727281318,
              "depth": 2,
              "replies": [
                {
                  "id": "lownb3n",
                  "score": 3,
                  "body": "sure there is. subcription churn is a reasonable metric for trust. i havent checked their subscription numbers going back several quarters, but i expect there has not been huge negative impacts.",
                  "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lownb3n/",
                  "created": 1727293365,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "low854k",
          "score": 1,
          "body": "Do you have a PT in a year?",
          "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/low854k/",
          "created": 1727288641,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "low12mv",
      "score": 9,
      "body": "Anything Motley Fool suggests to premium users is a sure loss, Cathy Woods still has a lot to learn.",
      "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/low12mv/",
      "created": 1727286452,
      "depth": 0,
      "replies": [
        {
          "id": "loy4mu4",
          "score": 1,
          "body": "When did those fools suggest that? If they did it in June then they missed out on a 60% rise in the share price.",
          "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/loy4mu4/",
          "created": 1727311550,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loujw3v",
      "score": 16,
      "body": "Admittedly, I follow Unity news more as a consumer of games than as an investor.  But I'd be concerned for the long term health of the company.  They really shook their developers down with the announcement of \"per download\" charges, and that scared a lot of those developers away.  They obviously realized they tried to boil the frog too fast, walked back their decision to monetize downloads and pivoted CEOs, but I don't think anything they do will heal the brand damage.  Developers with current projects are kind of stuck as it's a huge undertaking to completely rewrite your game on another platform, but how are they going to attract new developers and sustain long term growth when they've put the development community on edge?  I don't think they will ... I think we've seen the peak of Unity and it's all dead cat bounces from here.",
      "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/loujw3v/",
      "created": 1727269181,
      "depth": 0,
      "replies": [
        {
          "id": "lov3mx1",
          "score": 11,
          "body": "The entire exec suite has been swapped out since the announcement was rolled back. I don't really buy the \"once the trust is broken it is gone forever\" in the context of companies, which are made up of ever-changing humans with different & evolving perspectives.",
          "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lov3mx1/",
          "created": 1727276035,
          "depth": 1,
          "replies": [
            {
              "id": "lovgjxd",
              "score": 4,
              "body": "I said this in another comment but if your customer base are largely independent studios you aren’t changing any hearts or minds by swapping out the suit. The market has a short memory but many of these studios projects are measured in years, with some taking half a decade or more. \n\nOnly the market gives a shit about the c-suite. Most customers aren’t interacting with the people you’re referring to. The devs that have already left the platform aren’t coming back and an entire generation of game developers now have a tribal “don’t use unity use godot” mentality. I think you fail to appreciate how hard gamers feel they are oppressed.",
              "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovgjxd/",
              "created": 1727280091,
              "depth": 2,
              "replies": [
                {
                  "id": "lovi513",
                  "score": 9,
                  "body": "the exodus to godot is overstated and overblown. godot is still far behind Unity. Studios didn't change engines, hobbyists did.",
                  "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovi513/",
                  "created": 1727280597,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lovks25",
                      "score": 1,
                      "body": "All we have to talk about are anecdotes anyway, but my point is that gamers and devs are some of the worst, most emotional, irrational consumers in existence. Studios are less and less of the overall pie every year, a trend that will continue as barriers to publishing continue to be solved by new distribution mediums. Good will goes a long way in this market.\n\nAgain, im not saying Unity will fail as a company. But they will not be an industry leader.",
                      "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovks25/",
                      "created": 1727281422,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "loy4x3m",
                          "score": 2,
                          "body": "They were never industry leaders anyway, that was Unreal engine and still is.",
                          "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/loy4x3m/",
                          "created": 1727311655,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lovhexb",
                  "score": 1,
                  "body": "I think you touched on an important point as well - it's not easy to swap game engines since projects are measured in years. Many Unity users begrudging continued to use the engine despite the run time fee fiasco. I suspect they will re-evaluate their needs when their projects are released but I don't expect studios to be acting irrationally because of a moral grudges... \n\n  \nIMO a game developer setting out today deciding to use Godot to create the same types of mobile games Unity is capable of is not a serious developer. Godot is not a 1:1 port of everything Unity or UE is capable of, at least not yet.",
                  "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovhexb/",
                  "created": 1727280368,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lovl950",
                      "score": 2,
                      "body": "Anyone who genuinely thinks devs whole sale swapped engines for ongoing development is on crack. I don’t think the full effects of the Unity fiasco have been felt for exactly that reason. I think that gives Unity some time to ameliorate some of those relationships, but I definitely believe there’s more than one studio making the decision to use Unreal for their next title.",
                      "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovl950/",
                      "created": 1727281571,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "low5fpw",
      "score": 5,
      "body": "Lol, I finished reading this post, feel pretty good abt my bag holding Unity at $120.00/ piece, then it dropped again just 30min ago. I have no words on how a post on WSB can move a ticker lol.",
      "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/low5fpw/",
      "created": 1727287797,
      "depth": 0,
      "replies": [
        {
          "id": "loy53mt",
          "score": 3,
          "body": "I don't think it will get back up to 120 for years.",
          "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/loy53mt/",
          "created": 1727311723,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lozft3f",
          "score": 2,
          "body": "Want to pay your respect to the new Wall Street influencer?![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lozft3f/",
          "created": 1727333734,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvzcanp",
          "score": 1,
          "body": "I'm just praying for it to go to 27 at least so I can finally get rid of it. I don't even care of future performance anymore",
          "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lvzcanp/",
          "created": 1731019796,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lovysjp",
      "score": 3,
      "body": ">September 2024\n\n>AI hype\n\n  \nwhat?",
      "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovysjp/",
      "created": 1727285753,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lovclzx",
      "score": 4,
      "body": "It’s already +40% from its lows",
      "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovclzx/",
      "created": 1727278867,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lov6rbq",
      "score": 4,
      "body": "I sold as soon as I saw this. Thanks op for letting me know when to sell ;-)",
      "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lov6rbq/",
      "created": 1727277027,
      "depth": 0,
      "replies": []
    },
    {
      "id": "low76dx",
      "score": 1,
      "body": "It shit the bed lol",
      "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/low76dx/",
      "created": 1727288341,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loy45hb",
      "score": 1,
      "body": "Probably to late, it already got up by nearly 60% over the last 2 months. \n\nAI assistance, if that what they are really introducing in Unity, make sense in software. ChatGPT is already helping me in unity, a dedicated one built within the software, trained on the software could be even more powerful.",
      "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/loy45hb/",
      "created": 1727311374,
      "depth": 0,
      "replies": []
    },
    {
      "id": "louqfse",
      "score": -3,
      "body": "Yeah it’s a massive L if you go for Unity. They just burned their good will with consumers. The fallout has yet to fully go into effect. Take Hoyoverse as an example. Genshin Impact and ZZZ are built on Unity, but upon the news of Unity’s pricing fiasco they started hiring game engineers out the ass. Either they’re going to make their own in house engine or switch to Unreal. When that happens, Unity’s stock is gonna plummet.",
      "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/louqfse/",
      "created": 1727271624,
      "depth": 0,
      "replies": [
        {
          "id": "lov9p2w",
          "score": -1,
          "body": "> Genshin Impact and ZZZ are built on Unity, but upon the news of Unity’s pricing fiasco they started hiring game engineers out the ass. Either they’re going to make their own in house engine or switch to Unreal.\n\nThere's not many studios running in-house engines these days. Even CD Projekt Red who had a solid in-house engine switched to Unreal. That being said there's no reason for me to see why the past actions of the former CEO will affect the new Unity 6.\n\nTo add, you don't just switch engines on an already built game. Genshin is unity and they can't switch till they release their next game. It's more likely they incorporate Unity 6 features into their already built games.",
          "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lov9p2w/",
          "created": 1727277950,
          "depth": 1,
          "replies": [
            {
              "id": "lovaofm",
              "score": 1,
              "body": "Several misconceptions you’re making. Given that Unity’s pricing restructure was going to specifically affect mobile games, especially ones like Genshin, it’s likely that Hoyo would do a cost benefit analysis and deduce that rebuilding the engine would ultimately save money compared to Unity’s insane pricing. BUT even moreso, it’s that more games in the future are going to avoid Unity due to this shift in public perception and developer persepction around the engine.",
              "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovaofm/",
              "created": 1727278258,
              "depth": 2,
              "replies": [
                {
                  "id": "lovepee",
                  "score": -1,
                  "body": "Yes but everything you’ve said would affect these games has since been walked back. It is likely future games will avoid it but I think given the changes at the top of the company, it doesn’t seem likely that the in the long term Unity will be phased out. \n\nIf the pricing structure was seen to completion I have no doubt that games like Genshin may have been rebuilt (however I still find that unlikely), but given that the pricing structure was nipped in the bud, I don’t see it affecting games currently using Unity. To add, there’d be no reason to implement new unity features to those games as Unity releases them.",
                  "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovepee/",
                  "created": 1727279518,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lovfjo2",
                      "score": 2,
                      "body": "You fail to recognize that the “walking back” doesn’t un burn the bridges that Unity burnt. They just made a change that puts an entire project at risk. Now during the decision making process for games, Unity will be viewed as a potential liability. \n\nGiven that they already risked making one change, they will likely risk making another at some point.  Watch and learn.",
                      "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovfjo2/",
                      "created": 1727279780,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lovh9tg",
                          "score": 0,
                          "body": "I think you fail to take into account the changes at the top. If there wasn’t a new CEO I would be more inclined to agree with you. I understand it doesn’t in burn those bridges but it is an extremely well established engine a majority of developers have experience with. I may be wrong of course but I don’t think it is as cut and dry as you are making it out to be. There’s ample opportunity for them to grow (or fail) again.",
                          "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovh9tg/",
                          "created": 1727280322,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lovi78x",
                              "score": 0,
                              "body": "Yeah they aren’t gonna magically fix their financial issues due to having a new CEO. They COULD make a turn around, but that’s incredibly unlikely given the damage they’ve caused to their brand and reputation.",
                              "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovi78x/",
                              "created": 1727280616,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lovhkpt",
                      "score": 2,
                      "body": "This entire argument lives in the fantasy that because it was never enacted there was no lasting fallout in trust, like the act of replacing a ceo and walking back a bad policy had no impact. That’s a stretch. Unity 6 may be successful but I don’t see Unity being the industry leader, ever.",
                      "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovhkpt/",
                      "created": 1727280419,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lovj7a4",
                          "score": 2,
                          "body": "I think it all comes down to what we think game studios decisions will be. Unity is a well established engine. At worst you’re looking at studios moving to Unreal but I don’t see many studios developing their own engine. That’s a big risk that a vast majority of developers probably won’t take. Same outcome either way if they move to Unreal of course. I just don’t see many companies totally jumping ship if they have a lot of talent that has experience with unity. I could of course be wrong but we are speculating here.",
                          "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/lovj7a4/",
                          "created": 1727280928,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "loy5glg",
                  "score": 0,
                  "body": "An they would reevaluate that view regularly. They may have change their minds since then.",
                  "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/loy5glg/",
                  "created": 1727311855,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "loy5bny",
          "score": 0,
          "body": "Or they will reevaluate and decide to stay with Unity.",
          "permalink": "/r/wallstreetbets/comments/1fozsnx/unitys_epic_comeback_betting_big_on_ai_and_a_new/loy5bny/",
          "created": 1727311805,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}