{
  "title": "Boeing losing '$100 million to $150 million a day' as union strike rolls on",
  "score": 1445,
  "selftext": "Boeing (BA) finds itself stuck between a rock and a hard place as the labor strike between it and the International Association of Machinists (IAM) union nears a second week.\n\nOn Monday, Boeing upped its offer to the union, which represents 33,000 workers, but did not proceed through union leadership and instead sent a \"best and final\" offer directly to workers, which didn’t sit well with the IAM. Boeing’s latest offer upped pay hikes to 30% from 25% in the prior offer, doubled a signing bonus to $6,000, and increased 401(k) contributions, among other things.\n\n\"The survey results from yesterday were overwhelmingly clear, almost as loud as the first offer: members are not interested in the company's latest offer that was sent through the media,\" IAM said in a statement late Tuesday night. \"Many comments expressed that the offer was inadequate and the company's decision to bypass the Union was viewed as disrespectful.\"\n\nEarlier, IAM said it contacted Boeing to engage in “direct talks” after the offer, which the company refused. Therefore, the union said it would not be holding a vote on the proposal.\n\nNevertheless, Boeing’s insistence on going directly to union members speaks to the difficulty the company is in, said Anita Mendiratta, an aviation and tourism expert at consulting firm AM&A.\n\nIAM union workers also know they have public support behind them, as big labor has seen its popularity grow, while Boeing has seen its standing suffer. The union is in a “very strong position,” Mendiratta said, as the strike not only puts financial pressure on Boeing but also hurts Boeing on a “reputational level” too.\n\nWith the strike hitting Boeing’s bottom line by as much as $1.8 billion thus far, the plane maker needs to make a deal soon. Boeing shares are already down an astounding 40% year to date.\n\nShareholders hope Boeing and new CEO Kelly Ortberg can make a deal and reverse the cash drain by the time the plane maker is expected to report third quarter earnings at the end of October.\n\n“Boeing is already having to do some significant re-examination of the financials of the organization. To put this in context, every single day that Boeing is on strike, they’re losing between $100 million and $150 million,” Mendiratta said to Yahoo Finance.\n\nWithout union workers based in Boeing’s Renton, Wash., assembly facility, Boeing cannot deliver its 737 Max jets, which are the company’s cash cow. Boeing is still able to deliver its 787 Dreamliner out of its non-union South Carolina facility; however, those jets are limited in number. In the second quarter, Boeing delivered 70 737 Max jets, but only nine of the larger Dreamliners.\n\nMendiratta, who is also special adviser to the UN Tourism Secretary-General, said disruptions in Boeing not only hurt the American plane maker but also the aviation industry as a whole.\n\n“It’s not just Boeing that’s in trouble — the entire global aviation system is in trouble because it relies on Boeing for 4 in 10 commercial aircraft as well as what it delivers in its other divisions,” Mendiratta said. “When there is a delay in the delivery of aircraft, and there are many airlines that are having delays, it means that the entire global aviation ecosystem is going to suffer, as is the global traveling public.”\n\nMendiratta doesn’t see the union bending here, at least not in the short term. Boeing put workers in a difficult position that led them to strike in the first place, she said, and emotions are running high following Boeing’s latest move to circumvent IAM leadership.\n\nIAM union workers also know they have public support behind them, as big labor has seen its popularity grow, while Boeing has seen its standing suffer. The union is in a “very strong position,” Mendiratta said, as the strike not only puts financial pressure on Boeing but also hurts Boeing on a “reputational level” too.\n\nWith the strike hitting Boeing’s bottom line by as much as $1.8 billion thus far, the plane maker needs to make a deal soon. Boeing shares are already down an astounding 40% year to date.\n\nShareholders hope Boeing and new CEO Kelly Ortberg can make a deal and reverse the cash drain by the time the plane maker is expected to report third quarter earnings at the end of October.\n\nhttps://finance.yahoo.com/news/boeing-losing-100-million-to-150-million-a-day-as-union-strike-rolls-on-130406155.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAANAWQmHD0UzqhKnTVDPsFleXumbn6G1xmOLNZ1qIpyvkppimRiyy_gjOLPw696DvbAlA3BFaU-DOlU9IwEQJpP0atQzCVt4lS1sxV8XLSzzpstngGWXUTGlg_Bo8vCePljmQbLBpTO6RRHhZIbX_vL4VeUmcoErS1aaCJzzp8ds6",
  "link_flair_text": "Company News",
  "id": "1fp6x3r",
  "num_comments": 283,
  "created_utc": 1727277293,
  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/",
  "comments": [
    {
      "id": "lovaqp8",
      "score": 630,
      "body": "Pretty shocked they are ONLY down 40% YTD with everyone that’s happened",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovaqp8/",
      "created": 1727278279,
      "depth": 0,
      "replies": [
        {
          "id": "lovd209",
          "score": 369,
          "body": "being backed by a superpower that won't let you fail is enticing to buyers",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovd209/",
          "created": 1727279006,
          "depth": 1,
          "replies": [
            {
              "id": "lovjrq5",
              "score": 178,
              "body": "The issue is even if the US bails out Boeing, there is no guarantee that they will do so in a way that protects shareholders. For example, they may do a GM-style bailout, where the corporate entity goes through bankruptcy, but then there is a new company with the same assets/employees that the government owns(and then eventually sells off)",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovjrq5/",
              "created": 1727281107,
              "depth": 2,
              "replies": [
                {
                  "id": "lovyl4g",
                  "score": 89,
                  "body": "> The issue is even if the US bails out Boeing, there is no guarantee that they will do so in a way that protects shareholders.\n\nWhy do the shareholders need to be protected? \n\nInvesting has risks, one of which is the failure of the business you invest in. The reason shareholders are entitled to profits is because of the risk they take by investing.\n\n If the government eliminates risk from the market, it’s no longer capitalism. That promotes inefficiency which harms more people in the long run.",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovyl4g/",
                  "created": 1727285689,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lowxf69",
                      "score": 43,
                      "body": "Shareholders should not be protected.\n\nBut retail buying Boeing because its government backed are in for disappointment.  Not only does the bailout require a lot of stipulations that limit flexibility, in the case of bankruptcy all equity is wiped out ala GM 2008 when investors got ZERO.  Buying too big to fail in most cases is not a valid stock investing strat.\n\nLook at a lot of financials, big auto, boeing post 2008, intel which all underperformed the index.\n\nThat doesn't mean Boeing is close to bankruptcy or not a potential good buy at this time.",
                      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowxf69/",
                      "created": 1727296459,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "loz3k12",
                      "score": 12,
                      "body": ">If the government eliminates risk from the market, it’s no longer capitalism. That promotes inefficiency which harms more people in the long run.\n\n\"Socialism for the rich, capitalism for the poor\"",
                      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loz3k12/",
                      "created": 1727326387,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lozm7n5",
                          "score": 9,
                          "body": "Letting Boeing go through a GM style bankruptcy is literally the opposite of this\n\nInvestors would get hosed while workers would be safe",
                          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lozm7n5/",
                          "created": 1727338205,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "loz857u",
                          "score": 4,
                          "body": "Which is why Boeing needs to be allowed to fail and wipe out investors.",
                          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loz857u/",
                          "created": 1727328964,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lp0jls1",
                      "score": 8,
                      "body": "It’s the law, when Henry Ford tried to raise wages and living standards for his workers Dodge sued which happened in 1919 and the Supreme Court ruled that a company must do what’s best for the shareholders, not its employees or customers. It explains the majority of behavior from corporations to this day.",
                      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp0jls1/",
                      "created": 1727356365,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lp1hrvg",
                          "score": 2,
                          "body": "> that a company must do what’s best for the shareholders\n\nBased",
                          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp1hrvg/",
                          "created": 1727367552,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lovsqv4",
                  "score": 32,
                  "body": "Main difference is that Boeing is far more important than GM to the country, and arguably to the world.\n\nYou really do not want to have to rely solely on Air Bus, or up and coming Chinese passenger planes.\n\nThere are a lot of issues in the company, but at the same time you don't want to fuck around too much such that the company becomes crippled for the next decade or so.",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovsqv4/",
                  "created": 1727283889,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lovv20d",
                      "score": 95,
                      "body": "It needs to be broken up. The industry was better when Boeing had to compete with companies like McDonnell Douglas. \n\nBoeing becoming too big to fail, and receiving protection in the form of guaranteed bailouts by the government, is why it sucks now. Capitalism doesn’t work if there isn’t competition and failure of uncompetitive business. You need antitrust regulations and actual competition for capitalism to work.",
                      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovv20d/",
                      "created": 1727284605,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "loy2tdj",
                          "score": 7,
                          "body": "The Welch disciples also had a fair contribution to the downfall, both in terms of relationship with their employees and focus on short term performance.  McNerney torched the relationship with the unions, goodwill was long gone before these last three CEOs",
                          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loy2tdj/",
                          "created": 1727310882,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "loycwcx",
                          "score": 5,
                          "body": "The problem is that laws already failed, Boeing buying everything left and right already cannibalized the market, antitrust already failed. Boeing being as tied up as it is in politics as a job thing, and having that foothold probably also made the C-suite not give a shit, as they'd know how politically sensible it is, and it simply not being allowed to fall.  \n  \nBombardier and Embraer went into completely different markets as Boeing and Airbus decked it out in the big airliner market, and apparently it still isn't interesting to either.",
                          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loycwcx/",
                          "created": 1727314671,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "loys6dy",
                              "score": 3,
                              "body": "A company doesn’t even need to buy others to corner the market, just do what the telecoms did and promote tons of bullshit regulations to make it so hard to get into the business you essentially stop any new competition. \n\nPeople think regulations help competition but with the level of corruption these days it’s actually the opposite.",
                              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loys6dy/",
                              "created": 1727320836,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lowv3wc",
                          "score": -5,
                          "body": "It doesn't work when the fed keeps printing trillions and giving it to their buddies via congress.   I'm sick of working man.  I don't see the point.",
                          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowv3wc/",
                          "created": 1727295756,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "loxqney",
                              "score": 3,
                              "body": "Don't give into cynicism. I know you're tired, it's ok we all are. We'll weather this storm.",
                              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loxqney/",
                              "created": 1727306409,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "loxnbsw",
                      "score": 6,
                      "body": "that doesn't change the fact that original share holders can still get wiped out with a bailout",
                      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loxnbsw/",
                      "created": 1727305193,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "loxwezs",
                          "score": 1,
                          "body": "While I believe a company like Boeing should not just be chasing share prices, there are a lot of issues if the share prices just tank that significantly interfere with the operations of a company.\n\nThe ideal situation isn't to cause Boeing investors to bleed out, but to make sure Boeing is a solid competitor to Airbus and up and coming Chinese planes.",
                          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loxwezs/",
                          "created": 1727308525,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "low2nrd",
                      "score": 6,
                      "body": "Why would any of that affect shareholder outcomes?",
                      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/low2nrd/",
                      "created": 1727286940,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "loxphr8",
                      "score": 5,
                      "body": "Your investment can still be garbage and not go bankrupt lol",
                      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loxphr8/",
                      "created": 1727305988,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lozpe5x",
                  "score": 1,
                  "body": "Not true. Boeing Shareholders are the same as arm suppliers to the US and essential for geo-political interest. Boeing won’t fall and their stock price will be fine. You cannot let (indirectly) the entire defense supply chain collapse.",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lozpe5x/",
                  "created": 1727340453,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lovgblg",
              "score": 19,
              "body": "Intel and Boeing reaping the rewards of hiring retired military officers",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovgblg/",
              "created": 1727280020,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lovhbg3",
              "score": 6,
              "body": "It more so it looks like Boeing just wants to be broken up into two companies",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovhbg3/",
              "created": 1727280336,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lovjla7",
              "score": 6,
              "body": "What does that do for shareholders?  They didn't let GM fail...",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovjla7/",
              "created": 1727281051,
              "depth": 2,
              "replies": [
                {
                  "id": "lovt1pq",
                  "score": 12,
                  "body": "The old shares are for the bankrupt company. You’re left holding the bag.",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovt1pq/",
                  "created": 1727283985,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lovwo6q",
                  "score": 13,
                  "body": "GM’s stock as it existed prior to the bailout was removed from the markets and had to trade over the counter in 2009 (as Motors Liquidation Company).\n\nA new entity was formed and purchased the bankrupt GM’s assets and was then listed on the market in like 2010 I think.\n\nBasically the old shareholders got wiped out, the US government formed and owned most of new GM, which it eventually sold (I think for an overall loss).\n\nBeing a shareholder has risk, one of which is the failure of the business you invest in. That risk is why shareholders are entitled to profits. That’s true capitalism.\n\nTLDR the shareholders and tax payers got screwed. Uncompetitive entities need to fail and be removed from the market.",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovwo6q/",
                  "created": 1727285100,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lowu64j",
                  "score": 4,
                  "body": "They did. Obama took all of our shares and paid out only 11% on the bonds. ",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowu64j/",
                  "created": 1727295465,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lowh0ii",
              "score": 2,
              "body": "General Motors has entered the chat",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowh0ii/",
              "created": 1727291420,
              "depth": 2,
              "replies": []
            },
            {
              "id": "loxc6k1",
              "score": 1,
              "body": "That and the media likes dramatize a lot of what's happening. People probably have a grimmer outlook than what's actually happening on paper.",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loxc6k1/",
              "created": 1727301221,
              "depth": 2,
              "replies": []
            },
            {
              "id": "loyfukr",
              "score": 1,
              "body": "…for the bondholders",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loyfukr/",
              "created": 1727315812,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lovndjw",
          "score": 33,
          "body": "I'm shocked that Boeing ever recovered to $260 a share by the start of the year. No clue what investor in their right mind ever thought it was worth that, the last time Boeing had a profitable quarter was Q2 2022, and that was just barely profitable, they've had losses as large as -$7.02 a share in the last 3 years, and 5 whole quarters with losses in excess of $1 a share.\n\nBoeing these days is the definition of a Zombie company.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovndjw/",
          "created": 1727282237,
          "depth": 1,
          "replies": [
            {
              "id": "lovof2x",
              "score": 18,
              "body": "I think their massive stock buybacks might have artificially inflated the stock price",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovof2x/",
              "created": 1727282559,
              "depth": 2,
              "replies": [
                {
                  "id": "loxlplm",
                  "score": 1,
                  "body": "Lets say they bought back every share except for 1. Do you think that one share should be worth $200 and it trading at anything above that being artificial?    \nOr is that one share perhaps more valuable because it now represents a bigger piece of the potential future earnings (however much of a gamble you might think that is)",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loxlplm/",
                  "created": 1727304612,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lowf5or",
              "score": 4,
              "body": "This. Plus there are a billion other companies that are better buys right now.....makes me wonder who is buying Boeing....very sus",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowf5or/",
              "created": 1727290836,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lowex6i",
          "score": 6,
          "body": "Seriously. Who the fuck is buying Boeing stock right now?",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowex6i/",
          "created": 1727290761,
          "depth": 1,
          "replies": [
            {
              "id": "loy9ulm",
              "score": 3,
              "body": ">To buy when others are despondently selling and to sell when others are greedily buying requires the greatest fortitude and pays the greatest reward.\n\n\\~\\~John Templeton\n\nEDIT -- leave it to /r/stocks to downvote a statement from one of the great investors of all time. but then again, /r/Bogleheads also has downvoted quotes from Jack Bogle so perhaps I shouldn't be surprised.",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loy9ulm/",
              "created": 1727313508,
              "depth": 2,
              "replies": [
                {
                  "id": "lpm4iak",
                  "score": 1,
                  "body": "This. It’s indeed very risky but Boeing may still reward you with a long enough time horizon.",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lpm4iak/",
                  "created": 1727678191,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lowujod",
          "score": 4,
          "body": "Same. I don't know why anyone even owns these shares anymore. They can't get out of their own way!",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowujod/",
          "created": 1727295581,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lovn9c0",
          "score": 19,
          "body": "My dad, a boomer, once told me in the late 2010’s that Boeing was a better investment than AMD (I had told him to buy AMD at $2.50 in 2017) because the US government had a vested interest in keeping Boeing alive at all costs. \n\nWhile I could’ve bought a house by now had I followed through on that investment, i instead listened to him and did the safe play. Thankfully I switched once I got control of that custodial account in 2020 and I’m up 100+ %",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovn9c0/",
          "created": 1727282200,
          "depth": 1,
          "replies": [
            {
              "id": "lovt11a",
              "score": 34,
              "body": "Your dad was not wrong when he said that... No one knows Boeing with a duopoly would fuck up so bad .. it had the entire market cornered with only one competitor.. a market that was growing and with high barriers of entry... Compare that to AMD which was in free fall and competing with Intel and NVIDIA... Nine out of 10 people would have done what he did at that time. Now.. AMD is a better company but given the AI growth and competitive and how expensive the stocks are... If you have a long time horizon... Boeing might still be a better stock than AMD today depending on what has been factored in. But Boeing is a badly run company with lots of systemic issues .. so I will not invest in it personally.",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovt11a/",
              "created": 1727283979,
              "depth": 2,
              "replies": [
                {
                  "id": "lovtrzs",
                  "score": 0,
                  "body": "I have no problem with believing that Boeing might be an interesting long play given its value has pretty much halved in a year. However, I don’t know enough about corporate structures to have any feeling that Boeing cannot fail. Like, it’s a good play if Bleing will definitely be here, but you could’ve said that about Intel until Monday when rumors started that Qualcomm was going to make a play for the design division. \n\nLike, Boeing’s main money maker is their contracting division. It’s a good long play IF that division never gets bought, but could Lockheed swoop in and make an offer to carve out a slice of the company? Could someone else? What happens if Boeing suddenly only makes some government stuff and their flailing commercial division?",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovtrzs/",
                  "created": 1727284212,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lowe0fh",
                      "score": 6,
                      "body": "Any company can fail ... It just felt like Boeing was a pretty safe bet in a duopoly market until all their quality issues came to the fore front... Intel was also a dominant player but it was in a tech ancillary area... They missed the mobile shift. Arm was gaining ground and lot of the foundry job was moving towards TSMC and GPUs were  better at AI matrix operations. I am not pro Boeing and I am losing money in Intel... But hindsight is always 100 percent correct. Just that what your dad said .. was not off the mark given where things stood then.",
                      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowe0fh/",
                      "created": 1727290474,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lovxw6x",
              "score": 9,
              "body": "your dad was right but the problem with alot of advise from older to young people is that their investment perspective is dictated by when they pay attention to the market. Right now AMD and NVDA are great plays but 10 years ago it wasn't. So even if you had a little kid and tell them about ai and crypto it might not be true in 20 - 30 years.",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovxw6x/",
              "created": 1727285477,
              "depth": 2,
              "replies": [
                {
                  "id": "lowjvex",
                  "score": 6,
                  "body": "His dad was not right. Just because the US needs a company to survive does not mean they need the company to thrive. \n\nIn my experience it seems like older people generally assume that household names are good investments (GM, Delta, American Airlines, Sears) and that any company that isn't a household name cannot compare. \n\nAMD was absolutely a great play in 2016 (poster said 2017, but they are a year off if they were buying at 2.50). \n\nJan 7 2015: $2.63\n\nJan 1 2016: $2.77\n\nJan 6 2017: $11.29\n\nJan 5 2018: $12.19\n\nJan 4 2019: $17.55\n\nJan 3 2020: $48.03\n\nAnd then covid + tech shortages + AI led us to today. \n\nThe gains from 2016-2020 were pretty much entirely due to their Zen CPUs and entirely unrelated to AI.\n\nBecause of the x86 licensing, no new companies could pop up and make x86 CPUs. AMD could not be acquired, because the license would not transfer, which would have prevented anyone from being interested in acquiring them.",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowjvex/",
                  "created": 1727292310,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lovsyvf",
              "score": 8,
              "body": "Listening to boomers on stock is like following tips from a taxi driver. They have no idea how to invest, and most got rich off selling their bloated house value to the next generation.\n\n\nI mentioned FB, Amzn, and many of the current tech companies to my parents before. They laughed at the idea of those companies growing fast, not laughing now..",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovsyvf/",
              "created": 1727283960,
              "depth": 2,
              "replies": [
                {
                  "id": "lowfxas",
                  "score": 7,
                  "body": "My inlaws made 6.5mm off the sale of a company 10 years ago and they told me to buy GE stock back in 2016 (which is basically at the same level now, so your investment would have gone down for awhile and then gone back tot he same place). They also put at least half, if not more, of their money in bonds.....never listen to boomers\n\nBoomers just got lucky in a booming economy- made money in housing, businesses, etc. because there was such little competition 40 years ago",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowfxas/",
                  "created": 1727291077,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "loyyphy",
                      "score": 4,
                      "body": "Don't forget being able to lock in 30Y risk-free rates at 15%.  Some will say mortgages were high but the difference is the government cannot modify the interest once you get it.\n\nYou can refi and they did.  Rates kept going lower and lower.\n\nAnd now we are fucked and have to print our way out because they spent like crazy while refusing to pay for it with taxes.",
                      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loyyphy/",
                      "created": 1727323896,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lowxswn",
          "score": 1,
          "body": "Stock has barely moved the last couple weeks I shorted it at $160 and sold at $152 because it has such strong support at that level. Once a deal is reached this stock is going to jump 20%+ in the short term but tank on their October earnings report",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowxswn/",
          "created": 1727296576,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loyyj4u",
          "score": 1,
          "body": "Aren't they deemed as \"too big to fail\" though, because of all the defense/commercial contracts they have?",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loyyj4u/",
          "created": 1727323809,
          "depth": 1,
          "replies": [
            {
              "id": "lozt0o8",
              "score": 2,
              "body": "That’s the thinking but when your aircraft are malfunctioning repeatedly and you steamed astronauts in space you just might lose your juicy gov contracts",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lozt0o8/",
              "created": 1727343023,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lovhmim",
      "score": 146,
      "body": "Pretty terrible execution when they only have one competitor.  It should be a slam dunk to make decent profit for good ol Boeing lol.. It was ran by idiots, hopefully the new CEO can turn things around",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovhmim/",
      "created": 1727280435,
      "depth": 0,
      "replies": [
        {
          "id": "lowgt3p",
          "score": 22,
          "body": "Clearly step 1 should be a rebrand.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowgt3p/",
          "created": 1727291355,
          "depth": 1,
          "replies": [
            {
              "id": "loyoy1w",
              "score": 13,
              "body": "Drop the “e” and “i” and just call it Bong Air.",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loyoy1w/",
              "created": 1727319441,
              "depth": 2,
              "replies": [
                {
                  "id": "loyucx4",
                  "score": 7,
                  "body": "Pilot takes fat bong ripp* \"Folks, we've just hit our cruising altitude of CLOUD 9\"",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loyucx4/",
                  "created": 1727321824,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "loyn1dj",
              "score": 2,
              "body": "Rebrand to AAircar. Firstly that puts them one letter ahead in the Yellow Pages, secondly we don't like buses/public transit in America, so it's a car instead. Nobody wants to be a bus wanker. The extra A stands for \"American\" obviously.",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loyn1dj/",
              "created": 1727318656,
              "depth": 2,
              "replies": [
                {
                  "id": "loz2wi9",
                  "score": 1,
                  "body": "AAIAircar, because AI technology is the cool new thing.",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loz2wi9/",
                  "created": 1727326041,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp104uh",
                      "score": 2,
                      "body": "New tagline: \"Putting the AI in Airplane.\"\n\nStock goes up 420% overnight",
                      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp104uh/",
                      "created": 1727362037,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "loycxwz",
          "score": 8,
          "body": "They have more then one competitor.\n1. Commercial space is airbus and Embraer\n2. Space you SpaceX, blue origin, luna, etc\n3. Defense you have lockheed, rtx, Bae, etc",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loycxwz/",
          "created": 1727314687,
          "depth": 1,
          "replies": [
            {
              "id": "lp0irjl",
              "score": 1,
              "body": "Rtx doesn't make planes do they",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp0irjl/",
              "created": 1727356051,
              "depth": 2,
              "replies": [
                {
                  "id": "lp15454",
                  "score": 2,
                  "body": "They make airplane engines",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp15454/",
                  "created": 1727363617,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp1gfjb",
                      "score": 1,
                      "body": "That helps Boeing",
                      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp1gfjb/",
                      "created": 1727367138,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lp1git5",
                          "score": 2,
                          "body": "Boeing engines are roll royce",
                          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp1git5/",
                          "created": 1727367166,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lp1h0yg",
                              "score": 1,
                              "body": "Lol they are all 3 and not much Rolls-Royce",
                              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp1h0yg/",
                              "created": 1727367321,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lp1mkxx",
                                  "score": 1,
                                  "body": "Source?",
                                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp1mkxx/",
                                  "created": 1727369021,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lp1ovjf",
                                      "score": 1,
                                      "body": "Please Google \"what engines does Boeing passenger planes use\" \n\nRolls-Royce is very few and typically on the dreamliner 787.",
                                      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp1ovjf/",
                                      "created": 1727369725,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lp1r7go",
                                          "score": 1,
                                          "body": "Yea send",
                                          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp1r7go/",
                                          "created": 1727370446,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lowgxxd",
          "score": 6,
          "body": "Who would want to run a company with this much scrutiny and this much downside. One mistake and 300 people are dead.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowgxxd/",
          "created": 1727291398,
          "depth": 1,
          "replies": [
            {
              "id": "loxoees",
              "score": 11,
              "body": "The downside is very small compared to other industries.  When engineers are allowed to freely design and essentially run departments then amazing, marvel, and safe designs are brought forward.  However when the bean counters, MBAs, and Wall Street idiots who only care about money override logical decisions from engineers who truly care about making the right decisions for public safety, that's when a company goes down the shitter.\n\nWho would've thought that ruining what originally made a company successful just to save pennies would end up in disaster (Boeing).",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loxoees/",
              "created": 1727305590,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lovk9qk",
      "score": 268,
      "body": "Boeing was already a case study, but now it'll almost be required learning.\n\nThis is what happens when you let MBAs run rampant, prioritizing short-term stock price and gains over longer term growth through sustained excellence.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovk9qk/",
      "created": 1727281262,
      "depth": 0,
      "replies": [
        {
          "id": "lovzucu",
          "score": 52,
          "body": "Muilenburg was a beoing engineer that got promoted up to ceo",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovzucu/",
          "created": 1727286076,
          "depth": 1,
          "replies": [
            {
              "id": "lowuccs",
              "score": 35,
              "body": "And all the advice and options for governance he got were from the aforementioned MBAs chasing their stock option bonuses. \n\nOne single person does not a company make. The culture and management vision is equally important. He either didn't go into the job having a good enough vision and lost sight of what made the company it's money and/or didn't manage the company culture well enough to push back about the direction the company was going in.\n\nBoth are fatal mistakes to make when you're the CEO.",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowuccs/",
              "created": 1727295519,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lovy3mu",
          "score": 18,
          "body": "Muilenburg was an engineer not an MBA.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovy3mu/",
          "created": 1727285541,
          "depth": 1,
          "replies": [
            {
              "id": "low3csf",
              "score": -5,
              "body": "Yes - but I'm not talking about just him. I'm talking about the decision making stretching all the way back to the McDonnell Douglas \"acquisition\" that ended up being more of \"MCD buying Boeing with Boeing's money\" rather than Boeing acquiring MCD.",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/low3csf/",
              "created": 1727287150,
              "depth": 2,
              "replies": [
                {
                  "id": "low4i8d",
                  "score": 14,
                  "body": "Stonecipher and Condit didn´t have MBAs either.",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/low4i8d/",
                  "created": 1727287507,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lp0iz2q",
          "score": 2,
          "body": "The FAA should be under just as much scrutiny for letting the second crash happen",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp0iz2q/",
          "created": 1727356128,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loyn5br",
          "score": 2,
          "body": "It's so corrupt and rotten it can't be salvaged at this point.\n\nNeeds to be spun off and sold into a few separate companies.  We need way more competition in the space.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loyn5br/",
          "created": 1727318701,
          "depth": 1,
          "replies": [
            {
              "id": "lp0rxvs",
              "score": 3,
              "body": "Reputational damage is also a problem. What qualified engineers would want to work for Boeing?",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp0rxvs/",
              "created": 1727359344,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lovho8w",
      "score": 106,
      "body": "Boeing is essentially paying $4,000 per employee every day to delay a contract agreement",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovho8w/",
      "created": 1727280450,
      "depth": 0,
      "replies": []
    },
    {
      "id": "low087y",
      "score": 54,
      "body": "Maybe don’t sped $50 billion for stock buy back while not paying workers as well?",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/low087y/",
      "created": 1727286194,
      "depth": 0,
      "replies": [
        {
          "id": "loxnoxu",
          "score": 10,
          "body": "Blasphemer!  👈  Thou shalt now impede the profits of the ruling class!",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loxnoxu/",
          "created": 1727305327,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loz4tui",
          "score": 3,
          "body": "Stock buybacks aren't an expense. They live below the bottom line.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loz4tui/",
          "created": 1727327083,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lovus12",
      "score": 42,
      "body": "They can pay execs millions to fuck over the company and employees, they have plenty of money to chill out for a strike.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovus12/",
      "created": 1727284520,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lovtbg1",
      "score": 23,
      "body": "Couldn't have happened to a nicer company. They deserve it.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovtbg1/",
      "created": 1727284069,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lovgrga",
      "score": 101,
      "body": "2 billion is roughly doubling their employee salaries, so for 100 million a day they could give a 50% raise vs losing 2 weeks of productivity, but their max offer is 30% over 10 years. What a joke.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovgrga/",
      "created": 1727280157,
      "depth": 0,
      "replies": [
        {
          "id": "lovk214",
          "score": 67,
          "body": "That doesn't seem correct. Boeing's annual operating expenses are $76.5 Billion. While much of that might be non-labor costs like materials, I seriously doubt that labor only makes up ~3% of their total costs.\n\nBoeing has 170,000 employees, $2 Billion would be about $11,000 per employee. I seriously doubt their average salary is that low, that's less than minimum wage.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovk214/",
          "created": 1727281196,
          "depth": 1,
          "replies": [
            {
              "id": "lovormx",
              "score": 38,
              "body": "There are only 33,000 members in the IAM which is what this post is all about.",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovormx/",
              "created": 1727282666,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lovqksd",
          "score": 24,
          "body": "It's 30% over 4 years please correct your comment and don't spread misinformation",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovqksd/",
          "created": 1727283226,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lovz8ow",
          "score": 4,
          "body": "You’re not accounting for the fact that if they raise wages they are permanently higher, and he’s they are hemorrhaging money right now but once it stops it stops, a pay increase is forever.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovz8ow/",
          "created": 1727285891,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lovjary",
          "score": 0,
          "body": "but the joke is baked by a superpower",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovjary/",
          "created": 1727280959,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lovjewf",
          "score": -4,
          "body": "What?! 30% over ten years… I didn’t know that… so basically matching inflation over 10 years… man let it burn hold out",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovjewf/",
          "created": 1727280995,
          "depth": 1,
          "replies": [
            {
              "id": "lovqi6p",
              "score": 24,
              "body": "It's over 4 years, that other commenter is wrong",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovqi6p/",
              "created": 1727283203,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lovs4ft",
              "score": 2,
              "body": "Offer was over 4 years",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovs4ft/",
              "created": 1727283693,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lovmeoj",
      "score": 5,
      "body": "The government will bail them out and continue to subsidize them",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovmeoj/",
      "created": 1727281931,
      "depth": 0,
      "replies": [
        {
          "id": "lp0j8ba",
          "score": 1,
          "body": "I think everyone wants to cash out and break it up into two companies or 4",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp0j8ba/",
          "created": 1727356225,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lowdedd",
      "score": 9,
      "body": "Down 41% YTD 😱",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowdedd/",
      "created": 1727290283,
      "depth": 0,
      "replies": [
        {
          "id": "loywt22",
          "score": 4,
          "body": "SO FAR...",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loywt22/",
          "created": 1727322972,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lowe8rn",
      "score": 4,
      "body": "For those interested in the math behind the losses number:\n\nThe Boeing Renton factory produces roughly ~30 737s a month currently (depending on the month). This means that the factory delivers roughly one 737 per day. A 737 costs ~$100M. Boeing cannot produce 737s while the workers are on strike, which means Boeing isn’t getting their $100M cash deposit per day. This isn’t factoring in the loss of revenue due to the Everett site being affected, which produces the 777-F, 777X, and 767-F, 767-T. Everett makes up the other ~50 million of costs. \n\nThis ~150M in lost revenue / cash is what is causing the multitude of cost cutting measures such as furlough. \n\nAdditionally, Boeing is currently rated BBB-, and the credit rating agencies said the only reason Boeing isn’t at junk bond status is because of their 400 billion dollar backlog. They can’t take out more debt in risk of going to junk bond status.  \n\nThey need this strike to end ASAP",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowe8rn/",
      "created": 1727290547,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lownnit",
      "score": 3,
      "body": "Boeings most recent c-suite pay (mainly stock compensation): \n\nKelly Ortberg (New CEO Boeing): $22 Million (2024 comp package) \n\nStephanie Pope (CEO BCA): $9,537,503 (2023) \n\nDave Calhoun (Ex CEO Boeing): $33 Million (includes 45% raise in one year, 2023)",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lownnit/",
      "created": 1727293469,
      "depth": 0,
      "replies": []
    },
    {
      "id": "low7uoc",
      "score": 3,
      "body": "[Our reporter Jane is the first to officially confirm that Boeing has STOPPED production of 737 jets.](https://fortune.com/2024/09/25/boeing-737-production-halted-stopped/)\n\n“Airplane production in Washington state is temporarily paused including work on the 737 MAX, 767, 777/777X, P-8, KC-46A Tanker, E-7 Wedgetail,” a spokesperson wrote *Fortune* in an email Wednesday. “Work at our Fabrication sites in Washington and Oregon will also temporarily pause. Employees not represented by this union will continue to report to work as normal.”",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/low7uoc/",
      "created": 1727288552,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lox9gp6",
      "score": 3,
      "body": "last contract was 16 years ago. so the workers need a 40% raise just to keep up with inflation. cant blame them. maybe if they pay them better the quality will go up.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lox9gp6/",
      "created": 1727300303,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loy89if",
      "score": 3,
      "body": "This is what happens when Boeing is managed like a McDonalds",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loy89if/",
      "created": 1727312911,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lovkeyv",
      "score": 33,
      "body": "PNW is now the home of big tech.  The cost of living is significantly higher because of that.\n\nBuilding anything in the PNW is no longer sustainable.  We are talking about a guy flipping burgers last week, joined BA at the lowest grade @ $21/hr,  6 years later he'll be making $43/hr with great benefits (look at the 401k, he puts in 8% and gets 12% or a total 20% of his salary) - And that's still not enough.\n\nAirbus is building planes in Alabama with a much cheaper labor force - w/o quality issues.  Boeing should move 737 assembly lines to Charleston to better compete.\n\nThe union is angry that Dave got $30 million (stock - not cash.  This was part of the contract, no way around that) for his failed leadership but they are demanding 1 billion and couldn't install the door properly.\n\nBoeing doesn't lose 100m/day.  Boeing's delaying 100m worth of revenue based on the planes' list prices.\n\nFor Boeing, the situation this year is better than 2020.  They already delivered (YTD) more planes than the entire 2020.  BSC is still delivering 787.  The company doesn't have to pay for machinists in PNW (6.5 million per day) and will have 12.6 billion in cash.\n\nIt becomes a waiting game.   I just want Boeing to take this opportunity to move the 737 assembly lines.  The contract is no longer valid so nothing is holding it back.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovkeyv/",
      "created": 1727281308,
      "depth": 0,
      "replies": [
        {
          "id": "lovsx3h",
          "score": 10,
          "body": "You’re being downvoted but are 100% correct",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovsx3h/",
          "created": 1727283944,
          "depth": 1,
          "replies": [
            {
              "id": "lovz755",
              "score": 5,
              "body": "I downvoted him for saying there's no quality issues at the dreamliner plant because that's patently untrue.  Also for thinking a skilled machinist would be flipping burgers anywhere or that a burger flipper's wage has ANYTHING to do with ANYTHING in this situation.",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovz755/",
              "created": 1727285877,
              "depth": 2,
              "replies": [
                {
                  "id": "low4trx",
                  "score": 3,
                  "body": "you may need to read slower next time.  Where did I say the 787 has no quality issue?  The 787 is significantly more complex than the 737 and a significant amount of 787 quality issues are originated from the fuselage section not fitting together - that's a supplier manufacturing issue, not an assembly issue.  Airbus has no issue with the Alabama plan building 737 competitor.\n\nIf you follow the union talk, you'll see that they often compared being starting (lowest grade) to the minimum wage and those of fast-food workers.  Many even said they could get a job at a fast-food place and get paid the same during the strike.\n\nGrade 1 - the entry-level - machinist is not a \"skilled machinist\".  A few years later - yes but not starting. But then a few years later, he/she is already on the way to a max 43/hr rate.",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/low4trx/",
                  "created": 1727287607,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lovywqk",
          "score": 1,
          "body": "Boeing is in the process of buying Spirit. Spirit makes the 737 fuselage and then ships the plane to Puget sound area to finish it. It would be easier to reverse it and ship wings to Spirit and let them put the wings on and start finishing the planes there vs shipping the fuselage to SC.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovywqk/",
          "created": 1727285788,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lovr72h",
          "score": 0,
          "body": "This… I support the union members, but trying to compare your salary to that in tech makes no sense. Either you want the work to stay here at a reasonable pay, or it gets moved somewhere cheaper, but you can’t have both.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovr72h/",
          "created": 1727283413,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lovrq18",
          "score": 0,
          "body": "I imagine they'll try to automate processes as much as possible before they try to move assembly lines. But yeah every fight like this is further incentive to move production to a non unionized area",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovrq18/",
          "created": 1727283571,
          "depth": 1,
          "replies": [
            {
              "id": "loxrzqu",
              "score": 2,
              "body": "Aerospace parts are already automated with CNC and other machines.  The only hindrance for Boeing to move manufacturing is labor and facility, moving the shipping of parts a few States is easy.",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loxrzqu/",
              "created": 1727306897,
              "depth": 2,
              "replies": [
                {
                  "id": "loxy3q0",
                  "score": 2,
                  "body": "Boeing field is some insanely valuable land if they ever actually considered picking up and moving.",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loxy3q0/",
                  "created": 1727309147,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lowbef5",
      "score": 8,
      "body": "The rich would rather run our country or their companies into the ground than share profits to a greater degree with the lesser of us.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowbef5/",
      "created": 1727289657,
      "depth": 0,
      "replies": [
        {
          "id": "loyny6m",
          "score": 2,
          "body": "Edit: Boeing <> country.  In its current state Boeing is so poorly run its an actual danger to the public.\n\nThis is not about profit-sharing.\n\nI'm all for workers being paid more.  I'm for BA going under because it's a piece of shit and we need more competition instead of a duopoly.  \n\nZero accountability isn't good for anyone.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loyny6m/",
          "created": 1727319028,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loxsgzt",
          "score": 3,
          "body": "This is they way it's trended for the past four decades.  Companies use to actually care about its employees, now it's all about sucking them dry at every chance to increase shareholder price.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loxsgzt/",
          "created": 1727307073,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lowqb34",
      "score": 7,
      "body": "I get why the workers are striking. COL is insane in the PNW.\n\n\nThat being said, Boeing has been in the red for like, multiple years. Long-term, a tailspin is not the time to press your foot down. It is only going to accelerate the decline. Then these folks will be out of a job either because the company folds, or because Boeing shifts production and lays off folks.\n\n\nIf I was management, long term, I would focusing moving production to places where COL is reasonable to match. PNW COL has been destroyed by the Tech Sector, creating a society of the haves and have nots, and it is unrealistic for most companies to keep up with that type of inflation. For Boeing it will be a lot easier to match COL in say Arkansas vs Washington State.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowqb34/",
      "created": 1727294275,
      "depth": 0,
      "replies": [
        {
          "id": "loyx74t",
          "score": 0,
          "body": "100 percent spot on!  COL here is insane, and it's no longer company friendly - the company should pack up and move on out to greener pastures...",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loyx74t/",
          "created": 1727323160,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lovyrmf",
      "score": 2,
      "body": "I wonder if they paid off debt instead of buybacks if they could have covered this in interest reduction.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovyrmf/",
      "created": 1727285745,
      "depth": 0,
      "replies": []
    },
    {
      "id": "low55u2",
      "score": 2,
      "body": "It’s really unbelievable how incompetent that leadership has been.  Way to go Dave",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/low55u2/",
      "created": 1727287712,
      "depth": 0,
      "replies": []
    },
    {
      "id": "low5ylf",
      "score": 2,
      "body": "Crappy part about this is we taxpayers will be paying for this when they bail them out.  They are too big to fail.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/low5ylf/",
      "created": 1727287960,
      "depth": 0,
      "replies": []
    },
    {
      "id": "low7mgg",
      "score": 2,
      "body": "So, if this true, it's probably a LOT more expensive than paying the poor fuckers that work there a higher salary lol",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/low7mgg/",
      "created": 1727288480,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lowjn1z",
      "score": 2,
      "body": "I made the mistake of buying the stock when it was like 180 thinking they had hit bottom and it would go back up in the low-mid 200's.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowjn1z/",
      "created": 1727292239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lowusys",
      "score": 2,
      "body": "I don’t think raises would cost that much in 20 years",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowusys/",
      "created": 1727295662,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loxiwg9",
      "score": 2,
      "body": "stock isnt that down that much...... needs to really HIT hard before I touch boeing.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loxiwg9/",
      "created": 1727303592,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loxy9uq",
      "score": 2,
      "body": "Bypassing the union is such a dick move",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loxy9uq/",
      "created": 1727309210,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loyq55a",
      "score": 2,
      "body": "How long before the non-union facility becomes unionised?",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loyq55a/",
      "created": 1727319947,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loys8dj",
      "score": 2,
      "body": "Couple of things really stood out to me in this article. \n\n  \n> IAM union workers also know they have public support behind them, as big labor has seen its popularity grow, while Boeing has seen its standing suffer. The union is in a “very strong position,” Mendiratta said, as the strike not only puts financial pressure on Boeing but also hurts Boeing on a “reputational level” too.\n\n  \n- I'm absolutely on the side of the workers/union here. However, I suspect that Boeing doesn't really care about their reputation here as much as people think, or the public support behind the union. They have a near monopoly in their business, at least in terms of output capacity which is desperately needed in a critical field. It feels like poison saying it but that affords them the privilege to ignore reputation damage for a long time. There's no where else for buyers to go, they have to deal with Boeing, trashed reputation or not. However this strike ends I suspect Boeing will push to move 737 production out of the PNW into areas like Atlanta and SC where unions aren't as protected. \n\n  \n> Shareholders hope Boeing and new CEO Kelly Ortberg can make a deal and reverse the cash drain by the time the plane maker is expected to report third quarter earnings at the end of October.\n\n  \n- This is going to be the downfall of Boeing that leads to some sort of inevitable government bailout. Shareholder primacy and value extraction mindset has been taken further and further over the cliff the last 50 years. Even with all of the recent revelations about the company, shareholders DEMAND the next quarter earnings be turned around. It's clear to anyone who's ever worked in any type of operations role that Boeing needs a solid 5-10 year turn around cycle to get it back on track, break even sure but put aside profits. Shareholders won't allow a reinvestment into the company. The name of the game on Wall Street with companies this large is value extraction, never growth or value retention.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loys8dj/",
      "created": 1727320860,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loz3ffp",
      "score": 2,
      "body": "You know what Boeing should do, is do more stock buy back. 😂 they should make stock buy backs illegal again.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loz3ffp/",
      "created": 1727326318,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lozuune",
      "score": 2,
      "body": "They brought it on themselves",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lozuune/",
      "created": 1727344270,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lovt506",
      "score": 2,
      "body": "How much of it is a true loss and how much is just deferred cash flows?  I mean if they haven't lost any sales then when their issues are resolved they should be able to ramp up production and get their cash flows back on track.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovt506/",
      "created": 1727284014,
      "depth": 0,
      "replies": [
        {
          "id": "low5j4x",
          "score": 1,
          "body": "Is there really a difference? If the deferred cash flows can't be made up (say because assembly lines are running at 100% anyway), a delay is the same thing as a loss",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/low5j4x/",
          "created": 1727287827,
          "depth": 1,
          "replies": [
            {
              "id": "low9obv",
              "score": 2,
              "body": "That assumes you're at 100% of capacity forever.  A company can only wish for that scenario.  And if that were the case then you really owe it to your investors to expand your capacity.",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/low9obv/",
              "created": 1727289117,
              "depth": 2,
              "replies": [
                {
                  "id": "lowexko",
                  "score": 3,
                  "body": "I think that's the way it is with aircraft, though. There's something like a 10 year waiting list for a new plane.",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowexko/",
                  "created": 1727290764,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lowvos1",
                      "score": 5,
                      "body": "That's because of how they're sold.  It's not like the airline with a delivery slot in 2035 really wants the thing right now.",
                      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowvos1/",
                      "created": 1727295932,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lovoft3",
      "score": 6,
      "body": "The reality is these workers have a great position. They're united, and Boeing may fail, but it will simply be replaced by a new entity, because the US won't let the EU have a monopoly on aircraft, so they'll still have their jobs just under a new name. \n\nAnd if the EU actually believes the anti-trust bullshit it throws at US tech companies than the EU doesn't want to have an aircraft monopoly either... right? Though, I'm sure they'd actually love it though and it'd be nice to see their blatant anti-\"us tech\" bias completely exposed. Though frankly everybody with a brain knows it already.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovoft3/",
      "created": 1727282565,
      "depth": 0,
      "replies": [
        {
          "id": "loxcovx",
          "score": 1,
          "body": "Weird thread to bash the EU in. It’s literally about a failing American company. I guess you can’t help yourself?",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loxcovx/",
          "created": 1727301394,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lowa3fp",
      "score": 1,
      "body": "So who's buying?",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowa3fp/",
      "created": 1727289249,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lowgabm",
      "score": 1,
      "body": "Boeing could solve all its problems by giving their employees equity. ",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowgabm/",
      "created": 1727291190,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lowmp7s",
      "score": 1,
      "body": "Let's make it 1,000 days.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowmp7s/",
      "created": 1727293180,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp07pnw",
      "score": 1,
      "body": "Eventually they will give in . Because the costs of not doing business will become simply too costly . ",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp07pnw/",
      "created": 1727351432,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp0rjet",
      "score": 1,
      "body": "It's crazy how so many issues I see with massive corporations can all be tied back to bad US policy.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp0rjet/",
      "created": 1727359206,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp1kj0f",
      "score": 1,
      "body": "Time to buy up boeing :) you know with government contacts they're not going to let the company die",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp1kj0f/",
      "created": 1727368394,
      "depth": 0,
      "replies": [
        {
          "id": "lp2hwzq",
          "score": 1,
          "body": "Thats not a good reason to buy a stock. It’s a similar situation with GM. The government doesn’t want them to die and they even bailed them out in the past. Yet their stock performance has been abysmal over the years.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp2hwzq/",
          "created": 1727378802,
          "depth": 1,
          "replies": [
            {
              "id": "lp4hhit",
              "score": 1,
              "body": "Good point",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp4hhit/",
              "created": 1727403897,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lp3c090",
      "score": 1,
      "body": "Fuck em up!!! Keep that strike 🪧 going boys and girls!",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp3c090/",
      "created": 1727388528,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpbhjue",
      "score": 1,
      "body": "So pay them",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lpbhjue/",
      "created": 1727517584,
      "depth": 0,
      "replies": []
    },
    {
      "id": "low2udk",
      "score": 2,
      "body": "Their financials are already awful, how can they expect to turn the ship around while also raising pay 30%?",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/low2udk/",
      "created": 1727286995,
      "depth": 0,
      "replies": [
        {
          "id": "loxzgjv",
          "score": 5,
          "body": "Maybe just pay the executives and shareholders less?",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loxzgjv/",
          "created": 1727309645,
          "depth": 1,
          "replies": [
            {
              "id": "loy0rs1",
              "score": 1,
              "body": "Dividends are not included on the income statement, and even with 0 executive pay they'd still be deep in the red.",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loy0rs1/",
              "created": 1727310131,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lp13san",
          "score": 1,
          "body": "Their financials are awful because they can't build enough planes to make a profit. They could slash wages, and they'd still lose money. Just look at the 787 Dreamliner: it's produced at the non-union plant in South Carolina with low wages, yet it's been a massive money pit ever since it was released. \n\nBoeing can't build planes because they have been more focused on screwing their workers and massaging their stock with debt-fueled stock buybacks than on actually managing their production lines competently.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lp13san/",
          "created": 1727363196,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lovgcuy",
      "score": 1,
      "body": "They're fu ked",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovgcuy/",
      "created": 1727280031,
      "depth": 0,
      "replies": []
    },
    {
      "id": "low3nj3",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/low3nj3/",
      "created": 1727287242,
      "depth": 0,
      "replies": [
        {
          "id": "loz15u2",
          "score": 1,
          "body": "What's your job? And getting fired isn't the same as furloughed.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loz15u2/",
          "created": 1727325133,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loweueo",
      "score": 1,
      "body": "Let’s all sit tight and wait for the CEO performance bonus.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loweueo/",
      "created": 1727290737,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loytp42",
      "score": 1,
      "body": "That’s great! They were losing $200,000,000 a day BEFORE the strike!",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loytp42/",
      "created": 1727321524,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lozat8f",
      "score": 1,
      "body": "Damn. They ain’t gonna have enough money to pay assassin.",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lozat8f/",
      "created": 1727330554,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lovzen4",
      "score": -2,
      "body": "Just move all factories out of WA and they won't have this headache on their hands every few years 🤷🏻‍♂️",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovzen4/",
      "created": 1727285942,
      "depth": 0,
      "replies": [
        {
          "id": "loyqwvp",
          "score": 1,
          "body": "Heaven forbid workers fight for livable wages and benefit. Does the bottom of boeing's boot taste that good?",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loyqwvp/",
          "created": 1727320282,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lowkr3y",
          "score": 1,
          "body": "Nah, management like that will see labor strikes wherever they go.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lowkr3y/",
          "created": 1727292578,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lovo7v1",
      "score": 0,
      "body": "Boeing saving more than that in furlongs and no pay increases",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovo7v1/",
      "created": 1727282497,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lovkr4r",
      "score": -9,
      "body": "Can't they just quietly murder all these uppity union folks?",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovkr4r/",
      "created": 1727281414,
      "depth": 0,
      "replies": [
        {
          "id": "lovmgn3",
          "score": 10,
          "body": "That's the power of unions, you can murder one whistleblower, but good luck murdering the entire working class.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovmgn3/",
          "created": 1727281948,
          "depth": 1,
          "replies": [
            {
              "id": "lovmwhb",
              "score": 3,
              "body": "I was joking of course. Jeez, the downvotes",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovmwhb/",
              "created": 1727282088,
              "depth": 2,
              "replies": [
                {
                  "id": "lovn5ba",
                  "score": 2,
                  "body": "I had a feeling you were, if it helps I didn't downvote you, I actually chuckled a bit.",
                  "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovn5ba/",
                  "created": 1727282165,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lovdce7",
      "score": -50,
      "body": "this is how unions tear companies to pieces\n\nEdit: and the union should be dismantled",
      "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovdce7/",
      "created": 1727279096,
      "depth": 0,
      "replies": [
        {
          "id": "lovdsbo",
          "score": 28,
          "body": "Boeing management tore itself to pieces. This is just another side effect of their horrible decision making over the last 20 years",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovdsbo/",
          "created": 1727279234,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loveax8",
          "score": 48,
          "body": "If you think boeing is struggling because of the union, its time to pull your head out of your ass.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loveax8/",
          "created": 1727279394,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loviiu0",
          "score": 5,
          "body": "You think the average floor worker is responsible for the decision to unilaterally cut costs and run everything into the ground in the name of shareholder profits lol?",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/loviiu0/",
          "created": 1727280717,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lovhlm6",
          "score": 9,
          "body": "Can someone make the eric andre shooting meme with boeing shooting themselves and blaming unions?",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovhlm6/",
          "created": 1727280427,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lovdv0e",
          "score": 23,
          "body": "To be fair this company deserves to be torn to pieces.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovdv0e/",
          "created": 1727279257,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lovhosr",
          "score": 7,
          "body": "Pretty sure Boeing’s management did a fine job of that long before these union struggles lol.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovhosr/",
          "created": 1727280455,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lovf3qd",
          "score": 16,
          "body": "This is how unions keep major corporations from abusing its workforce. ",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovf3qd/",
          "created": 1727279643,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lovjh5d",
          "score": 3,
          "body": "No, this is how *poor management* tears a company apart. \n\nIf a workforce gets to the point of a labor strike, that’s *managemen’s* fault.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovjh5d/",
          "created": 1727281015,
          "depth": 1,
          "replies": [
            {
              "id": "lovkdap",
              "score": 2,
              "body": "[removed]",
              "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovkdap/",
              "created": 1727281293,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lovfcgg",
          "score": 3,
          "body": "Kelly?",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovfcgg/",
          "created": 1727279718,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lovgbz6",
          "score": 2,
          "body": "lmfao",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovgbz6/",
          "created": 1727280023,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lovhbiq",
          "score": 1,
          "body": "2 billion is roughly doubling their employee salaries, so for 100 million a day they could give a 50% raise vs losing 2 weeks of productivity, but their max offer is 30% over 10 years. What a joke.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovhbiq/",
          "created": 1727280337,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lovmbc8",
          "score": 1,
          "body": "If by union you mean the chamber of commerce, then yeah you're right.",
          "permalink": "/r/stocks/comments/1fp6x3r/boeing_losing_100_million_to_150_million_a_day_as/lovmbc8/",
          "created": 1727281901,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ],
  "stockTickers": {
    "post_summary": "Boeing is experiencing significant financial losses and reputational damage due to a labor strike with the IAM union, exacerbating its existing challenges.",
    "companies": [
      "Boeing"
    ],
    "tickers": [
      "BA"
    ],
    "main_ticker": [
      "BA"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Boeing is facing significant financial and reputational challenges due to an ongoing union strike and failed negotiations with the IAM union.",
    "stock_recommendations": "The user does not explicitly recommend buying or selling Boeing stock.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "There is a negative sentiment due to Boeing's substantial financial losses and challenges in resolving the union strike.",
    "sentiment": "negative"
  }
}