{
  "title": "Is TSM a good buy?",
  "score": 84,
  "selftext": "Tsm looks fairly valued to me at the moment with a peg ratio of 1 and over 20% earnings growth each year over the past five years and they’re a industry leader with over 50% market share in a booming industry. They’re well financed with a good balance sheet and aren’t afraid to use capital to drive innovation and are typically successful. Not to mention the backing of the us government. Is there something I’m missing?",
  "link_flair_text": null,
  "id": "1fpcnpj",
  "num_comments": 101,
  "created_utc": 1727291582,
  "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/",
  "comments": [
    {
      "id": "lowij8p",
      "score": 82,
      "body": "Do you expect a stock which has risen 70% YTD to keep rising? Could be right. Could be wrong.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowij8p/",
      "created": 1727291897,
      "depth": 0,
      "replies": [
        {
          "id": "lowps48",
          "score": 23,
          "body": "That's what I said about NVDA and I didn't buy but then it went up 10x.",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowps48/",
          "created": 1727294115,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lowra8g",
          "score": 75,
          "body": "TSM has 90% of market share in advanced chips and the barrier to entry is extremely high. This is a buy and hold forever stock. They pretty much have no competition. \n\nSamsung is a way distant 2nd. Global Foundries is a loser. Intel is trying to make a play but they’ll need a decade of flawless execution to gain share (spinning off IFS, massive investments, customers willing to take a leap of faith, and honing their fab process with the disadvantages of U.S. labour). Realistically no one can challenge them. \n\nBefore anyone says “but China”, China wants global stability, an invasion of Taiwan would be disastrous for China too, and there is no one on the planet able to fill TSMC’s void if this were to happen. In addition, TSMC is slowly hedging by opening new factories around the world. The most legitimate observation about the China risk is it will always cause the stock to trade at a lower PE multiple than what it would if the risk did not exist. One negative story by Bloomberg in the summer caused TSMC to sell off even though its fundamentals did not change. Owning this stock is not for the faint of heart.",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowra8g/",
          "created": 1727294575,
          "depth": 1,
          "replies": [
            {
              "id": "lp05vs0",
              "score": 3,
              "body": "hey don't call GF a loser, that's 55nm slander and i won't stand up for it",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp05vs0/",
              "created": 1727350571,
              "depth": 2,
              "replies": []
            },
            {
              "id": "loyy5g3",
              "score": 3,
              "body": "Two of the biggest points around TSM (moat and China threat) haven’t changed in many years. TSM is a good company but you have to question what will drive further growth since those factors should be priced in. \n\nI’ve been in since before AI but I don’t know if I would buy now",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loyy5g3/",
              "created": 1727323621,
              "depth": 2,
              "replies": [
                {
                  "id": "lozu4w7",
                  "score": 2,
                  "body": "What do you mean what will drive future growth? Literally the biggest companies on the planet are their customers. All of them are saying they will double down on AI capex",
                  "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lozu4w7/",
                  "created": 1727343796,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lozuplw",
                      "score": 4,
                      "body": "Yes but to what extent is that priced in? As I mentioned TSM’s dominance in semiconductors is nothing new and it’s already doubled in value over the past year due to AI hype. At some point it’s no longer undervalued, at what price does it become overvalued?",
                      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lozuplw/",
                      "created": 1727344178,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lp2jpzi",
              "score": 1,
              "body": ">  but they’ll need a decade of flawless execution to gain share\n\ndecade? around two years\n\nif they deliver 18A in next 10 months and their infra/tools/support for customers matures then they should be fine",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp2jpzi/",
              "created": 1727379372,
              "depth": 2,
              "replies": []
            },
            {
              "id": "loylftp",
              "score": -4,
              "body": "They pretty much have no competition? Maybe not in the chip sector but a few million Chinese surrounding the land air and water of the country it's in are competing for total control of the country. The fact we have multiple times thrwarted china's attempt to aquire the machines and tech that exist  inside that building make me feel like china won't take it and keep the presses running as usual.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loylftp/",
              "created": 1727318012,
              "depth": 2,
              "replies": [
                {
                  "id": "lp0i1ka",
                  "score": 0,
                  "body": "TSM has failsafes in place to destroy the equipment if China invades Taiwan, and has matched production in there Arizona plant to their Taiwanese plant. That'll only grow with the investment coming in from the CHIPs act. \n\nNot saying it's not a threat, but there are contingencies in place.",
                  "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp0i1ka/",
                  "created": 1727355773,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp438bt",
                      "score": 2,
                      "body": "I am very perplexed with why every redditor thinks this way. I guess no one here is Taiwanese. Nobody wants a war,  and every Taiwanese in real life thinks blowing up TSM is the dumbest thing ever. No Taiwanese want to see their country turn into Somalia or Haiti",
                      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp438bt/",
                      "created": 1727398519,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lp271do",
                      "score": 1,
                      "body": "TSMC equity will go to $0 if Taiwan gets attacked \n\nThe company can survive and just wipe out equity. They’d immediately fall into bankruptcy if Taiwan shipments got canceled for a few months. \n\nThey don’t have infinite cash on hand but they do have immediate expenses. \n\nA war in Taiwan would end TSMC equity value. They can send equity to $0 and still survive as a company.",
                      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp271do/",
                      "created": 1727375366,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lp26qhc",
              "score": 0,
              "body": "But China means TSMC to $0 of equity value.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp26qhc/",
              "created": 1727375271,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lowm12p",
          "score": 19,
          "body": "Yes.\n\nThe debt they’ve taken on to build in Arizona, Germany, and Japan is serviceable and within reason and they’ll pay it off soon enough. After that it’s profit profit profit.\n\nLook at Fiserv as an example with their purchase of Clover",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowm12p/",
          "created": 1727292973,
          "depth": 1,
          "replies": [
            {
              "id": "lowwc3j",
              "score": 3,
              "body": "Exactly why I bought, they look to have future growth mapped out very nicely and nobody currently makes better chips.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowwc3j/",
              "created": 1727296130,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lp272ro",
              "score": 1,
              "body": "Unless China invades",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp272ro/",
              "created": 1727375378,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lowkfzk",
          "score": 2,
          "body": "I’m looking over the next five years",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowkfzk/",
          "created": 1727292484,
          "depth": 1,
          "replies": [
            {
              "id": "lowmio6",
              "score": 9,
              "body": "TSM essentially has been mirroring NVDA at a much less parabolic pace",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowmio6/",
              "created": 1727293123,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lp9ml77",
          "score": 1,
          "body": "At about 20x forward earnings, the valuation isn't absurd.  \n\nOn the plus side, they have a dominant market share and look to have good growth for the next several years at least.  \n\nOn the minus side, they are capital intensive, so a drop in demand would hit them hard.  There is also always political/military risk from China.",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp9ml77/",
          "created": 1727481548,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loz869c",
          "score": 1,
          "body": "I think it’s right man tbh, nvidia rose a lot more and without TSMC they would be making nothing, if TSMC raises their prices everyone has to pay them or just not have chips, the one thing I could foresee is trump’s tarriffs making them less competitive for american companies than intel but literally no one makes chips at the capacity TSMC does when they were over capacity during covid that’s what caused the entire chip shortage, also they have plenty of FABs in America so even the tarriffs seem like a long shot.",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loz869c/",
          "created": 1727328981,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loxce6d",
      "score": 17,
      "body": "Hell yes. Their massive plant in Phoenix is brand new and probably not even full production yet. Govt deals",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loxce6d/",
      "created": 1727301293,
      "depth": 0,
      "replies": [
        {
          "id": "loymfy8",
          "score": 5,
          "body": "Has it crossed your mind why they are building the plant there? I have to believe they think a loss of the current factory being taken or compromised is more then concerning. Surely labor costs are going to rise and the price to build a factory in the USA over Taiwan must be 10x ? Wild guess but someone if you know better hit me with real numbers",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loymfy8/",
          "created": 1727318417,
          "depth": 1,
          "replies": [
            {
              "id": "lp3175z",
              "score": 4,
              "body": "Because US wants to have chips made in the US. US can’t be reliant on foreign countries for their chips. It’s a national security issue. Not necessarily that the Taiwan plant is at risk, more so they just want assurances that we can make our own advanced chips here in the states. It’s a fine line and I get your point though.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp3175z/",
              "created": 1727384892,
              "depth": 2,
              "replies": [
                {
                  "id": "lp49bry",
                  "score": 4,
                  "body": "It also provides TSMC with two major wins\n\n• bpc plan in case things escalate with China, etc.  They are geographically concentrated, and therefore overly exposed to risk\n\n• a path to increase production capacity as they hit energy / resource constraints in Taiwan",
                  "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp49bry/",
                  "created": 1727400779,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "loyy3af",
              "score": 5,
              "body": "> Has it crossed your mind why they are building the plant there? \n\nThe CHIPS Act. US gov't subsidies for semiconductor fabs.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loyy3af/",
              "created": 1727323592,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lozl0jc",
      "score": 4,
      "body": "ASML almost has a monopoly with the lithography technology, they are the suppliers for not just semiconductor manufacturers like the aforementioned TSM, but literally everything that uses microchips, from smartphones to industrial machines. It's the most important technology of the past decades (and the future), with no competitors.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lozl0jc/",
      "created": 1727337347,
      "depth": 0,
      "replies": [
        {
          "id": "lp13jqj",
          "score": 7,
          "body": "> literally everything that uses microchips, from smartphones to industrial machines\n\nThey only have a monopoly on EUV lithography. Most chips other than modern CPUs and GPUs do not need that and do not require machines as advanced as the ones only ASML can supply. Canon, Nikon, and plenty others supply semiconductor manufacturing equipment for everything else.",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp13jqj/",
          "created": 1727363119,
          "depth": 1,
          "replies": [
            {
              "id": "lp49i24",
              "score": 3,
              "body": "This ^\n\nFor non-leading edge nodes, there are other lithography options. Given ASML is booked out, many fabs don’t have a choice but to explore other options  ",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp49i24/",
              "created": 1727400843,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lp18srr",
              "score": 1,
              "body": "> They only have a monopoly on EUV lithography\n\nThat's enough for me",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp18srr/",
              "created": 1727364771,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lp0nt2n",
          "score": 2,
          "body": "How come I never hear more people mention asml? They don’t seem to grow as much as these other AI stocks even though I’ve heard the same things you’ve just mentioned about the company. Is there something I’m missing about it?",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp0nt2n/",
          "created": 1727357904,
          "depth": 1,
          "replies": [
            {
              "id": "lp0oi2o",
              "score": 3,
              "body": "It's low-risk low-reward but very strong. The kind of stocks that let's you sleep well at night. It probably won't tenfold your money, but it'll still have pretty good gains from the AI trend",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp0oi2o/",
              "created": 1727358152,
              "depth": 2,
              "replies": [
                {
                  "id": "lp0rgf0",
                  "score": 1,
                  "body": "What % of your portfolio is in this? I was thinking of rebalancing my 401k and Roth",
                  "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp0rgf0/",
                  "created": 1727359177,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp0rsw2",
                      "score": 3,
                      "body": "Just 8% yet, as I'm trying to stay on the NVDA/PLTR train",
                      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp0rsw2/",
                      "created": 1727359296,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lp1i92g",
              "score": 2,
              "body": "Because the tech market is mostly hype driven and nothing to do with fundamentals it seems.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp1i92g/",
              "created": 1727367700,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltxg6et",
              "score": 1,
              "body": "There's a hard limit on what they can produce. Meaning they can only crank out so many machines and since the tech is extremely monitored, they can't just sell it to anyone. In 2023 ASML sold 53 EUV machines. It's not like they can turn a switch and pump out 500.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/ltxg6et/",
              "created": 1729985298,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "loy22cy",
      "score": 19,
      "body": "You know that the stock is going south every time Xi Jingping is in a mad mood, right?\n\nThe risk of investing in TSM is not on the business itself, but purely geopolitical.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loy22cy/",
      "created": 1727310606,
      "depth": 0,
      "replies": [
        {
          "id": "loye491",
          "score": 10,
          "body": "So plenty of opportunities to keep buying more!",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loye491/",
          "created": 1727315141,
          "depth": 1,
          "replies": []
        },
        {
          "id": "loyo14w",
          "score": -2,
          "body": "Glad I'm not the only one with sense here. Remember when people thought mocking him was just funny politics but then when a multi billionaire tycoon with one of the biggest companies in China thought he could make a comment or disagree with xi so you have to disappear for months. I listened to a translation of a speech he gave to his country on a national holiday and what he said has stuck with me \"for those that want to take advantage or speak badly about us we shall smash their skulls\" obviously not a direct quote but it was about the USA and I was quite amazed even a fucked up person in that position of power would want to show some idk not  class but not completely fucking crazy! This wasn't back room we all know in the talks we don't hear involving top politicians would of course disgust you. But no the fact is he said this in front of millions of his people he said it with emphasis and hand gestures.",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loyo14w/",
          "created": 1727319062,
          "depth": 1,
          "replies": [
            {
              "id": "lp8dbd9",
              "score": 1,
              "body": "It's literally the same that any country says about their rivals, \"if you fck with us we will fk you up\". Like, the US says this every week to a different country.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp8dbd9/",
              "created": 1727465190,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lownjbk",
      "score": 3,
      "body": "It is, or simply go for SMH.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lownjbk/",
      "created": 1727293434,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loyn5xt",
      "score": 2,
      "body": "Every country is throwing money at new fabs, like the chips act.  There will be an inevitable glut, and margins will fall, but we will have very cheap devices.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loyn5xt/",
      "created": 1727318708,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lozy0r2",
      "score": 2,
      "body": "2/10 uninverts, fed drops 50pts… means no equities are a good buy rn.  wait 6 months and see where we are. imho.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lozy0r2/",
      "created": 1727346295,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loxp7vs",
      "score": 5,
      "body": "What you are missing is the very real risk of a China invasion of Taiwan where the main factory is at. In fact, personally I don't think it's a question of *if* China will invade Taiwan, it is a question of **when**.\n\nThe new Phoenix factory is very much a contingency plan in case the above comes to be. However, even with the backup factory an invasion and takeover of the homeland factory would disturb their value output and future projected earnings massively.\n\nPersonally I don't know whether it is overvalued or undervalued. But the reason it isn't priced like other chip stocks is most definitely the risk.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loxp7vs/",
      "created": 1727305888,
      "depth": 0,
      "replies": [
        {
          "id": "lp0qoav",
          "score": 3,
          "body": "Doomsayer! We should also store canned food and water in a nuclear bunker, just in case.. \n\n\n That **when will China invade** has been a question since 1990! ",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp0qoav/",
          "created": 1727358911,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loxogkv",
      "score": 1,
      "body": "Is there a reason why institutional ownership is so low? Genuinely asking since I don't know.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loxogkv/",
      "created": 1727305611,
      "depth": 0,
      "replies": [
        {
          "id": "loxuhcp",
          "score": 5,
          "body": "It's a foreign company located in a country with some notable geopolitical risks. Investing in it also means exposure to the Taiwan dollar, which carries its own risks.\n\nFurthermore, Taiwan has certain rules governing foreign ownership limits in some industries. TSMC is not affected a lot by these at the moment, but it could be if the rules were to change, which is another risk.\n\nI'm not saying these are the main reasons but they are the first things that come to mind.",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loxuhcp/",
          "created": 1727307814,
          "depth": 1,
          "replies": [
            {
              "id": "loyq6t1",
              "score": 1,
              "body": "I mean you could invest 10000000 tonight xi decides he saw something on TV it mocked him so he decimates most of Taiwan except for TSMC. The silver lining is people like xi if we were to have to battle in any size or format they usually respect the needs of others and will turn over TSMC to us if we win.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loyq6t1/",
              "created": 1727319967,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "loxzber",
      "score": 1,
      "body": "I bought 7 months ago. An uncharacteristically large amount of one stock for me. I did it mostly off the feels! It's done well. Not sure how much more momentum it has but it's held up well compared to some AI/semi (ASML). Are you long term? Id still load up then.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loxzber/",
      "created": 1727309591,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loykf4o",
      "score": 1,
      "body": "Depends what is your timeline is this value buying for the long hold? You need to be a little more specific but in a broad general sense if I looked at the market and wanted a list of 1000 stocks that are must buys TSM right now Isnt on the list. also just to put it out there TSM is in real danger from China idk the chances of an incident but because of china's leader there is definitely a chance. The fact they have been pursuing the machinery to produce top tier chips for years and by coincidence China has an army and navy surrounding Taiwan. I may deserve to be on the conspiracy sub for saying this but the reason TSM is getting a factory in the USA is because the chance of a Taiwan invasion is higher then it seems. Honestly in the sector I like WDC. Looks like WDC popped on MU earnings which was underpriced but post earnings I would have to take a 2nd look",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loykf4o/",
      "created": 1727317601,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lozcju0",
      "score": 1,
      "body": "Excellent company, excellent profit, excellent growth, less premium valuation, worst location. I bought since 62. Cost average to 98. Have been my bread and butter. I think I will wait since I have to take the risk of geopolitics.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lozcju0/",
      "created": 1727331637,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lozsik8",
      "score": 1,
      "body": "The Best Buy.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lozsik8/",
      "created": 1727342669,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp02afa",
      "score": 1,
      "body": "Chips are very cyclical. Typically its a good time to buy when its bust. Right now were in the boom cycle.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp02afa/",
      "created": 1727348763,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp064ai",
      "score": 1,
      "body": "i would go with MU, it only went up like 10% YTD and announced astronomical numbers yesterday, plus they're down 30% from all time high",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp064ai/",
      "created": 1727350681,
      "depth": 0,
      "replies": [
        {
          "id": "lpp6dhw",
          "score": 1,
          "body": "They are down again. Seems like market doesnt trust them lol.",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lpp6dhw/",
          "created": 1727725208,
          "depth": 1,
          "replies": [
            {
              "id": "lps18i8",
              "score": 1,
              "body": "yeah 2 red days already ? it's over for them .. that company is dead",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lps18i8/",
              "created": 1727766993,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lp06y1t",
      "score": 1,
      "body": "Yes, super good.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp06y1t/",
      "created": 1727351074,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp0ulsf",
      "score": 1,
      "body": "TSMC (TSM) looks pretty solid. They have strong demand for their advanced 3nm tech and are seeing good growth in AI and high-performance computing sectors. Risks include potential overcapacity and geopolitical tensions impacting their supply chain. Also, rising electricity costs could affect profit margins. Long-term, their investments in new fabs and cutting-edge tech make them a promising play...",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp0ulsf/",
      "created": 1727360241,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp2j4yi",
      "score": 1,
      "body": "Invested in TSM years ago and never looked back. Since then people on here keep complaining about \"China invading\" as an excuse to not invest but I guess some people enjoy bag holding Intel instead",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp2j4yi/",
      "created": 1727379188,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp6dglh",
      "score": 1,
      "body": "No",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lp6dglh/",
      "created": 1727441260,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loxwrze",
      "score": 1,
      "body": "as long as china is tamed",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loxwrze/",
      "created": 1727308657,
      "depth": 0,
      "replies": [
        {
          "id": "loypi6u",
          "score": 1,
          "body": "Are they currently tamed? Don't worry the threat has been tamed they only have forces surrounding our most important technologically advanced chip factory. They have been trying to make under the table deals to buy a chip maker from any country willing we have stopped the ones we found out about. Oh and they are so tame they flew weather balloons all around our country but to be diplomatic we didn't shoot it down until we did (I'm sure it was caution what a fucking easy ploy fly a ship in to enemy airspace it gets shot down contents a Winnie the Pooh bear and scarlet fever or leprosy. But for real what was in those fucking things.",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loypi6u/",
          "created": 1727319677,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "loy8q49",
      "score": 1,
      "body": "I've stayed out of TSM only due to potential geopolitical issues.  Buffet bought TSM some time ago and sold within months if I'm not mistaken for the very same risk factor.\n\nI think TSM will do well.  But I'd rather put my money into NVDA LRCX ASML AVGO and perhaps even someday in INTC if they can right the ship.  I can sleep at night with these and they'll do just as well if not better.  Now if TSM gets up in running in the US then it's a different story.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loy8q49/",
      "created": 1727313086,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loxxfkk",
      "score": 0,
      "body": "I personally believe in the semiconductor industry - AI or no AI (even though I also believe we are only starting to scratch the surface with AI).",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loxxfkk/",
      "created": 1727308900,
      "depth": 0,
      "replies": [
        {
          "id": "loyr2dm",
          "score": 2,
          "body": "Well yeah dude prior to semi conductors it was vacuum operated diodes and shit. Do you know someone who is personally against semiconductors and is trying to bring back vacuum activated switches and diodes? I mean it's definitely more green.",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loyr2dm/",
          "created": 1727320349,
          "depth": 1,
          "replies": [
            {
              "id": "loysgj4",
              "score": 0,
              "body": "I see plenty of people (not saying in this sub in particular) who think semis are only doing well because of the AI \"bubble\", but I think that's inaccurate. There are definitely people who aren't comfortable with the idea of investing in them.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loysgj4/",
              "created": 1727320961,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "loyc4tm",
      "score": 0,
      "body": "I am in cautious mode now, if Donald wins, we switch from bombing wars back to economic wars, specially with China.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loyc4tm/",
      "created": 1727314378,
      "depth": 0,
      "replies": [
        {
          "id": "loyn74l",
          "score": 1,
          "body": "He has no chance, and I’m a republican.",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loyn74l/",
          "created": 1727318722,
          "depth": 1,
          "replies": [
            {
              "id": "lu6at2f",
              "score": 1,
              "body": "this will not age well",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lu6at2f/",
              "created": 1730123096,
              "depth": 2,
              "replies": [
                {
                  "id": "lu6p6dj",
                  "score": 2,
                  "body": "I’ve never been more confident.",
                  "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lu6p6dj/",
                  "created": 1730127790,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lu70068",
                      "score": 1,
                      "body": "I will return to this comment in 8 days",
                      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lu70068/",
                      "created": 1730131108,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lowjldg",
      "score": -7,
      "body": "how do you value tail risk of Xi making Taiwan a part of China in the next five years, and what that means for investment?",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowjldg/",
      "created": 1727292225,
      "depth": 0,
      "replies": [
        {
          "id": "lowjp7p",
          "score": 18,
          "body": "We’ve heard this line for decades.",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowjp7p/",
          "created": 1727292258,
          "depth": 1,
          "replies": [
            {
              "id": "lowp41z",
              "score": 0,
              "body": "I mean it took around 20 years for them to get hong kong under their boot, buts it's basically done now.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowp41z/",
              "created": 1727293913,
              "depth": 2,
              "replies": [
                {
                  "id": "lowylbo",
                  "score": 3,
                  "body": "One of them was a borrowed island. It now homes a lot of rich people. \n\nThe other one vehemently despises the other. Has aligned themselves culturally, economically, and militarily to the West, and is the backbone to American IT exceptionalism.",
                  "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowylbo/",
                  "created": 1727296824,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "loygp2j",
                      "score": 1,
                      "body": "Yes, and now America has a backup and China still needs chips. The writing is on the wall.",
                      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loygp2j/",
                      "created": 1727316137,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lowwa4s",
                  "score": 1,
                  "body": "asdfasdfasdfasdf",
                  "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowwa4s/",
                  "created": 1727296114,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lox68bh",
                      "score": 3,
                      "body": "It is lazy, but I think it highlights the time scale at which China functions as opposed to western democracies, especially since Xi removed term limits and has established himself as president for life in 2018.  Xi has been very clear on reunification, and the loss of value to TSM would happen whether it's a peaceful or violent transition.",
                      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lox68bh/",
                      "created": 1727299223,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lowmpzr",
          "score": 2,
          "body": "Hate this argument, every stock except of the Military ones would be down after that",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowmpzr/",
          "created": 1727293186,
          "depth": 1,
          "replies": [
            {
              "id": "loy2j31",
              "score": 2,
              "body": "LMT is an interesting hedge against against TSM losing value.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loy2j31/",
              "created": 1727310776,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lox6d6w",
              "score": 1,
              "body": "to that point if you are invested in big tech, you are already have significant exposure to TSM already.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lox6d6w/",
              "created": 1727299268,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lowk4hx",
          "score": 1,
          "body": "They are building buildings across the United States and in the eu so they’ll just relocate more than likely",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowk4hx/",
          "created": 1727292386,
          "depth": 1,
          "replies": [
            {
              "id": "lowrn30",
              "score": 2,
              "body": "There’s no way Taiwan will let them relocate nor move any significant leading edge production out of Taiwan. \n\nTSM and the entire chip manufacturing industry is their life insurance. The only way to ensure uncle Sam needs to fly in to protect them from that hypothetical invasion. \n\nHaving said that. I don’t think that invasion is likely any time soon.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowrn30/",
              "created": 1727294686,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lowmdej",
              "score": 1,
              "body": "Way easier said than done, their stock will tank if China invades and moving some buildings out from Taiwan is not going to save them.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowmdej/",
              "created": 1727293078,
              "depth": 2,
              "replies": [
                {
                  "id": "lowrwmt",
                  "score": 1,
                  "body": "But when will China actually invade Taiwan? We hear that Story since Putin invaded Ukraine and even before that. What changed?",
                  "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowrwmt/",
                  "created": 1727294769,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lowsf8x",
                      "score": 2,
                      "body": "That's the big question, no one really knows except Xi Jinping.",
                      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowsf8x/",
                      "created": 1727294929,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lowjqfp",
      "score": -8,
      "body": "Who the fuck knows. \n\nBuy an ETF.",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowjqfp/",
      "created": 1727292268,
      "depth": 0,
      "replies": [
        {
          "id": "lowyc1l",
          "score": 4,
          "body": "wrong answer",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowyc1l/",
          "created": 1727296745,
          "depth": 1,
          "replies": [
            {
              "id": "lox0d6q",
              "score": -4,
              "body": "Thanks Nostradamus. Any actual input here or you’re gonna be a tease for the duration this thread is relevant.",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lox0d6q/",
              "created": 1727297365,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lowkkh3",
      "score": -7,
      "body": "Not if you believe Trump will win election",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowkkh3/",
      "created": 1727292521,
      "depth": 0,
      "replies": [
        {
          "id": "lowp9hy",
          "score": 2,
          "body": "How is the guy that started a trade war with China and railed about Chinese threats all 4 years somehow worse for TSM than Kamala?",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowp9hy/",
          "created": 1727293959,
          "depth": 1,
          "replies": [
            {
              "id": "lowqs34",
              "score": 2,
              "body": "He's already on record saying TSMC stole American tech and will not defend against China invasion (unless they pay) \n\nhttps://www.reuters.com/technology/tsmc-shares-fall-more-than-2-after-trump-says-taiwan-should-pay-defence-2024-07-17/",
              "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowqs34/",
              "created": 1727294420,
              "depth": 2,
              "replies": [
                {
                  "id": "lowvw7o",
                  "score": 11,
                  "body": "Kind of like how Mexico will pay to build \"the wall\" on the border.",
                  "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowvw7o/",
                  "created": 1727295995,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lowteuf",
                  "score": -7,
                  "body": "Why should we sacrifice thousands of American lives and trillions in equipment if we get nothing in return? Sounds like a reasonable position to me",
                  "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowteuf/",
                  "created": 1727295233,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lowz85o",
      "score": -9,
      "body": "Everything is priced in…",
      "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/lowz85o/",
      "created": 1727297019,
      "depth": 0,
      "replies": [
        {
          "id": "loxevjj",
          "score": 3,
          "body": "Stop, the market has “priced in” what is known. It isn’t known what TSMC’s future will be.",
          "permalink": "/r/stocks/comments/1fpcnpj/is_tsm_a_good_buy/loxevjj/",
          "created": 1727302157,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}