{
  "title": "The Chinese stock market is notching its strongest weekly gain since 2014.",
  "score": 240,
  "selftext": "The CSI300 is up by 12.4% this week so far, which is its strongest weekly gain since December 2014 (+13.4%). By the end of the day, it could be strongest weekly gain since 2008. I know we hate investing in China in this sub, but there might be a point for adding a bit of China back into your portfolio today. There are two main investment theses:\n\n1. The Chinese consumer is not financially weak, they are simply sentiment driven.\n2. Chinese government support for the market is sending the signal for retail investors to invest.\n\n**Point 1:** Context for today's environment. Chinese stock market pessimism reached peak in February 2024 as it appeared the government was not keen to provide policy support. This was a mistake in messaging by the CCP. Chinese investing culture is extremely different from the US. While US markets are more sophisticated and fundamental driven - Chinese investors are HIGHLY sentimental. Western media blames the collapse of real estate for the past 2-years of market underperformance, this is true, but not because its hurting Chinese people's financial health. It's the severing of trust in the government (that they would bail out the real estate firms and save the people's money and investment properties) that is the problem. The Chinese gross savings ratio sits at \\~44%  - unlike US consumers and investors (US personal savings rate is 3%) who CAN'T spend if the market collpases, the Chinese are simply choosing not to consume or invest. \n\nSo what does all this mean? It means the CCP needs to send the strongest possible message to the Chinese people that it will support the market and help the property industry. It doesn't actually have to do anything like a massive bailout, but it needs to be performative and convincing - like the Fed is in the US. Once sentiment swings positive, all that unallocated capital floods right back into the market - especially if it becomes a 'government-approved' medium. \n\n**Point 2:** And that's exactly what the CCP has done in the past week. It TELEVISED a PBOC announcement on a range of (tbh low-impact) fiscal policies. Then XJP called for an \"emergency\" politburo meeting to implement \"forceful\" rate cuts and support for real estate. They even allowed state-owned-entities (basically government fund managers) to borrow from the PBOC just to buy and prop up broad market indices. This is hugely sentiment swinging. The CCP is essentially saying to its people that \"you can invest safely, we are going to prioritise the market\", and retail is responding. \n\nThe fact that the Chinese market might be having its strongest weekly gain since 2014 is pretty convenient because this coincides with the 2014 bubble when the Chinese government incentivised its citizens to invest in the market - a similar environment to today. What happened then:\n\n1. The CSI almost DOUBLED between late 2014 to mid-2015. \n2. It caused one of the biggest bubbles and crashes in Chinese market history.\n\nIMO if the market is headed for a V-shape recovery, China does not appear to be a long-term play. But there is a lot to be gained from the compressed spring that is Chinese equities rn. China Tech is arguably their strongest suite of stocks (fundamentally) and they have been going absolutely gangbusters over this week. I see strong upside over a 1-year time horizon, with downside risk being political tensions w/ US and CCP failure to follow through with policy support. I would reduce portfolio exposure approaching 2021 stock market peaks in the case of market exuberance. The ideal scenario is a slow-down or even correction to allow for more sustainable recovery. In which case, corrections represent compelling entry-points.\n\n(Disclosure: 55% of my portfolio is in HK and I am up 15% over 1 week.)",
  "link_flair_text": null,
  "id": "1fqe95d",
  "num_comments": 134,
  "created_utc": 1727406390,
  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/",
  "comments": [
    {
      "id": "lp4pdyp",
      "score": 139,
      "body": "When’s the dump?",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp4pdyp/",
      "created": 1727407131,
      "depth": 0,
      "replies": [
        {
          "id": "lp4w7wz",
          "score": 127,
          "body": "soon as you buy",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp4w7wz/",
          "created": 1727410243,
          "depth": 1,
          "replies": [
            {
              "id": "lp4wa77",
              "score": 27,
              "body": "Sounds accurate. You can’t rely on the Chinese market.",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp4wa77/",
              "created": 1727410273,
              "depth": 2,
              "replies": [
                {
                  "id": "lpama3d",
                  "score": 4,
                  "body": "Watch out, you might end up saying that for a long time while Chinese stocks make new multi year highs ",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpama3d/",
                  "created": 1727497209,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpawt8a",
                      "score": 2,
                      "body": "The HSI is negative since the GFC lol. He could’ve said that at any point over the last 15+ years and be correct",
                      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpawt8a/",
                      "created": 1727503276,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lp4xe4w",
                  "score": 2,
                  "body": "I feel the CCP policies will constipate the market for several months.",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp4xe4w/",
                  "created": 1727410822,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lp4y2p9",
          "score": 6,
          "body": "When I buy there will be a dump. Gonna buy like 1 share of baba next week. It will be dump",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp4y2p9/",
          "created": 1727411165,
          "depth": 1,
          "replies": [
            {
              "id": "lp7eztt",
              "score": 7,
              "body": "No, it'll go up to entice you to buy more.  As soon as you're all in that's when the rug pull will happen.  It's like gambling.  They let you win a little to draw you in.",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp7eztt/",
              "created": 1727454069,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lp5m4o3",
          "score": 1,
          "body": "if everyone in the room read some news , you d know atleast after their National day holidays week",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5m4o3/",
          "created": 1727426054,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp525ik",
      "score": 126,
      "body": "My hang Seng index bought ~5 years ago is still pretty deep in the red.\n\nI got in BABA at ~200 years ago, exited at ~140 and reinvested it into SPY. With the gains, unless BABA hits 400 or something it won't even be comparable to keeping my money in BABA the whole time.\n\nI'm not saying that occasional bullruns in Chinese stocks are impossible, but the ceiling to run is very low and stock prices is one of the lowest priority of the CCP. For the average buy-and-hold, you're better off getting American index funds.\n\nSaying this as a Chinese btw",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp525ik/",
      "created": 1727413277,
      "depth": 0,
      "replies": [
        {
          "id": "lp67bv0",
          "score": 44,
          "body": "I read it as you bought BABA 200 years ago and thought I was in a shitpost sub.",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp67bv0/",
          "created": 1727438636,
          "depth": 1,
          "replies": [
            {
              "id": "lp6ns64",
              "score": 21,
              "body": "He bought the guy Alibaba instead of the stock",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp6ns64/",
              "created": 1727445139,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lp8130m",
              "score": 5,
              "body": "bag holding BABA for 200 years. he must be a member of /valueinvesting/\n\nholding INTC for 200 years too?",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp8130m/",
              "created": 1727461184,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lp52hmo",
          "score": 19,
          "body": "100% agree. My closing paragraph basically says that this is a tactical play and shouldn't be viewed as a signal to enter China in the long-term.",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp52hmo/",
          "created": 1727413461,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lp542ju",
          "score": 3,
          "body": "The mistake you made was buying it at an ATH during extreme exuberance.\n\nI bought 4500 shares @ 83, and will let this run coz it has got legs. \n\nTrend is your friend mate and don’t let your bias get in the way of making money.\n\nBurry bought a ton when it was in the high 60s and I am sure he is not a dumb fomo investor lol \n\nSo, yep, as with everything - be it the US or China or India, look for the right opportunity and get in and let it run.\n\nI mean, true that ppl would have been better of buying nvda or the us index, but yep, I know ppl who got into nvda at 140+ and saw their investment get slashed by a third over night. \n\nTrend is your friend, and go along with it and prioritise making money. \n\nI am not even Chinese btw",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp542ju/",
          "created": 1727414330,
          "depth": 1,
          "replies": [
            {
              "id": "lp57pq1",
              "score": 10,
              "body": "I bought googl. \n\nIm not even American btw",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp57pq1/",
              "created": 1727416445,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lp58zii",
              "score": 6,
              "body": "I'm not sure what's the point you're making actually. Are you saying that timing the market is important? To look from hindsight that one bought at highs was a mistake?\nTo say its a good price again, using hindsight?\n\nConventional wisdom is time in the market > timing the market and everything you mentioned just goes against it.",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp58zii/",
              "created": 1727417214,
              "depth": 2,
              "replies": [
                {
                  "id": "lp6y35m",
                  "score": 4,
                  "body": "He’s saying price is what you pay and value is what you get. A can of coke is a can of coke. At 50 cents it’s a good deal. At 50 dollars it’s a bad deal. It’s a can of coke regardless.",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp6y35m/",
                  "created": 1727448620,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lp59jsk",
                  "score": 12,
                  "body": "That’s bs, boomers say that.\n\nYou don’t need to aim for perfection, but don’t get in when it’s at ATHs or being exuberant, there is always a risk that you might be  at the end of a rug pull.\n\nBasically keep an eye on companies who have a legit moat but have been beaten down due to factors / reasons  that can be overcome….\n\n jumping on nvda after it has pumped 1000% is a terrible idea.\n\nGetting on baba while it was languishing in the 60s due to reasons outside its control ( but something that can change overnight) was / is not a terrible bet…. Baba has a solid moat, this is not luckin coffee. \n\nThe risks were minimal while it was at 60s\n\nA week back, saw the big contract lunr got awarded, jumped in at 7.8$, 15 k shares, jumped out at 9.5 $ in a matter of hours coz it was getting a bit irrational.\n\nEasiest 20k + but I would have been totally cool holding it coz lunr has got a solid moat. \n\nNow, I wait and watch….",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp59jsk/",
                  "created": 1727417562,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp7bwzl",
                      "score": 1,
                      "body": "This guy knows..",
                      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp7bwzl/",
                      "created": 1727453070,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lp59wez",
                      "score": 0,
                      "body": "Ah I see, lol okay whatever floats your boat.",
                      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp59wez/",
                      "created": 1727417780,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lpbts2o",
                  "score": 1,
                  "body": "Seriously. The old I got mine when hindsight bias came into play. He confidently forgot to mention his $200 shares, his $150 shares, etc etc because back then at 150$ that was over 50% discount it looked like an amazing sale that was \"obviously going to make money\"",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpbts2o/",
                  "created": 1727525080,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lp5zgm0",
          "score": 1,
          "body": "PCE and spending data are bearish in any scenario—higher values may lead to inflation, while lower values suggest a weakening economy.",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5zgm0/",
          "created": 1727434717,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lp69cos",
          "score": 0,
          "body": "So you bought at completely high levels and think that’s bad value because you lost money? I Have Baba since 70s, what do you think how I value this investment?",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp69cos/",
          "created": 1727439534,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp5lglj",
      "score": 63,
      "body": "This sub is the same as your average Joe. When stocks are down it’s like ‘no fucking way look how much it’s down’ and when they’re up it’s like ‘fucking hell I’m getting in on this shit’. \n\nAt least wallstreetbets has some semblance of self-awareness this sub is just a bunch of Cathie Wood’s who think they’re Warren Buffet’s. \n\nAnd OP Chinese stocks have been a buy for at least twelve months now - I wouldn’t go chasing trends at this moment.",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5lglj/",
      "created": 1727425579,
      "depth": 0,
      "replies": [
        {
          "id": "lp9dpiz",
          "score": 11,
          "body": "Every time I even mentioned that BABA<$90 is a great bargain I was attacked by all these morons parroting their China mantras. Now they are buying. Oh boy.",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp9dpiz/",
          "created": 1727478024,
          "depth": 1,
          "replies": [
            {
              "id": "lpcjuj3",
              "score": 4,
              "body": "And your thesis was that China would pump on massive stimulus?",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpcjuj3/",
              "created": 1727535767,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lpci7g1",
              "score": 4,
              "body": "maybe because you waited? BABA has been flat since 2022. just because you were right now doesn't mean you weren't wrong for a long time.",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpci7g1/",
              "created": 1727535187,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpao49k",
          "score": 2,
          "body": "Chinese stocks have lost like 60 to 90% multi year and some were hardcore memes: NIO, c'mon. \n\n\nThere's still dust on the ground from all those buildings that got demolished. \n\n\nHowever, now we got stimulus, time to reconsider all of them.\n\n\nDon't hate on Chinese stock discussions. ",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpao49k/",
          "created": 1727498202,
          "depth": 1,
          "replies": [
            {
              "id": "lpb8isz",
              "score": 6,
              "body": "You are proof of the backwards thinking of retail. When a stock loses 60-90% of its value - particularly because of macro reasons and not company specific - that is when you should consider buying it, *not* when it’s shot up 40% in a week. \n\nWhat you are describing are the classic retail traps of sell low buy high and letting price dictate narrative. \n\nAnd of course Chinese stocks are still cheap but anyone who’s *not* been loading up over the last year *and* is only buying them now is really just stupid retail chasing trends.\n\nFor reference I have a 15% portfolio position in various Chinese names built over the last twelve months which has now swelled to 25% over the last few days. I was trying to have Chinese stock discussions on here for the last year and got irrational hate every damn time. It’s just another case of classic inverse Reddit.",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpb8isz/",
              "created": 1727511067,
              "depth": 2,
              "replies": [
                {
                  "id": "lpbhld4",
                  "score": 4,
                  "body": "You do realize they are still massively down right?",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpbhld4/",
                  "created": 1727517613,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpbkife",
                      "score": 2,
                      "body": "Again - this is classic backwards retail thinking. You know the thing they write at the end of every single goddamn investment fund blurb - ‘past performance does not equal future results’ - yeah you’re playing the game wrong. \n\nAnd no I am not massively down - the Chinese section of my portfolio has doubled the return of SPY since I bought it.",
                      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpbkife/",
                      "created": 1727519631,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lpbuqm3",
                  "score": 2,
                  "body": "I get your logic but the irrational hate is probably because of the extra risks associated with the CCP. They really control stock prices like the tech crackdown where fundamentals were increasing and exceeding forecasts on some stocks yet they still continued to plummet down. \n\nYou still have hindsight bias by saying anything under $90 a share. When BABA was $150 people like yourself would be raising how cheap and obvious it was that you needed to get it now because how often is a stock over 50% off? In theory people were throwing 15% of their portfolio into it looking for long term gains only to find their position cut in a third on the way down to 60$.",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpbuqm3/",
                  "created": 1727525565,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpc0wtm",
                      "score": 3,
                      "body": "The irrational hate and fear mongering are manufactured by an American media terrified of their own slowly deteriorating status in the world. The China risks are real but vastly overblown and the equities got so cheap that the reward became too favourable. \n\nSaying <$90 was a good buy is not hindsight bias as it’s not based on price action it is based on cold, rational financial analysis and mean reversion. At $150 the value still did not compensate for the risks in my view however over the next few years I’m confident in saying that will be seen as a good price (as many of the risks have dissipated). \n\nAnd yes when you take a position you might see it go down by a lot before your value thesis plays out and yes it can take years. I saw my Spotify investment in 2022 go down by a third and now it’s a triple. I can say similar for Amazon, Meta, Meli etc. If you can’t handle your equities going down 50% then honestly you shouldn’t be in them in the first place.",
                      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpc0wtm/",
                      "created": 1727528446,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lp5d5vp",
      "score": 14,
      "body": ">Chinese government support for the market is sending the signal for retail investors to invest.\n\nAnd it will reverse when the Gods that be change their mind. \n\nI hope your post didn't convince some poor sod that China is a good stock investment.",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5d5vp/",
      "created": 1727419866,
      "depth": 0,
      "replies": [
        {
          "id": "lpbuxog",
          "score": 1,
          "body": "Agreed. Stock prices are only off the CCP's mood that day not fundamentals. Nothing more frustrating than seeing your stock beat expectations, blowing it out of the water, yet it drops 5% because CCP threatens more crackdowns",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpbuxog/",
          "created": 1727525664,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp4pr5a",
      "score": 30,
      "body": "sorry buddy. credit swiss is out of money and out of business. go find some other dumba$$es to fleece.",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp4pr5a/",
      "created": 1727407285,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp4xzbw",
      "score": 10,
      "body": "As soon as anyone follows OP's recommendations, quantum China dump protocol gets activated!",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp4xzbw/",
      "created": 1727411118,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp5n0yf",
      "score": 5,
      "body": "Could be a rug pull before the annual party conference next week. Better wait to see what the party declares there first.",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5n0yf/",
      "created": 1727426691,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp7os5z",
      "score": 4,
      "body": "Way too risky",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp7os5z/",
      "created": 1727457233,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp5giut",
      "score": 9,
      "body": "Cool you’re up 15% in one week, but you’re still underperforming the market YTD",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5giut/",
      "created": 1727422121,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp4vkss",
      "score": 23,
      "body": "The median wealth of Chinese citizens kind of disagrees with the premise",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp4vkss/",
      "created": 1727409929,
      "depth": 0,
      "replies": [
        {
          "id": "lp533ks",
          "score": 19,
          "body": "median wealth of a typical Chinese is actually not bad, which may or may not be shocking to some poeple.",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp533ks/",
          "created": 1727413794,
          "depth": 1,
          "replies": [
            {
              "id": "lp5mafj",
              "score": 3,
              "body": "idk , it is just $1000 salary",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5mafj/",
              "created": 1727426168,
              "depth": 2,
              "replies": [
                {
                  "id": "lp9m9nr",
                  "score": 2,
                  "body": "yeah salaries are low but there are a shit load of small business owners, who capitalize on the $1000 salary.",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp9m9nr/",
                  "created": 1727481417,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lp98h7m",
                  "score": 2,
                  "body": "But prices in China are much lower.\n\nFor example, you can have breakfast in China for $1\n\nSo it’s easier to save money",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp98h7m/",
                  "created": 1727475985,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lp4wkq0",
          "score": -8,
          "body": "2022 study showed the median wealth of Chinese citizens is higher than the median wealth of Europeans.",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp4wkq0/",
          "created": 1727410418,
          "depth": 1,
          "replies": [
            {
              "id": "lp51ax4",
              "score": 13,
              "body": "I would honestly just go with nominal gdp per capita in this case.  Median wealth doesn't paint an accurate picture.  This [wiki ](https://en.wikipedia.org/wiki/List_of_countries_by_wealth_per_adult)article shows median wealth of China at par with the median wealth of Europe, around 27k.  It also shows that the median wealth of Iceland is 413k, and Canada has a higher median wealth at 137k than the US, who is at 107k.  I don't think people in Iceland are 4 times more wealthier than those in the U.S., and if I told my fellow Canucks that we are doing better than the average American, I'll get laughed at.",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp51ax4/",
              "created": 1727412821,
              "depth": 2,
              "replies": [
                {
                  "id": "lp56lyr",
                  "score": 7,
                  "body": "I dont think the nominal gdp per capita alone is accurate. Look at chinese gdp purchasing power (PPP) as well.. it would only be fair and the chinese have higher ppp than usa currently.",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp56lyr/",
                  "created": 1727415791,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp94o7o",
                      "score": 1,
                      "body": "Their stuffs are cheap doesn't mean  they have growth, see where the sector growth is, and most of them are state owned and books can be cooked. I doubt their gdp is pretty made up too.",
                      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp94o7o/",
                      "created": 1727474537,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lp5in80",
                  "score": 5,
                  "body": "The median wealth shows China at par with Europe because there are tons of poor European countries, predominantly the ones not part of the EU.\n\nRussia and Turkey have HUGE populations compared to EU nations and they are counted as Europe.\n\nThat same link shows the median wealth of EU is $77.5k which is much higher than China's $27k.\n\nIt makes no sense to group Russia, Turkey and Germany together while separating China, India and SEA. \n\nIt would be like grouping Germany with Indonesia then saying China has a higher median wealth than Germany + Indonesia. While technically true, it holds no value other than to push a skewed narrative.\n\nI think most people understand the reality that western European countries are far wealthier than China as a whole, and that China itself is a multi-tier country where some areas have wealth on the level of western europe while other areas have wealth on the level of poorer south east asian nations.",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5in80/",
                  "created": 1727423603,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lp6adcy",
                  "score": 1,
                  "body": "The Canadian stat is surely driven by their insane housing inflation, with people who bought more than a couple years banking tons of equity.",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp6adcy/",
                  "created": 1727439976,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp6jcul",
                      "score": 0,
                      "body": "Exactly. ",
                      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp6jcul/",
                      "created": 1727443530,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lp51smc",
              "score": 17,
              "body": "you’re absolutely correct. you’re going to be downvoted in this sub because people are unable to wrap their heads around what you’re saying without taking it as “you’re doing CCP propaganda,” but if anyone has an open mind just know OP is correct, and the post above is a beautiful explanation of current events. OP isn’t trying to spread propaganda or anything, they did a great job explaining things very concisely.\n\nthe chinese economy and culture is very different than here in the US, and this means very different things for investments in China. however if any of OP said was convincing, consider it. After hearing the news I allocated a small portion of my portfolio to specifically China, because this IS a good signal.",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp51smc/",
              "created": 1727413082,
              "depth": 2,
              "replies": [
                {
                  "id": "lp52dat",
                  "score": -5,
                  "body": "Throwing money at an economy failing due to over regulation, demographic collapse, low confidence and lack of innovation isn’t going to fix it. I still wouldn’t put money into China as a long term investment simply because there are too many risks.",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp52dat/",
                  "created": 1727413396,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp57a92",
                      "score": 4,
                      "body": "Failing due to over regulation, demographic collapse, low confidence are fair assessments. But when you say lack of innovation, that word alone has no grounds and delegitimizes your whole statement. Its like me saying i fucked your friends friend. Ok? That could be true. Then ill say i fucked your sisters friends brother. Ok that might be true too. Then i say i fucked your dad. Well now thats clearly not true. Thats how you sound like with this comment. China is definitely innovating. Theyve innovated more than the US in various sectors, like renewable energy, transportation and logistics, evs, 5g. Brother if you potentially watch anti-chinese propaganda 24/7 (and im not saying you are) and believe this kind of bs, you are either a really good grifter or you shouldnt touch the stock market or at the very least give any one real advice.\n\nI want to add that personally i wouldnt invest more than even 1% of my portfolio in chinese stocks unless i was more well read on them.",
                      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp57a92/",
                      "created": 1727416190,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lp5gtpk",
                          "score": 1,
                          "body": "i think its weird this is happening right after the important dude with all the power disappeared an important economist",
                          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5gtpk/",
                          "created": 1727422333,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lp5e1i6",
                          "score": 1,
                          "body": "VC funding has collapsed and startups have fallen to 1,200 from 50,000 in the span of a couple years. \n\nBig companies can’t independently innovate forever, this is a major issue and isn’t something I’m hyperbolising about.\n\n[https://www.ft.com/content/1e9e7544-974c-4662-a901-d30c4ab56eb7](https://www.ft.com/content/1e9e7544-974c-4662-a901-d30c4ab56eb7)",
                          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5e1i6/",
                          "created": 1727420435,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lp5iqs4",
          "score": 0,
          "body": "You can compare stats all day but chinese citizens are pretty well off in general.",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5iqs4/",
          "created": 1727423672,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp87ixq",
      "score": 3,
      "body": "After my BABA dropped to 1/3 of the purchase price I will just not buy anything China no matter how alluring it seems",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp87ixq/",
      "created": 1727463283,
      "depth": 0,
      "replies": [
        {
          "id": "lpbx0rk",
          "score": 2,
          "body": "Yeah people are just jumping on the speculation wagon convincing themselves it's good fundamentals for no apparent reason. \n\nJust wait for Trump to look like he's seriously getting elected in 2 months and watch the massive rug pull unfold beyond your eyes",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpbx0rk/",
          "created": 1727526680,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpw9q3w",
          "score": 1,
          "body": "The reason BABA has dropped so much is cos Blackrock has been selling their shares for years + negative sentiments.",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpw9q3w/",
          "created": 1727826291,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp5dckc",
      "score": 4,
      "body": "Nah. I completely agree with the lady from Bank of America said today on Bloomberg (I am having trouble finding her name, it was Winnie something)\n\nIt’s just words so far. Lowering rates from the monetary side is a start. But they’ve done nothing but give words on the fiscal side. Which is by far the most important here.\n\nShe basically said they went for low-hanging fruit and the actions they’ve done so far will do next to nothing besides provide some short-term exuberance\n\nThe only thing we’ve gotten is a Reuters report about 2T yuan, but that’s something like $300-$400B and that’s just a drop in the bucket on what they need. Goldman put out something saying something along the same lines\n\nYou can trade some really short term stuff and be nimble about it. But ultimately I don’t think this will be digested well. If Tepper didn’t go out and talk his book this morning then the price action would be totally different imo\n\nJust gonna stay out. There’s a million stocks to buy",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5dckc/",
      "created": 1727419985,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp5td61",
      "score": 11,
      "body": "Who the fuck trusts Chinese accounting lmfao",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5td61/",
      "created": 1727431072,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp6iqgn",
      "score": 2,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp6iqgn/",
      "created": 1727443299,
      "depth": 0,
      "replies": [
        {
          "id": "lpaxjgi",
          "score": 2,
          "body": "Flashbacks to Ozon stirring up some talk lol. There was a glitch on CNN and a couple other sites that showed analyst price targets in Rubles as being in Dollars and so many people thought analysts were calling for it to 100x.\n\nGood call though. I will say that china can absolutely screw you though. See: Ant group IPO getting blocked cause Jack Ma said mean things, random game rules being announced that crushed Tencent out of nowhere, and a thousand other things. It’s a regulatory environment that can 180 in split seconds and china can absolutely screw you",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpaxjgi/",
          "created": 1727503736,
          "depth": 1,
          "replies": [
            {
              "id": "lpbvs8h",
              "score": 1,
              "body": "1000%\nCCP's mood effects prices not fundamentals. The sooner people realize this hidden risk/reward nature the sooner they realize the gains aren't worth it when high risk",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpbvs8h/",
              "created": 1727526084,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lp4pyk7",
      "score": 9,
      "body": "How can I short this? ",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp4pyk7/",
      "created": 1727407372,
      "depth": 0,
      "replies": [
        {
          "id": "lp547ps",
          "score": 13,
          "body": "Please do- we want all the liquidity we can take. \n\nWhat’s that ? You ain’t got the balls now ? Go on, you can short baba, that is pretty much Chinese tech - do it mate, and post your position.\n\nHate ppl who just talk and don’t do crap",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp547ps/",
          "created": 1727414411,
          "depth": 1,
          "replies": [
            {
              "id": "lp56wv3",
              "score": -5,
              "body": "Found the Chinese bot",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp56wv3/",
              "created": 1727415971,
              "depth": 2,
              "replies": [
                {
                  "id": "lp5afms",
                  "score": 5,
                  "body": "Found the guy who missed out on the gains",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5afms/",
                  "created": 1727418112,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp5aqxh",
                      "score": -2,
                      "body": "American defense stocks had better gainz son",
                      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5aqxh/",
                      "created": 1727418307,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lp99lgp",
          "score": 1,
          "body": "if you dont know how to short something, you probably shouldn't be shorting",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp99lgp/",
          "created": 1727476419,
          "depth": 1,
          "replies": [
            {
              "id": "lp9w5gb",
              "score": -1,
              "body": "It was rhetorical. \n\n\nrhetorical\n\n\nadjective \n\n\nrhe·​tor·​i·​cal ri-ˈtȯr-i-kəl \n\n\n1 a : of, relating to, or concerned with rhetoric \n\n\nb : employed for rhetorical effect especially : asked merely for effect with no answer expected",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp9w5gb/",
              "created": 1727485497,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpx8ipy",
          "score": 0,
          "body": "Hope you didn't short my friend - you'd be looking a little silly right now",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpx8ipy/",
          "created": 1727839423,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp5flfb",
      "score": 6,
      "body": "My rule no. 1 no chinese stocks.\nLook at what happened to russian stocks.\nInvest in stable nations.",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5flfb/",
      "created": 1727421477,
      "depth": 0,
      "replies": [
        {
          "id": "lpbvkv3",
          "score": 1,
          "body": "Wish I learnt that before BABA dropped to 18% of it's value from peak",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpbvkv3/",
          "created": 1727525983,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp4ulzg",
      "score": 5,
      "body": "Update: The CSI300 is now up 15.7% for the week - the biggest weekly gain since November 2008.\n\nEdit: updated stat 12.4% -> 14.9%\n\nEdit 2: updating 14.9% -> 15.7%",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp4ulzg/",
      "created": 1727409477,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp51req",
      "score": 2,
      "body": "pump and dump time",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp51req/",
      "created": 1727413063,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp7mkfw",
      "score": 2,
      "body": "USA stocks are overvalued. Chinese stocks are undervalued. The rise of Chinese stocks was going to happen. The China market is the 2nd largest globally and will become the largest.",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp7mkfw/",
      "created": 1727456518,
      "depth": 0,
      "replies": [
        {
          "id": "lpbv8o0",
          "score": 1,
          "body": "China doesn't play off fundamentals. Besides questionable reporting standards the CCP has way bigger influence on any stock price than their underlying fundamental ever will. It wasn't that long ago they shook their fist, screamed Tech crackdown or 18 months or so and you watched your portfolio instantly cut into a 1/3 of what it previously was",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpbv8o0/",
          "created": 1727525817,
          "depth": 1,
          "replies": [
            {
              "id": "lpdd864",
              "score": 2,
              "body": "Have you been to China. It is far more advanced than North America. There’s a reason why they are becoming the global leader. \n\nJump on board or miss out.",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpdd864/",
              "created": 1727545810,
              "depth": 2,
              "replies": [
                {
                  "id": "lpdti1i",
                  "score": 1,
                  "body": ">Jump on board or miss out.\n\nThis is foolish thinking.",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpdti1i/",
                  "created": 1727551406,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpdto50",
                      "score": 2,
                      "body": "It’s not. China has massive companies.",
                      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpdto50/",
                      "created": 1727551468,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lplom7f",
                          "score": 1,
                          "body": "Companies under the thumb of the cap,  never forget that",
                          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lplom7f/",
                          "created": 1727668796,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lqav9sk",
                  "score": 1,
                  "body": "Ever since I’ve been to China in person and saw what I saw I started to invest in Chinese stocks. I’m glad it’s now paying off. ",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lqav9sk/",
                  "created": 1728050430,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lqbn8mx",
                      "score": 1,
                      "body": "Me too. What the media communicates vs reality are very different. Congratulations on the gains.",
                      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lqbn8mx/",
                      "created": 1728059541,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lp5n7kq",
      "score": 1,
      "body": "I don't see anyway they can prip up the property market, there's alot of city debt and that debt gets served from selling government land and as far as I can tell the property market is already saturated and people are wary of buying into a project that doesn't get finished.  This just feels like an exercise to get households into more debt and feed the money to the top. How can the stock market grow without consumers spending, I just don't see the end game and it looks far too grey.",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5n7kq/",
      "created": 1727426821,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp6l4xm",
      "score": 1,
      "body": "Michael burry was right all along….",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp6l4xm/",
      "created": 1727444194,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp8s393",
      "score": 1,
      "body": "I bought Chinese etf's as soon a Tepper pumped it all up",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp8s393/",
      "created": 1727470082,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpcex5h",
      "score": 1,
      "body": "Chinese market surges potential short-term gains with sentiment-driven investing.",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpcex5h/",
      "created": 1727534027,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpfddta",
      "score": 1,
      "body": "And then when trump comes in he will cargo banned china again",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpfddta/",
      "created": 1727572489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpm5gnu",
      "score": 1,
      "body": "Maybe if it goes up enough, it will simply rescue all the people in the red for having bought in on it some years ago?",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpm5gnu/",
      "created": 1727678838,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqb3boj",
      "score": 1,
      "body": "Chasing a trend in a volatile stock/market by a retail investor usually doesn't end well.  However, a trend \\*may\\* continue. There is some support for that here in that more stimulus is predicted by several experts. Whether those like Tepper stay with his upside call or are now selling is unknown. I wouldn't risk much.  I preferred to bias my international investments more towards India and Japan.",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lqb3boj/",
      "created": 1728053142,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp4y0hl",
      "score": 0,
      "body": "Chinese stocks were so, so cheap back in January. Let’s hope this rally holds. ",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp4y0hl/",
      "created": 1727411135,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp64vv0",
      "score": 1,
      "body": "Since it is artificially boosting the US economy to make the current leadership seem competent enough to deserve another term it will have that domestic impact too",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp64vv0/",
      "created": 1727437499,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp7t71b",
      "score": 1,
      "body": "My emergin market is 15 % of my total. I sold my Indian mutual fond and re directed it to china since i heard alot of positive news on the radio about china. I mean the goverment can be bad but many companies are profitabel and solid!\n\nSince alot of the world markets are expensive i belive the second largest economy in the world will have to come out of this accumulation phase thats its in right now.",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp7t71b/",
      "created": 1727458640,
      "depth": 0,
      "replies": [
        {
          "id": "lpbwpf5",
          "score": 1,
          "body": "This isn't America. The risk/reward is a lot greater because of a multitude of reasons. The biggest of which is the CCP's mood determines the stock price not the underlying fundamentals of the company. Do you not recall when 75% of the tech company blew away analysis expectations yet they were down 5-10% because the CCP did a 180 and was grumpy that day screaming tech crackdown? That wasn't even that long ago. \n\nAll I'm saying don't just buy Willy Milly because 2nd largest economy, fundamentals etc. BABA was considered the Amazon of China (retail and cloud computing divisions) yet dropped to 18% of its peak value which is insane for a 'safe' stock, all because the CEO forgot to give unlimited praise to the CCP. \n\nMake sure you factor in everything, for example a Trump presidency. If he is going to throw 20% blanket tariffs on China how do you think your portfolio is going to do next month when people assess that upcoming risk and start bailing on China? Did you factor in he might ban chinese stocks? Etc etc\n\nAlso sorry for responding to you again but I hope the more detailed response is thought provoking for you",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpbwpf5/",
          "created": 1727526528,
          "depth": 1,
          "replies": [
            {
              "id": "lpefrfi",
              "score": 1,
              "body": "I understand that the risk/reward is far greater than our companys that why i *only invest 15*. But i belive the climate will change because the ccp whants to attract foreing investors again and they made a big misstake on the tech crackdown. They are signaling exactly that now when they released the news of the first money injection and i belive more good news will come out in the future. \n\nYou are right about that if Trump will bring home the flag and put tarifs or even bans on certain products.\nI belive that even if he prefers to do that its just for political gains. American market is way to intertwined with the Chinese goods fo",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpefrfi/",
              "created": 1727559337,
              "depth": 2,
              "replies": [
                {
                  "id": "lpegbqe",
                  "score": 1,
                  "body": "What im saying is that even a ban or tarifs on certain product from china will not affect the market long term and is used for political gains.",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpegbqe/",
                  "created": 1727559548,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lpwapgz",
              "score": 1,
              "body": "There are other stocks to invest in the China bull run. If anyone is keen to invest, stay out of US business related.\nAnyway, the stimulus is to boost up domestic demand and sentiments.",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpwapgz/",
              "created": 1727826655,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lp9l4a7",
      "score": 1,
      "body": "Bought the peak at like 220 sold at 80 about 20k loss, I’m a regard",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp9l4a7/",
      "created": 1727480953,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp50c84",
      "score": -2,
      "body": "Wish I hadn’t sold BABA, looks super bullish right now.",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp50c84/",
      "created": 1727412319,
      "depth": 0,
      "replies": [
        {
          "id": "lp5rznx",
          "score": 4,
          "body": "Then buy it?",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5rznx/",
          "created": 1727430173,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp80tfl",
      "score": 0,
      "body": "Damn everyone is hating on the chinese stocks.  JD is still pretty undervalued and made some good money from it so far lol",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp80tfl/",
      "created": 1727461097,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp8kk26",
      "score": 0,
      "body": "Xi looks like he has told the government to fix the problems and meet the goals for year end \n\nThey aren’t sitting back any longer.",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp8kk26/",
      "created": 1727467576,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp4per4",
      "score": -33,
      "body": "This is your sign to buy Chinese stocks, it’s only the beginning of a wonderful economic recovery. China has really outdone itself this time.",
      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp4per4/",
      "created": 1727407140,
      "depth": 0,
      "replies": [
        {
          "id": "lp4pzxv",
          "score": 18,
          "body": "Are you okay? ",
          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp4pzxv/",
          "created": 1727407389,
          "depth": 1,
          "replies": [
            {
              "id": "lp517xc",
              "score": 9,
              "body": "He just got back from his vacation at the nearest “political reeducation” camp. He has never felt better.",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp517xc/",
              "created": 1727412777,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lp5yivw",
              "score": -5,
              "body": "All Chinese stocks up pre market while America stocks are red, tell me, whose economy is currently thriving? America is at the peak it’s only downhill from here, China stocks are the way to go if you’re looking to make money!",
              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp5yivw/",
              "created": 1727434202,
              "depth": 2,
              "replies": [
                {
                  "id": "lp698er",
                  "score": 4,
                  "body": ">tell me, whose economy is currently thriving? \n\n\nIs this a trick question? Definitely not the one that had to turn the money printer on and pay people to invest.  \n\n\nAlso, the American stock market is in the middle of one of the most blistering bull runs in history. ",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp698er/",
                  "created": 1727439483,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp6i443",
                      "score": -4,
                      "body": "You say “the most blistering bull runs” but you know it’s solely due to AI hype and when it booms everything will go down right? It’s just a sham, and I know that you know this deep inside.",
                      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp6i443/",
                      "created": 1727443064,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lp6j6np",
                          "score": 6,
                          "body": ">It’s just a sham, and I know that you know this deep inside.\n\n\nYou are projecting so hard right now for Winnie the Pooh, lol. \n\n\nTwo days of finally some gains in the Chinese stock market (still down YTD) after a massive artificial stimulus is as convincing as pausing trading on the Russian ruble because everything is 'fine'. It's not something you do because everything is fine. It's something you do because everything is not fine. ",
                          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp6j6np/",
                          "created": 1727443467,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lp6js1i",
                              "score": -2,
                              "body": "Whatever, I don’t feel like arguing with someone who doesn’t know what they’re talking about. Feel free to look back at this comment 1 year from now just to realize how wrong and misguided you were.",
                              "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp6js1i/",
                              "created": 1727443689,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lp6k4yi",
                                  "score": 3,
                                  "body": "Remindme! One year. ",
                                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp6k4yi/",
                                  "created": 1727443823,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lp6kb7c",
                                      "score": 1,
                                      "body": "I will be messaging you in 1 year on [**2025-09-27 13:30:23 UTC**](http://www.wolframalpha.com/input/?i=2025-09-27%2013:30:23%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp6k4yi/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1fqe95d%2Fthe_chinese_stock_market_is_notching_its%2Flp6k4yi%2F%5D%0A%0ARemindMe%21%202025-09-27%2013%3A30%3A23%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201fqe95d)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp6kb7c/",
                                      "created": 1727443888,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "lpyx1w0",
                                      "score": 0,
                                      "body": "Laughing at you right now 😂😂",
                                      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpyx1w0/",
                                      "created": 1727874058,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lpz13cd",
                                          "score": 1,
                                          "body": "You're very bad at telling time, lol.",
                                          "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpz13cd/",
                                          "created": 1727875620,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "lpbxa56",
                                  "score": 1,
                                  "body": "One year from now if I'm lucky I'll break even on BABA, meanwhile the S and P 500 doubled from the time I invested in BABA over the S and P. China sucks ass man",
                                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lpbxa56/",
                                  "created": 1727526805,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lp6ftrd",
                  "score": 5,
                  "body": "You need help",
                  "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp6ftrd/",
                  "created": 1727442191,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp6ic0r",
                      "score": 0,
                      "body": "I believe that the ones who need help are those not investing in China and are missing out on free money. But to each their own I suppose.",
                      "permalink": "/r/stocks/comments/1fqe95d/the_chinese_stock_market_is_notching_its/lp6ic0r/",
                      "created": 1727443148,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}