{
  "title": "East Coast port strike looms for first time since 1977.",
  "score": 82,
  "selftext": ">Thousands of dockworkers at every major East and Gulf coast port are girding to strike starting early next week, threatening to close trade gateways that handle about half of all goods shipped in containers in and out of the U.S.\n\n>Negotiations between the union representing dockworkers and a shipping industry group representing terminal operators and ocean carriers have been stalled for months, with both sides this week issuing conflicting statements about their willingness to bargain.\n\n>The union representing 45,000 dockworkers, the International Longshoremen's Association (ILA), is threatening to strike at ports from Massachusetts to Texas if a new labor deal with the USMX isn't reached before the current contract expires at midnight on September 30. A walkout would be the first East Coast dock strike since 1977. \n\n>The ports that could close in a strike handle more than 68% of all containerized exports in the U.S. and roughly 56% of containerized imports, according to industry data. So even a short strike would cause significant disruptions in regional trade flows. One analysis estimated that could cost the U.S. economy as much $5 billion a day.\n\nLink: https://www.cbsnews.com/amp/news/east-coast-port-strike-what-to-know/\n\nAny thoughts on what this could mean for the stock market and which companies will be impacted most?",
  "link_flair_text": null,
  "id": "1fqnjs1",
  "num_comments": 12,
  "created_utc": 1727443196,
  "permalink": "/r/stocks/comments/1fqnjs1/east_coast_port_strike_looms_for_first_time_since/",
  "comments": [
    {
      "id": "lp74wt5",
      "score": 49,
      "body": "I think this strike will be an enormous wakeup call to the ports to put more work forward into automating after seeing the havoc that the union causes. \n\nMajor ports in other nations are mostly automated, the US is sadly stuck in the past due to collective bargaining against the interest of advancing port technology.\n\nSucks for the poor dockworkers to be caught between all this, with shit conditions and bad job security. Not too dissimilar to what happened to the coal miners.",
      "permalink": "/r/stocks/comments/1fqnjs1/east_coast_port_strike_looms_for_first_time_since/lp74wt5/",
      "created": 1727450832,
      "depth": 0,
      "replies": [
        {
          "id": "lp8s8ab",
          "score": 28,
          "body": "https://www.pbs.org/newshour/amp/nation/dockworkers-threaten-to-strike-at-key-u-s-ports-over-automation-and-pay\n\nThey want a total ban on automation.   1/3 of longshoremen based in new york harbor made over 200,000$ due to overtime pay.  \n\nIn Canada we have the same issues with unions fighting against automation.  Some of Canada and US ports are ranked lowest in the world.\n\nhttps://www.reddit.com/r/Ships/comments/1at5rtv/why_are_us_and_canadian_ports_among_the_least/",
          "permalink": "/r/stocks/comments/1fqnjs1/east_coast_port_strike_looms_for_first_time_since/lp8s8ab/",
          "created": 1727470129,
          "depth": 1,
          "replies": [
            {
              "id": "lpmz3d3",
              "score": 3,
              "body": "Ayyy looks like the mafia rackets never really went away huh",
              "permalink": "/r/stocks/comments/1fqnjs1/east_coast_port_strike_looms_for_first_time_since/lpmz3d3/",
              "created": 1727698052,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lpcusxi",
              "score": 2,
              "body": "Port of Montreal is striking too",
              "permalink": "/r/stocks/comments/1fqnjs1/east_coast_port_strike_looms_for_first_time_since/lpcusxi/",
              "created": 1727539566,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lp77yi0",
          "score": 33,
          "body": "The dockworkers have been making insane bank for decades because these longshoremen unions act like medieval fiefdoms where they refuse to adopt technology and most people won't ever be able to join it unless they're related to a current member.\n\nDoubt it'll ever change organically, either, because obviously the dockworkers will keep electing these union leaders who will line their pockets. \n\nJust check out this thread with a bunch of longshoremen talking about how landing that job is like being given a winning lotto ticket: https://www.reddit.com/r/Longshoremen/comments/8dryun/why_is_this_job_so_sought_after/\n\nDon't get me wrong, I'm generally very pro-union, but this one specifically has morphed into an entirely different beast.",
          "permalink": "/r/stocks/comments/1fqnjs1/east_coast_port_strike_looms_for_first_time_since/lp77yi0/",
          "created": 1727451811,
          "depth": 1,
          "replies": [
            {
              "id": "lp7d8jx",
              "score": 8,
              "body": "Careful having an anti-union sentiment on Reddit, that could cost you dearly.\n\nSadly I'm in the business of importing and exporting so I know how shit our east coast ports are and how archaic our technology and work are. There is no reason we should be loading containers the same way we did 60 years ago. Other nations ports put us to absolute shame and it's entirely the fault of the union having a stranglehold on the infrastructure.",
              "permalink": "/r/stocks/comments/1fqnjs1/east_coast_port_strike_looms_for_first_time_since/lp7d8jx/",
              "created": 1727453499,
              "depth": 2,
              "replies": [
                {
                  "id": "lph27il",
                  "score": 1,
                  "body": "Unions are just flat out bad these days. Its like organized theft.",
                  "permalink": "/r/stocks/comments/1fqnjs1/east_coast_port_strike_looms_for_first_time_since/lph27il/",
                  "created": 1727606656,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lpdpjd6",
          "score": 3,
          "body": "My understanding is that the West Coast ports are fairly automated, but the East Coast ones are prevented from doing so by the unions",
          "permalink": "/r/stocks/comments/1fqnjs1/east_coast_port_strike_looms_for_first_time_since/lpdpjd6/",
          "created": 1727550026,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp8l3q2",
      "score": 1,
      "body": "Inflation in bound",
      "permalink": "/r/stocks/comments/1fqnjs1/east_coast_port_strike_looms_for_first_time_since/lp8l3q2/",
      "created": 1727467758,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp6mdvy",
      "score": -8,
      "body": "Of we will pay more",
      "permalink": "/r/stocks/comments/1fqnjs1/east_coast_port_strike_looms_for_first_time_since/lp6mdvy/",
      "created": 1727444644,
      "depth": 0,
      "replies": []
    }
  ]
}