{
  "title": "Why Healthcare stocks not popular around?",
  "score": 42,
  "selftext": "I am new to stock market subs. What caught my attention is healthcare stocks are rarely discussed. I am surprised because unlike other industries:\n\n* Healthcare companies announce product sales and regional sales numbers\n* Healthcare companies clearly state if there is competition or not\n* Easier to forecast because both Patent expiry date and pipeline are public information\n\nWhat I like about healthcare market at large:\n\n* Healthcare is one of three defensive industries according to Morningstar. Others are Utilities and Consumer Defensive. Utilities almost always underperform the market. For Consumer Defensive, there are huge barriers to entry. Bluechips in Beverages or Tobacco are hard to challenge. In bear market I am going to buy Utilities and Consumer Defensive; otherwise I chase Healthcare for defensive stocks and stability in my portfolio.\n* The reason I go for healthcare stocks is that they possess protected downside with upside potential. It is hard to quantify the \"upside.\" I try to ask healthcare professional friends of mine about the drugs.\n* Another reason that I go for HC is its historical performance compared to other costs. I am sure most of you are familiar with Moore's law. Please also check Eroom's Law (that is opposite of Moore's) which applies to healthcare industry. There are countless articles about the increase in healthcare spending despite technological advancement over years. Bad news for citizens, good for investors.\n   * [https://www.ncbi.nlm.nih.gov/books/NBK234309/](https://www.ncbi.nlm.nih.gov/books/NBK234309/)\n   * [https://www.weforum.org/agenda/2024/08/healthcare-costs-digital-tech/](https://www.weforum.org/agenda/2024/08/healthcare-costs-digital-tech/)\n* In my experience, the biggest issue in healthcare market is Litigation. Most common cause is copycats. If you can avoid this risk; then, the possibility of Merger and Acquisition is quite common and really exciting along with growth potential.",
  "link_flair_text": "Industry Discussion",
  "id": "1fqri07",
  "num_comments": 78,
  "created_utc": 1727453655,
  "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/",
  "comments": [
    {
      "id": "lp7q6fb",
      "score": 31,
      "body": "Healthcare investing is tricky. New regulations can come out of nowhere and fuck up your profits. You need to pay a lot of attention to news. Also, biotech and pharma waste a lot of money on research. If that research does not brings good results in a certain ammount of time, stock price can plummet.  You need to invest in those stocks when they are undervalued to be safe, and many are probably overvalued.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7q6fb/",
      "created": 1727457679,
      "depth": 0,
      "replies": [
        {
          "id": "lpalux8",
          "score": 10,
          "body": "Everyday there is a news article with this format:\n\n\"XYZ company has gotten approval for ABC trials!\"\n\nThey never mention that this is step 2 out of a 19 step - 6 year process IF everything goes correctly.\n\nTbh, it's just another tuesday in the pharma/biotech world.",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpalux8/",
          "created": 1727496986,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lp7uzac",
          "score": 2,
          "body": "I agree with you for short and mid-term investing. Some stocks cannot recover from sharp plummets.  \nHowever, my conclusion from Eroom's Law on healthcare is that patients pay for regulatory, litigation and R&D costs in long-term.\n\nOvervaluation is thing. If a HC company has growing net income and low debt, P/E is definitely 30+. Couldn't find an exception yet",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7uzac/",
          "created": 1727459209,
          "depth": 1,
          "replies": [
            {
              "id": "lpidauz",
              "score": 1,
              "body": "And.. just listen to Karmala Harris and her plans for pharma industry. You'd want to stay away from this sector!",
              "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpidauz/",
              "created": 1727626581,
              "depth": 2,
              "replies": [
                {
                  "id": "lpimaz8",
                  "score": 1,
                  "body": "I admit Both candidates possess some level of risk. However, I remember an Obama interview (probably a docuseries in Netflix) where he said something like “Healthcare is 6% of GDP, you can’t change the rules so easily”",
                  "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpimaz8/",
                  "created": 1727629455,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lp7lnkc",
      "score": 56,
      "body": "Novo Nordisk and Eli Lilly are very expensive, and Pfizer is also quite expensive. The growth is priced-in and there's tons of downside potential from increased regulation.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7lnkc/",
      "created": 1727456226,
      "depth": 0,
      "replies": [
        {
          "id": "lp7u9pc",
          "score": 17,
          "body": "People been saying that for months, it's expensive at 400 it's expensive at 500, now lly is at 900. Same with Costco, people don't learn",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7u9pc/",
          "created": 1727458982,
          "depth": 1,
          "replies": [
            {
              "id": "lp8gbk3",
              "score": 18,
              "body": "Lumping Costco with lly is bizarre. Lly actually has growth- eps grew 68%\n\nCost grew eps 11%. If we're betting on Costco doubling, it would mean their pe would need to expand from 53 to 106 as they're not going to get there through growth",
              "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp8gbk3/",
              "created": 1727466181,
              "depth": 2,
              "replies": [
                {
                  "id": "lp8h7bo",
                  "score": 1,
                  "body": "That's my point..",
                  "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp8h7bo/",
                  "created": 1727466469,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp8kqjc",
                      "score": 11,
                      "body": "youre saying costco deserves the stock price growth\n\nit doesnt lmao. it's way too expensive and is detached from fundamentals, its a meme stock\n\nlly is expensive too but there's actually fundamentals there to justify it",
                      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp8kqjc/",
                      "created": 1727467636,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpbc42k",
                          "score": 2,
                          "body": "Costco a meme stock?? Hahah, GTFOH. They’re the third largest retailer in the world.",
                          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpbc42k/",
                          "created": 1727513640,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lpapt5l",
                  "score": 0,
                  "body": "11% is still much higher than the 7% EPS growth average of the SP500 since 1945. Costco is not a bad investment by any means. Expensive? Maybe, but it should still beat the market if it continues at this pace.",
                  "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpapt5l/",
                  "created": 1727499128,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpbvv8k",
                      "score": 2,
                      "body": "youre blinded by price action. assume COST continues their past 5 yr growth rate which is 15% (not 11% mb) and their multiple contracts to 35x\n\nit would mean their stock price grows 0% for the next 3 years while hitting those metrics. and when you say oh that'll never happen, their multiple is just going to keep going up(PE expanded from 37 to 53 in the past year despite the same level of growth)! it'll be higher than tsla (73 PE) + nvda (57 PE, forward PE 43) combined! remember the nifty 50, where people were paying 80x PE for mcdonalds because \"they're an amazing stock\"",
                      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpbvv8k/",
                      "created": 1727526123,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpe3u1m",
                          "score": 2,
                          "body": "On September 1st, 2024 Costco increased its membership fee from $60 to $65 and their executive from $120 to $130.\n\nFor context every $10 increase in their fee will boost profits by 20%. People pay a premium for good companies. Costco hasn’t had a p/e lower than 20 for more than a decade now.\n\nDo I own any? No, but basing an investment decision solely on p/e is not understanding the full picture.\n\nYou have to project future cash flows to get a better idea.",
                          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpe3u1m/",
                          "created": 1727555039,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lp868jn",
          "score": 2,
          "body": "What about healthcare insurance though? UNH is a monster",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp868jn/",
          "created": 1727462864,
          "depth": 1,
          "replies": [
            {
              "id": "lp9cou8",
              "score": 9,
              "body": "The biggest problem I see is that the government seems serious about squeezing them for better pricing on medicare.  They used to be able to maintain stable margins, so as long as they had subscriber growth, they would make more money.  Now CMS is giving smaller rate increases and raising the bar for star ratings; the insurer's margins going forward are going to be a lot more volatile and unpredictable than before.",
              "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp9cou8/",
              "created": 1727477627,
              "depth": 2,
              "replies": [
                {
                  "id": "lp9dbn2",
                  "score": 1,
                  "body": "Damn, that checks out. Do you see any good opportunities in the healthcare space then?",
                  "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp9dbn2/",
                  "created": 1727477873,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp9pzwi",
                      "score": 4,
                      "body": "Small caps healthcare stock like molina, Oscar, clov has a huge opportunity. When interest rates goes down, small cap stocks will shoot up.",
                      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp9pzwi/",
                      "created": 1727482944,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lp9e8mc",
                      "score": 1,
                      "body": "I am still holding CVS because it is so darn cheap and paying me 4.5% to wait for them to get their act together, but if it pops back I'm out.",
                      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp9e8mc/",
                      "created": 1727478233,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lpm48pm",
                  "score": 1,
                  "body": "Ye they can squeeez but UNH have bigger net margin then competitors so they can float upper the surface",
                  "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpm48pm/",
                  "created": 1727678008,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lp7navv",
          "score": 1,
          "body": "I lean more towards GARP investing rather than value or dividend investing, so I find healthcare mega caps less appealing. While small caps carry higher risk, what are your thoughts on mid-cap biotechnology and pharmaceutical stocks?",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7navv/",
          "created": 1727456756,
          "depth": 1,
          "replies": [
            {
              "id": "lp7t7ic",
              "score": 0,
              "body": "Small caps do not carry higher risk for being small caps.  They typically don't make any money, but if you find one that already makes money, it's not that risky unless you overpay for it.\n\nWhich gets to the large cap healthcare stocks are not as liked: Growth is priced in, no margin of safety if they have tough times ahead.",
              "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7t7ic/",
              "created": 1727458644,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lp7jdt4",
      "score": 32,
      "body": "I love health care stocks.  America’s population is old and getting older and virtually all of those people need health care.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7jdt4/",
      "created": 1727455494,
      "depth": 0,
      "replies": [
        {
          "id": "lp7lv82",
          "score": 7,
          "body": "This. Wealth transition between generations doesn't have to be through inheritance only.",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7lv82/",
          "created": 1727456294,
          "depth": 1,
          "replies": [
            {
              "id": "lq0xxw4",
              "score": 2,
              "body": "^",
              "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lq0xxw4/",
              "created": 1727897933,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lp7wo2x",
      "score": 18,
      "body": "I hate the American private insurance system, so I bought shares in it since the corruption will only increase over time. Might as well profit from it.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7wo2x/",
      "created": 1727459749,
      "depth": 0,
      "replies": [
        {
          "id": "lp7ylxm",
          "score": 5,
          "body": "if you can't beat 'em, join 'em\n\nIt is even true for President Obama. I remember an Obama interview (probably a docuseries in Netflix) where he said something like \"Healthcare is 6% of GDP, you can't change the rules so easily\"",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7ylxm/",
          "created": 1727460376,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp8tdce",
      "score": 9,
      "body": "My Ira is 50% mcd 50% unh",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp8tdce/",
      "created": 1727470516,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp9m5l0",
      "score": 8,
      "body": "Personally I like the picks and shovels healthcare plays... names like Danaher and Thermo Fisher. There's no doubt there are going to be a lot more blockbuster drugs like Ozempic in the future, but it's nearly impossible to know which company is going to discover them.\n\nEveryone loves to talk about Eli Lily now, but what about when revenue and EPS were flat for a decade+? Pfizer's revenue in 2004 was $52.5B. Last year it was $58.5B. Pharma is far from an easy industry to invest in.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp9m5l0/",
      "created": 1727481371,
      "depth": 0,
      "replies": [
        {
          "id": "lpqq5rw",
          "score": 1,
          "body": "Same here. I also go that route with technology. TMO, DHR are two of my biggest positions. The CROs are interesting as well. CDMOs too even though they’re struggling now (well, Charles River is). Some of the smaller tools companies are interesting, too.",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpqq5rw/",
          "created": 1727744561,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lp9nvf6",
          "score": 1,
          "body": "Great point! Investing in \"picks and shovels\" plays like Danaher and Thermo Fisher offers a more stable approach to healthcare, benefiting from overall industry growth without the risk tied to any single drug. The volatility and unpredictability in pharma are real—many companies face years of stagnation before a breakthrough, if at all. That said, I remember an anecdote from *100 Baggers* by Chris Mayer: an investor who bought 10 biotech stocks in the '90s mostly ended up with failures or laggards. Yet, one of those stocks, Amgen, skyrocketed to 100x.\n\nWhile it's true that identifying future blockbusters is a challenge, there's also value in having a venture capitalist mentality—diversifying across high-potential plays, knowing a few big winners can offset the inevitable losses. It’s a riskier path, but sometimes, those asymmetric payoffs can make all the difference.",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp9nvf6/",
          "created": 1727482075,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp9xc6a",
      "score": 6,
      "body": "Election season and both parties are going after pricing.\n\nAlso Medicare has won and negotiated some prices down.\n\nAlso FTC keeps blocking every merger they can.\n\nBest of breed stocks have done fine though. Like LLY, UNH has recovered and hit ATH, ABBV and MRK.\n\nPFE, BMY, etc have patent cliffs.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp9xc6a/",
      "created": 1727485998,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp7x3pf",
      "score": 3,
      "body": "Rotation on health care insurance. \n\nMy XLV, VGHCX all do well. Buy and forget. Yes, sometimes boring but they stay up.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7x3pf/",
      "created": 1727459888,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpef97p",
      "score": 4,
      "body": "I have UNH. They've doubled in price three times over the last 15 years at roughly 5 year intervals. I'd be happy if it takes 6 now but even 7 or 8 would still be fine for my FIRE age goal.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpef97p/",
      "created": 1727559144,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp7th60",
      "score": 8,
      "body": "I want to see the system they exploit be burned down and rebuilt from the ashes, personally.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7th60/",
      "created": 1727458730,
      "depth": 0,
      "replies": [
        {
          "id": "lpah4k7",
          "score": 3,
          "body": "Funny to see people invest in health corps only to one day die in a shitty hospital because the corporations exploit their staff and squeeze everything for shareholder profit.",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpah4k7/",
          "created": 1727494640,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lp7y2o1",
          "score": 2,
          "body": "I understand and you have a point. On the other hand, I remember an Obama interview (probably a docuseries in Netflix) where he said something like \"Healthcare is 6% of GDP, you can't change the rules so easily\"",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7y2o1/",
          "created": 1727460201,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp7hss3",
      "score": 3,
      "body": "Pharma carries a lot of risk. Especially over the last two years. The industry as a whole is going through a major restructure RN and even those who work in the industry can't tell you where it will land next year. Betting on pharma companies is pretty close to betting on roulette. ",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7hss3/",
      "created": 1727454981,
      "depth": 0,
      "replies": [
        {
          "id": "lp7l0sq",
          "score": 1,
          "body": "Can you tell more about major restructure? I am not aware of this risk",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7l0sq/",
          "created": 1727456023,
          "depth": 1,
          "replies": [
            {
              "id": "lp7qnlw",
              "score": 2,
              "body": "Go take a look in r/biotech. Every major biotech has cut large programs from their sheets. Unemployment in pharma is pretty high rn due to these cuts. The restructure has been framed in a way to make preparation for AI but in reality, they are cutting huge dead weight programs that grew from the cheap money/pandemic boom. \n\n\nMost pharma companies are realizing that they are coming up on a major IP/patent cliff. We are seeing more money go to MnA rather than R&D. This shift is causing a bunch of mid to large companies to buy teams that are in trial, yet have no idea what they are truly buying. \n\n\nI think there are some good plays to be had in diabetes focused teams, but many teams are going to see little to no growth over the next couple years if they cut their R&D. ",
              "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7qnlw/",
              "created": 1727457833,
              "depth": 2,
              "replies": [
                {
                  "id": "lp7w9r4",
                  "score": 2,
                  "body": "My take is also similar: Most promising companies work on diabetes, cancer, genetics and neuroscience.\n\nI focus on mid-caps for M&A expectations. But these companies usually rely on one or two patented drugs - so expectation is not free of risk. \n\nWill check dedicated subs for biotech and pharmaceutical; thanks",
                  "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7w9r4/",
                  "created": 1727459621,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lp7m2rm",
      "score": 3,
      "body": "Just bought a bunch of IHI today. Let's goo",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7m2rm/",
      "created": 1727456361,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lphbrbl",
      "score": 3,
      "body": "Healthcare stocks are very dangerous due to regulations, lawsuits, long running trials, etc.\n\nHowever, all these dangers can create very attractive daytrading opportunities.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lphbrbl/",
      "created": 1727612172,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpj2kez",
      "score": 3,
      "body": "Any \"boring\" sector stuff gets passed over on Reddit for the most park. \n\nNo one talks about Proctor & Gamble either.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpj2kez/",
      "created": 1727634368,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp83bpt",
      "score": 2,
      "body": "Why? Because neither you nor 99.9% of people here understand healthcare industry let alone pharmaceutical.\n\nYour second point is one of genuinely the most insane out of touch things I have read on this sub;  What do you think happens when people lose their jobs?\n\nEasier to forecast? LLY, which is as predictable as they come, has a range for their 2027 revenues from 58B to 84B- that is the analysts ranges; even if you exclude some of data points, you will get a range of 55B to 75B, but it is easier to forecast for you I guess?\n\n\nYou know it’s a bubble when everyone and their cousins are experts on all industries and can see what no one can.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp83bpt/",
      "created": 1727461915,
      "depth": 0,
      "replies": [
        {
          "id": "lp86v1n",
          "score": 4,
          "body": "If I lose my job, I won't buy a new car, clothes, phone... But I will pay my healthcare expenses of my wife and child no matter what. This is why healthcare stocks are defensive.  \n  \nI checked all popular \"undervalued\" stocks recently. NKE, LULU, DIS, CELH... They don't disclose critical info on their sales. But healthcare companies do. You know patent expiry date, you know sales drop 90% once the patent expires, you have regional sales numbers. With all available data, it is definitely easier to forecast than NKE, LULU, DIS, CELH.\n\nI am not an expert definitely. But I have some cash in case bubble bursts",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp86v1n/",
          "created": 1727463068,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp842j8",
      "score": 3,
      "body": "Because they're mostly traps. Check the markets daily and watch these companies skyrocket 80% in a day, they can easily have 95% moves down over a year and 1000% moves up in the same time. Just not worth the risk. Regulations come out and fuck everything up sometimes, things get banned etc just not worth it, theres too many out there too",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp842j8/",
      "created": 1727462157,
      "depth": 0,
      "replies": [
        {
          "id": "lp88jm1",
          "score": 3,
          "body": "Most of them are traps, yes. I remember a story from 100-baggers by Chris Mayer. He tells the story of anonymous investor who bought 10 biotech stocks in 90s. Although he tried to be smart, most of them failed and some others barely survived.   \n  \nHowever, one stock skyrocketed to 100x, that is Amgen.\n\nMaybe we should have venture capitalist mentality",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp88jm1/",
          "created": 1727463615,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp94kmp",
      "score": 5,
      "body": "HIMS is disrupting traditional healthcare, growing like crazy, debt free and profitable",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp94kmp/",
      "created": 1727474499,
      "depth": 0,
      "replies": [
        {
          "id": "lpa5zbh",
          "score": 2,
          "body": "I have been waiting for HIMS to pop a while now.. undervalued",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpa5zbh/",
          "created": 1727489700,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lp9mvny",
          "score": 1,
          "body": "The future of healthcare is online and digital - that's for sure!",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp9mvny/",
          "created": 1727481668,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp7pnm3",
      "score": 2,
      "body": "Hoping for a big comeback in 2025 for Humana.  Solid earnings.  They did admittedly fuck up this year by not pricing their plans correctly based on CMS’s smaller than anticipated reimbursement rates.  More boomers retiring every year.  \n\nAnd fuck it I’m gonna say it.  Medicare reimbursement rates will probably do better under Trump than Kamala.  That’s my big wild card.  This is according to the WallStreet Journal not some half brained hope.  Granted it’s still hope.  Would love to see a 70-100 point run if they get their shit right this next year.  We’ll see….",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7pnm3/",
      "created": 1727457514,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp7rkec",
      "score": 1,
      "body": "I am in only one growth stock for the time being and my priority us to acquire as possible in the near future as I don't want to miss the opportunity. \n\nBut as for Healthcare, it is on my list for the future. I am also looking at things like hospital/hospice reits too.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7rkec/",
      "created": 1727458121,
      "depth": 0,
      "replies": [
        {
          "id": "lp7wxhm",
          "score": 1,
          "body": "I am more of a GARP investor, so I'd like to have a look at that stock if you share.\n\nIn return, you may read my investment thesis post on Amphastar AMPH. If BAQSIMI acquisition is successful, I expect a significant growth in revenue and net income.",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7wxhm/",
          "created": 1727459833,
          "depth": 1,
          "replies": [
            {
              "id": "lp88s8n",
              "score": 1,
              "body": "I am only buying RKLB right now. I believe I will only focus on this one for the next year or so, I think. One of the reasons I made it my primary stock is that I have been kicking myself for missing so much stuff over the last decade and I am determined to make up for it. Plus I am a huge space geek so that is a bonus. Also, the overall industry is growing and I believe the team is competent and will be able to take advantage of this and keep growing the company.",
              "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp88s8n/",
              "created": 1727463694,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lp88e8s",
      "score": 1,
      "body": "I was 100% in biotechs in the past. It certainly isn’t for most people.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp88e8s/",
      "created": 1727463567,
      "depth": 0,
      "replies": [
        {
          "id": "lp89n1x",
          "score": 1,
          "body": "I remember an anecdote from 100-baggers by Chris Mayer. He tells the story of anonymous investor who bought 10 biotech stocks in 90s. Although he tried to be smart, most of them failed and some others barely survived.\n\nHowever, one stock skyrocketed to 100x, that is Amgen. Maybe we should have venture capitalist mentality.\n\nHow was your experience?",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp89n1x/",
          "created": 1727463979,
          "depth": 1,
          "replies": [
            {
              "id": "lp8bfrh",
              "score": 2,
              "body": "So in my early days, I was doing much higher risk activities. Buying leaps and calls on investments based on my own medical opinion. The reason why this worked for me is because I didn’t know how to read financial statements at the time but I knew how to interpret science. \n\nI soon transitioned into longer term investing with healthcare related stocks as I learned more about finance. Health insurance companies were doing quite well but I liquidated last year due to the increase in elective surgeries. They produced stellar returns but I don’t regret selling as I rotated heavily into interest rate sensitive plays. I am still long a couple of drug developers but most are trading damn expensive. I’m in novo, lilly, and AstraZeneca, and a speculative position in VKTX. \n\nIn the past, I have made decisions based on science but been wrong and sold at 90% losses, but that has only happened a couple of times. The vast majority of these have produced multibagger returns. \n\nFinal note: healthcare stocks aren’t always a big gamble unless you’re speculating in FDA trials. Go for larger players and look for companies that print cash. Like every market segment, some corners can be more degenerate than others, but you need to buy quality.",
              "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp8bfrh/",
              "created": 1727464570,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lp959v6",
      "score": 1,
      "body": "I don’t know I have been hoarding VHT for past 7 years",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp959v6/",
      "created": 1727474763,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpay5ec",
      "score": 1,
      "body": "Many pharma stocks have had a great run in 2024, so not sure I would call them unpopular.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpay5ec/",
      "created": 1727504119,
      "depth": 0,
      "replies": [
        {
          "id": "lpb2s81",
          "score": 1,
          "body": "Going through the comments in this post, most retail investor don’t feel comfortable with healthcare stocks.\n\nMy take is the run you mention is the work of institutional and super investors",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpb2s81/",
          "created": 1727507122,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpb9rr8",
      "score": 1,
      "body": "Once bitten, twice shy.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpb9rr8/",
      "created": 1727511948,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpc55oy",
      "score": 1,
      "body": "Looking at the past history, when sp500 tanked the health care etf tanked as well. Can you explain how it is more defensive?",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpc55oy/",
      "created": 1727530260,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpiypo9",
      "score": 1,
      "body": "Most of the growth is due to greed and price gouging",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpiypo9/",
      "created": 1727633183,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpyg750",
      "score": 1,
      "body": "Dva - DaVita provides kidney dialysis? It’s a niche stock. It’s not regulated. It’s part of my portfolio. \nLow debt, good balance sheet.",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lpyg750/",
      "created": 1727866217,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp7g741",
      "score": 1,
      "body": "For example, I did a little bit of research about a healthcare stock but went under the radar\n\n[https://www.reddit.com/r/stocks/comments/1fp7cfn/amphastar\\_amph\\_growth\\_potential\\_2025\\_onwards/](https://www.reddit.com/r/stocks/comments/1fp7cfn/amphastar_amph_growth_potential_2025_onwards/)",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7g741/",
      "created": 1727454459,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp7kyed",
      "score": 0,
      "body": "Pharma stock can have many boom and bust or higher cost of capitol… PFE doesn’t have anything in the pipeline atm and the stock has taken a major hit… healthcare is going up and not for good reason imo… ligation is finally here and hopeful can help cap the higher and higher cost for HC to consumers… I am an investor as well but pharma and HC insurance companies doesn’t interest me too much… they do tend to outperform inflation and GDP growth… if you are selective with choices…",
      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7kyed/",
      "created": 1727456001,
      "depth": 0,
      "replies": [
        {
          "id": "lp7n0zj",
          "score": 1,
          "body": "I am more of a GARP than value or dividend investor; so I agree that Healthcare mega caps are not attractive.   \n  \nSmall caps are risky - but what about biotechnology and pharmaceutical  mid-caps? \n\nYou are right, though, must be selective with stock picking...",
          "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp7n0zj/",
          "created": 1727456668,
          "depth": 1,
          "replies": [
            {
              "id": "lp8yzg4",
              "score": 2,
              "body": "I was listening to a podcast that was talking about the challenges of drugs going to market… and a different one on semi conductors… I know they are different sectors… but they can learn from each other… more importantly drug companies from semiconductors  I think mega cap companies in drug manufacturing has a lot of drag…. And they need to consolidate their workflow to get into more niche process like you say about biotech/ pharma… I dunno about sizes of companies… but their growth drivers and value creation problems in all sizes… pharma and biotech has lots of upfront cost and r and d and drug trial cost… plus drug discover cost… drag from drug approval process and government regulations… but I think pharma is more greedy which gets great short term or near term results but doesn’t help with sustainable growth… with healthy margins…",
              "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp8yzg4/",
              "created": 1727472475,
              "depth": 2,
              "replies": [
                {
                  "id": "lp9mfrs",
                  "score": 1,
                  "body": "That's an interesting point of view... I will check healthcare industry returns with that in mind. Maybe there are cyclical movements in healthcare over the long term. Thanks for sharing!",
                  "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp9mfrs/",
                  "created": 1727481487,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp9oza2",
                      "score": 2,
                      "body": "Winners are the middlemen… think drug suppliers chains and PBMs… toll companies… if you can stomach the idea the wealth consolidation from these lynch pin approach… with contracts and pricing power..",
                      "permalink": "/r/stocks/comments/1fqri07/why_healthcare_stocks_not_popular_around/lp9oza2/",
                      "created": 1727482525,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}