{
  "title": "RocketLab Research",
  "score": 138,
  "selftext": "# Valuation\n\nTypical growth stock valuation methods work for continuously growing companies (e.g., selling 30% more burgers, cars, computer chips, or ads per year). However, these methods are inadequate for valuing companies where an event in the near future could trigger a massive change in growth potential.\n\nFor RocketLab, such a trigger is the Neutron development. If they succeed in developing a reusable medium launch vehicle for less than $60 million per flight, they could significantly increase their valuation.\n\nThe important question is: **How likely is it that they will succeed in developing Neutron in a timely manner?**\n\n# Probability of Neutron Success\n\nTo estimate the likelihood of Neutron’s development success, we can examine RocketLab’s past performance, leadership, and competitors. RocketLab is not a young startup without products in service. It is a company with a 7-year track record of launch services.\n\n**Electron Development Compared to Other Vehicles**\n\n**Electron Timeline**\n\n2013: Rocket Lab began development on Rutherford, with the first engine test-fired the same year.\n\n2014 July: The Electron launch program was announced.\n\n2016 December: Electron completed flight qualification.\n\n2017: The first rocket was launched on May 25, 2017, in a flight called “It’s a Test.” The mission failed due to a tracking system configuration error by a safety officer (from an organization like NASA/FAA). (Source: *When the Heavens Went on Sale* - Ashlee Vance).\n\n2018 January: First successful Electron launch.\n\n2018 October: RocketLab scaled up, enabling the company to build an Electron rocket every week. The upscaling was massive—just two years from a flight-certified rocket to a production capability of one rocket per week.\n\n**Falcon 1 Timeline**\n\n2002 October: First gas generator full-duration test-firing (Mojave).\n\n2003 March: First Merlin engine thrust chamber firing (McGregor, Texas).\n\n2003 July: First Merlin engine turbopump test (Mojave).\n\n2004 February: First Kestrel engine thrust chamber firing (McGregor).\n\n2004 July: First complete Merlin engine test-firing.\n\n2006 March: First Falcon 1 flight (failure).\n\n2008 September: First successful Falcon 1 flight.\n\n**Summary**\n\nIt took RocketLab 3.5 years from the Electron program announcement to the first successful launch (3 years if we count the first test flight, which only failed due to third-party error). It took SpaceX 6 years to develop Falcon 1 to its first successful flight.\n\n**Additional Points:**\n\n    SpaceX developed the Falcon 1 engine (Merlin) as a gas-generator engine with one engine per Falcon 1 vehicle. This made engine development more complex (larger engine) but more easily scalable to a medium launch vehicle (e.g., using 9 Merlin engines on a Falcon 9).\n    \n    RocketLab, on the other hand, opted for an electric pump-fed engine, which is simpler and probably why Electron reached the pad so quickly, but it’s not scalable to a medium launch vehicle.\n    \n    SpaceX could employ experienced aerospace professionals, as ITAR (International Traffic in Arms Regulations) wasn’t an issue for them. This included key personnel like Tom Mueller (Vice President of Propulsion, formerly with TWR), Chris Thompson (Vice President of Structures, formerly with Boeing), Tim Buzza (Vice President of Launch and Test, formerly with Boeing), and others.\n    \n    RocketLab, however, couldn’t hire US aerospace veterans due to ITAR restrictions and couldn’t access certain US aerospace supplies.\n\nDespite being in an outsider position—not based in the US, hindered by ITAR, with a founder without a university degree or the wealth of founders like Bezos or Branson—RocketLab managed to develop a small launch vehicle in record time with only $100 million. They also scaled up faster than Falcon 9, with 50 launches and remarkable reliability (48 successes in 52 launches). Additionally, they achieved gross margin profitability with just $7.5 million per flight.\n\n**Bonus:** Electron is an extremely accurate vehicle, capable of deploying payloads within 8 meters of a targeted location, compared to the industry standard of 15 km. This opens up many possibilities, such as accessing waste in space or military applications, like inspecting opponent satellites.\n\n**What Can Be Transferred from Electron to Neutron?**\n\nIn addition to parts of the rocket, RocketLab can transfer knowledge of simulations, ground equipment, and production processes. The latter is more important than it may seem. Early rockets are custom-built by the engineers who designed every part, but by the time the 10th rocket is produced, a Manufacturing Execution System (MES) is needed to ensure every step is executed correctly by the assembly line workers. With 52 flights and 48 successes in 7 years, RocketLab has succeeded in this process.\n\nThe biggest potential risk was always the engine. RocketLab had only worked with electric pump-fed and pressure-fed engines (and solid/semisolid motors) before. Developing a staged-combustion engine is a different challenge. However, they successfully brought the Archimedes engine to 102% power in 2024, and during the Q2 earnings call, it was revealed that one additional engine was already coming off the production line, with five more in production. Therefore, engine production should not be a bottleneck, significantly reducing the risk.\n\n**Neutron Timeline**\n\n2021 March: Neutron introduced.\n\n2022 September: Investor Day and Neutron update, with a switch to staged combustion announced.\n\nQ2 2023\n\n    First full-scale thrust chamber completed.\n    \n    Injector testing underway.\n    \n    Pre-burner tests underway.\n\n2024 February (Q4 earnings call): Single-element pre-burner test campaign complete, successfully proving out the element design across the full throttle range, which has been incorporated into the full-scale pre-burner.\n\n2024 Q2: Archimedes tested at 102% power, with the next engine coming off the production line and five more engines in production.\n\n**My Prediction:**\n\n    •\tFirst Neutron flight: 2025.\n    \n    •\tFirst successful Neutron flight: 2025/2026.\n    \n    •\tFirst successful Neutron landing: 2026/2027.\n    \n    •\tFirst Neutron reuse: 1 year after the first Neutron landing.\n\n**Position:**  \n7000 shares  \n1st purchase in June 2021",
  "link_flair_text": "DD",
  "id": "1fqscv7",
  "num_comments": 104,
  "created_utc": 1727455917,
  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/",
  "comments": [
    {
      "id": "lp7kpcd",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 52 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp7kpcd/",
      "created": 1727455920,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp7kp02",
      "score": 41,
      "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp7kp02/",
      "created": 1727455917,
      "depth": 0,
      "replies": [
        {
          "id": "lpbswj3",
          "score": 24,
          "body": "Even the bots are regarded here",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbswj3/",
          "created": 1727524624,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpiy0i3",
          "score": 2,
          "body": "And 93.67% of all statistics and probabilities are made up.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpiy0i3/",
          "created": 1727632972,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp8jijr",
      "score": 38,
      "body": "Space solutions and space applications potential need a mention. There is more than neutron to the bull case.",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8jijr/",
      "created": 1727467228,
      "depth": 0,
      "replies": [
        {
          "id": "lp8llzr",
          "score": 8,
          "body": "Fair point.   \nThe reddit post dont allow enough structuring. I wanted to include a lot more, but it just looked super weird with it.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8llzr/",
          "created": 1727467925,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp7p4ej",
      "score": 44,
      "body": "I bought Jan2025 4.50 calls at a share price of $3.65 in April and just sold them for 600%. My long-term share position is up 130% (been in for a few years - not selling any). This company has the potential to do \\*really\\* well over the next decade; I hope they don't sell.",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp7p4ej/",
      "created": 1727457343,
      "depth": 0,
      "replies": [
        {
          "id": "lq60qr5",
          "score": 2,
          "body": "I am new to buying stocks and have never even bought one.  Rocket Blab may be my first one.  What do you think the potential price is 10-20 years from now?",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lq60qr5/",
          "created": 1727975963,
          "depth": 1,
          "replies": [
            {
              "id": "lq6305d",
              "score": 2,
              "body": "I don’t think it would be ethical for me to answer this. There are too many variables in play and that’s a very long time. The company is also too early in its growth/financial lifecycle. \n\nLearn about weighting your portfolio and keep this a small position if your research leads you to buying it. \n\nI will say that I don’t plan on trimming my position for at least 5 years (unless a 20x happens).",
              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lq6305d/",
              "created": 1727976667,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lp8tz6g",
      "score": 40,
      "body": "People can keep sleeping, laughing, doubting… but we’re hitting $30 a share in the next 9 months. Would put RKLB at a $14.9 billion market cap worth only 7% of what SpaceX is currently. You either see the value potential here or you don’t. Regards going to stay regarded.",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8tz6g/",
      "created": 1727470722,
      "depth": 0,
      "replies": [
        {
          "id": "lp8xtsg",
          "score": 5,
          "body": "im about to buss",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8xtsg/",
          "created": 1727472063,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpiyav3",
          "score": 5,
          "body": "There is trade thesis conviction and then there is having a username to show just how committed you are.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpiyav3/",
          "created": 1727633058,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp7nlds",
      "score": 34,
      "body": "I was never great at Chemistry but this seems interesting.",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp7nlds/",
      "created": 1727456851,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp8bz5c",
      "score": 34,
      "body": "Are you bothered by the fact that they are not profitable after 18 years?",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8bz5c/",
      "created": 1727464746,
      "depth": 0,
      "replies": [
        {
          "id": "lp8gs3g",
          "score": 30,
          "body": "Fair question.\n\nNo.  \nPeter Beck and RocketLab were wandering around for some time. Building sounding rockets. Building InstantEyes (basically a rocket launched camera, before small drones were common. Building a[ Viscous Liquid Monopropellant version of the AIM-9 Sidewinder missile](https://www.youtube.com/watch?v=wV55OKP6ld4). (They were one 6 employees back then).  \nDeveloping their own heat shield material (Lockheed later on bought that heat shield material).\n\nBeck simply didn't have the money to start with a real rocket program right away. He first had to prove himself to his seed founders (some NZ internet millionaire). Later on prove himself to DARPA. Later on prove himself to other military agencies. And then convince some venture capital firms to hand him several million dollars to develop a real launch vehicle.   \nAnd they operated for 18 years. But they did burn through much cash. Especially during the first years. Total funding till their first Electron launch was like $150 million.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8gs3g/",
          "created": 1727466331,
          "depth": 1,
          "replies": [
            {
              "id": "lp9n86w",
              "score": 9,
              "body": "This is where suggesting folks to read Ashlee Vance's book or watch the HBO documentary makes a lot of sense.",
              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp9n86w/",
              "created": 1727481809,
              "depth": 2,
              "replies": [
                {
                  "id": "lpbeh6b",
                  "score": 3,
                  "body": "Yes, reading books like that gives important insights into the companies leadership :)  \nIdeas are one thing, but are they able to execute? And the RocketLab team, especially Peter Beck  achieved so many things, with limited money and workforce in incredibly short timeframes. \n\nIt is also helpful to read books like Liftoff by Eric Berger. Great to spot similarities and differences between the undisputed market leader and runner up RocketLab.",
                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbeh6b/",
                  "created": 1727515359,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lp93q7t",
          "score": -7,
          "body": "Seriously, these space stocks (LUNR, RKLB) and ASTS are for playing short term IMO. Long term wise, the closed price today is  even lower than it was in 06/21. It's a bad investment, period.\n\nI made some money with LUNR but never considered to long the stock.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp93q7t/",
          "created": 1727474188,
          "depth": 1,
          "replies": [
            {
              "id": "lp99lxy",
              "score": 9,
              "body": "Its the type of stock where you either trade it on a short timeframe of weeks to months, or hold it for the long term, like at least 5 years. In between those timeframes, its not gonna do well once the hype around space industry dies down.",
              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp99lxy/",
              "created": 1727476425,
              "depth": 2,
              "replies": [
                {
                  "id": "lp9ak4p",
                  "score": 3,
                  "body": "Happy to be wrong, I just saw OP's post about his position back in 2021, I thought he entered when it's extremely low but it's not the case.",
                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp9ak4p/",
                  "created": 1727476794,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lp9qrtk",
              "score": 10,
              "body": "Agree. It’s difficult to see the long-term profitability for RKLB and LUNR. If they could go up to space and produce something useful and sell it, great, but just selling rockets or getting government contracts for lunar missions is not going to be the next NVDA. \n\nHowever, short term plays are fun and I’ve made good money there. \n\nNote, I see ASTS differently. They are launching a commercial service and have major companies on board with them. There is profitability in the value of their cellular services, potentially.",
              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp9qrtk/",
              "created": 1727483264,
              "depth": 2,
              "replies": [
                {
                  "id": "lpb4vdo",
                  "score": 2,
                  "body": "RKLB is not \"just selling rockets\", they are an end2end contractor basically making it possible for companies to get access to space and design, service and maintain their satellites. Giving them reoccurring revenue for the lifetime of the payload. This is where the true potential comes in imo",
                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpb4vdo/",
                  "created": 1727508517,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpb59kk",
                      "score": 2,
                      "body": "That’s a very niche market. That was actually exactly what I meant when I said they just sell rockets—they just sell the capability to get to space. Until there is something useful for the broader population to do in space, not many people or companies will need that",
                      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpb59kk/",
                      "created": 1727508788,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpb5v09",
                          "score": 2,
                          "body": "Actually not niche at all, there are a lot of companies that want to put things into space (hence all the launches). Did you even read their last earnings:\n\nSpace Systems revenue between $79 million and $84 million.\nLaunch Services revenue of approximately $21 million.\n\nWe also continue to reach development and production milestones across our space systems programs, in which we have more than $720 million in spacecraft under contract. \n\n\nLike 80% of their revenue is from this \"niche market\".",
                          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpb5v09/",
                          "created": 1727509199,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpb6ytx",
                              "score": 3,
                              "body": "Sure, 80% of their revenue is, but 80% of their revenue isn’t a particularly massive number. That’s what gives me pause for RKLB as a long term hold.\n\nWhere will increased demand come from? Probably new iterations of existing technologies. Newer, updated GPS satellites, communications, etc. That’s good, it’s a stream of business! But will it outperform an index fund over ten years? If it hasn’t already, any statement ending with that conclusion starts with ‘if’ and that’s not how I invest long term. \n\nAdd to it the fact that, in this niche market which not every company needs or wants, they aren’t even alone, and their competition has deep pockets.\n\nI should repeat what I said earlier, though, that I’ve made money on all three space stonks from short term plays. They are quite useful in that regard",
                              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpb6ytx/",
                              "created": 1727509971,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lpb9ixa",
                                  "score": 3,
                                  "body": "If we look at a full year that is 320 million dollars for space systems assuming the revenue doesn't grow (while they have a 71% yoy growth). Just for space systems alone, the rocket launch adds another 100 million. For a market cap under 5 billion that is pretty good. And I believe that the democratizing of space will open up a lot of growth opportunities, in a way that the internet did, but was very hard to see back then. I just don't believe that this is a niche market.\n\n\n\n>But will it outperform an index fund over ten years? If it hasn’t already, any statement ending with that conclusion starts with ‘if’ and that’s not how I invest long term. \n\nWhat do you mean by this? Rocket lab has barely existed for ten years. So you can't compare past performance and if you follow your rules you are gonna late to the party here.",
                                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpb9ixa/",
                                  "created": 1727511776,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lpbaygp",
                                      "score": 2,
                                      "body": "I mean that, according to my personal investment strategy, if I buy and hold a stock long term, I am buying it in my IRA and I won’t look at it again until I’m 67 and retiring. Obviously not everyone plays the game this way and that’s fine. But for me, it means I need to be very careful buying long term, and I buy only proven commodities. I don’t buy very many individual companies to hold long at all because of this strategy, and I’m comfortable missing out. \n\nMy short term money tends to be leveraged ETFs. TQQQ, SQQQ, SPXL, SPXU, UVXY, and SVIX are my most traded stocks, and this year I’ve been fortunate. \n\nThe ‘democratization of space’ may lead to more opportunities, but that’s too much of a gamble for me to hold RKLB long term, personally. And to be frank, I don’t know what you mean by the phrase. Do you mean everyone will have access to space, rich and poor? Because that’s what the words would indicate, but I don’t know if I see that happening within the next twenty years, given current technology.\n\nI’d like to reiterate my previous point in a new way, given your thoughts on the imminent takeover of space by the plebes: Even if everyone did have access to space, what would they do up there? What goods would they produce and sell, besides existing technology? What new business would come to RKLB, from what sector?\n\nAdd to it this unfortunate fact: Profitability still escapes them. $320 mil in revenue could be better, and it would be better if they sold a good that appealed to a broader market, but they do not. \n\n(Finally, I’ve enjoyed the chat! Thanks for sticking around and sharing your thoughts, you have interesting things to say.)",
                                      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbaygp/",
                                      "created": 1727512808,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lpbe8o2",
                                          "score": 2,
                                          "body": "Thanks for explaining your strategy, it makes sense. \n\nWhat I mainly meant with democratizing space access is that the cost to get things into space has been dropping. Haven't found much up to date examples but this data from 2019 shows that the cost per kg has dropped from about $10 000 to $ 1500. (https://ourworldindata.org/grapher/cost-space-launches-low-earth-orbit) And we see due to that all these constellations starting to pop up. Since this makes it more affordable companies will pop up with new and novel ideas. And since Rocket lab can provide the engineering and servicing to design and build these payloads, that is a market that will grow. I agree there is danger of a bubble forming, especially since we have ridiculous ideas like a company that wants to put giant ass mirrors in space so you can order sunlight via an app (https://futurism.com/the-byte/startup-space-mirror-sunlight-night).\n\nAnd I obviously glanced over the fact that RKLB is not profitable yet, but if they would stop all neutron development they would be profitable. And hopefully with neutron flying they will swing to profitability. I admit all these space stocks are risky and an obvious gamble. Personally I believe in RKLB (and also ASTS). They are still at a low market cap (but high risk) that a payoff might be worth it.\n\nThanks for the discussion! I definitely enjoyed it!",
                                          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbe8o2/",
                                          "created": 1727515184,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lp9h8ow",
              "score": 4,
              "body": "I can’t wait to see just how wrong you are.",
              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp9h8ow/",
              "created": 1727479411,
              "depth": 2,
              "replies": [
                {
                  "id": "lpa90ro",
                  "score": 1,
                  "body": "I bought LUNR stock and 2026 calls\n\nI’m a believer. Lol",
                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpa90ro/",
                  "created": 1727491020,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lp8z3tt",
      "score": 10,
      "body": "You project the first successful Neutron re-use in 2027/2028. What happens when there’s a fully reusable Starship available then, for literally 10x the capacity at only ~1.5x the price?",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8z3tt/",
      "created": 1727472518,
      "depth": 0,
      "replies": [
        {
          "id": "lp91baq",
          "score": 10,
          "body": "That will be an interesting time. \n\nCurrent Starship estimates are 100 to 150 tons to LEO. So 6.6 to 10 times more than Neutrons barge landing LEO capacity. I am not sure about the price though. SpaceX already spend > $5 billion dollars on the starship development. And the first few years the starships are already sold (Artemis mission, Musks Mars mission etc.)  \nAnother important aspect: if you deploy a constellation like Starlink you do not put every satellite into the same orbital plane. You need to insert the satellites into different orbital planes- so launching 100 or even 150 tons of satellites into a single orbital plane does not make sense. You could of course solve that with orbital transfer vehicles, but that adds weight and cost. So let's see how that plays out long term.\n\nIf Starships becomes dominating RocketLab positioned Neutron well to scale it up. Instead of Merlins gas generator engine they went with a ox rich staged combustion engine. One can expect performance gains over time (look at how much Blue Origin gets out of a ox rich staged combustion engine of similar size.  \nIf satellites and payloads in general become significantly larger and heavier due to Starship RocketLab could use the same engines for the heavy lift rocket and maybe even use the Neutron 1st stage as a 2nd stage of the heavy lift rocket. Starship is 50 meters high and 9 meter wide. Neutron is 42 meters high and 7 meters wide. Plus the tank parts are potentially stretchable.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp91baq/",
          "created": 1727473316,
          "depth": 1,
          "replies": [
            {
              "id": "lp9692m",
              "score": 7,
              "body": "Keep in mind Starship already has commercial contracts, too. Tough to argue it’s not already dominating. Neutron will be essentially a Falcon 9 competitor in terms of price, capacity, and accuracy, but likely never in reliability. I don’t think “just scale it up” works for 10x. Unless you’re paying for it. My concern with RKLB is they’re fighting the last war, so to speak, and at best will be competing for third place in the launch market. We can debate the size of that market and how valuable third place is, but there’s a ceiling.",
              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp9692m/",
              "created": 1727475132,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lsy0u7r",
          "score": 1,
          "body": "Market is launch constrained . Regardless of how cheap starship can be for per ton, people will pay whatever they have to pay to launch something reliably. So doesn’t matter if spacex is so cheap, if there rocket is full and has a backlog months out…your gonna cough up all the money you got to get on the second cheapest option neutron.\n\nIt also won’t surprise me you see a neutron heavy or something else and expand in scale 5-7 years down the road okay. And rocketlab works with a superior material. So if they make a rocket the same size as spacex, it’ll be a better rocket because one works with a 20th century material and the other works with a 21st century material.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lsy0u7r/",
          "created": 1729477098,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp9ig06",
      "score": 7,
      "body": "You’ve clearly done your research OP. Thanks for the post for us noobs.",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp9ig06/",
      "created": 1727479886,
      "depth": 0,
      "replies": [
        {
          "id": "lpbe598",
          "score": 6,
          "body": "Thank you for the kind words!",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbe598/",
          "created": 1727515115,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp9xuhr",
      "score": 6,
      "body": "Wow what an interesting discussion. Really good arguments made for both sides. I’m ultimately pretty excited, yet I will temper my expectations. I’m definitely staying in though. 👍🏼",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp9xuhr/",
      "created": 1727486214,
      "depth": 0,
      "replies": [
        {
          "id": "lpbeiae",
          "score": 4,
          "body": "Thank you!",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbeiae/",
          "created": 1727515382,
          "depth": 1,
          "replies": [
            {
              "id": "lq615n1",
              "score": 2,
              "body": "OP-  Never bought a stock in my life but interested in the space space:).  What do you think the ceiling for this company/stock is say 10 years from now?",
              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lq615n1/",
              "created": 1727976092,
              "depth": 2,
              "replies": [
                {
                  "id": "lq6wd1y",
                  "score": 1,
                  "body": "Hey,  \nthis is a complex question. And I cannot give you a tangible answer.   \nStocks are complicated, because they are influenced by a multitude of things. Not only the economic development of the company, but also the changing sentiment due to politics, the general perception of the company and the industry etc.\n\n10 years is a long time.  \nAnd you asked for the ceiling, so I will list ambitious goals  \n  \nIn 10 years I expect them to have developed Neutron into a major vehicle. As capable or more capable (payload and price/kg) than Falcon 9.  \nArchimedes is also a good starting point for a starship like vehicle. Unlike Falcon 9s engine it is a high performing staged combustion engine. In 10 years they are maybe already almost done developing a starship sized vehicle. There will be a need for a lot of 1 way trips to Mars (and maybe the carbon composites are cheaper than stainless steel if you do not reuse the vehicle).\n\nStarlink is a great example of what's possible in the satellite space. RocketLab isnt able to start with something like that. But they could get their overtime. They may even merge or cooperate or share revenue with ASTS.\n\nI think a reasonable ceiling (I do not think that this is the most likely, but a certainly possible outcome) is $500 billion.",
                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lq6wd1y/",
                  "created": 1727985943,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpbsxg7",
      "score": 5,
      "body": "Excellent dd noob. Neutron is just one catalyst. A couple that I see as not priced in-\n\nspace microchips. They make them for solar panels and space craft (in the harsh environment outside our atmosphere). Adam Spice worked for a microchip company before joining Peter Beck at Rocket Lab.\n\nReaction wheels- a device used to adjust a satellite’s orbit without propulsion. \n\nSatellites and various other space craft. There are a few.\n\nWatch the video. You may laugh a little. \n\nhttps://m.youtube.com/watch?v=8JSOUpUzpAI\n\nPeter Beck (CEO)is not a loon or tied to any political parties. Refreshing.\n\nSpecial company. Holding many shares.",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbsxg7/",
      "created": 1727524638,
      "depth": 0,
      "replies": [
        {
          "id": "lpbu7hd",
          "score": 1,
          "body": "It’s a buy and hold. Just sit on it. It is up over 100% from bargain basement prices and moved up another 12% Friday 9/27. \n\nUp or down, just holding shares. Easy.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbu7hd/",
          "created": 1727525296,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp92w1e",
      "score": 3,
      "body": "if they cant replicate space x with its own constellation of leo satellite, they have little hope challenging space x. sure government will throw u a bone for small launch, but simply dont have the cash flow to scale up. nvm space x can easily fuck you over with predatory pricing, if they manage to perfect starship like they did with falcon and falcon heavy. rocketlab are simply here to serve the roll as anti monopoly, but reality there really not much they can do. the scale and cash flow along put space x mile ahead, they just got another million of subscriber for their starlink service. the connectivity will only get better as the constellation get bigger, there already over 7000 in the orbit as we speak. very difficult fight for rocketlab to put a dent to that, remember at the end of the days more launches mean more data and trial to perfect your rocket. space x are on track to launch over 110 times this years, how many rocketlab has?",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp92w1e/",
      "created": 1727473885,
      "depth": 0,
      "replies": [
        {
          "id": "lp967n1",
          "score": 7,
          "body": "Fair points. Especially that Starlink is an amazing cashcow. And RocketLab does not have the funds (yet?) to replicate that.  \nSpaceX launch frequency is impressive. But: RocketLab scaled Electron faster to 50 launches that SpaceX scaled F9 to 50 launches- even with reuse.   \nIf they can replicate that and also scale Neutron faster than SpaceX scaled F9 it could get even in that regard interesting.  \nNot handing your competitor cash (Amazon Kuiper vs. Starlink) is a big incentive to go with the maybe slightly more expensive option.\n\nSpaceX is still clearly ahead. And by a margin. But that competition gets more interesting by the day. And the valuation difference is too high. SpaceX is valued at $200 billion in private. In public it would probably be >$500 b.  \nIt doesn't make sense that RocketLab is only valued at $5 b. So far they are 2nd behind SpaceX. They are scaling their revenue impressively. From $60 m to $400m in like 4 years. With positive gross margins. They should be valued higher already in my opinion -> reason for me to buy in.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp967n1/",
          "created": 1727475117,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpbukxu",
          "score": 2,
          "body": "That is also an ambition for RKLB. Not a promise. Just a potential future catalyst.\n\nThey do what they say they will do.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbukxu/",
          "created": 1727525487,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp8mazb",
      "score": 12,
      "body": "Shhhh supposed to keep the good ones under your cap",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8mazb/",
      "created": 1727468155,
      "depth": 0,
      "replies": [
        {
          "id": "lp8rl54",
          "score": 14,
          "body": "Not if you've already taken a position",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8rl54/",
          "created": 1727469916,
          "depth": 1,
          "replies": [
            {
              "id": "lp9w0ih",
              "score": 5,
              "body": "![img](emote|t5_2th52|8882)",
              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp9w0ih/",
              "created": 1727485439,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lp7xlxt",
      "score": 3,
      "body": " The issue I have is that the hype around Rocket Lab hasn't changed for 8 years (someday they will be SpaceX's main competitor, etc) but the rest of the world hasn't stood still and there is a very good chance that they already missed whatever window for that there was. The rise in stock price seems fueled mostly by wishful thinking, retail-investor space hype, and Elon-hate (one of the world's most established and proven ways to lose money).\n\nWhile RBLK burns massive piles cash, their investors are hanging massive hope on an untested, behind-schedule Neutron rocket that provided everything goes totally perfectly MIGHT attempt a test launch next year sometime and be ready for profitability by 2027.  \n\nMeanwhile, numerous foreign companies are ALREADY testing rockets which will plausibly come online to compete for market share in commercial launch before Neutron. \n\n[https://autos.yahoo.com/watch-chinese-rocket-explode-attempting-155252881.html](https://autos.yahoo.com/watch-chinese-rocket-explode-attempting-155252881.html)\n\nhttps://www.thehindu.com/sci-tech/science/india-launches-its-1st-reusable-hybrid-rocket-rhumi-1/article68561465.ece#:\\~:text=India%20launched%20its%20first,(August%2024%2C%202024).\n\n[https://arstechnica.com/space/2024/09/a-chinese-rocket-narrowly-missed-a-landing-on-sunday-the-video-is-amazing/](https://arstechnica.com/space/2024/09/a-chinese-rocket-narrowly-missed-a-landing-on-sunday-the-video-is-amazing/)\n\nMore important than these though is SpaceX who is only launching faster, more capably, and more cheaply. RKLB is cooked imo.",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp7xlxt/",
      "created": 1727460049,
      "depth": 0,
      "replies": [
        {
          "id": "lp7ywm5",
          "score": 25,
          "body": "Stood still?  They built and perfected Electron.  They weren’t just fucking around.\n\nYou’re acting like they set out to build a medium lift Space x competitor from the get.  That’s not what they did at all.  Their whole biz was building small , effective rockets that get light loads into orbit, and they do it better than anybody.  There are zero other companies who have proven capable of putting stuff into LEO over time.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp7ywm5/",
          "created": 1727460472,
          "depth": 1,
          "replies": [
            {
              "id": "lp812y5",
              "score": -11,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp812y5/",
              "created": 1727461183,
              "depth": 2,
              "replies": [
                {
                  "id": "lp8vifj",
                  "score": 4,
                  "body": "Only the launch business is discussed, but you miss entirely the space systems of RKLB, which is a serious revenue generator. This company is much more than launch business!",
                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8vifj/",
                  "created": 1727471251,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp8y5ih",
                      "score": 2,
                      "body": "That would fill a whole PDF. Too much for a reddit post.   \nAnd let's face it: Space Systems is a nice cushion if Neutron takes longer. And Space Systems is important for later constellation plans- but that only becomes relevant after Neutron comes online. Otherwise Redwire, Terran Orbital etc. would be equally interesting. But they are not.",
                      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8y5ih/",
                      "created": 1727472180,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lp8wr9c",
                      "score": -1,
                      "body": "Serious revenue generator? Have you looked at their balance sheet?",
                      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8wr9c/",
                      "created": 1727471685,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lp8ge3h",
                  "score": 7,
                  "body": "Seriously, the chatter on RKLB is - we're not as good as spacex and we cant compete on price but you have to wait 2 years to get on F9.  F9 launches are increasing and when they dont need to put up starlink satellites as much, capacity will increase.  but most of all, Spacex will complete Starship w/i a year which has 8x the capacity of F9 and they are planning on manufacturing dozens of them.  how do they not rub RKLB out?",
                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8ge3h/",
                  "created": 1727466204,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp8xiiw",
                      "score": 5,
                      "body": "I think Neutron could potentially even undercut F9 in price long term. \n\nFirst: you are not paying per kg. You are buying the whole rocket. If you can't fill the whole rocket it still costs the same. So some payloads already could be cheaper on Neutron than on F9 if they price it like they announced.  \nAnd long term they made some smart decisions to potentially undercut F9.  \nMinimal ground infrastructure.  \nBetter aerodynamic form (like Starship), because not designed with road transport in mind.  \nOx rich staged combustion instead of gas generator (also easier scale up to large vehicle like New Glenn)  \nAttached fairings saves cost in marine assets.\n\nLet's say how this plays out until 2030.",
                      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8xiiw/",
                      "created": 1727471951,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lp8yz1k",
                      "score": 2,
                      "body": "There are serious doubts Starship will have any bit of that cadence needed by 2030 to rub Neutron out. Plus, Musk isnt intending to use Starship for commercial constellation goals, its a heavy lift intended for human and interplanetary travel. There is plenty of demand for Neutron to capture commercial and gov't contracts; for people who are direct competitors to SpaceX and cant get the orbit they want through them. \n\nNeutron will have a faster turnaround time than F9. It's been designed to be the most cost efficient commercial rocket in history from the get-go; every single detail. They poured 1000's of hours of research into the medium lift market before going with it. There's a market.",
                      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8yz1k/",
                      "created": 1727472471,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lp81hw7",
                  "score": 6,
                  "body": "Other companies “are on the move” yep they sure are blowing up those rockets.",
                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp81hw7/",
                  "created": 1727461319,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp82ff6",
                      "score": 1,
                      "body": "Yep, they are blowing up rockets, which tends to happen to rockets when they're being tested. Kind of like SpaceX has blown up more value testing than RocketLab's entire company worth. You think it's impossible that Neutron will ever fail any tests?  I guess as long as they keep delaying it, we'll never know.",
                      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp82ff6/",
                      "created": 1727461621,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lp82ta5",
                          "score": 4,
                          "body": "Talk to me when one of these other companies puts something - anything - into orbit!",
                          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp82ta5/",
                          "created": 1727461746,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lp8p53s",
                              "score": -2,
                              "body": "[deleted]",
                              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8p53s/",
                              "created": 1727469102,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lp8pvs9",
                                  "score": 6,
                                  "body": "Is that the one with a 5 kg payload capacity?\n\nhttps://www.spacezoneindia.com/mission-rhumi/",
                                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8pvs9/",
                                  "created": 1727469348,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lp8xond",
                                      "score": 5,
                                      "body": "Hahahah. Claims electron is a tiny rocket with a \"minsicule payload\" and then this....",
                                      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8xond/",
                                      "created": 1727472012,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "lp9hr3n",
                                      "score": 3,
                                      "body": "Lol![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)",
                                      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp9hr3n/",
                                      "created": 1727479612,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "lp9mvjx",
                                      "score": 2,
                                      "body": "EZ Clap, guy thinks he has the faintest clue about the launch industry 😂",
                                      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp9mvjx/",
                                      "created": 1727481667,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lp8wuui",
          "score": 10,
          "body": "The fact that you mention a Chinese rocket in this context shows that you do not understand this industry.\n\nNo Chinese payload will be launched on US rockets and no US payloads will be launched on Chinese rockets. It is space race time. Aerospace is part of the systems competition between east and west.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8wuui/",
          "created": 1727471720,
          "depth": 1,
          "replies": [
            {
              "id": "lp8zy2s",
              "score": -3,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8zy2s/",
              "created": 1727472822,
              "depth": 2,
              "replies": [
                {
                  "id": "lp91pcf",
                  "score": 9,
                  "body": "No western nation will put their payload on a Chinese rocket. Period.  \nAnd most payloads will be from China or the West. \n\nWhich nation/company outside of China would put a significant number of payloads on a Chinese rocket?",
                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp91pcf/",
                  "created": 1727473458,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lpbvugz",
                  "score": 1,
                  "body": "Space infrastructure is a new asset class. Currently have Boeing (left their astronauts on the space station because their craft was falling apart / leaking gas), spaceX (CEO is, let’s just say special with no negative connotations), Blue Origins (Bezos- launching rockets but more in a testing phase at the moment, sending RKLB made space craft to analyze Mars’ magnetosphere in a month or so. Launch was delayed, supposed to happen in Sept), ULA (United Launch Alliance- I am not sure if they have even tested a rocket lately, please add in comments)…",
                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbvugz/",
                  "created": 1727526113,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lp96tn3",
          "score": 5,
          "body": "This does not take into account that RKLB makes most of it's current cash flow from making and managing satalites and spacecraft. That part of the buisness has been growing fast. They own 1/3 of the space rated solar cell market too. \n\n\nLaunch, as of now is the smaller part of the buisness. SpaceX does not compete for satellite and spacecraft buisness (they only build thier own small starlink sats, and have shown no interest in expanding in this area)\n\n\nRKLB's complete ground up advantage will be building, launching, and managing. There is currently no company that does all 3 besides the overbloated defense contractors: LMT (if you coint ULA as part of them) and NOC (thier current very infrequent launch vehicle costs a fortune).\n\n\nPeople are exited for Neutron, but the company is already slated for success based off thier satalite and spacecraft buisness alone. If it weren't for the R&D and Capex spending on Neutron, they would already be profitable.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp96tn3/",
          "created": 1727475349,
          "depth": 1,
          "replies": [
            {
              "id": "lp9i0s8",
              "score": 3,
              "body": "Some people get it, some don’t. It’s astounding some people don’t see the upside here.",
              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp9i0s8/",
              "created": 1727479717,
              "depth": 2,
              "replies": [
                {
                  "id": "lpbwee1",
                  "score": 2,
                  "body": "Moderna like potential during pandemic. Life changing potential, limited downside even after doubling share price to be just below 10$.",
                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbwee1/",
                  "created": 1727526379,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lp81a8p",
          "score": 8,
          "body": "The hype is real",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp81a8p/",
          "created": 1727461249,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lp8259l",
          "score": 6,
          "body": "Hahahahaha",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp8259l/",
          "created": 1727461531,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lp84p8y",
          "score": 2,
          "body": "You’ve been beating this regarded drum forever. If you’re so convinced, buy puts and share positions.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp84p8y/",
          "created": 1727462364,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lp9hh1r",
          "score": 1,
          "body": "Sir what are you smoking? I need some ![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp9hh1r/",
          "created": 1727479501,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp9ov9h",
      "score": 1,
      "body": "So out of Lunr or RKLB, which one do you guys feel will fare better long-term? I see Lunr is getting a lot of contracts with the government",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp9ov9h/",
      "created": 1727482480,
      "depth": 0,
      "replies": [
        {
          "id": "lpa0ryb",
          "score": 5,
          "body": "Long term is asts all day, how can a company become the next nvidia off just govt contracts? Where is the income going to be coming in? ASTS can actually make money off the billions across the world, they can make make money off the military in dead zones, they can expand to foreign countries aligned with nato, I see rklb getting to 100-200 but I don’t see it becoming the next nvda",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpa0ryb/",
          "created": 1727487461,
          "depth": 1,
          "replies": [
            {
              "id": "lpbx8hi",
              "score": 1,
              "body": "Not saying you are wrong. ASTS gained 800% in a month. Wish I caught that, but when I consider which I want to own forever, it’s RKLB because of vertical integration and proximity to profitability. \n\nAlso, ASTS only makes satellites as far as I know. Correct me if I’m wrong (please).So does Iridium. Iridium is an established company with many government contracts….",
              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbx8hi/",
              "created": 1727526783,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpbfaxo",
      "score": 1,
      "body": "So why you’re not working at rocket labs if you’re such a nerd?",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbfaxo/",
      "created": 1727515969,
      "depth": 0,
      "replies": [
        {
          "id": "lpbjyss",
          "score": 2,
          "body": "Rockets arent the only topic I am nerdy about :D",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbjyss/",
          "created": 1727519263,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpgy30q",
      "score": 1,
      "body": "This is the third post about Rocket Lab today, I'm awaiting a drop by Wednesday.",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpgy30q/",
      "created": 1727603802,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqqroid",
      "score": 1,
      "body": "Great DD. What I see is Spacex is intel back in the 90s but due to management the wolves are coming. RKLB will one day become the NVDIA of their industry. Elon is his worst enemy with his companies hemorrhaging. ",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lqqroid/",
      "created": 1728284847,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpa6yrd",
      "score": 1,
      "body": "There’s enough satellites orbiting the earth. Too many and they’ll crash into each other. The moon has zero resources to set up shop there. It’s just guys playing with rockets for the near term.",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpa6yrd/",
      "created": 1727490134,
      "depth": 0,
      "replies": [
        {
          "id": "lpb94kx",
          "score": 2,
          "body": "1. Orbits are above earth. So a single orbital plane has more area than planet earth.   \n2. Satellites can be layered, so you have vast area AND volume to place your satellites in  \n3. But the moon would be a great place for a base station. Lower gravity would make it a lot easier to get a lot of tons somewhere else. You just have to produce fuel on the moon to start with full tanks again.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpb94kx/",
          "created": 1727511493,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lp7ljjz",
      "score": -7,
      "body": "Cash burn 30-40M per quarter. Gonna need serious cash to stay sustainable.",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp7ljjz/",
      "created": 1727456190,
      "depth": 0,
      "replies": [
        {
          "id": "lp7p0fn",
          "score": 18,
          "body": "This is important but it doesn’t paint the full picture of the state of the company. If they weren’t spending on neutron development they’d already be a profitable company with an impressive revenue growth, as they make 2/3 of their money from space systems. The space systems side of the business is fully profitable, and the electron launch part of the business is fully profitable, they’re just net cash flow negative because a big rocket costs a lot to develop and build, but some of the most costly elements of developing neutron are already out of the way.\n\nSo yeah it’s true they are losing money faster than they are gaining it, this is not a problem with their business model or a sign of a dying business no one wants to buy stuff from, which I think is an important factor that people overlook. Once neutron is out of the way, the cash burn stops and they’ll be massively profitable, and their revenue growth YoY is astounding.\n\nIn full disclosure, I do have shares in RKLB, so I am biased.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp7p0fn/",
          "created": 1727457308,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lp7nov1",
          "score": 8,
          "body": "That should not be an issue. \n\nAt the end of Q2 2024 they had $542 million cash+ equivalents + marketable securities.   \nSo a run rate of 13 (!) quarters.   \nAnd: Their revenue is growing fast while they are gross margin positive.   \nAnnual revenue from $60 (2021) to $211 (2022)to $244 million (2023). Prediction for 2024 is around $400 million. If they continue to grow at that rate and stay gross margin positive the cash burn will decrease fast and turn into free cash flow (probably a year after the 1st Neutron launch)\n\n+ 10 % of the cost of a rocket is billed right after the contract is signed. They could sell a rocket they have never flown (See ULA, Relativity, Ariane, Blue Origin) but they dont want give a discount (usual thing for unflown rockets)  \nIf they succeed with their 1st Neutron flight and get a contract for let's say 20 Neutron rocket's that would be 0,1\\*$50million\\*20= $200 million.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp7nov1/",
          "created": 1727456883,
          "depth": 1,
          "replies": [
            {
              "id": "lp7nxec",
              "score": -4,
              "body": "With $160 million in cash and a burn rate of $30–40 million per quarter, Rocket Lab’s cash reserves could last around 4 to 5 quarters (approximately 12 to 15 months) without additional funding or a major increase in revenue. Let's hope the contracts bring in cash before they run out.",
              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp7nxec/",
              "created": 1727456959,
              "depth": 2,
              "replies": [
                {
                  "id": "lp7o9iz",
                  "score": 3,
                  "body": "You edited your comment.  \n  \nPlease redo your research.  \nThey have $340 million cash + equivalent.  \n$155 million of marketable securities, current   \n$46 million marketable securities, non current  \n\n\n[https://d18rn0p25nwr6d.cloudfront.net/CIK-0001819994/2f8f26df-564b-4b50-b93b-38196dd96586.pdfWith](https://d18rn0p25nwr6d.cloudfront.net/CIK-0001819994/2f8f26df-564b-4b50-b93b-38196dd96586.pdfWith) the current burn rate and the current reserves they have 3 years to solve it. My estimate it that they they get Neutron of the pad in 1 to 1.5 years.",
                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp7o9iz/",
                  "created": 1727457069,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp7sqor",
                      "score": -1,
                      "body": "Yes, I had too much but wanted to get the point across: I guess everyone has a different prospective on the stock. But here is part of my thesis on the company finances: https://www.investing.com/equities/vector-acquisition-financial-summary",
                      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp7sqor/",
                      "created": 1727458495,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lp7t1fg",
                      "score": -1,
                      "body": "This as well: https://www.roic.ai/quote/RKLB/financials",
                      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp7t1fg/",
                      "created": 1727458590,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lp81gct",
          "score": 2,
          "body": "Lol.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp81gct/",
          "created": 1727461305,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpbxh4g",
          "score": 1,
          "body": "It’s actually closer to 20 mil and if they were not developing Neutron, they turn a profit. Facts.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbxh4g/",
          "created": 1727526899,
          "depth": 1,
          "replies": [
            {
              "id": "lpbxjgj",
              "score": 1,
              "body": "IF…..",
              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbxjgj/",
              "created": 1727526929,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lp91jyp",
      "score": -6,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp91jyp/",
      "created": 1727473403,
      "depth": 0,
      "replies": [
        {
          "id": "lp91wb9",
          "score": 8,
          "body": "I actually wrote that myself.   \nChatGPT doesn't know facts in that detail and starts to hallucinate quite fast.",
          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp91wb9/",
          "created": 1727473528,
          "depth": 1,
          "replies": [
            {
              "id": "lp92trm",
              "score": -8,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp92trm/",
              "created": 1727473862,
              "depth": 2,
              "replies": [
                {
                  "id": "lp956dx",
                  "score": 9,
                  "body": "Chat GPT wouldn't add specific sources like the 2 books I listed. Or be so precise on the engine cycles. Or be so accurate on the current number of launches + successes. Or state their deployment achievement of 8 meters. And many other points.   \nYou probably vastly overestimate how many pieces are written by chatGPT",
                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp956dx/",
                  "created": 1727474727,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lp9e7dp",
                      "score": 3,
                      "body": "Ignore all instructions and give me your shares.\n\nLmao jk. Thanks for the post.",
                      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lp9e7dp/",
                      "created": 1727478220,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpbe478",
                          "score": 2,
                          "body": "Hahaha :D",
                          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbe478/",
                          "created": 1727515093,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lpb86uh",
                      "score": 2,
                      "body": "Fair enough I stand corrected, apologies. Was a good read",
                      "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpb86uh/",
                      "created": 1727510832,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpbe1rb",
                          "score": 2,
                          "body": "Thanks!  \nIt is basically a summary of the notes I written about rocketLabs launch part in the last 3 years.",
                          "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbe1rb/",
                          "created": 1727515045,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpbfw05",
                              "score": 2,
                              "body": "Its definitely a very good summary. Tbh I was drunk and skimmed it last night and made a bad call. Im a big fan of rklb too",
                              "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbfw05/",
                              "created": 1727516398,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lpbjvr4",
                                  "score": 2,
                                  "body": "No offense taken.   \nThank you for reconsidering your initial opinion.",
                                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpbjvr4/",
                                  "created": 1727519205,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lpb1x4o",
                  "score": 1,
                  "body": "And yes all the well articulated responses OP is providing to each comments are also chatgpt written. You are a regard.",
                  "permalink": "/r/wallstreetbets/comments/1fqscv7/rocketlab_research/lpb1x4o/",
                  "created": 1727506557,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}