{
  "title": "AI Plays: NVD, AMD, GOOGL + a Couple Broader Questions",
  "score": 65,
  "selftext": "What’s up people,\n\nHope everyone is good. Posting this in hopes of getting some discussion about AI and possible investments going.\n\nFor context, with all the talk about AI going on, I've been trying to learn what I can about it. I don’t have any relevant background or expertise, but I’ve increasingly felt compelled to learn about it so I'm at least not totally ignorant. At this point, I’ve mostly been watching YouTube interviews of Altman/Zuckerberg/Gates types, along with lectures that Stanford makes available.\n\nIn the midst of this, I watched two videos in which separate AI researchers mentioned a [2019 blog post titled “The Bitter Lesson.”](http://www.incompleteideas.net/IncIdeas/BitterLesson.html) Apparently, this blog post was written by a computer scientist and is really influential in the field. One of the main takeaways, as I understand it, is that all that really matters for improving AI is providing more computing power.\n\nGiven how much the tech community seems to believe this, I decided to make a few plays in the space, buying literally just a few shares of NVDA, AMD, and GOOGL earlier this week. NVDA and GOOGL are obviously some of the biggest names in the space, albeit in different aspects. I took a chance on AMD, even though people seem to say their tech isn't as good, just because I still feel like it could rise with the rest of the field as long as people keep thinking AI is the future.\n\nTo be candid, I’m cynical about about how AI will be used and, more broadly, I don’t really think this is a great time to just now be getting into the market- from my perspective, it still seems like a lot of people are burnt out from work/life, and the companies that are making more money seem to be doing so largely by raising prices. I’m not sure how sustainable it all is without some sort of correction. Still, I wanted to get a little skin in the game so that I’m motivated to keep learning.\n\nIf anyone finds any of this worth talking about, I have two ongoing questions at this point:\n\n1)    What really excites people in the field about generative AI/large language models from a technological/computer science perspective? For example, when blockchain was blowing up, I heard it said that Blockchain was exciting because it made it possible to transfer a digital file such that the original sender no longer possessed the file after sending. Regardless of my personal opinions on the technology, that explanation at least made sense to me, and I could imagine possible applications and why people might be excited. What is it about AI that likewise has tech experts so excited really? What specifically does it allow them to do that they could never do before, and why is that valuable?\n\n2)    Outside of the people running tech companies, who is really positioned to benefit from AI? In nearly every video I see of Sam Altman talking, he says something like, “I believe AI will have a positive net benefit on society overall.” I wonder, though, how he would measure this. It seems to me like AI will help any company or user that can leverage it to make money, but could end up harming a lot of employees and end consumers. I feel like it could just accelerate trends of companies extracting more and more money from the rest of the population. I'm really not trying to make this political or turn it into a debate on capitalism. That’s just my honest gut feeling about it from an economic perspective at this point. I see it providing a lot of benefit to a relatively small segment of the population.\n\nWould be interested to hear what other people think and if/how you are investing in the space. I'd even like to know if people here actually use AI in their personal lives. And if anyone has resources that they feel have helped deepen their knowledge about AI, I’d really appreciate you sharing. I feel like I’ve kind of hit a wall trying to get beyond surface-level discussions about the field.\n\nCheers.",
  "link_flair_text": null,
  "id": "1frpnji",
  "num_comments": 69,
  "created_utc": 1727561903,
  "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/",
  "comments": [
    {
      "id": "lph1r4p",
      "score": 10,
      "body": "Here is an [old post](https://www.reddit.com/r/StockMarket/comments/13xempk/some_ai_apps_by_category/?utm_source=share&utm_medium=web2x&context=3) that may help with a visual presentation.\n\nFor me, the hardware will become commoditized but the question is when - I personally suspect in 5 years.\n\nIn my opinion, the generational winners will be companies with the largest datasets will prevail - GOOG=BIDU > APPL> AMZN=BABA > MSFT=META but there will also be industry specific players (like healthcare, i.e., drug discovery , possibly UNH or research hospital like MSK or Duke Univ), defense maybe PLTR, travel = BKNG, retail (specifically grocery) - any large chains with loyalty programs (they know a lot about you and your preference) or TSLA has more driving data, particularly for autonomous driving AI.\n\nI would also not rule out Bloomberg as they have immense financial data set and how companies interrelate. I suspect they are already using it and being private do not publicize it, like APPL (who prefer to use the term Large Language Modeling)\n\nMSFT except for OFFICE has been a follower or acquirer; they were way behind on AI and is the reason the partner with OpenAI and did better PR.\n\nI will stick with Google.\n\nI personally also suspect that APPL (I know they partner with OpenAI for the consumer front, but believe they have internal products) and AMZN have better AI tech as it is captive and will never be in the open market for competitive reasons.\n\nThere was a good new release of data is king and those that can exploit data will win. Isomorphic Labs partnering with LLY and NVS on drug discovery. If you can shorten drug discovery time and extend protection - it is a big win.",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lph1r4p/",
      "created": 1727606355,
      "depth": 0,
      "replies": [
        {
          "id": "lphwcy5",
          "score": 2,
          "body": "Thanks, appreciate all this🙌🏽",
          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lphwcy5/",
          "created": 1727620808,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpg2ls6",
      "score": 11,
      "body": "I would throw ANET into the AI bucket",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpg2ls6/",
      "created": 1727583629,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpg81jp",
      "score": 24,
      "body": "GOOG just seems like an obvious buy. It's priced low right now and they're throwing a lot of money at AI infrastructure. Even if they don't use it directly the can lease out the ML servers in the new data centers they're building.  NVDA is great but GOOG covers so many different area whereas NVDA and amd just make chips. \n\nDisclaimer- I own all 3",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpg81jp/",
      "created": 1727586568,
      "depth": 0,
      "replies": [
        {
          "id": "lpihyxx",
          "score": 3,
          "body": "What about the possible break up of Google? Isn’t that a risk factor?",
          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpihyxx/",
          "created": 1727628075,
          "depth": 1,
          "replies": [
            {
              "id": "lpix2e7",
              "score": 8,
              "body": "Personally I don't think its risky if that were to ever happen. What would they do, break out YouTube and the Data Centers? Break off Android to its own company? Separate pixels into their own phone manufacturer? Make Waymo its own thing again? Sure give me shares of youtube. I'd be happy to own any of GOOGs products if GOOG was to be split up.",
              "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpix2e7/",
              "created": 1727632690,
              "depth": 2,
              "replies": [
                {
                  "id": "lpo4dxc",
                  "score": 5,
                  "body": "So, you are saying even if the company breaks up, owning the underlying businesses makes sense either way.",
                  "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpo4dxc/",
                  "created": 1727713187,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpoytc4",
                      "score": 6,
                      "body": "Correct sir, that's my opinion.",
                      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpoytc4/",
                      "created": 1727722845,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lppp830",
                          "score": 1,
                          "body": "Got it. Makes sense.",
                          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lppp830/",
                          "created": 1727731157,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpq4rxo",
                              "score": 5,
                              "body": "Just for context, Google has many products with over a billion users\n\n*Gmail: The most popular email provider in the world \n \n*Google Drive: Reached one billion users in July or August 2018 \n \n*Google Photos: Joined the billion-user club in July 2019 \n \n*Google Play Store: Reached one billion users in September 2015 \n \n*Android: Has over 3 billion active devices \n \n*Chrome: Has over 2.65 billion users \n \n*YouTube: Has over 2.1 billion users \n \n*Google Search: Has over 3.6 billion users",
                              "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpq4rxo/",
                              "created": 1727736693,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lq13djz",
                                  "score": 3,
                                  "body": "Nice list you have there, brother...",
                                  "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lq13djz/",
                                  "created": 1727899666,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lq5200h",
                  "score": 2,
                  "body": "Those individual blocks are worth a lot less if they’re not part of the Google ecosystem.\n\nThey won’t be able to share data. A big drawback for marketing and AI.\n\nThey won’t have the user convenience factor of linking to your other accounts.\n\nThey won’t be able to nudge users of one app to use the others.",
                  "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lq5200h/",
                  "created": 1727964932,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lpit9o0",
              "score": 6,
              "body": "If it breaks up, the stock will probably go up too.",
              "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpit9o0/",
              "created": 1727631562,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpj2gct",
          "score": -2,
          "body": "Google is wasting a lot more money than they are spending efficiently. They're a company in decline and the market has known it for some time. All their products become worse over time and their AI efforts have been a disaster so far.",
          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpj2gct/",
          "created": 1727634333,
          "depth": 1,
          "replies": [
            {
              "id": "lpj4e1e",
              "score": 6,
              "body": "That's just like, your opinion. Personally I've been holding since $69 and it's worked out well. Their AI efforts have not been a disaster. \nHave you tried Google Lens? It's fantastic. That's just one example.",
              "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpj4e1e/",
              "created": 1727634941,
              "depth": 2,
              "replies": [
                {
                  "id": "lpjfosq",
                  "score": -5,
                  "body": "Lens is great, but I'm sure it'll get worse over time like all their other products. Also, I wasn't saying it wasn't a good investment in the past, I'm not even saying it won't be a good investment in the future, but the company is clearly in decline, heavily bloated by woke ideologies and at a serious risk of having their search business disrupted because they're making a mess of Gemini.",
                  "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpjfosq/",
                  "created": 1727638476,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpojvg5",
                      "score": 5,
                      "body": "> woke\n\n\nAlways worth reading the follow up comment. They can't help but show their bias. It's like a 3 paragraph limit for this type before their cranial diarrhea acts up.",
                      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpojvg5/",
                      "created": 1727718126,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lps6w4o",
                          "score": -1,
                          "body": "Not sure this is what you're trying to say, but are you seriously arguing that woke ideologies haven't been a huge negative on many companies' efficiency/profitability on a sub about business and stocks?",
                          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lps6w4o/",
                          "created": 1727770881,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lps718n",
                              "score": 1,
                              "body": "🤡 ",
                              "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lps718n/",
                              "created": 1727770986,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lplqp41",
                      "score": 2,
                      "body": "WOKE MIND VIRUS",
                      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lplqp41/",
                      "created": 1727669875,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lps6nmg",
                          "score": 1,
                          "body": "Exactly, although that's only part of Google's issue imo.",
                          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lps6nmg/",
                          "created": 1727770709,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lpj9nuu",
              "score": 1,
              "body": "Thinking one of the top AI companies in the world is in decline, is peak, even on this sub.",
              "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpj9nuu/",
              "created": 1727636606,
              "depth": 2,
              "replies": [
                {
                  "id": "lpjf6pz",
                  "score": -1,
                  "body": "Thinking a company would be valued so cheaply for no reason is peak, even on this sub.",
                  "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpjf6pz/",
                  "created": 1727638320,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpjsbtj",
                      "score": 1,
                      "body": "Yes because of course the market is never wrong.\n\n\nLike when $META was trading at 10x in 2022.",
                      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpjsbtj/",
                      "created": 1727642370,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lps6deb",
                          "score": 1,
                          "body": "Meta was valued fairly at the time but made a dramatic shift that changed its course. Google has not made any such switch. Also, I'm not saying the market isn't wrong by some margin, but it's clear that Google has massive issues and the market agrees. It's not cheap for no reason.",
                          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lps6deb/",
                          "created": 1727770503,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lpkcz8e",
                      "score": 1,
                      "body": "It’s valued cheaply due to anti trust concerns not whatever nonsense you claim it is. Google is printing money rn and will continue to do so.",
                      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpkcz8e/",
                      "created": 1727649479,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lps6mhm",
                          "score": 1,
                          "body": "It's been valued cheaply for at least 3 years, well before anti-trust was a serious concern.",
                          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lps6mhm/",
                          "created": 1727770685,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpfo83a",
      "score": 21,
      "body": "Just track QQQM and you’ll get exposure to all the big AI plays",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpfo83a/",
      "created": 1727577010,
      "depth": 0,
      "replies": [
        {
          "id": "lpg5th1",
          "score": 33,
          "body": "I think people make these threads because they want to get into the next big AI plays that arent Mag 7, ETFs, and index funds  early. Such as buying PLTR at $7. The issue with this is PLTR at $7 was regularly downvoted on this sub in these type of forward looking threads. You would be called a bagholder for saying positive things about it back when it was $7. \n\nThe second part is lets say you went against the downvotes and negativity find something at the bottom of these threads. Many people sell it as soon as they get a 30-100% gain. To continue with a PLTR example a lot of people sold when it was $10-15.",
          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpg5th1/",
          "created": 1727585329,
          "depth": 1,
          "replies": [
            {
              "id": "lpg80rz",
              "score": 14,
              "body": "People are saying same for Space plays like ASTS and RKLB. \n\nI do not care making a swing trade of a few thousand bucks. I don’t see the point of this subreddit if all they suggest is ETFs. Most people here already know that lol.",
              "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpg80rz/",
              "created": 1727586556,
              "depth": 2,
              "replies": [
                {
                  "id": "lpghl4z",
                  "score": 12,
                  "body": "Same with meta when it dropped to 100, Reddit acted like it was a failing business",
                  "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpghl4z/",
                  "created": 1727592445,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lphq0w1",
                      "score": 3,
                      "body": "Of course you went with META. This sub gets boring with how Mag 7 heavy the discussion is.\n\nNot hating Mag 7 it just there are hundreds of stocks in the market. I remember when CAVA dipped 40% after its IPO and it was $30 wondering if it really was a failing business that was going to zero. It has since gone up 300%. I hope to hear more stuff like that but I know Mag 7 and ETFs is what this sub tends to have upvoted to the top of most threads.",
                      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lphq0w1/",
                      "created": 1727618446,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lpgdxfl",
                  "score": 3,
                  "body": "Cause majority of people lose money investing on specific stocks. We get burned and become bitter",
                  "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpgdxfl/",
                  "created": 1727590088,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpghxo0",
                      "score": 4,
                      "body": "Yeah there is a risk with individual stocks. If people don’t like that invest in broad market ETFs. I do that for my retirement portfolio as well. \n\nBut here we want to find next 5-10x baggers. Take some risk, I’m fine losing money on stocks like RKLB or PLTR. They won’t my change my life it goes to zero. But they could change my life if they go to 100 or more.",
                      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpghxo0/",
                      "created": 1727592671,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lpj21du",
          "score": 4,
          "body": "If OP wanted to do that, he wouldn't be on /r/stocks but /r/ETFs.",
          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpj21du/",
          "created": 1727634205,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpgtk3x",
      "score": 5,
      "body": "AI is a massive field. One interesting play is focusing on manufacturing since demand will likely be higher than supply for the foreseeable future. The companies that have advanced manufacturing (ASML semiconductor manufacturing) are primarily TSMC, Samsung (not traded in the US), Intel, and Micron (at a smaller scale). I have invested heavily in Intel and Micron since I think the US and Europe want western manufacturers they have more control over. \n\nAnother play is arm based processors, with the focus these days being Arm and Qualcomm, I'm invested in both.\n\nI'm also invested in Nvidia, Amd, and a couple smaller chip companies which are less related like Marvell and TSEM. I am quite bullish in general on semiconductors but you have to know when to buy and what. The less risky option is going for an ETF like SOXX.",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpgtk3x/",
      "created": 1727600584,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpge989",
      "score": 7,
      "body": "NVDA is selling chips to Amazon, Google, Azure and also uses these cloud services. They now have them as customers and they also use their own chips sold to these cloud providers as consumers. Both get to claim AI hype is real and real world use cases. \n\n\n\nBesides this evey other production use case is around text generation and struggles with hallucinations, RAG for everything and struggle with long context or long conversations, synthetic data for many things but making sure there is no biases so essentially doing ML but now with expensive hardware with similar outcomes. These are qualified use cases and some more in call center, automated responses which can take advantage of NLP but only big tech companies can spend billions to make no money and still enjoy returns in form of marketcap rise due to hype. GenAI os as good and will stay as has blockchain. Only picks and shovel selling is profitable right now. It's an early innings but market cap for these semiconductor companies is unsustainable. NVDA especially is at risk of massive correction and maybe so many engineers have taken a break or left and sold their stocks to enjoy their time. Insider trading also shows everyone is selling and taking advantage of this high valuation with 10x jump in 2yrs. \n\n  \nTech is evolving but market cap for these picks and shovels company is crazy. So is it for AMD who is miserable behind on software stack that can support Training and doesn't scale too well for inference plus they have very low supply to  make any gains in market share. No one wants AMD and if NVDA hardware gets cheaper they will get another reason to not use AMD.",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpge989/",
      "created": 1727590295,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpgn58z",
      "score": 8,
      "body": "Google. Theyre going to win in the long run",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpgn58z/",
      "created": 1727596130,
      "depth": 0,
      "replies": [
        {
          "id": "lpibhif",
          "score": 3,
          "body": "Absolutely, and at 22 PE, it's a steal. Original questions, however, are probably not for this forum (which has more investment angle). \n\n\n > What specifically does A.I. allow them to do that they could never do before, and why is that valuable? Who is really positioned to benefit from AI?\n\n\nIt's easy to \"write off\" the utility of Gen-A.I. seeing that an average user can just use it to create cat pictures or short videos. But there're seriously cool applications of A.I. + multimedia in the entertainment industry.  \n\n\nAlso, LLMs are a generic umbrella technology covering specific A.I. algorithms. For example, your city's garbage recycling probably already uses A.I. to separate different plastics, with cameras and other types of physical sensors feeding an A.I. algorithm.  \n\n\n And, of course, most \"talked about\" application is self driving cars and trucks. If you want to see something cool right now, try Google photos app. Ask it to \"remove crowd\" from a picture taken at Eiffel tower. It works!",
          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpibhif/",
          "created": 1727626002,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpj1x23",
      "score": 3,
      "body": "I think you might be a bit too focused on LLMs, not AI in general. LLMs are cool, but they're very expensive and might end up being a race to the bottom. There are other parts of AI that are likely to see much higher profits. I'd recommend diving deeper into AI products by companies like Palantir and Tesla.",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpj1x23/",
      "created": 1727634167,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpg0x3p",
      "score": 5,
      "body": "AI bubble \"crashes\" when the imagination falls behind direction/training.  What I mean is right now everyone is chasing a LLM, but once they are all pretty good, what then?  That then requires something new, a new idea, and then starting back over at the beginning which will take a few years.  In that interim AI craze will dimish (not crash).",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpg0x3p/",
      "created": 1727582762,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpka9fh",
      "score": 2,
      "body": "Missing out on META. Palantir has great AI potential. Start following smaller AI verticals (saas) coming out of the LLMs some already have massive valuations keeps tabs on those and which ones you see having a future and when they go public invest and rest.",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpka9fh/",
      "created": 1727648473,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpg7hl9",
      "score": 2,
      "body": "November 2021 vibes",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpg7hl9/",
      "created": 1727586251,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpgpp3y",
      "score": 2,
      "body": "You are very late to the party son",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpgpp3y/",
      "created": 1727597864,
      "depth": 0,
      "replies": [
        {
          "id": "lphypaa",
          "score": 2,
          "body": "Fashionably late, or there’s puke on the floor late",
          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lphypaa/",
          "created": 1727621629,
          "depth": 1,
          "replies": [
            {
              "id": "lpikcwp",
              "score": 2,
              "body": "Everyone has already hooked up. There are some drinks and chips left so all is not lost. In a few hours, some people will puke yes, some will be ok and some will be somewhere in between with a little or big hangover",
              "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpikcwp/",
              "created": 1727628832,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpisob7",
      "score": 1,
      "body": "One gets more diversification and support from top 50 Nasdaq. I agree in 2024 these magnificant 7 had a huge gain. I small one has to wait for the next opportunity for the next hype.   Too late if one gets started.",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpisob7/",
      "created": 1727631389,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpfklph",
      "score": 1,
      "body": "Just buy into FSELX or SMA - heavy. People will tell you to stay in an S&P tracking index, and that’s safe, but i think it’s worth the so-called risk for the massive returns these indexes offer.  And I love the idea that I dont have to pick the stocks (or when to sell them), rather,let the people who spend all their time thinking about this stuff - and controlling large influential amounts of capital- make that decision for you.",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpfklph/",
      "created": 1727575479,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpfxc3i",
      "score": 0,
      "body": "To see the value of AI, just literally go to the ChatGPT website and ask your questions.",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpfxc3i/",
      "created": 1727581033,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpep6bo",
      "score": -13,
      "body": "GOOGL has had back to back flops on AI. Was caught asleep at the wheel and has chatGPT eating their lunch.\n\nThey lost on AI and are only being propped up by the rest of their monopoly. I bought dips on each Gemini flop and cashed out at 168. It's laughable to call them an AI company when Gemini performs worse than Grok\n\nIf you want to make money on AI you need to follow the money, datacenters, the components in the server racks, fiber cable to connect centers. Nuclear to power them...\n\nOr you can look at companies selling AI solutions for enterprise data.\n\nMy picks? NVDA, APLD, LUMN, MU, SOUN, PLTR, META, AMD, AI, SMR\n\nbought a lot last year and on the dip this summer. I am sitting pretty high and dry, comfortably in the green.",
      "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpep6bo/",
      "created": 1727562916,
      "depth": 0,
      "replies": [
        {
          "id": "lpflfx0",
          "score": 4,
          "body": "Tbh a lot of these you listed is captured under SOXX ETF. If you wanted to go long, SOXX might be a good play.\n\nI’ve been rolling with SOXL/TQQQ and made a few plays last month. Up ~10% in the past month. Probably more if I went full in SOXL but wanted TQQQ for a little exposure to the rest of the market.",
          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpflfx0/",
          "created": 1727575830,
          "depth": 1,
          "replies": [
            {
              "id": "lpg0bab",
              "score": 2,
              "body": "SOXL is the way.",
              "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpg0bab/",
              "created": 1727582458,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpfdcdh",
          "score": 2,
          "body": "Appreciate the comment🙌🏽thanks for the other recs",
          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpfdcdh/",
          "created": 1727572473,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpgaa13",
          "score": 2,
          "body": "Downvoters show yourself lol 😂😂",
          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpgaa13/",
          "created": 1727587865,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpfaq4y",
          "score": 5,
          "body": "I still think NVDA will continue to do well and it will be hard to overtake them. AMD is the closest but even then, they are really far from NVDA",
          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpfaq4y/",
          "created": 1727571408,
          "depth": 1,
          "replies": [
            {
              "id": "lpfbf25",
              "score": 2,
              "body": "Yeah I edited my post I have a lot of NVDA 27$ costavg\n\nAMD is good and I prefer them over INTC",
              "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpfbf25/",
              "created": 1727571684,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpfec9p",
          "score": 4,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpfec9p/",
          "created": 1727572875,
          "depth": 1,
          "replies": [
            {
              "id": "lpfkr0y",
              "score": -2,
              "body": "[removed]",
              "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpfkr0y/",
              "created": 1727575541,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpf37a5",
          "score": 2,
          "body": "Can you please name these companies.",
          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpf37a5/",
          "created": 1727568427,
          "depth": 1,
          "replies": [
            {
              "id": "lpfhkf8",
              "score": 0,
              "body": "I did",
              "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpfhkf8/",
              "created": 1727574212,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpfqtkq",
          "score": 3,
          "body": "Sort of right here. I mean I use chatgpt now instead of googling it. Google would have replaced their search engine with AI by now. Companies have been integrating their AI already, even though not great. AI needs to be used to grow. Also I don't trust google and I think it's a trash company in regards to investing. I appreciate what they do  as a company and the products they decide to have faith in but it's like a talented employee that may or may not show up to work or reach a deadline or even deliver. There are less stressful companies.",
          "permalink": "/r/stocks/comments/1frpnji/ai_plays_nvd_amd_googl_a_couple_broader_questions/lpfqtkq/",
          "created": 1727578125,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}