{
  "title": "Part 2: Archer Aviation is a Table Pounding Buy as the Grizzly Research Report Caused Over ~27% Short - Dare I say I stand with Cathie Wood",
  "score": 135,
  "selftext": "I did some digging because I felt [my previous DD on Archer Aviation](https://www.reddit.com/r/wallstreetbets/comments/1for7pv/the_time_has_come_for_archer_aviation_achr_evtol/) wasn't to the standards I could be proud of and was rather light on information. Other DD's you may remember that have been spot on are of [ARM](https://www.reddit.com/r/wallstreetbets/comments/18tpf0u/arm_is_worth_1000_everything_runs_on_arm_what/), [ARM\\_2](https://www.reddit.com/r/wallstreetbets/comments/1aljrk5/dd_arm_is_the_future_of_edge_ai_with_7000_patents/), [NVIDIA](https://www.reddit.com/r/wallstreetbets/comments/1aqf0zb/nvda_is_worth_1000_this_year_ai_will_be_the/), [VRT](https://www.reddit.com/r/wallstreetbets/comments/1bju7so/is_vertiv_vrt_a_good_growth_story_because_they/), [MICROSOFT](https://www.reddit.com/r/wallstreetbets/comments/19aodnm/dd_on_pltr_and_ai_its_over_folks_your_ai_will/), [APPLE ](https://www.reddit.com/r/wallstreetbets/comments/1ce31se/apple_regardless_of_this_quarter_now_is_the_time/)and others. When nobody else believes I like to find the things worth believing in.\n\nArcher Aviation is worth believing in. Adam Goldstein quite simply is getting shit done. He's just executing and has the perfect partners in United Airlines and the U.S. Military starting with deliveries to the USAF.\n\nIn the search for more information, I needed to see what the bear case was against Archer Aviation and Joby to see who the hell was causing such a massive short-interest float in these stocks. I needed to study the bear cases and see if they were correct in their thesis.\n\nFirst, let's talk about the bears and in this case there are two, Kerrisdale Capital and Grizzly Research. Kerrisdale Capital to the shots at Joby Aviation and Grizzly set it sights on Archer Aviation causing a \\~19% and \\~22% short  in the eVTOL startups respectively.\n\nSince we're here to talk about Archer I will focus on the short report from Grizzly but I will say the same thesis can be made against Kerrisdale as they are largely the same troupe's such as, \"outlook for profitability as ‘delusional’\" or \"Joby will be a historical footnote\" or Grizzly's \"Archer Aviation is a Lame Duck\" or “metaphoric crash landing”.\n\nHarsh words from institutions that are taking a position to drive the stock down. Let's see what Grizzly's thesis is, the date of the thesis, and what has changed in reality since that thesis was written.\n\n[Grizzly's article you can read for yourself](https://grizzlyreports.com/we-believe-archer-aviation-inc-nasdaqachr-is-a-lame-duck/) but here are the main points (We Believe Archer Aviation, Inc is a Lame Duck - August 15, 2023):\n\n1. **Misleading DoD contract:**\n   * **Claim**: Archer’s **DoD contract** was portrayed as a major win, leading to a 40% stock jump. However, Grizzly argues that this was a **noncompetitive, indefinite quantity/indefinite delivery contract**, with only **$1.3 million in potential revenue for 2023**, far less significant than portrayed.\n   * **Reference**: \"DoD contracts ACHR received... is capped at $1.3m total revenue in 2023.\"\n2. **Flight Activity Misrepresentation:**\n   * **Claim**: Archer claimed to be conducting daily test flights, but Grizzly’s investigation found only a **handful of flights**, likely staged for special events. Grizzly accused Archer of recycling old video footage to exaggerate progress.\n   * **Reference**: \"Our investigators visited ACHR’s flight testing facilities... reported seeing only a handful of flights.\"\n3. **Partnerships with Cheap Warrants:**\n   * **Claim**: Archer’s partnerships with **United Airlines** and **Stellantis** were secured by giving out millions of shares and warrants for little compensation, misleading investors into thinking these partnerships were more significant.\n   * **Reference**: \"ACHR has bought credibility through partnerships... Archer awarded millions of shares for questionable or no compensation.\"\n4. **FAA Certification Timeline:**\n   * **Claim**: Grizzly consulted with FAA experts who estimated that Archer would not receive **Type Certification** for its Midnight aircraft until at least **2028**, not 2024 as Archer claimed.\n   * **Reference**: \"FAA experts... estimated... 2028 was a very optimistic estimate.\"\n5. **Misleading Settlement with Wisk/Boeing:**\n   * **Claim**: Archer settled a legal dispute with **Wisk/Boeing** by giving **$100 million in free shares** to Boeing, despite announcing the settlement as a success, diluting shareholders and undermining Archer’s autonomy technology claims.\n   * **Reference**: \"ACHR dished out $100M in free warrants for a $12,000,000 investment by Boeing.\"\n6. **Incomplete Manufacturing Facility:**\n   * **Claim**: Archer promised its **San Jose lab and small-scale production facility** would be operational by May 2023. However, Grizzly’s investigation in July found the facility was far from complete, casting doubt on their production timelines.\n   * **Reference**: \"Our on-site visit in July found a very incomplete facility... not expected to be operational before October 2023.\"\n7. **Stock Dilution and Early Vesting:**\n   * **Claim**: Archer diluted shareholders by issuing **free shares to partners** like United Airlines, often modifying or accelerating vesting schedules without clear disclosure, benefiting these partners at shareholders' expense.\n   * **Reference**: \"ACHR... discreetly amended and/or activated clauses to vest warrants early.\"\n\nAll these claims, in my opinion, are a play against time. Time, eventually will either prove them right or prove them wrong. Time though is not the friend of this short report. With enough time business mode, transparency, and actual progress will come to light. It's easy to make these broad claims and try to tamp down expectations because this is a hard road ahead for a new form of aircraft and a new form of transportation. But this is no Hindenburg report because as you will see Adam Goldstein has been executing the hell out of his vision and should be applauded for it.\n\nLet's take these claims 1 by 1 knowing what we now know as of today's date 9/28/2024.\n\n1. **\\*\\*\\*Misleading DoD contract:**\n   * **Reality**: the DoD and specifically the USAF have shown a commitment and desire for these new aircraft. The reality is a substantial commitment and desire from the military for mission critical operations planned for new eVTOL aircraft.\n      1. **Delivery of Midnight eVTOL to the U.S. Air Force**: On **August 15, 2024**, Archer delivered its first **Midnight** eVTOL aircraft to the **U.S. Air Force** as part of its **$142 million contract** under the **AFWERX Agility Prime program**. This delivery shows substantial progress in Archer's partnership with the DoD, contradicting the earlier skepticism that the contract would yield minimal results.\n      2. **Use of Aircraft**: The U.S. Air Force plans to use the Midnight aircraft for **personnel transport, logistics, and rescue operations**, marking real military applications. The contract includes not just the aircraft but also **pilot training, maintenance, and certification support**, further validating the value of the contract\n2. **\\*Flight Activity Misrepresentation:**\n   * **Reality**: Archer is actually performing many flight tests and is even ahead of schedule for this activity. Grizzly actually went to the facility and took spy pictures of what seems to be parked aircraft in a hanger which proves, nothing about absolutely nothing. Funnily, they also asked in their asked neighboring businesses if they \"saw anything\" regarding test flights. LOL, I mean hmm so in other words you are asking them if they weren't doing their actual job and just watching the sky all day? Seems like a ridiculous anecdotal reference if you ask me. Also, the U.S. Military has taken part in the demonstrations so unless you are saying the U.S. Military is lying... Here are the facts since that report.\n      1. **Ongoing Flight Testing**: Archer continued to make significant strides in its testing program, including manned test flights of the **Midnight** eVTOL aircraft, which directly counter Grizzly's claims about limited flight activity. Archer has since confirmed **daily test flights** in preparation for their **FAA certification** and commercial launch, demonstrating more substantial progress than what the report suggested​.\n      2. **Video Footage Authenticity**: While Grizzly accused Archer of recycling video footage, post-August 2023, Archer showcased new videos of live flight tests, including those witnessed by government and military officials during demonstrations for the **U.S. Air Force's Agility Prime program**, further legitimizing their claims of frequent testing.\n3. **\\*\\*Partnerships with Cheap Warrants:**\n   * **Reality**: Since the update of this report there have been significant updates that contradict Grizzly's thesis full of criticisms of Archer's partnerships with United Airlines and Stellantis. TLDR, everyone has literally doubled down their investment. These are not cheap words, warrants, or shallow commitments.\n      1. **United Airlines** has continued to show strong support for Archer, having made multiple investments since 2021. In **August 2023**, United was part of a **$215 million investment** round, its third time investing in Archer. United also made a **$10 million pre-delivery payment** for 100 of Archer's eVTOLs, demonstrating continued commitment to Archer’s future aircraft​.\n      2. **Stellantis**, Archer’s manufacturing partner, has similarly deepened its relationship. In **January 2023**, Stellantis committed **$150 million in equity** and began scaling up its role as Archer's exclusive manufacturing partner for the **Midnight eVTOL**. As of August 2023, Stellantis led the $215 million funding round, further solidifying its strategic alignment with Archer.\n      3. **Continued Insider Investment as of July 2024**, in the face of all of this just recently in July N.v. Stellantis in July bought 17 million shares for $54 million.\n4. **\\*\\*\\*\\*\\*FAA Certification Timeline:**\n   * **Reality**: This is both the most important and seemingly the biggest blunder of the short report. There is evidence that this may be the undoing of the short that I will discuss towards the end. In short, the notion that Archer was misleading investors is turning out to be a flat out misleading statement. To the contrary, in many ways they are ahead of schedule and or ontime. Especially, when you consider the difficulty of all of this. 2028 doesn't seem optimistic but rather an inevitability. So much so, they have scored 2 out of 3/4 of the FAA Type Certification which is outstanding. They are on total track for the FAA for-credit flight testing that will allow them to make test flights with an operational in-flight test pilot which is the critical part of their Type Certification.\n      1. **Significant FAA Milestones Achieved**: Archer has made substantial progress in its **FAA certification** pathway: **Final Airworthiness Criteria**: On **May 23, 2024**, Archer achieved a significant regulatory milestone when the **FAA issued the final airworthiness criteria** for the **Midnight** aircraft. This finalized the required steps for achieving Type Certification​. **Part 145 Maintenance & Repair Certificate** and **Part 135 Air Carrier Certificate**: Archer received both certifications from the FAA, which are essential for starting commercial operations\n      2. **For-Credit Flight Testing**: As of **September 2024**, Archer successfully completed **402 test flights**. These were completed ahead of schedule and have been crucial in preparing for **for-credit flight testing**, which is expected to begin in **early 2024**​.\n      3. **Delivery to the U.S. Air Force**: On **August 15, 2024**, Archer delivered its first **Midnight aircraft** to the **U.S. Air Force** under the **AFWERX Agility Prime program**, showcasing substantial military interest and further validating the company's technical progress.\n      4. **Part 135 Certification**: On **August 15, 2024**, Archer delivered its first **Midnight aircraft** to the **U.S. Air Force** under the **AFWERX Agility Prime program**, showcasing substantial military interest and further validating the company's technical progress.\n5. **\\*\\*\\*Misleading Settlement with Wisk/Boeing:**\n   * **Reality**: Grizzly makes the argument Archer's settlement with Wisk and Boeing was a costly defeat and a net negative. And they argue that reliance on Wisk's autonomous technology could jeopardize Archers future autonomy capabilities. In a master stroke Adam and the Archer team have turned this into a net positive for the prospects of the company. What's actually misleading is how Grizzly which writes the report on August 15th seemingly did a news grab from articles written just days prior making the case in the exact opposite sentiment than what Grizzly decided to report against. it's like you know the news is not that but you want to mislead for your own purposes so you decide to spin it in the opposite direction. This wasn't a legal defeat but rather an opportunity for Archer to form a lasting partnership with boeing and a sizeable investment from them.\n      1. **Collaboration Instead of Defeat**: The settlement has evolved into a **collaboration agreement** between Archer and Wisk, with **Boeing** as a key investor. Instead of a costly loss, the settlement paved the way for Wisk to become **Archer’s exclusive provider of autonomous flight technology**. This strategic partnership is expected to significantly enhance Archer's technological capabilities for future aircraft.\n      2. **Boeing Investment**: As part of the settlement, Boeing made a **significant investment** in Archer during a $215 million funding round that included major players like **Stellantis** and **United Airlines**. This is a substantial boost to Archer’s financial position, contradicting the narrative that the settlement was purely a negative outcome.\n6. **\\*\\*\\*Incomplete Manufacturing Facility:**\n   * **Reality**: Grizzly's early criticisms of Archer's manufacturing facilities is now crumbling with the reality their facilities' are nearing completion and are now operational. This is what I mean that the time of this report is not proving well for Grizzly. They are executing and point by point this report becomes more incorrect in its entire premis.\n      1. **San Jose Facility**: Archer completed the installation of its **high-volume battery pack manufacturing line** at the **San Jose Integrated Test Lab** in **May 2024**. This facility now has the capacity to produce up to **15,000 battery packs per year**, a crucial step toward scaling production​.\n      2. **Conforming Midnight Aircraft**: Archer’s **first conforming Midnight aircraft** is expected to be completed in **Q4 2023**, with flight testing set to begin in **early 2024**. The San Jose facility has been central to the assembly and testing of these aircraft, demonstrating substantial progress​.\n      3. **Covington, Georgia Manufacturing Facility**: In addition, Archer began construction on a **high-volume manufacturing facility** in **Covington, Georgia** in **March 2023**. This facility, projected to support the production of up to **650 eVTOL aircraft per year**, is on track for completion in **2024**, ahead of the **Midnight** eVTOL’s planned entry into service in **2025**. Per Archers news report, Archer’s team has made rapid progress with the buildout of this nearly 400,000 square foot facility and remains on track to **complete construction by the end of the year** as of July 2024.\n7. **\\*\\*\\*Stock Dilution and Early Vesting:**\n   * **Reality**: The fact is Adam is executing and institutions that were complaining or directly impacted are now converts into the Archer Aviation plan. The navigating here of issues and problems by Archer CEO Adam Goldstein is honestly a master-class if you ask me. At every turn of seemingly negative interactions Archer has leveraged partnerships over conflict and has secured long-term strategic advantages, mitigating concerns raised by Grizzly. This has been good for investors and antithetical to the shareholder dilution premis.\n      1. **Stellantis Partnership**: Since **August 2023**, Stellantis has increased its investment in Archer, contributing **$55 million** following successful flight milestones. Stellantis has remained a crucial manufacturing partner, providing capital, manufacturing expertise, and technical support. The partnership with Stellantis is expected to help Archer scale up production to **650 aircraft annually** once their **Covington, Georgia** facility is operational​. This long-term commitment demonstrates that the warrants issued to Stellantis have fostered a valuable strategic alliance rather than merely diluting shareholders.\n      2. **Wisk/Boeing Settlement**: The **Boeing/Wisk** settlement resulted in Archer gaining access to **autonomy technology**, which is crucial for scaling the eVTOL business in the future. Boeing has invested in Archer as part of a **$215 million** funding round, which included other major investors like **United Airlines** and **ARK Invest**. These investments further strengthen Archer’s financial position and allow it to avoid significant R&D costs.\n\nAs you see, none of the key points made by Grizzly are coming to fruition, and in many cases, Archer has used the challenges to strengthen their strategy and vision.\n\nIf you remember in the conversation I alluded to that there is some evidence that the short which was almost at 30% has come down from that level to the 22.28% as last reported.\n\nHere are the short stats from Benzinga with highs in the short as recent as the month of August.\n\nhttps://preview.redd.it/xdgt42wvnmrd1.png?width=1885&format=png&auto=webp&s=03e74db783587a8c3b4bf1d44326a0d5ced3c474\n\nMy theory is these shorts are going to start to exit as Archer continues to execute.\n\nI am looking at a strategy of staggered calls in the 3, 6, 9, and 12 month range. At some point Archer is going to get it's 3rd and most important leg of the FAA Type certification which is the for-credit flight testing that essentially is the green light for piloted flights. After that it will be smooth sailing with only manufacturing (production certification) left to certify.\n\nWhile the Grizzly Research short report was seemingly more apt over a year ago, it absolutely is proving to be inaccurate and obsolete on all of their main points and concerns criticizing the notion of viability for Archer Aviation's Air-Mobility aspirations.\n\nThis is one where I think Cathie has done her due diligence and is correct in her outlook and investment into AA along with United Airlines and Stellantis. The DoD contracts are coming in and the USAF can't wait to get their hands on these aircraft. Cathie and ARK are doubling down again and this time it's the shorts that maybe on the wrong side of history as certification seems inevitable for flight and operations of Archer Aviations Midnight eVTOL aircraft.\n\nWith the stock nearing ATLows this stock looks to pop at some point with any positive news on the certification front. The sweet spot here looks to be 6 and 9 month calls along with straight up shares.\n\nCurrently I have a small position and calls in the October 18th and November 15th timeframe. When I figure out the exact call I want I am going big. I will update you on that front when i have more information.\n\n**Update**: [Analyst have this a Moderate Buy and a lot of Overweight ratings from top investment firms](https://www.marketbeat.com/instant-alerts/nyse-achr-percent-advance-2024-09-27/).\n\nA number of equities analysts recently commented on the company. Benchmark reaffirmed a \"buy\" rating and issued a $12.00 price objective on shares of Archer Aviation in a research note on Friday, August 9th. Cantor Fitzgerald reaffirmed an \"overweight\" rating and issued a $10.00 price objective on shares of Archer Aviation in a research note on Monday. JPMorgan Chase & Co. increased their price objective on shares of Archer Aviation from $5.00 to $6.00 and gave the stock an \"overweight\" rating in a research report on Wednesday, July 24th. Finally, HC Wainwright started coverage on shares of Archer Aviation in a report on Tuesday, September 3rd. They issued a \"buy\" rating and a $12.50 target price on the stock. One investment analyst has rated the stock with a hold rating and four have assigned a buy rating to the stock. According to data from [MarketBeat.com](http://MarketBeat.com), Archer Aviation has a consensus rating of \"Moderate Buy\" and a consensus target price of $9.00.\n\n**Update 2**: [This information is huge regarding final SFAR FAA Rule](https://verticalmag.com/news/faa-soon-to-release-final-sfar-for-powered-lift-aircraft):\n\nThe U.S. Federal Aviation Administration (FAA) is preparing to release a crucial regulation that will help pave the way for the commercialization of eVTOL aircraft in the U.S., according to Christopher Coes, acting under secretary of transportation for policy at the U.S. Department of Transportation.\n\nSpeaking at Honeywell’s Advanced Air Mobility (AAM) Summit on Sept. 19, Coes announced that the final special federal aviation regulation (SFAR) for powered-lift pilot certification and operations is expected to be published in the “next month.”\n\n“I think you’ll see it is quite responsive to \\[industry\\] comments,” Coes told attendees. “It will come well ahead of certifications that the FAA is working very hard with our manufacturers.”\n\nThe SFAR was a hot topic at last year’s summit, where the draft version faced considerable criticism. Industry concerns focused on the certification process for pilots, the requirement for dual flight controls, energy reserves for electric aircraft, and flight simulation training devices.\n\nMany in the industry felt the rules governing pilot certification and operations of a novel technology like powered-lift eVTOLs should be modernized to reflect the unique aspects of electrification and range.\n\nHowever, at this year’s summit, the mood had shifted toward cautious optimism for the release of the final SFAR.  \n“There’s great anticipation for the rule, which we’re told is coming in just a few weeks,” said Kristie Greco Johnson, senior vice president of government affairs with the National Business Aviation Association (NBAA). “If the FAA can deliver \\[the rule\\] in just a few short weeks, it’ll be a major accomplishment for the agency.”\n\nWhile Coes contends the final SFAR will be released in the next month, the FAA technically has until Dec. 16 to finalize the regulation, according to the FAA reauthorization bill. The same bill also mandated that a notice of proposed rulemaking (NPRM) for unmanned aerial systems (UAS) operating beyond visual line of sight (BVLOS) be issued by Sept. 16. However, the FAA missed that deadline, raising concerns about the SFAR’s timely release.  \nThere is broad consensus that the U.S. faces stiff competition from global players to lead in AAM. With first movers like Joby Aviation and Archer Aviation aiming for a 2025 commercialization of eVTOLs, the pressure is on the FAA to meet expectations.",
  "link_flair_text": "DD",
  "id": "1frqceh",
  "num_comments": 215,
  "created_utc": 1727563998,
  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/",
  "comments": [
    {
      "id": "lpes0j6",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 11 months ago\n**Total Comments** | 3925 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpes0j6/",
      "created": 1727564009,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpf7dgf",
      "score": 63,
      "body": "If you have any idea how the FAA works, both on the regulatory level and on a practical aviation level, you would understand the profound difficulty any of these aviation startups will have in achieving any profitability.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpf7dgf/",
      "created": 1727570080,
      "depth": 0,
      "replies": [
        {
          "id": "lq18x6l",
          "score": 1,
          "body": "Really LOL Then Sell i buy Your Stocks If you actually owe them LOL 10/2/24 Short squeeze Time LOL",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lq18x6l/",
          "created": 1727901401,
          "depth": 1,
          "replies": [
            {
              "id": "lq18x9z",
              "score": 2,
              "body": "Squeeze deez nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lq18x9z/",
              "created": 1727901402,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpf81pv",
          "score": -12,
          "body": "The FAA has nothing to do with profitability. that is just an absurd association. The FAA is for safety and regulation. Once they certify then their business plans and investment will lead to profitability or not. The FAA is a hurdle and nothing more.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpf81pv/",
          "created": 1727570345,
          "depth": 1,
          "replies": [
            {
              "id": "lpf9zko",
              "score": 20,
              "body": "Ok... it's a massive hurdle at best\n\n\nOnce Archer or Joby is able to get certified, you're going to need the infrastructure (heliports, companies that can operate passenger service [in and of itself, an extremely lengthy and costly process], etc).\n\n\nThen you add in issues such as massive congestion of low airspace in heavily urban areas, especially with other smaller autonomous aircraft, and NIMBYism, which is already affecting aviation throughout the country.\n\n\nMaybe I'm just someone yelling at the clouds but I'm also pretty heavily into aviation and I don't see this going quickly, smoothly, or inexpensively.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpf9zko/",
              "created": 1727571109,
              "depth": 2,
              "replies": [
                {
                  "id": "lpfyx3w",
                  "score": 10,
                  "body": "NIMBYism , when you start getting Airbus dual engine helicopters blasting over your house at 150' let me know, as it is not fun for us.",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfyx3w/",
                  "created": 1727581777,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpg5dbk",
                      "score": 3,
                      "body": "In the majority of scenarios that I'm referencing, the airports were there long before any homes were built and definitely before people bought those homes.\n\n\nIf you don't fall into either of those categories, I see your point.",
                      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg5dbk/",
                      "created": 1727585085,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lphpjpt",
                          "score": 3,
                          "body": "That is correct, the two hospitals in town have added heliports over the past 5 years and there is no supervision for use.",
                          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lphpjpt/",
                          "created": 1727618261,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lpg82hh",
                      "score": 2,
                      "body": "They have a video on noise levels compared to traditional planes. They are much much quieter",
                      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg82hh/",
                      "created": 1727586583,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lpg4u5l",
                      "score": 1,
                      "body": "huh?",
                      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg4u5l/",
                      "created": 1727584799,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lphps2g",
                          "score": -1,
                          "body": "Use you're GED",
                          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lphps2g/",
                          "created": 1727618351,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lphuw1k",
                              "score": 6,
                              "body": "He says, using the incorrect version of “you’re”.",
                              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lphuw1k/",
                              "created": 1727620278,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lpftmsi",
                  "score": 2,
                  "body": "can't they just land on roofs? \n\nI thought uber wanted to do vtols at some point and that was their plan. I read some pdf in 2018 I could be wrong",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpftmsi/",
                  "created": 1727579373,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpg3hox",
                      "score": 9,
                      "body": "Yeah, it's every tech bros plan to fly these things wherever they want until they realize that the airspace in this country is highly regimented and regulated and they can't just throw money at the problem.",
                      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg3hox/",
                      "created": 1727584085,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lpfa735",
                  "score": -2,
                  "body": "Yes and they're getting 100's of millions in investment. Seriously, you should look at their BP.",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfa735/",
                  "created": 1727571194,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpfiz0k",
                      "score": 7,
                      "body": "Hyperloop was also getting 100's of millions in investments, and yet now it's all dead because (surprise surprise) it was a dumb idea that wouldn't have ever worked. Watch [this video](https://youtu.be/SePATBiLSYs) about Virgin Hyperloop going bankrupt early this year and how hopeless their engineers turned out to be despite their cockiness a few years ago.\n\nHaving a lot of money for a cool sounding futuristic idea is not a valid argument for their assured success.",
                      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfiz0k/",
                      "created": 1727574797,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpfve1p",
                          "score": 5,
                          "body": "You're saying nothing that has to do with drilling holes in mountains and passing a car through it. lol. Totally 2 different things. And the military is ordering them. Why is it so hard to follow. comparing it with hyperloop is absurd.",
                          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfve1p/",
                          "created": 1727580130,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpjykxo",
                              "score": 2,
                              "body": "You just looked well over his last sentence. Getting funding does not equate to assured success. You are in love with the idea, an idea you feel is a few years away when in reality is decades away, if it even hits feasibility, which is very, very hard to believe it ever will.",
                              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpjykxo/",
                              "created": 1727644373,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lpfvgn7",
                          "score": 1,
                          "body": "https://preview.redd.it/cptrmacs2ord1.png?width=112&format=png&auto=webp&s=283ee28f059628bcc606c8a07a72607f57da9ee7",
                          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfvgn7/",
                          "created": 1727580161,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpew2gp",
      "score": 46,
      "body": "Never saw DD this detailed",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpew2gp/",
      "created": 1727565579,
      "depth": 0,
      "replies": [
        {
          "id": "lpfnvbz",
          "score": 25,
          "body": "For the sake of OP’s sanity - I hope it was done by chat gpt",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfnvbz/",
          "created": 1727576858,
          "depth": 1,
          "replies": [
            {
              "id": "lpfp250",
              "score": 21,
              "body": "I read the short report and analysed it. I felt it was necessary to do DD before I put in this bagger.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfp250/",
              "created": 1727577368,
              "depth": 2,
              "replies": [
                {
                  "id": "lpqezga",
                  "score": 2,
                  "body": "You mean bagholder. The AAM industry won't be profitable for a decade. Just short it until 2035.",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpqezga/",
                  "created": 1727740433,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpqezjt",
                      "score": 1,
                      "body": "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpqezjt/",
                      "created": 1727740434,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpqllyh",
                          "score": 1,
                          "body": "How about you hop on an air taxi and crash and burn like the AAM stock prices since IPO.",
                          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpqllyh/",
                          "created": 1727742889,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lq19rhr",
                  "score": 2,
                  "body": "It is 22% shorted and going Down you can check on NASDAQ just bought today 2.98 and in for the long run x2 OR x3 coming",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lq19rhr/",
                  "created": 1727901664,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lpf86hs",
          "score": 12,
          "body": "I have but it was the unibomber so…..",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpf86hs/",
          "created": 1727570398,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpfuxx3",
          "score": 2,
          "body": "My immediate impulse was to say \"bout to sell my shares\" but dame 😵‍💫",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfuxx3/",
          "created": 1727579923,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpgqccn",
      "score": 7,
      "body": "I have 20 3.50 calls for November 1st, there has been a few dark pool and whale orders on ARCHER this past week.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpgqccn/",
      "created": 1727598308,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpgjoqs",
      "score": 6,
      "body": "\"\"The U.S. Federal Aviation Administration (FAA) is preparing to release a crucial regulation that will help pave the way for the commercialization of eVTOL aircraft in the U.S., according to Christopher Coes, acting under secretary of transportation for policy at the U.S. Department of Transportation.\n\nSpeaking at Honeywell’s Advanced Air Mobility (AAM) Summit on Sept. 19, Coes announced that the final special federal aviation regulation (SFAR) for powered-lift pilot certification and operations is expected to be published in the “next month.”\"\"",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpgjoqs/",
      "created": 1727593807,
      "depth": 0,
      "replies": [
        {
          "id": "lpi0amn",
          "score": 5,
          "body": "Oh it's time. I knew it was time. I feel it.\n\n[https://verticalmag.com/news/faa-soon-to-release-final-sfar-for-powered-lift-aircraft](https://verticalmag.com/news/faa-soon-to-release-final-sfar-for-powered-lift-aircraft)\n\n>The U.S. Federal Aviation Administration (FAA) is preparing to release a crucial regulation that will help pave the way for the commercialization of eVTOL aircraft in the U.S., according to Christopher Coes, acting under secretary of transportation for policy at the U.S. Department of Transportation.\n\n>Speaking at Honeywell’s Advanced Air Mobility (AAM) Summit on Sept. 19, Coes announced that the final special federal aviation regulation (SFAR) for powered-lift pilot certification and operations is expected to be published in the “next month.”\n\n>“I think you’ll see it is quite responsive to \\[industry\\] comments,” Coes told attendees. “It will come well ahead of certifications that the FAA is working very hard with our manufacturers.”\n\n>The SFAR was a hot topic at last year’s summit, where the draft version faced considerable criticism. Industry concerns focused on the certification process for pilots, the requirement for dual flight controls, energy reserves for electric aircraft, and flight simulation training devices.\n\n>Many in the industry felt the rules governing pilot certification and operations of a novel technology like powered-lift eVTOLs should be modernized to reflect the unique aspects of electrification and range.  \n...  \nHowever, at this year’s summit, the mood had shifted toward cautious optimism for the release of the final SFAR.  \n“There’s great anticipation for the rule, which we’re told is coming in just a few weeks,” said Kristie Greco Johnson, senior vice president of government affairs with the National Business Aviation Association (NBAA). “If the FAA can deliver \\[the rule\\] in just a few short weeks, it’ll be a major accomplishment for the agency.”  \n...  \nWhile Coes contends the final SFAR will be released in the next month, the FAA technically has until Dec. 16 to finalize the regulation, according to the FAA reauthorizaton bill. The same bill also mandated that a notice of proposed rulemaking (NPRM) for unmanned aerial systems (UAS) operating beyond visual line of sight (BVLOS) be issued by Sept. 16. However, the FAA missed that deadline, raising concerns about the SFAR’s timely release.  \nThere is broad consensus that the U.S. faces stiff competition from global players to lead in AAM. With first movers like Joby Aviation and Archer Aviation aiming for a 2025 commercialization of eVTOLs, the pressure is on the FAA to meet expectations.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpi0amn/",
          "created": 1727622186,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lphwdyx",
          "score": 3,
          "body": "Ohhhhhh juicy. Do you have a link. To this I'll update.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lphwdyx/",
          "created": 1727620818,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpi1g7z",
      "score": 7,
      "body": "**Update 2**: [This information is huge regarding final SFAR FAA Rule](https://verticalmag.com/news/faa-soon-to-release-final-sfar-for-powered-lift-aircraft):\n\nThe U.S. Federal Aviation Administration (FAA) is preparing to release a crucial regulation that will help pave the way for the commercialization of eVTOL aircraft in the U.S., according to Christopher Coes, acting under secretary of transportation for policy at the U.S. Department of Transportation.\n\nSpeaking at Honeywell’s Advanced Air Mobility (AAM) Summit on Sept. 19, Coes announced that the final special federal aviation regulation (SFAR) for powered-lift pilot certification and operations is expected to be published in the “next month.”\n\n“I think you’ll see it is quite responsive to \\[industry\\] comments,” Coes told attendees. “It will come well ahead of certifications that the FAA is working very hard with our manufacturers.”\n\nThe SFAR was a hot topic at last year’s summit, where the draft version faced considerable criticism. Industry concerns focused on the certification process for pilots, the requirement for dual flight controls, energy reserves for electric aircraft, and flight simulation training devices.\n\nMany in the industry felt the rules governing pilot certification and operations of a novel technology like powered-lift eVTOLs should be modernized to reflect the unique aspects of electrification and range.\n\nHowever, at this year’s summit, the mood had shifted toward cautious optimism for the release of the final SFAR.  \n“There’s great anticipation for the rule, which we’re told is coming in just a few weeks,” said Kristie Greco Johnson, senior vice president of government affairs with the National Business Aviation Association (NBAA). “If the FAA can deliver \\[the rule\\] in just a few short weeks, it’ll be a major accomplishment for the agency.”\n\nWhile Coes contends the final SFAR will be released in the next month, the FAA technically has until Dec. 16 to finalize the regulation, according to the FAA reauthorizaton bill. The same bill also mandated that a notice of proposed rulemaking (NPRM) for unmanned aerial systems (UAS) operating beyond visual line of sight (BVLOS) be issued by Sept. 16. However, the FAA missed that deadline, raising concerns about the SFAR’s timely release.  \nThere is broad consensus that the U.S. faces stiff competition from global players to lead in AAM. With first movers like Joby Aviation and Archer Aviation aiming for a 2025 commercialization of eVTOLs, the pressure is on the FAA to meet expectations.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpi1g7z/",
      "created": 1727622592,
      "depth": 0,
      "replies": [
        {
          "id": "lpidpex",
          "score": 3,
          "body": "Thanks for the massive DD! What are your predictions in terms of price change for the next coming period? Is this a short play or long term hold?",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpidpex/",
          "created": 1727626711,
          "depth": 1,
          "replies": [
            {
              "id": "lpig7nq",
              "score": 2,
              "body": "Great question. The stock was $5 just a few weeks ago. Short seemingly started piling in when they had just let up. I've rode the stock down about ~28%. That's when I a DD and found the short.\n\nI think this stock can easily do $5 plus again from here to November / December. I could be just flat out wrong so. But I'm ok with it. I plan on staggering calls and buying shares. Just looking for good price action on calls which there is right now ie they're cheap. Oct 18, Nov 15 and I will keep going from there. I want to make sure I catch all positive news. I'm just going to keep building and rolling into new shares and calls.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpig7nq/",
              "created": 1727627513,
              "depth": 2,
              "replies": [
                {
                  "id": "lpihpel",
                  "score": 2,
                  "body": "Thanks! Amazing response time 🤩 \n\nIt seems to be a high risk high reward play. Especially seeing to the fact that they currently have a cash runway of about 11 months (based on my findings) and there are a lots of unresolved and open topics. \n\nIf there is any news keep me posted. Highly interested in picking up some stocks myself.",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpihpel/",
                  "created": 1727627992,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpik6ax",
                      "score": 3,
                      "body": "I think this is low risk and deep value. Don't doubt the US military desires.",
                      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpik6ax/",
                      "created": 1727628774,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpinrxv",
                          "score": 2,
                          "body": "Those desires however stills need to be converted into actual fullfilled orders. Looking forward to what the future might hold",
                          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpinrxv/",
                          "created": 1727629910,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lpi1g95",
          "score": 1,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpi1g95/",
          "created": 1727622592,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpeweah",
      "score": 24,
      "body": "Eh, I have no real comments on the shorts reports, but VTOL is an extremely difficult thing that military has spend hundreds of billions and 80 years trying to make work with not much reliable success.  Helicopters are considered \"mature\" technology yet also still very dangerous.  Energy density of oil is still vastly superior to any batteries available which puts some hard current limits on things like range versus capacity.\n\nThat said, there's some key differences between those and evtol.\n\nFrom a risk management perspective, All it's going to take is one highly public Kobe Bryant or a Troy Gentry and the whole things going to crater. That's very hard to predict but it's still immature and early enough is that's all it going to take to eat massive losses. \n\nIt's cheap enough I'll go ahead and put down some funny money on it in long, but it's money I've accepted could instantly go down in flames if a Kobe happens",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpeweah/",
      "created": 1727565706,
      "depth": 0,
      "replies": [
        {
          "id": "lpexet8",
          "score": 2,
          "body": "The Kobe situation, god rest his soul and all the people on that flight, was mostly due to weather. I think military usage will put the aircraft through its paces and be able to report back on non-human payload because remember you can operate these aircraft autonomously. It maybe some time we get human rides but if this goes well with the military I think the human / comercial flight certifications come in tow. \n\nRemember you can fly this (I know it's not the US) Microlights in Victoria falls today. lol I mean if people get into that then they'll get into anything. \n\nhttps://preview.redd.it/eh99e4xuwmrd1.jpeg?width=2000&format=pjpg&auto=webp&s=1989eeb64901b3ddb9d4f6e81bc872d19a2417ed",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpexet8/",
          "created": 1727566104,
          "depth": 1,
          "replies": [
            {
              "id": "lpiojiy",
              "score": 2,
              "body": "That makes it worse, not better. If weather wipes out a traditional aircraft, people will say it was the result of weather. If weather wipes out an e-vtol (or any experimental aircraft) people will say it is the result of inferior machines. You've just identified a fact that will fuck over this company and think that it is a defense of them.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpiojiy/",
              "created": 1727630144,
              "depth": 2,
              "replies": [
                {
                  "id": "lqbkean",
                  "score": 2,
                  "body": "or you don't fly them in weather",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lqbkean/",
                  "created": 1728058623,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpf25yf",
      "score": 9,
      "body": "https://preview.redd.it/p3rcx0sg2nrd1.jpeg?width=1179&format=pjpg&auto=webp&s=e28c1f8e6ee8420d23e4197b867272cde4e79cf2\n\nSomeone agrees with OP’s assessment. Obviously not an earth shattering amount of cash but $185k is a little faith.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpf25yf/",
      "created": 1727568006,
      "depth": 0,
      "replies": [
        {
          "id": "lpf2x4z",
          "score": 5,
          "body": "Damn is that you? Did you do any calls or are you just going straight shares?",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpf2x4z/",
          "created": 1727568313,
          "depth": 1,
          "replies": [
            {
              "id": "lpf34b3",
              "score": 7,
              "body": "No no, that’s not me at all\n\nI was just reading your DD and went to check out their stock. This alert was there when I opened it up so it lends a little credence to your DD and I was sharing that\n\nI’m looking at potentially doing some options though, solid write up",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpf34b3/",
              "created": 1727568394,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lq7r2g8",
          "score": 1,
          "body": "which app is this?",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lq7r2g8/",
          "created": 1727996323,
          "depth": 1,
          "replies": [
            {
              "id": "lq7r5db",
              "score": 1,
              "body": "WeBull, in dark mode",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lq7r5db/",
              "created": 1727996352,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpicf7f",
      "score": 4,
      "body": "Yes its disheartening seeing share prices fall for NO reason but traders playing games. The main plant is almost finish and all indications the equipment needed to make the aircraft is being installed. This is not a Nikola truck fiasco  where the CEO mislead investors.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpicf7f/",
      "created": 1727626309,
      "depth": 0,
      "replies": [
        {
          "id": "lpicotm",
          "score": 2,
          "body": "He's been very transparent. The website is updated with news all of the time.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpicotm/",
          "created": 1727626392,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpeu9z0",
      "score": 7,
      "body": "Out of curiosity, what is your opinion on Joby. From my understanding they’re developing a direct competitor product but are much further along. I hold ACHR right now because I think they’re undervalued but you seem like you probably have done quite a bit of research on Joby as well",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpeu9z0/",
      "created": 1727564878,
      "depth": 0,
      "replies": [
        {
          "id": "lpevcze",
          "score": 14,
          "body": "Same exact thing. They had a short report put out on them and they are executing. These contracts are coming. The military wants these aircraft. The only difference for me is that they're stock isn't down as much as Archer's is so for me I think Archer has the most upside potential here. 2 really good companies paving the way.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpevcze/",
          "created": 1727565302,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpgqtfj",
      "score": 4,
      "body": "Cathie has been making great plays lately",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpgqtfj/",
      "created": 1727598639,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpgxfu2",
      "score": 4,
      "body": "As an ARCH bagholder, I appreciate your post ![img](emote|t5_2th52|4258)![img](emote|t5_2th52|8883)",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpgxfu2/",
      "created": 1727603354,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpyz6fi",
      "score": 5,
      "body": "This post aged beautifully",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpyz6fi/",
      "created": 1727874895,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpft8ih",
      "score": 12,
      "body": "I don’t have patience to write long DD like this but can claim that I have done extensive research on this. \n\nMy personal position is 100+ LEAPS for Joby and 2150 in stock.\n\nI only believe in Joby and I strongly feel Archer is going to fold or go bust in 4 years or less.\n\nI will give reasons for this in short as I don’t have patience n don’t have time or care to convince anyone.\n\n1. Joby truly developed eVTOL from scratch and have complete new new design. Archer is just electric helicopter where they are assembler of aircraft where why may have just swap the engine with electric motors. Due to this their aircraft is almost 1200lbs heavier than Joby. This in itself going to kill then in operating cost and cannot compete with Joby which will multi fold efficient n cheaper to operate thereby cheaper on pricing\n\n2. Archer is mostly style n less substance. Their flight has yet to do extensive flight testing.\nThey are flying empty ✈️. So currently it’s just baloon with no payload.  Once you add payload most likely their design will go bust. The design is too heavy n bulky\n\n3. Dilution- Archer is going for extensive dilution  every quarter against plant setup and labor supply from Stellantis . Moreover they plan issue more shares.\n\n4. Archer certification in time is very difficult given they need to integrate number of desperate components n technology. Joby developed almost 80-90% IP in-house so they integrate seamlessly with common software language.\n\n5. Archer is led by businessman vs Joby is led by technocrat\n\n6. Joby has successfully tested hydrogen flight. In 5-6 year they will have it approved. Then they will have huge cost advantage and unparalleled technology edge\n\n7. Autonomy- only Joby has full autonomous rights to their own plane. Archer sold it to Wisk/Boeing. Robo Air-Taxi. This is where real money is. Believe me Robo AirTaxi will happen before Tesla/Waymo or Aurora.\n\nOnce you do in depth study you will uncover few more obvious reasons why archer is way behind and over priced at current valuation.\n\nOverall Archer is not gonna pop it’s gonna poop 💩 soon.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpft8ih/",
      "created": 1727579198,
      "depth": 0,
      "replies": [
        {
          "id": "lpft8jf",
          "score": 6,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpft8jf/",
          "created": 1727579198,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpg5ldg",
          "score": 5,
          "body": "\"*Believe me Robo AirTaxi will happen before Tesla/Waymo or Aurora.*\"\n\nThis is where you lost all your credibility.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg5ldg/",
          "created": 1727585206,
          "depth": 1,
          "replies": [
            {
              "id": "lpg6jxd",
              "score": 1,
              "body": "Not really. The facts supports this assumption very well.\n\nFlights are flying in fly-by-wire (FBW) mode for quite long.\n\nDrones are flying by remote for years now.\n\nAll eVTOL players are testing the evot without human onboard.\n\nJoby themselves did remote autonomous flights in last.\n\n[joby autonomous flight.](https://ir.jobyaviation.com/news-events/press-releases/detail/105/joby-demonstrates-autonomous-flight-in-united-states-air)\n\nThere are other players too like Beta. One player in China eHANG claims tieup across many countries for pilotless flights. They have not launched yet though.\n\nOverall autonomy in air has much longer and safer history than anything on road.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg6jxd/",
              "created": 1727585734,
              "depth": 2,
              "replies": [
                {
                  "id": "lpg7v2e",
                  "score": 4,
                  "body": "Waymo has been transporting paying customers for over a year now. Where have you been?",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg7v2e/",
                  "created": 1727586465,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpg9l3h",
                      "score": 0,
                      "body": "I know but it will take long time for wide adaptation across globe…. Again it’s just my belief that eVTOL will surpass them in autonomy in next decade.",
                      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg9l3h/",
                      "created": 1727587459,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpi0ywd",
                          "score": 3,
                          "body": "Yeah that's why I said, you lost all credibility when you made that claim\n\nWhat Waymo has accomplished today, eVTOL wont even come close in 10 years.\n\nUber already has the same concept with their helipad. Problem with scaling eVTOL is that it is too expensive for average joes (Someone said $100/ride?!?! keep dreaming. I'd say at least $300/ride). Also to be at the level of Uber, you need at least 50,000 ol these eVTOL in each city. Just not happening. Waymo/Uber will have every driver replaced with their autonomous vehicles in 10 years. Tesla wont have it unless they break out of their stubborn \"Camera Only\" sensors.\n\nThere is a short term play with Joby, AAviation, etc but no viable profitbility in the long run.",
                          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpi0ywd/",
                          "created": 1727622424,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpi5fku",
                              "score": 2,
                              "body": "We can have our own viewpoints. First eVTOLs will have pilot on board for few years but they will go remote piloting and then full autonomy pretty fast. Currently they have approval to fly only for in-sight conditions so they need to first cross that barrier 🙂\n\nAgree that Waymo is ahead than Tesla.\n\nHonestly these are two diff markets. I see with autonomy more traffic will be on road increasing congestion so we will have to go to air.\n\nBiggest problem I see with eVTOL is it would be 3 rides to get to destination- to heliport, air ride and then from heliport to final destination.\n\neVTOLs have use cases diff than road travel- flying from JFK to Long Branch NJ, between islands in Caribbeans, city centers to outskirts/ suburban mansions etc before they go full main stream.\n\nNot in 10 but in 20 years they will be mass produced like cars today and folks will have this in their backyard or walkable garages.  Sounds unbelievable but that’s the future I see.",
                              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpi5fku/",
                              "created": 1727623976,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lpg8iol",
                  "score": 1,
                  "body": "This is for sure something Joby is ahead on I give you that. Wisk Aero will help Archer catch up eventually. I think both of them for now just need to get certified to get going and then it's off to the races.",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg8iol/",
                  "created": 1727586842,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lpg22yc",
          "score": 4,
          "body": "Good DD - I have no issue with Joby but there are a few counter points to your DD that should be understood. \n\n1. You make a big deal about creating their own IP but Archer's counter point is that their parts are industry standard and can be purchased and produced more easily. Personally, I think both have a fair point. Archer also has their own IP in the most important parts which include the drive train. \n\n2. I really like the look and feel of Archer way more than Joby. Joby looks like they took a drone from DJI and scaled it up to a person capable aircraft. Not necessarily a bad thing but as far as style goes Archer definitely has that edge. Also, they will soon have their pilot test certification soon. So that's no really a great argument against them. Their for-test certification is coming soon and will be a major announcement. \n\n3. Nothing really to say here as this stuff ain't cheap. Raising capital is something they both have to do. It's not like you can make the argument that Joby doesn't have to do this too. \n\nBoth are have delivered aircraft to the military and both are set to deliver more. Again, both will be players in this arena and that's a good thing. Competition is a good thing. Don't forget a short report and subsequent short float on Joby is a thing too as their short is about \\~19%. \n\nThe reason why I chose Archer however is that their current market cap has much deeper value than Joby at these current levels. \n\nCurrently Joby is valued at $3.74 Billion while Archer Aviation is valued at only $1.09 Billion with a much higher float. So, with all of that I have to think Archer at this moment is a better buy. Both of their market caps can easily be in the $50 - $100 Billion range in the 4 - 6 year future which will be a substantial gain for all those invested. In the short term, if Archer keeps pushing and gets their certs a 3x increase will be a $3 Billion market cap and that seems completely justified. That would also be a 300% increase in the stock price from $3 to $9 a share. I say this is an easy bagger if you ask me. Deep fucking value if there ever was one.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg22yc/",
          "created": 1727583354,
          "depth": 1,
          "replies": [
            {
              "id": "lpg4smc",
              "score": 4,
              "body": "Archer is really trying hard to project itself in same league as Joby and they have been successful largely in their plan to create that image but reality is they are no way close to Joby.\n\nArcher outstanding shares are going to increase at least double in next year alone due to dilution to Stellantis and others.\n\n\nYou not assigning any premium to fact that Joby has enormous IP capital- whole design, hydrogen, autonomous , software/hardware, almost 90% parts and way ahead in progress.\n\nArcher looks are sexy but that extra weight to make it sexy makes it commercially not viable against nimble Joby as per mile cost will be too high (assuming bulky Archer can lift that payload). Joby did incredible job at reducing weight by redesigning everything.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg4smc/",
              "created": 1727584776,
              "depth": 2,
              "replies": [
                {
                  "id": "lpg5pt0",
                  "score": 2,
                  "body": "Sexy goes a long way sometimes. It becomes the preference as long as the cost isn't too sexy. LOl, jokes aside. What you're saying isn't without merit I get it but at the end of the day they are doing very similar things and they both have a 1000 pound payload with the same passenger capability. Don't forget, Archer first started off with the Maker which was a smaller aircraft. \n\nThe hydrogen thing is not really important right now so let's get these guys flying first and then we can advance to more payload, larger eVTOL's in general and further distances. I think the pipeline for both of these companies will be great. They just need to get off the ground first. Literally. \n\nAgain, one has a current market cap of 3.47 B and the other only 1 B. I don't know how much you want Archer to go lower but unless you think it is a valueless company it is hard to not imagine Archer as deep value right now.",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg5pt0/",
                  "created": 1727585274,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpg70st",
                      "score": 3,
                      "body": "Archer is not valueless but it’s going bankrupt at some point and then they have only one buyer- Wisk/Boeing. Who will buy them for scrap value.",
                      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg70st/",
                      "created": 1727585993,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpg7g4j",
                          "score": 1,
                          "body": "They literally have major investors that have literally just recently invested including the US government. What are you talking about. You must be Grizzly with a short to have written this much in my DD report. Good luck with your short. Let's see how it all pans out.",
                          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg7g4j/",
                          "created": 1727586229,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpg8i93",
                              "score": 3,
                              "body": "Your calls are farting hence you so upset?\nYour DD conveniently ignores why Archer is weak and valued correctly. You keep comparing to Joby. I say if Joby is $3M then yes Archer at $1M with impending HUGE HUGE HUGE dilution is overvalued at $1M.\n\nDon’t have any shorts or long or anything abt Archer.\n\nI wish you luck with your conviction and hope I’m wrong but this not smelling good from get go.\n\nYou mentioned Maker… that was toy and how much flight details data have they released on that or even about midnight.\n\nWhy founders fought and one left. The other founder sold huge shares are started his kher company… pls mention all this in your DD.\n\nThey are thief. They stole the design which is now settled court case but it just shows character of founder and management.\n\nFake it till you make it works sometimes and maybe they will make it, but I didn’t believe in it.",
                              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg8i93/",
                              "created": 1727586835,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lpg8iay",
                                  "score": 1,
                                  "body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg8iay/",
                                  "created": 1727586836,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "lpg9ar9",
                                  "score": 1,
                                  "body": "I don't get your dilution thing. Market cap is market cap. That doesn't change other than share price. If they dilute the market may punish them for it or just balance it out. If the dilution is purely more ownership amongst more people there is nothing inherently wrong with that.  In fact, you can look at that as a positive because there are more people involved.\n\nYou seem to be angry that I like Archer. You say their sexy design which is very sexy by the way is somehow something negative against them. It may be a net positive. We don't know yet. Why can't you just be happy for both companies. It doesn't have to be just Joby. In fact, I plan on investing in both but as I told you prior I think there is better value in Archer at the moment. It doesn't mean I think Joby is bad.\n\nThere is nothing wrong with 2 being in this space. Tides will lift all boats kind of thing. You made a lot of great points about Joby. Keep it on those lines. I literally just bought calls and nothing is farting. lol. relax.\n\nHere are all the analysts issuing by ratings too for your information:\n\nA number of equities analysts recently commented on the company. Benchmark reaffirmed a \"buy\" rating and issued a $12.00 price objective on shares of Archer Aviation in a research note on Friday, August 9th. Cantor Fitzgerald reaffirmed an \"overweight\" rating and issued a $10.00 price objective on shares of Archer Aviation in a research note on Monday. JPMorgan Chase & Co. increased their price objective on shares of Archer Aviation from $5.00 to $6.00 and gave the stock an \"overweight\" rating in a research report on Wednesday, July 24th. Finally, HC Wainwright started coverage on shares of Archer Aviation in a report on Tuesday, September 3rd. They issued a \"buy\" rating and a $12.50 target price on the stock. One investment analyst has rated the stock with a hold rating and four have assigned a buy rating to the stock. According to data from [MarketBeat.com](http://MarketBeat.com), Archer Aviation has a consensus rating of \"Moderate Buy\" and a consensus target price of $9.00.",
                                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg9ar9/",
                                  "created": 1727587293,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lt8d1a4",
          "score": 1,
          "body": "I own a decent amount of Archer, do you think it’s worth buying Joby as well or is it gonna be one or the other surviving?",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lt8d1a4/",
          "created": 1729629300,
          "depth": 1,
          "replies": [
            {
              "id": "lt94hnp",
              "score": 1,
              "body": "I don’t give advice to anyone but can voice my opinion.\n\nThey both are bit risky although I believe Joby is much better. \n\nI am heavy on Joby however recently I have taken very small position in Archer too. However I will exit Archer even at loss if my first assumption about them becomes reality.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lt94hnp/",
              "created": 1729638237,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpob0pl",
      "score": 3,
      "body": "Just tell me where to gamble my money",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpob0pl/",
      "created": 1727715325,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpz3p33",
      "score": 3,
      "body": "Guys! Good news Joby popped 20% today on added investment from Toyota! that is great news for the entire industry.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpz3p33/",
      "created": 1727876593,
      "depth": 0,
      "replies": [
        {
          "id": "lq373wp",
          "score": 1,
          "body": "Do you expect an investment in Archer from a different company in the near future. Have 2025 calls",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lq373wp/",
          "created": 1727928451,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpeu4b8",
      "score": 6,
      "body": "So basically, flying car go brrrr?",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpeu4b8/",
      "created": 1727564818,
      "depth": 0,
      "replies": [
        {
          "id": "lpfqsaw",
          "score": 6,
          "body": "Thank you. I needed a TL;DR",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfqsaw/",
          "created": 1727578109,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpeusgk",
      "score": 8,
      "body": "I also got 100 contracts of $4 nov 1st, let’s gooooo",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpeusgk/",
      "created": 1727565080,
      "depth": 0,
      "replies": [
        {
          "id": "lpft7a4",
          "score": 3,
          "body": "Earning nov 7",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpft7a4/",
          "created": 1727579183,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpewk45",
          "score": 3,
          "body": "how confident we feeling",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpewk45/",
          "created": 1727565769,
          "depth": 1,
          "replies": [
            {
              "id": "lpewoje",
              "score": 5,
              "body": "we gettin a bag, easy",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpewoje/",
              "created": 1727565817,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpewtok",
          "score": 2,
          "body": "are you believing in the squeezing",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpewtok/",
          "created": 1727565872,
          "depth": 1,
          "replies": [
            {
              "id": "lpey9nx",
              "score": 4,
              "body": "It's deep value right now. I believe.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpey9nx/",
              "created": 1727566442,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpexsz8",
      "score": 5,
      "body": "Tldr. Motley fool's dd says they go 20x. If the ai bubble bursts in the next 2 years, they'll get flushed. 5m per car and only 1200 ordered, which will take 2 years minimum to manufacture.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpexsz8/",
      "created": 1727566258,
      "depth": 0,
      "replies": [
        {
          "id": "lpez00s",
          "score": 1,
          "body": ">If the ai bubble bursts in the next 2 years, they'll get flushed.\n\nWhat does this have to do with AI? I don't get that part of your statement. Also, with certification the orders will start flying in (pun intended) literally. \n\nDon't forget they are building manufacturing plants as we speak. They are executing.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpez00s/",
          "created": 1727566734,
          "depth": 1,
          "replies": [
            {
              "id": "lpezzud",
              "score": 0,
              "body": "EVs and VTOLs go in the same bucket of overhyped retro-futuristic technology. It's a cool idea but people will be dumping into whatever new application of tech long before this can be monetized in any meaningful way.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpezzud/",
              "created": 1727567131,
              "depth": 2,
              "replies": [
                {
                  "id": "lpf0smk",
                  "score": 1,
                  "body": "I'm excited. Let's see. I think this is the one.",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpf0smk/",
                  "created": 1727567449,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lpf5krz",
          "score": 1,
          "body": "BTW Motley fool also said this, [https://www.fool.com/investing/2024/09/26/could-investing-50000-in-archer-aviation-make-you/](https://www.fool.com/investing/2024/09/26/could-investing-50000-in-archer-aviation-make-you/) inveting $50,000 to make you a millionaire.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpf5krz/",
          "created": 1727569371,
          "depth": 1,
          "replies": [
            {
              "id": "lpl9kq2",
              "score": 1,
              "body": "Yes, 20 x 50,000 = 1,000,000. Company seems mostly fine, just pointing out they'll get dragged down if the tech bubble bursts before they.....take off.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpl9kq2/",
              "created": 1727662219,
              "depth": 2,
              "replies": [
                {
                  "id": "lpl9y5d",
                  "score": 1,
                  "body": "Why? they are a transportation company. Yes it's tech but it's a new form of transportation. I don't see the parallel sorry.",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpl9y5d/",
                  "created": 1727662360,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpevtej",
      "score": 3,
      "body": "Hell of a research. Thank you.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpevtej/",
      "created": 1727565480,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpf08ce",
      "score": 3,
      "body": "I have some 2026 calls lol",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpf08ce/",
      "created": 1727567225,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpf0xga",
      "score": 4,
      "body": " I’m in for 100 shares, time will tell",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpf0xga/",
      "created": 1727567503,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpewi1m",
      "score": 4,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpewi1m/",
      "created": 1727565747,
      "depth": 0,
      "replies": [
        {
          "id": "lpf6y5a",
          "score": 2,
          "body": "I have a stock for you. Netflix! Have you heard they stream video, crazy I know.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpf6y5a/",
          "created": 1727569911,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpfo31d",
      "score": 2,
      "body": " Kobe-proofing the eVTOL tech is the next frontier. Joby's progress is impressive, but Archer's execution and partnerships give it an edge. Buckle up, it's gonna be a wild ride.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfo31d/",
      "created": 1727576951,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpftt1v",
      "score": 2,
      "body": "Congrats I’m gonna buy a few shares. Even better if Cathy Wood is actually in this position then you know when it’ll pop.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpftt1v/",
      "created": 1727579450,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpgb2rj",
      "score": 2,
      "body": "[https://www.marketbeat.com/instant-alerts/nyse-achr-percent-advance-2024-09-27/](https://www.marketbeat.com/instant-alerts/nyse-achr-percent-advance-2024-09-27/)\n\nA number of equities analysts recently commented on the company. Benchmark reaffirmed a \"buy\" rating and issued a $12.00 price objective on shares of Archer Aviation in a research note on Friday, August 9th. Cantor Fitzgerald reaffirmed an \"overweight\" rating and issued a $10.00 price objective on shares of Archer Aviation in a research note on Monday. JPMorgan Chase & Co. increased their price objective on shares of Archer Aviation from $5.00 to $6.00 and gave the stock an \"overweight\" rating in a research report on Wednesday, July 24th. Finally, HC Wainwright started coverage on shares of Archer Aviation in a report on Tuesday, September 3rd. They issued a \"buy\" rating and a $12.50 target price on the stock. One investment analyst has rated the stock with a hold rating and four have assigned a buy rating to the stock. According to data from [MarketBeat.com](http://MarketBeat.com), Archer Aviation has a consensus rating of \"Moderate Buy\" and a consensus target price of $9.00.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpgb2rj/",
      "created": 1727588340,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lph23io",
      "score": 2,
      "body": "sure i will get some calls just for lols",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lph23io/",
      "created": 1727606583,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lphbwb4",
      "score": 2,
      "body": "Looks like I’m buying more 2026 3.00 calls tomorrow",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lphbwb4/",
      "created": 1727612243,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lphfg4g",
      "score": 2,
      "body": "JOBY, I'm equity stake though.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lphfg4g/",
      "created": 1727613981,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpi14qp",
      "score": 2,
      "body": "3k in 7$ april 25 calls",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpi14qp/",
      "created": 1727622479,
      "depth": 0,
      "replies": [
        {
          "id": "lpi3d9f",
          "score": 1,
          "body": "Let's GOOO!!! \n\nOMG can you imagine 7 - 9 by next year. Analyst have price targets from $6 - $12. The last time this thing went nuts it spiked to the moon. Now with the impending FAA Rule, certification, military deliveries, and overall positive sentiment... With a stock this beat up. The stars are aligning just right.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpi3d9f/",
          "created": 1727623258,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpirwee",
      "score": 2,
      "body": "So what are we thinking here, January of 25 calls?",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpirwee/",
      "created": 1727631159,
      "depth": 0,
      "replies": [
        {
          "id": "lpo4o95",
          "score": 1,
          "body": "I have orders in and am making my way to Jan. I am spreading out all across the board. I have my last oct 18th today and heading into Nov 15th and some for Jan 1st. I am going to keep rolling up a position where I seek good price action.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpo4o95/",
          "created": 1727713281,
          "depth": 1,
          "replies": [
            {
              "id": "lpo627i",
              "score": 2,
              "body": "I've got 10/18s I've had since July,  they arent looking good so I'm gonna have to reposition.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpo627i/",
              "created": 1727713731,
              "depth": 2,
              "replies": [
                {
                  "id": "lpoi8xk",
                  "score": 1,
                  "body": "What sp?",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpoi8xk/",
                  "created": 1727717614,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpoio8i",
                      "score": 1,
                      "body": "$5 calls.",
                      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpoio8i/",
                      "created": 1727717749,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpokuz4",
                          "score": 2,
                          "body": "That's a bit rough now. I have those working out into later dates. If the SFAR announcement comes soon you may be fine",
                          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpokuz4/",
                          "created": 1727718434,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpolgoj",
                              "score": 2,
                              "body": "At this point they've lost most of their value, so I'll hold until expiry and hope for the best. Probably open some new longer dated positions this week or next.",
                              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpolgoj/",
                              "created": 1727718624,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lpolngc",
                                  "score": 2,
                                  "body": "This is the way",
                                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpolngc/",
                                  "created": 1727718683,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpiwm5n",
      "score": 2,
      "body": "remember one thing: the largest airlines are investing massively in eVTOL. Some are already building vertiports in airports. If they do it it is because they know that the market is viable.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpiwm5n/",
      "created": 1727632556,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpj2pa9",
      "score": 2,
      "body": "I thought Joby is the leader? Their stock is also pretty cheap.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpj2pa9/",
      "created": 1727634411,
      "depth": 0,
      "replies": [
        {
          "id": "lpj3p5f",
          "score": 3,
          "body": "Show me. I'll quit my job and come work for you right now.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpj3p5f/",
          "created": 1727634720,
          "depth": 1,
          "replies": [
            {
              "id": "lpj4pmg",
              "score": 1,
              "body": "That's what I could remember watching a CNBC clip a while ago and did some research, things may have changed recently.\n\nI meant in the regulation process, I just looked up Joby it it is the 1st one to allow doing air taxi in UAE, not like it means a lot but definitely helps with the PR.\n\nAlso Uber is investing in Joby. Not sure which one of these 2 will lead the market the same way Uber and Lyft do in ride sharing.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpj4pmg/",
              "created": 1727635043,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpjzwr6",
      "score": 2,
      "body": "If this guy is betting on this > **Covington, Georgia Manufacturing Facility**: In addition, Archer began construction on a **high-volume manufacturing facility** in **Covington, Georgia** \n\nThen I promise he has not seen the Dukes of Hazzard...or Smokey and the Bandit.\n\nGood luck on the high tech wizardry coming out of Covington, Georgia.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpjzwr6/",
      "created": 1727644812,
      "depth": 0,
      "replies": [
        {
          "id": "lpo4f1m",
          "score": 1,
          "body": "Quality shitpost",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpo4f1m/",
          "created": 1727713198,
          "depth": 1,
          "replies": [
            {
              "id": "lpqacea",
              "score": 1,
              "body": "But yeah if you think the 4th generation pig farmers can bring you're copium to you, well.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpqacea/",
              "created": 1727738718,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lpqa1he",
              "score": 0,
              "body": "Covington burns with a chlorine fire all day and night, spraying water on a chemical fire...... what tf.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpqa1he/",
              "created": 1727738608,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpoeb5v",
      "score": 2,
      "body": "When the SFAR comes out in October, the press will write: \"FAA authorizes commercial operation of eVTOLs\" \"FAA launches new era of air mobility\". The time to buy is now, not later",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpoeb5v/",
      "created": 1727716374,
      "depth": 0,
      "replies": [
        {
          "id": "lpoh70p",
          "score": 2,
          "body": "Exactly a return to 5 is so easy once that announcement comes out",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpoh70p/",
          "created": 1727717281,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpppcd3",
      "score": 2,
      "body": "Went YOLO on it! Let’s goooooo!!!!!!",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpppcd3/",
      "created": 1727731196,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpzg7q2",
      "score": 2,
      "body": "Bought 100 $5 contracts April 2025",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpzg7q2/",
      "created": 1727880861,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpzgsa8",
      "score": 2,
      "body": "Time for a huge short squeeze I'm in 10/2 @2.98 ",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpzgsa8/",
      "created": 1727881046,
      "depth": 0,
      "replies": [
        {
          "id": "lpzgsb1",
          "score": 1,
          "body": "Squeeze deez nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpzgsb1/",
          "created": 1727881046,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpzij30",
          "score": 1,
          "body": "LET'SSSSSSSSSSSSSSSSSSSS GOOOOOOOOOOOOO. Ahhhh I am so excited for this one.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpzij30/",
          "created": 1727881614,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpzze69",
          "score": 1,
          "body": "Archer is getting froggy today",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpzze69/",
          "created": 1727886963,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lq6hgh5",
      "score": 2,
      "body": "Options down ~40% today. Doubled down. 150 April 2025 $5 calls",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lq6hgh5/",
      "created": 1727981215,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt8cyl1",
      "score": 2,
      "body": "I own a decent amount of Archer, do you think it’s worth buying Joby as well or is it gonna be one or the other surviving?",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lt8cyl1/",
      "created": 1729629277,
      "depth": 0,
      "replies": [
        {
          "id": "lt8dgnj",
          "score": 1,
          "body": "There are 3 ACHR, JOBY (public), and BETA (private) - they are all great companies. I wish them all well. \n\nThe key for me is ACHR current valuation which I believe is too low. Much too low.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lt8dgnj/",
          "created": 1729629430,
          "depth": 1,
          "replies": [
            {
              "id": "lt8e7sj",
              "score": 2,
              "body": "I see, I’ve been holding for a few months now. Got a decent amount of shares at a good price but currently down a bit, as I got too excited in July and bought shares at a pretty high price 😅. I like the company though, was just wondering if I should diversify a bit. Thinking of just doubling down on Archer though, could be huge in 10 years time.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lt8e7sj/",
              "created": 1729629658,
              "depth": 2,
              "replies": [
                {
                  "id": "lt8hjz6",
                  "score": 1,
                  "body": "Over 10 years I would buy all 3 of them. Well, you can't buy BETA as of yet. I think personally, ACHR pops a bit and catches up some to Joby and then once that occurs I will just keep a portfolio of eVTOLs and surrounding businesses.",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lt8hjz6/",
                  "created": 1729630634,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lwdpeyc",
      "score": 2,
      "body": "This aged well",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lwdpeyc/",
      "created": 1731224024,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpexbeq",
      "score": 4,
      "body": "Okay I’m in",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpexbeq/",
      "created": 1727566066,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpew78p",
      "score": 4,
      "body": "Did you send chatgpt a photo of your cock?",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpew78p/",
      "created": 1727565631,
      "depth": 0,
      "replies": [
        {
          "id": "lpexl7t",
          "score": 24,
          "body": "it couldn't fit the screen",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpexl7t/",
          "created": 1727566174,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpewbwb",
      "score": 3,
      "body": "Dang that's a lot of words I ain't gonna read but I'm kinda glad Robinhood executed my call for me without me asking. Gonna cancel the sell I placed on half my shares.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpewbwb/",
      "created": 1727565680,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpfb64r",
      "score": 3,
      "body": "There is a huge concentration of OI on the 10/18 5c. Important to note that by my very rough estimation 60% STO, 40% BTO",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfb64r/",
      "created": 1727571585,
      "depth": 0,
      "replies": [
        {
          "id": "lpfkgum",
          "score": 1,
          "body": "Yes I would think that 10/18 call to 5 is not very likely unless there is a surprise announcement. What are you thinking? I think this is a $5 / $6 stock easily.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfkgum/",
          "created": 1727575422,
          "depth": 1,
          "replies": [
            {
              "id": "lpfm4mt",
              "score": 1,
              "body": "I need to do more research on my end. So military applications and Civilian air taxi?",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfm4mt/",
              "created": 1727576119,
              "depth": 2,
              "replies": [
                {
                  "id": "lpg2zww",
                  "score": 1,
                  "body": "Yes! Also, commercial use cases like emergency medical services and deliveries. Tons of use cases.",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg2zww/",
                  "created": 1727583837,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpfvfu7",
      "score": 3,
      "body": "Already have ~1k shares & a handful of calls for next year. Each time it drops i throw a bit more in, not earth shattering amounts, but a few hundred here & there.\n\nThey have been permitted in NY & CA already with Florida being worked on(from what I know, obviously i don't know everything).\n\nThanks to your amazing DD, think I will start loading more calls, thanks for that!!\n\nP.S. your military case is more right on than you know. These are coming, the investment from the DoD is there and many are excited about it. They will be used for troop & equipment transport in CA very soon(they have many bases in fairly close proximity so the use is obvious). There's talk of putting them on some ships to gather supplies without needing to go inland, so many uses have been discussed-with more uses being revealed all the time. I see the military being a large enough customer even without the commercial aspects, but they have that too!\n\nI too believe that ACHR will be huge in the coming years!",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfvfu7/",
      "created": 1727580152,
      "depth": 0,
      "replies": [
        {
          "id": "lpg2f4q",
          "score": 2,
          "body": "That's awesome. Yeah this one I feel strongly about! It's great to get in on the ground floor and they are getting close.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg2f4q/",
          "created": 1727583533,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpixwc7",
      "score": 4,
      "body": "You had me until Stellantis. \n\nLiterally the biggest POS automaker, wouldn’t touch anything they invest in with a 10ft pole",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpixwc7/",
      "created": 1727632937,
      "depth": 0,
      "replies": [
        {
          "id": "lplz5g2",
          "score": 1,
          "body": "I mean, a broken clock is right 2 times a day? lol I'll give you a better one. Many people don't know that FTS by SBF actually recouped much of their lost equity on the horrible crypto bet they took by that last minute investment into a little company called Anthropic. Just sayin. \n\nDon't judge a good investment badly",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lplz5g2/",
          "created": 1727674720,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpfnqqx",
      "score": 1,
      "body": "Any relation to Pioneer aviation there Frank?",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfnqqx/",
      "created": 1727576802,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpfvocb",
      "score": 1,
      "body": "why would united airlines want to invest? seems like they have their own lane to focus on",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfvocb/",
      "created": 1727580259,
      "depth": 0,
      "replies": [
        {
          "id": "lphd3s9",
          "score": 3,
          "body": "He said United pre-bought 100 of the aircraft. They bought them to start a United Air Taxi commercial service.\n\nThis is a potential new lane of commercial aviation and United wants to own this lane. \n\nI am not invested in this, just this DD got me reading about it and I plan to invest something bc OP convinced me. Also fuck Grizzly, they bend the truth in their reports, I have found them to be wrong before.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lphd3s9/",
          "created": 1727612851,
          "depth": 1,
          "replies": [
            {
              "id": "lpi219x",
              "score": 1,
              "body": "They are getting killed on PDD right now with the China announcement. That is another company they tried to bury and people got pissed about. PDD is up massively now. Grizzly was wrong on that one too.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpi219x/",
              "created": 1727622797,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lpib5ok",
              "score": 1,
              "body": "thanks, i must have missed that somehow",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpib5ok/",
              "created": 1727625893,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpg2wtb",
          "score": 1,
          "body": "I mean, why does anyone invest in anything?",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg2wtb/",
          "created": 1727583790,
          "depth": 1,
          "replies": [
            {
              "id": "lpg3oxy",
              "score": 1,
              "body": "companies don't have a hedge fund division that invests in random companies and securities, but they do invest in strategic partnerships, I guess your answer is \"I don't know\"",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg3oxy/",
              "created": 1727584191,
              "depth": 2,
              "replies": [
                {
                  "id": "lpg4l3o",
                  "score": 1,
                  "body": "No I do know. They are investing like anyone invest in anything. A return on investment. What the hell else would they be investing in it for?",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg4l3o/",
                  "created": 1727584665,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpg5aol",
      "score": 1,
      "body": "Really appreciate the write up.\n\nCan't find any mention of when they expect to start recognizing revenue (not just here, other sources as well). It looks like zero reported so far, despite the DoD contracts. \n\nI understand it's speculative, but ballpark, when do you think they start selling something?",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpg5aol/",
      "created": 1727585045,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpgzvbk",
      "score": 1,
      "body": "When you try to make the argument that dilution is good for shareholders you lose a lot of credibility.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpgzvbk/",
      "created": 1727605053,
      "depth": 0,
      "replies": [
        {
          "id": "lphdo1v",
          "score": 5,
          "body": "At this stage it's not the end of the world if valuation rises enough to make up for it. Getting cash in has to be top priority, you run outta cash then it's dead. But I agree OP demonstrated a fundamental misunderstanding of dilution.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lphdo1v/",
          "created": 1727613132,
          "depth": 1,
          "replies": [
            {
              "id": "lphrl5c",
              "score": 1,
              "body": "Not a misunderstanding just the reality of how difficult this is. You either get a mega investor or a collection of many investors. Openai is a perfect example. I was a few, then it was only msft and now it's several. Jesus h we are talking about a company that wants to be publicly traded right?\n\nLol my understanding of dilution. Stay afloat. That's all the understanding I need.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lphrl5c/",
              "created": 1727619052,
              "depth": 2,
              "replies": [
                {
                  "id": "lphzzjk",
                  "score": 1,
                  "body": "Right. I agree with you. How you explained it above made it seem like you didn't understand the concerns. I don't think it's a big deal to give some shares to your biggest strategic partners. My comment that you replied to basically said the same thing, cash is most important right now. I like your thesis and I'm going to invest next week",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lphzzjk/",
                  "created": 1727622077,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lph5jcy",
      "score": 1,
      "body": "Not an expert but I do get vibes of those old futurist pictures that pictured everyone in their personal dirigible or zeppelin.\n\n\n\n\nWe do know how that turned out.\n\n\nPersonally, the only bet on eVTOL I'd do is for military use.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lph5jcy/",
      "created": 1727608750,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lphkr4s",
      "score": 1,
      "body": "Can you go over financials",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lphkr4s/",
      "created": 1727616313,
      "depth": 0,
      "replies": [
        {
          "id": "lphqo7a",
          "score": 1,
          "body": "They're pre revenue",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lphqo7a/",
          "created": 1727618700,
          "depth": 1,
          "replies": [
            {
              "id": "lpj71bw",
              "score": 0,
              "body": "Bro just say no revenue. \n\nHow much cash vs debt?",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpj71bw/",
              "created": 1727635778,
              "depth": 2,
              "replies": [
                {
                  "id": "lpjaxwa",
                  "score": 1,
                  "body": "They have orders over $6 billion. Eat rocks",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpjaxwa/",
                  "created": 1727637007,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpiegyd",
      "score": 1,
      "body": "Other news to come, relayed by the Japanese press on September 26 but not yet by the Anglo-Saxon press: (\n\n[https://www.nikkei.com/nkd/company/us/STLA/news/?DisplayType=1&ng=DGXZQOUC2696R026092024000000](https://www.nikkei.com/nkd/company/us/STLA/news/?DisplayType=1&ng=DGXZQOUC2696R026092024000000)\n\n[https://www.yomiuri.co.jp/expo2025/20240926-OYO1T50059/](https://www.yomiuri.co.jp/expo2025/20240926-OYO1T50059/)\n\nI specify that NIKKO owns 10 millions shares in ARCHER",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpiegyd/",
      "created": 1727626951,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpietae",
      "score": 1,
      "body": "Nice DD, thanks for taking the time and effort to make it. \n\nI've looked into Archer a few times now and while I'm tempted to buy in, I have a couple of hurdles I'm struggling to get over. First of all I'm having a hard time seeing a scenario where they aren't just acquired by another megacorp. Boeing going balls-deep and consolidating them with Wisk makes a lot of sense; both companies are functionally the same, it merely seems to be the case that Archer want to push a more VIP and military-oriented aircraft line-up while Wisk is designed much more in the mould of an air-taxi Uber. Stellantis might also be interested in a direct acquisition if they can envision a more profitable return by cutting out other major investors like United and Boeing, as well as gaining them exposure to valuable US military contracts.\n\nI'm also not fully convinced by the eVTOL air-taxi concept. As a means of rapid transportation it does have potential (is there anyone who *doesn't* want to reach their destination not just in style but also half an hour earlier??) but I need to know exactly how they're going to make it affordable for people that aren't just high-income earners, because otherwise it will ultimately be an unprofitable service due to the complexity of the technology and the lack of a large clientele base. The stock has a lot of potential but the hurdles are really fucking big, I ain't gonna lie.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpietae/",
      "created": 1727627060,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpnbpu2",
      "score": 1,
      "body": "Maybe I missed it, but I don’t see anyone here talking about the impact of the Stellantis CEO replacement and reduction in profit outlook. \nStellantis was supporting Archer with funding and resources. Given Stellantis is down 47%, I would imagine they will pull back from some of the support for Archer as a part of the restructuring.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpnbpu2/",
      "created": 1727703409,
      "depth": 0,
      "replies": [
        {
          "id": "lpnks63",
          "score": 1,
          "body": "yeah, it really doesn't matter. those investments are set and the next CEO will preside over them. Nobody is sitting there looking at Archer and thinking OMG what a horrible investment. Quite the opposite.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpnks63/",
          "created": 1727706693,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpo3a87",
      "score": 1,
      "body": "Looking to pick up shares at 3.00. Have a bunch of calls looking to execute on better price action too.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpo3a87/",
      "created": 1727712827,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lponaz4",
      "score": 1,
      "body": "come on 3",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lponaz4/",
      "created": 1727719205,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpor20x",
      "score": 1,
      "body": "got him!!!",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpor20x/",
      "created": 1727720404,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpqck8s",
      "score": 1,
      "body": "Just eVTOL the fries in the bag.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpqck8s/",
      "created": 1727739544,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lptbfoh",
      "score": 1,
      "body": "The fact that ACHR is holding today is telling. Great signal!",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lptbfoh/",
      "created": 1727791639,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpv3teb",
      "score": 1,
      "body": "No matter what this stock won't go any further down. \n\nON 12 million volume it is flat as if it were being purchased for a merger. Love it!",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpv3teb/",
      "created": 1727812233,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq17wl4",
      "score": 1,
      "body": "I just bought today 2.98 10/2/24 and know ready for the long term x3 x4 x? and short squeeze $$$$$ x-tra  Bonus",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lq17wl4/",
      "created": 1727901084,
      "depth": 0,
      "replies": [
        {
          "id": "lq17wnw",
          "score": 1,
          "body": "Squeeze deez nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lq17wnw/",
          "created": 1727901085,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpf21s6",
      "score": 1,
      "body": "Lets say a route you want to go by car is 1 hour and they say the air taxi can make it 20 minutes...\n\nI order an uber and wait 10 minutes...take uber to air taxi place 10 minutes...wait 10 minutes for my air taxi to be ready... fly 20 minutes.... uber 10 minutes to my destination....\n\nSo yeah you want me to jump thru a bunch of hoops and save zero time while I could have been playing ps5 in my driverless living room instead...\n\nHard pass.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpf21s6/",
      "created": 1727567960,
      "depth": 0,
      "replies": [
        {
          "id": "lpf2n6h",
          "score": 1,
          "body": "What? lol you need to study what direct flight at 100 mph means. literally your calculations are way off. I don't know where your from but using New York or LA traffic as an example 20 miles might be an hour drive in which this would take 12 minutes. You have to use reality to understand the use case. Not sitting through traffic is highly desirable.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpf2n6h/",
          "created": 1727568198,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpfeozc",
      "score": 1,
      "body": "I bought 3k worth of shares a couple months ago around 3.70 and ended closing for a loss, might be time to go back in",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfeozc/",
      "created": 1727573022,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpfj4gb",
      "score": 1,
      "body": "What strikes are you currently in?",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfj4gb/",
      "created": 1727574860,
      "depth": 0,
      "replies": [
        {
          "id": "lpfkqyt",
          "score": 2,
          "body": "3, 3.5 5 10/18. and 3 and 5 11/15. So far.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpfkqyt/",
          "created": 1727575540,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpex15b",
      "score": -1,
      "body": "Air taxis are investment garbage. Why are people investing in this trash?",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpex15b/",
      "created": 1727565953,
      "depth": 0,
      "replies": [
        {
          "id": "lpexyrh",
          "score": 0,
          "body": "Grizzly is that you? I mean come on you guys took it down a lot. It's time to exit don't you think?",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpexyrh/",
          "created": 1727566321,
          "depth": 1,
          "replies": [
            {
              "id": "lpeycvd",
              "score": 0,
              "body": "I wish I had puts or shorted this at some point.\n\nBut nah, I usually just play good companies with calls or CSPs or similar strategies.\n\nAir taxis are garbage though.",
              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpeycvd/",
              "created": 1727566477,
              "depth": 2,
              "replies": [
                {
                  "id": "lpeypyd",
                  "score": 5,
                  "body": "But they don't exist yet. Why not take a chance on a new technology. You can say anything is garbage until it's undeniably not.",
                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpeypyd/",
                  "created": 1727566621,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpezgj6",
                      "score": 2,
                      "body": "It's terrible. Has no path to being profitable.\n\nIt's Uber with 1000 times more obstacles.\n\nI love new tech. New innovations. New companies.\n\nAir taxis are an old idea from the Jetsons trying to be realized with no semblance of a plan as to how to do it profitably. \n\nPutting a penny into them is a waste of money. The transportation disruption is going to be autonomous vehicles. Air taxis will never matter",
                      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpezgj6/",
                      "created": 1727566915,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lphf2yl",
                          "score": 1,
                          "body": "There's a huge growth path in replacing a percentage of helicopters and small aircraft already in use, even if a Jetsons like future doesn't occur. But your skepticism is warranted, that's the other obvious side of the market. It does help that major players in aviation see this as  promising, they know more about it than you or me",
                          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lphf2yl/",
                          "created": 1727613809,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lphhena",
                              "score": 0,
                              "body": "Taxis are not replacing small aircraft.\n\nLet me ask the simplest question:\n\n1. Where is the infrastructure?\n\n2. Who will pilot these? \n\nThose two facts make this a junk investment.",
                              "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lphhena/",
                              "created": 1727614867,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lpig2wy",
                                  "score": 2,
                                  "body": "Thats why the stock is at $3. This is definitely one that could go to zero. But they could replace a lot of current uses of helicopters which already have infrastructure. I think your questions are appropriate if you're looking at this as a replacement for people's everyday driving. That seems farfetched, the use cases aren't as strong. I am not shilling for it but OP convinced me to take a small flier on it.",
                                  "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpig2wy/",
                                  "created": 1727627470,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lpijk83",
                                      "score": 0,
                                      "body": "It's not a replacement for anything.\n\nThe stock will go to $0.\n\nHelicopters don't have commercial infrastructure at all lol\n\nUber doesn't make money and they:\n\n- use their employees cars\n\n- only require a driver's license\n\n- pay like crap\n\nAir taxis are supposed to make money when you need:\n\n- company funded vehicles\n\n- extensive safety operations\n\n- pilots who demand a far greater salary than a taxi cab drvier\n\n- infrastructure that doesn't exist\n\n- massive insurance policies\n\n- not to mention tons of regulations \n\nIt's garbage and anyone like OP who shills this shit is a moron.",
                                      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpijk83/",
                                      "created": 1727628579,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpev7jo",
      "score": 0,
      "body": "Puts it is",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpev7jo/",
      "created": 1727565243,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpezf8t",
      "score": 0,
      "body": "My problem with archer is i dont see any real world use for it on the commercial side.... It wont replace the public transportation we have... Just doesnt make any sense....Theres not going to be massive airports with people waiting in line and they arent going to be landing right at ur house and dropping u off where u want either...so ur still gunna have to uber....So yeah thats not a thing.... So then you ask yourself will it just be for rich people? I also think not...Not when cars are going to turned intro driverless living rooms... An air taxi would be a down grade....So who is it for? No1....Just a gimmick.",
      "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpezf8t/",
      "created": 1727566901,
      "depth": 0,
      "replies": [
        {
          "id": "lpf0ixn",
          "score": 1,
          "body": "Nobody is saying it's replacing cars. However, if you could go from one city to the next in LA and not experience any traffic and be right on the airport tarmac to catch a flight. That is a use case that many people will find valuable. With the military there are a million use cases. What about somebody who needs to transport a heart for a heart transplant. There are so many use cases it's not even funny. It's the future of short range transportation.",
          "permalink": "/r/wallstreetbets/comments/1frqceh/part_2_archer_aviation_is_a_table_pounding_buy_as/lpf0ixn/",
          "created": 1727567342,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}