{
  "title": "How are we feeling about ACMR?",
  "score": 41,
  "selftext": "I have a long position in ACMR, and I honestly just like their books. They have a super low debt:equity ratio, and are expanding operations out of China and in to Europe and the US. They're a \"picks and shovels\" company riding the coattails of the AI boom, and have over 100 patents on their equipment and processes.\n\nOn the other hand, they just broke through a resistance level on Friday, and short interest increased nearly 8% over the weekend. I've been searching the news for any info on why that might have happened, but I'm drawing a blank. \n\nCan anyone that's much better at technical analysis than me check this out and tell me what I'm missing?",
  "link_flair_text": null,
  "id": "1fstmpb",
  "num_comments": 7,
  "created_utc": 1727697158,
  "permalink": "/r/stocks/comments/1fstmpb/how_are_we_feeling_about_acmr/",
  "comments": [
    {
      "id": "lpmz7zf",
      "score": 7,
      "body": "Good company. I owned it a few years ago but sold out for a profit. It’s an American company on paper but the majority of their revenues comes from china, which is why you’re seeing the breakout.",
      "permalink": "/r/stocks/comments/1fstmpb/how_are_we_feeling_about_acmr/lpmz7zf/",
      "created": 1727698114,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpmy5y3",
      "score": 2,
      "body": "Following here",
      "permalink": "/r/stocks/comments/1fstmpb/how_are_we_feeling_about_acmr/lpmy5y3/",
      "created": 1727697608,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpnepf8",
      "score": 1,
      "body": "Held for a year or so, been quite bloody despite consistently positive news. Nice to finally have some momentum",
      "permalink": "/r/stocks/comments/1fstmpb/how_are_we_feeling_about_acmr/lpnepf8/",
      "created": 1727704529,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpnjmk3",
      "score": 1,
      "body": "i dont understand how the net profit margin seems to be decreasing, but overall revenue continues to go up, and from what i read, they are one of the top dogs in the market.  also, imho, it's never a bad idea to bet against china in an emerging tech sector.  i think it's severely undervalued.  although, if you had asked me yesterday, apparently, they have issues with too much product not sold?  but then today they released some report about backorders???  imo i think it's a good play.",
      "permalink": "/r/stocks/comments/1fstmpb/how_are_we_feeling_about_acmr/lpnjmk3/",
      "created": 1727706291,
      "depth": 0,
      "replies": [
        {
          "id": "lpnl7wp",
          "score": 3,
          "body": ">i dont understand how the net profit margin seems to be decreasing, but overall revenue continues to go\n\nI work in manufacturing, so I can answer this one... if you put in more OT and pay expedites at OV suppliers in order to get product out the door, your revenue can go up at smaller margins.",
          "permalink": "/r/stocks/comments/1fstmpb/how_are_we_feeling_about_acmr/lpnl7wp/",
          "created": 1727706841,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpql65l",
      "score": 1,
      "body": "will the recent china stimulus impact this company? if so, how?",
      "permalink": "/r/stocks/comments/1fstmpb/how_are_we_feeling_about_acmr/lpql65l/",
      "created": 1727742726,
      "depth": 0,
      "replies": []
    }
  ]
}