{
  "title": "Carnival Stock Slips After Record-Setting Quarter Offset by Weak Outlook",
  "score": 28,
  "selftext": "[Investopedia article](https://www.investopedia.com/carnival-record-setting-quarter-offset-by-weak-outlook-update-8720379); CCL was down much lower earlier, but is now at -2.75%.\n\nThe outlook portion that is bringing down CCL stock:\n\n> Carnival anticipates net yields growing by approximately 5.0% in constant currency in the fourth quarter and by about 10.4% for the full year. Analysts surveyed by Visible Alpha were looking for 5.76% and 10.52%, respectively. Net yield measures revenue per available passenger cruise day, after deducting expenses like airfare, commissions, and other direct costs.\n\nSome other info on the earnings [from street insider](https://www.streetinsider.com/Earnings/Carnival+Corp.+%28CCL%29+Tops+Q3+EPS+by+10c/23778490.html):\n\nCarnival Corp. (NYSE: CCL) reported Q3 EPS of $1.27, $0.10 better than the analyst estimate of $1.17. Revenue for the quarter came in at $7.89 billion versus the consensus estimate of $7.82 billion.\n\n2024 Outlook\n\nFor the full year 2024, the company expects:\n\n* Net yields (in constant currency) up approximately 10.4 percent compared to 2023, better than June guidance, based on continued strength in demand.\n* Adjusted cruise costs excluding fuel per ALBD (in constant currency) up approximately 3.5 percent compared to 2023, approximately 1 percentage point better than June guidance driven by cost saving opportunities, accelerated easing of inflationary pressures and benefits from one-time items.\n* Adjusted EBITDA of approximately $6.0 billion, up over 40 percent compared to 2023 and better than June guidance by nearly $200 million.\n* Adjusted return on invested capital (\"ROIC\") of approximately 10.5 percent, an improvement of approximately 5.0 percentage points compared to 2023 and half a point better than June guidance.\n* For the fourth quarter of 2024, the company expects:\n* Net yields (in constant currency) up approximately 5.0 percent compared to particularly strong 2023 levels.\n* Adjusted cruise costs excluding fuel per ALBD (in constant currency) up approximately 8.0 percent compared to the fourth quarter of 2023 due primarily to higher dry-dock days and higher investment in advertising.\n* Adjusted EBITDA of approximately $1.14 billion, up 20 percent compared to the fourth quarter of 2023.\n\nAgain see the outlook above that explains why the stock is negative today.",
  "link_flair_text": "Earnings beat!",
  "id": "1fszucu",
  "num_comments": 6,
  "created_utc": 1727713779,
  "permalink": "/r/stocks/comments/1fszucu/carnival_stock_slips_after_recordsetting_quarter/",
  "comments": [
    {
      "id": "lpp97vv",
      "score": 3,
      "body": "I like how the article is about 'weak outlook' when CCL quite literally said the opposite with data to back it up:\n\nCarnival's ([CCL](https://seekingalpha.com/symbol/CCL#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews)) bookings update: \"With nearly half of 2025 booked and less inventory remaining for sale than the prior year, we are leveraging strong demand to achieve record ticket pricing (in constant currency) ... Likewise, 2026 is off to an unprecedented start, achieving record booking volumes in the last three months.\"",
      "permalink": "/r/stocks/comments/1fszucu/carnival_stock_slips_after_recordsetting_quarter/lpp97vv/",
      "created": 1727726081,
      "depth": 0,
      "replies": [
        {
          "id": "lptk9r4",
          "score": 1,
          "body": "It's funny, but they kind of added the bad news deep in the earnings report, basically:\n\n> net yields growing by approximately 5.0% in constant currency in the fourth quarter and by about 10.4% for the full year. Analysts surveyed by Visible Alpha were looking for 5.76% and 10.52%,\n\nThe percentage is so little, but it's below expectations so it's automatically bad...",
          "permalink": "/r/stocks/comments/1fszucu/carnival_stock_slips_after_recordsetting_quarter/lptk9r4/",
          "created": 1727794644,
          "depth": 1,
          "replies": [
            {
              "id": "lpu21ik",
              "score": 2,
              "body": "The CCL daily swings are wild... 4-5% daily swings on Monday and Tuesday.\n\n  \nGood catch there as well.",
              "permalink": "/r/stocks/comments/1fszucu/carnival_stock_slips_after_recordsetting_quarter/lpu21ik/",
              "created": 1727800460,
              "depth": 2,
              "replies": [
                {
                  "id": "lpv6top",
                  "score": 1,
                  "body": "great for selling puts.",
                  "permalink": "/r/stocks/comments/1fszucu/carnival_stock_slips_after_recordsetting_quarter/lpv6top/",
                  "created": 1727813150,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lq2vq12",
      "score": 2,
      "body": "So the earnings are good, 2025 is alteady above the 2024 booking levels and they also have 2026 on good progress. Is there any problem? I do not get what the bad news are. They paid a lot of debbt in the past 2 years. This 19 resistance is quite strong. Seems they go back now to 14-16 like they do after each earnings report.",
      "permalink": "/r/stocks/comments/1fszucu/carnival_stock_slips_after_recordsetting_quarter/lq2vq12/",
      "created": 1727923279,
      "depth": 0,
      "replies": []
    }
  ]
}