{
  "title": "LEU, the fat pitch for a US uranium enrichment pure play",
  "score": 61,
  "selftext": "[LEU's Piketon. OH facility](https://preview.redd.it/umc8trpzuzrd1.png?width=935&format=png&auto=webp&s=d56d123b3020d0da0bfde8c0d69585aa948a59ba)\n\n**The Core of the Thesis**\n\nI believe Centrus Energy Corp (LEU) offers the greatest upside in the Nuclear sector. Here’s why:\n\n- LEU is the only American company that enriches uranium today.\n\n- It currently trades at 2.2x enterprise value / sales. It reported 189m of revenues last quarter.\n\nLets compare that valuation to the uranium miners. Of the one’s producing revenue, they average \\~97x. If we reduce the comparison to the lowest, it is 10x. If you want to compare to the largest and most well-known, it is CCJ at 11x. Suffice to say, nuclear-related companies trade at very high multiples.\n\nMaybe they should be trading more in like with utilities with nuclear exposure. Well even here, the average is 5x.\n\n The basic metrics for LEU and comparisons are below.\n\nhttps://preview.redd.it/8lff6y73tzrd1.png?width=933&format=png&auto=webp&s=14eb43fc2ce5763e231a34873cd3699ce9869a58\n\nhttps://preview.redd.it/qgxfjb9kszrd1.png?width=433&format=png&auto=webp&s=9193bcfeba5278761e75ed692d49d9ca20da72d6\n\nhttps://preview.redd.it/jrbs7jkoszrd1.png?width=437&format=png&auto=webp&s=99de7d1637a38361112ecfc18f62687a2f246afe\n\n**Potential for Outsized Returns**\n\nIf LEU simply re-rates to \\~5x – which to me, would still be very conservatively valued – it would be \\~123 / share. January 80 strikes currently trade at \\~1.7. If that re-rate happened before then, the return would be \\~25x. I.e. (123 – 80) / 1.7.\n\nThose kind of potential returns are exceptionally rare, even among contracts.\n\nI am not aware of any other nuclear related trades that could offer such an enormous return. Never mind such an enormous return on a relatively conservative premise, i.e. re-rating from \\~2.2 ev / sales to 5x.\n\nSo now that we have the most important elements out of the way, here is why I think Nuclear will be super hot, and more details on LEU specifically.\n\n \n\n**US Nuclear Bull Thesis**\n\nAI is viewed by the Mag7-Military-Inudustial complex as being central to US political and economic hegemony. As such, they have pulled out all stops in terms expenditures. And the feds have operated at breakneck spread to buttress US advantage in AI via regulation. I.e. they have acted swiftly and aggressively to being as much of the supply chain within US national borders or control.\n\nAs AI has progressed, anything that has been revealed to be a bottleneck – whether semis, or data centers with ready powers supplies, or electrical companies, etc. has re-rated, often doubling, tripling, or more in breakneck speed.\n\nThe latest revealed bottleneck is energy. And apparently nuclear power is the only source that can viably satiate the projected energy needs. Hence the MSFT big for three mile island. I view this as the opening salvo. The other big AI players will need to secure nuclear sites in short order – perhaps they will be bidding against one another – given the limited number of existing nuclear sites. The news cycle for Nuclear is primed to get wild, and fast.\n\n[From Centrus Investor Presentation](https://preview.redd.it/h324mgwptzrd1.png?width=1523&format=png&auto=webp&s=e41640e6343ace47c1ead089327134cee30923ee)\n\n**LEUs role**\n\nThe US’s largest vulnerability with respect to nuclear is that much of the supply chain is controlled by Russia. Given that (a) we are engaged with a proxy war with Russia, and (b) rapidly expanding nuclear power is now a major national security issue – I expect the Feds to act rapidly and decisively to remedy this issue.\n\nThe most obvious step to remedy this would be to provide substantial funding to support LEU’s expansion of enrichment facilities within the US. When it comes to acting decisively and rapidly – the Feds almost always bet big on the most established players with the longest history. That is unambiguously LEU.\n\nBeyond the feds taking action, I think the Mag7 / utilities are going to be placing massive orders to secure future enriched uranium, as it becomes evident the number of active nuclear sites in the US is set to expand. LEU should be a recipient of much of these orders and see their backlog increase substantially. In sum, I think LEU is primed for a series of very positive press releases and generally a very bullish news cycle with respect to nuclear energy.\n\n[From Centrus Investor Presentation](https://preview.redd.it/nqfpuftktzrd1.png?width=1521&format=png&auto=webp&s=2589d749e180e841a56e128b814bb86fea259545)\n\n**Further Info**\n\nThere is plenty of other reasons to be bullish LEU, e.g. their strong relationships with SMR developers and the work they are doing with HALEU. However, I will end it here. If there is interest, I'll do a follow-up post. In the meantime if you want to dive further\n\nI suggest this video or a presentation the CEO just gave in DC.\n\n[https://x.com/centrus\\_energy/status/1838732746962743484](https://x.com/centrus_energy/status/1838732746962743484)\n\nTheir investor presentation is here\n\n[https://investors.centrusenergy.com/static-files/058b474a-c135-4600-a84b-e9908864a7a](https://investors.centrusenergy.com/static-files/058b474a-c135-4600-a84b-e9908864a7a)\n\n**Disclosure**  \nIn sum, I think conditions are perfect for the re-rate I described above.\n\nI am long LEU commons and calls of various strikes and expiry dates.",
  "link_flair_text": "DD",
  "id": "1ft3itl",
  "num_comments": 44,
  "created_utc": 1727722745,
  "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/",
  "comments": [
    {
      "id": "lpoyicc",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 8 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/) \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpoyicc/",
      "created": 1727722749,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpp7w7b",
      "score": 11,
      "body": "What if their Russian supplier pulls back because of uranium export ban causing LEU to second source at less economical terms? (There was rumblings of this in Russian news today which likely contributing to weak PA in addition to profit taking). LEU bottom line immediately negatively impacted in this scenario that’s seemingly becoming more probable. \n\nAlso, going forward further re-rating appears to be less of a fat pitch and more of a binary event around whether or not they get expedited funding ($Bs) from DOE from recent RFP etc under the premise of government deeming the company a strategic national asset. If they don’t receive large funding infusion and have to negotiate a new supplier, the economics of supplying LEU presumably won’t be great for them even if hyperscalers place orders. I’m bullish $LEU overall (in from 30% lower), but think the US government either makes or breaks this trade. Lmk if you have pushback on any of this",
      "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpp7w7b/",
      "created": 1727725678,
      "depth": 0,
      "replies": [
        {
          "id": "lppd2c9",
          "score": 5,
          "body": "They seem to view Russia developments as a positive, as indicated by the slide. How things play out each step of the way in the short-term, I don't know. I do have confidence in the big picture that US want to eliminate Russia dependency and expand nuclear production domestically. Outside of working with LEU - I don't know how they would accomplish this. \n\nThere are some other companies that are earlier stages with more speculative tech. And bears cases typically rest on comparisons with these. I think if the Feds were interested in these they would fund both LEU and them. It is pretty late in the game in terms of nuclear development for them to be placing long tail bets are putting all their eggs in a single basket - in terms of funding purely much earlier stage companies years from enrichment, assuming everything works well - vs LEU which has been doing a fair amount of enrichment already.\n\nAlso, I think their current valuation leaves an enormous buffer even if there is some short-term turmoil with supplies. If we want exposure to nuclear, we have to consider the alternatives - and the alternatives are companies worth many billions with massive cash burn rates and practically no revenue.\n\nIf LEU margins got temporarily crushed - they would still have better metrics than every miner and SMR developer. And again, I think the market would be forward looking enough to realize that this simply makes federal funding - and hence increased long-term profitability - more likely.",
          "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lppd2c9/",
          "created": 1727727285,
          "depth": 1,
          "replies": [
            {
              "id": "lppeojb",
              "score": 5,
              "body": "Agree universe of publicly traded nuclear industry companies is small and even with risks outlined above I think LEU one of most attractive bets to play the theme. RSI extended but whatever. Hopefully DOE comes through with funding - apparently RFP decision is expected soon.  Also hard to take serious some small time fund managers incessantly pumping ASPI…10,000 word sub stacks + multiple tweets per day doesn’t mean someone has an edge and that stock is closer to investing in speculative small cap biotech… people prob gonna get hurt.",
              "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lppeojb/",
              "created": 1727727790,
              "depth": 2,
              "replies": [
                {
                  "id": "lpqrjvw",
                  "score": 7,
                  "body": "Regarding the other company your mentioned - seems to fit the profile of what retail loves, i.e. pre-revenue, far off tech, with a claim to dominant technology. In these cases - funding hurdles, risks inherent to commercialization of early stage tech, etc are overlooked. There have been dozens of these. Can't mention most because their market caps have shrunk too much.\n\nThat said, I do not really view these two companies as competitors. It's like AI - you could have fretted over who the winners would be among META, APPL, MSFT, GOOG, etc. - meanwhile over time they were all ripping beyond anyone's expectations.\n\nI think the same could happen here. Growth in the market is sufficient for both of these to do very, very well. I prefer LEU because is seems to have lest risk (since already established and producing more revenue) and much more upside (via options which pay higher than usual returns at this juncture bc the company remains relative obscure - at leas that is my read).",
                  "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpqrjvw/",
                  "created": 1727745082,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lq44b1x",
                  "score": 1,
                  "body": "After looking into all 3 options (Silex, Aspi, Leu). My conclusion was actually that ASPI has the best tech. That doesn't mean they'll come out ahead, but I like the odds more.  \n\nIn terms of the setup, according to the latest data, there are 8.2M shares sold short on ASPI. This is a whopping ±13 days to cover. The rumors are this short position is from a bunch of quant funds that short companies that have no revenue after making a big run. Aspi is guiding to be FCF positive by the end of the year, so this is quite an explosive setup if they deliver on that. Caveat emptor, but in terms of bets, this is a good as they come imo.",
                  "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lq44b1x/",
                  "created": 1727950185,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpp7xhf",
      "score": 7,
      "body": "I’ll check LEU out- I have some UEC…thinking uranium will be a long play.  \n\nAlso, just trying to get a little uranium for my pet spider (Silky Pants) to get some cool powers to pass along.",
      "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpp7xhf/",
      "created": 1727725689,
      "depth": 0,
      "replies": [
        {
          "id": "lppl3uu",
          "score": 5,
          "body": "The TAM for pet spiders is something I failed to address.",
          "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lppl3uu/",
          "created": 1727729810,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpznjgg",
          "score": 3,
          "body": "Contracts up big. Hope you can afford some gear for your spider now:\n\n[https://www.reddit.com/r/wallstreetbets/comments/1fuix1r/leu\\_the\\_first\\_100\\_gain\\_is\\_the\\_easiest/](https://www.reddit.com/r/wallstreetbets/comments/1fuix1r/leu_the_first_100_gain_is_the_easiest/)",
          "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpznjgg/",
          "created": 1727883241,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpozp6p",
      "score": 4,
      "body": "Positions?",
      "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpozp6p/",
      "created": 1727723126,
      "depth": 0,
      "replies": [
        {
          "id": "lpznn7v",
          "score": 2,
          "body": "Here is an update\n\n[https://www.reddit.com/r/wallstreetbets/comments/1fuix1r/leu\\_the\\_first\\_100\\_gain\\_is\\_the\\_easiest/](https://www.reddit.com/r/wallstreetbets/comments/1fuix1r/leu_the_first_100_gain_is_the_easiest/)",
          "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpznn7v/",
          "created": 1727883276,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpp064p",
          "score": 2,
          "body": "It's there at the bottom of the post.",
          "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpp064p/",
          "created": 1727723276,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpp9u92",
      "score": 5,
      "body": "Which call strike/expiry are you going for OP? What's 'various strikes and expiry' for the eejits who don't want to do more research?",
      "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpp9u92/",
      "created": 1727726265,
      "depth": 0,
      "replies": [
        {
          "id": "lppemhu",
          "score": 5,
          "body": "1/17/2025 60 strikes\n\n1/17/2025 80 strikes\n\nI think the 80s just opened. If you look at the option chain you will see how early innings this is in terms of limited Open Interest.\n\nFor example, compare to SMR which has \\~50,000 open interest for Jan, and SMR commons would have to 3x before seeing the type of returns LEU would return if it 2x's. What's more, SMR has \\~3x the market cap of LEU. so on that basis, it should be a lot easier for LEU to see dramatic changes in price.\n\nLEU has about \\~5,000 in open interest. Or \\~10x less than SMR.\n\nIn sum, I think LEU has a lot more juice to it than other more well-known nuclear stocks.",
          "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lppemhu/",
          "created": 1727727772,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpq1iwq",
      "score": 3,
      "body": "This is a really interesting trade, OP. Thanks for posting. I will definitely research this.",
      "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpq1iwq/",
      "created": 1727735514,
      "depth": 0,
      "replies": [
        {
          "id": "lpqoqir",
          "score": 2,
          "body": "Thanks. Interested to hear your thoughts once you dig into it yourself.",
          "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpqoqir/",
          "created": 1727744037,
          "depth": 1,
          "replies": [
            {
              "id": "lpuap6k",
              "score": 2,
              "body": "Will check back certainly (will take me this week and possibly next, though.) LEU wasn’t on my radar at all.",
              "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpuap6k/",
              "created": 1727803182,
              "depth": 2,
              "replies": [
                {
                  "id": "lpueupb",
                  "score": 3,
                  "body": "There is a lot to work through.",
                  "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpueupb/",
                  "created": 1727804473,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpv7hla",
                      "score": 3,
                      "body": "Yes. Congrats today! (Just saw my watchlist, up 44% on those contracts, nice.)",
                      "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpv7hla/",
                      "created": 1727813354,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpwircg",
                          "score": 3,
                          "body": "I want a 10x on the contracts",
                          "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpwircg/",
                          "created": 1727829671,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpzeh4i",
                              "score": 3,
                              "body": "Oh, I understand that, just celebrating a move in the right direction.",
                              "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpzeh4i/",
                              "created": 1727880293,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lsa5d2y",
              "score": 1,
              "body": "It took me forever to research, unfortunately but was convinced to start the position (saw another DD just before that helped as well.) Have some shares and calls in LEU, and shares of RYCEY and some URNM - so glad I didn’t totally miss it (hard to add after big gains, but adding to winning trades can be great, so…)",
              "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lsa5d2y/",
              "created": 1729121039,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpq6dol",
      "score": 3,
      "body": "Very interesting",
      "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpq6dol/",
      "created": 1727737270,
      "depth": 0,
      "replies": [
        {
          "id": "lpqos36",
          "score": 2,
          "body": "Thanks.",
          "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpqos36/",
          "created": 1727744054,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpqe3sb",
      "score": 3,
      "body": "I like the company but I don't enter stocks that just jumped. What valuation do you think I should enter? I think waiting 3-6months for a dip to 45-44 a share is reasonable given the volatility from 2021-today",
      "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpqe3sb/",
      "created": 1727740111,
      "depth": 0,
      "replies": [
        {
          "id": "lpqoixn",
          "score": 3,
          "body": "Generally I don't like stuff that just jumped either. \n\nIn the case of Nuclear - everything just jumped. I think the theme is at greater risk or taking off without me than fading. Same thing occurred with AI and every AI adjacent industry - they kept going until they 2x'd to 4'd in many cases before letting up.",
          "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpqoixn/",
          "created": 1727743961,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lps6sv5",
      "score": 3,
      "body": "Up 50% this month no thanks :(",
      "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lps6sv5/",
      "created": 1727770815,
      "depth": 0,
      "replies": [
        {
          "id": "lpt7ur6",
          "score": 1,
          "body": "It surprising me that the options have such a high return. Typically when a stock is running up that hard, the options become extremely expensive and offer limited return if the stock continues its move.",
          "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpt7ur6/",
          "created": 1727790371,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lq1iddx",
      "score": 3,
      "body": "I’ve been following this stock for 4 years and it’s been ranging forever. 25 to 60 to 25 to 60 to 25 to 60…. I hope you’re the one that’ll break it !",
      "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lq1iddx/",
      "created": 1727904364,
      "depth": 0,
      "replies": [
        {
          "id": "lq35mjg",
          "score": 2,
          "body": "If you know it well, post some DD on it. Feel like I only scratched the surface, but reluctant to post again on for fear of being labelled spam.",
          "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lq35mjg/",
          "created": 1727927717,
          "depth": 1,
          "replies": [
            {
              "id": "lq55eun",
              "score": 3,
              "body": "Would you still hop in rn on calls $80 strike? Might buy one contract for $580",
              "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lq55eun/",
              "created": 1727965965,
              "depth": 2,
              "replies": [
                {
                  "id": "lq6egs0",
                  "score": 2,
                  "body": "I have plenty of the $80 strikes still. That's just me though. No advice.",
                  "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lq6egs0/",
                  "created": 1727980276,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpt8jkr",
      "score": 2,
      "body": "Yesssir. Following with Jan25 75c. Whole set up is there as long as things keep chugging along",
      "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpt8jkr/",
      "created": 1727790620,
      "depth": 0,
      "replies": [
        {
          "id": "lptbfdv",
          "score": 3,
          "body": "They are out there spreading the word, so hopefully that helps with momentum. \"Centrus Energy Corp. (NYSE American: LEU) today announced that management are scheduled to participate in TD Cowen's 2024 Nuclear Fuel & Next Generation Virtual Roundtable on October 8. The company will participate in a fireside chat at 1:05PM ET on Tuesday, October 8, and host one-on-one investor meetings that day.\"",
          "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lptbfdv/",
          "created": 1727791636,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpznu2i",
          "score": 3,
          "body": "ya rich, bitch\n\n[https://www.reddit.com/r/wallstreetbets/comments/1fuix1r/leu\\_the\\_first\\_100\\_gain\\_is\\_the\\_easiest/](https://www.reddit.com/r/wallstreetbets/comments/1fuix1r/leu_the_first_100_gain_is_the_easiest/)",
          "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpznu2i/",
          "created": 1727883338,
          "depth": 1,
          "replies": [
            {
              "id": "lpzx1sl",
              "score": 3,
              "body": "160% gain so far. Trade is gonna mint",
              "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lpzx1sl/",
              "created": 1727886212,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltogjhe",
      "score": 2,
      "body": "Hey OP, do you think with upcoming earnings this will get another boost?",
      "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/ltogjhe/",
      "created": 1729862316,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsa4eva",
      "score": 1,
      "body": "Hey OP, I just started scaling in yesterday after my own reading and another analysis here. Only a few contracts, but up hugely today. (I’m not sure if I will keep adding, have to revisit it, but super happy.) Thanks!",
      "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lsa4eva/",
      "created": 1729120685,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsk9rfs",
      "score": 1,
      "body": "Good **** moneymaker. Unfortunately I didn’t get in the options in time. Ik you’re banking on the options right now.",
      "permalink": "/r/wallstreetbets/comments/1ft3itl/leu_the_fat_pitch_for_a_us_uranium_enrichment/lsk9rfs/",
      "created": 1729274465,
      "depth": 0,
      "replies": []
    }
  ]
}