{
  "title": "Challenge to find stocks matching 13 attributes of Peter Lynch",
  "score": 34,
  "selftext": "I tried to find modern examples to each attribute mentioned in Chapter 8 of One Up on Wall Street. Then I thought this community could find better fits and have fun together. So please share you candidates for any category below - maybe we discover hidden gems along the way.\n\nRECAP: Chapter 8 of One Up on Wall Street is  filled with fundamental yet profound strategies.  Invest in simple, easy-to-understand businesses over complex ones.  Identify undervalued companies with stable returns and less competition. And, search for as many of 13 attributes of the hypothetically \"perfect company.\" The dream attributes of such a company go as:\n\n***It Sounds Dull—Or Even Better Ridiculous:***\n\nCompanies with unexciting or absurd names often go unnoticed and can be undervalued, providing excellent buying opportunities. Lynch highlights that these companies are typically engaged in simple, straightforward businesses and the duller the name, the better the prospects could be.\n\nMy examples: Duckhorn Portfolio (NAPA) & The Lovesac Company (LOVE)\n\n***It Does Something Dull:***\n\nCompanies engaged in mundane or straightforward businesses might not attract attention but often provide stable and increasing returns. Lynch appreciates companies that do boring things as they are less likely to be in the limelight and more likely to be undervalued.\n\nMy examples: Waste Management (WM) & Stepan Company (SCL)\n\n***It Does Something Disagreeable:***\n\nBusinesses involved in unpleasant industries (like waste management) are often overlooked. Their disagreeable nature keeps them under the radar of most investors, potentially leading to lower valuations and higher returns for those willing to invest in them.\n\nMy Examples: Altria Group (MO), cannabis companies and Caesars Entertainment (CZR)\n\n***It’s a Spinoff:***\n\nCorporate spinoffs often result in profitable investment opportunities. Parent companies usually ensure that spinoffs have strong balance sheets and are well-positioned for success, leading to lucrative investments.\n\nFound a good website on this: [https://thezenofinvesting.com/recent-spinoffs/](https://thezenofinvesting.com/recent-spinoffs/)\n\n***The Institutions Don’t Own It, and The Analysts Don’t Follow It:***\n\nStocks with little to no institutional ownership and minimal analyst coverage can indicate untapped potential. These \"ignored\" stocks might offer significant opportunities for gains before they become mainstream.\n\nMy examples: Denny's Corporation (DENN) & Turtle Beach Corporation (HEAR)\n\n***The Rumors Abound: It’s Involved with Toxic Waste and/or the Mafia:***\n\nLynch points out that companies involved in industries surrounded by rumors or negative perceptions, like waste management or alleged Mafia connections, can offer hidden value. The negative stigma leads to fewer investors and potentially lower valuations.\n\nMy examples: **Clean Harbors (CLH)** & Boyd Gaming (BYD)\n\n***There’s Something Depressing About It:***\n\nCompanies operating in industries that deal with the less pleasant aspects of life, like funeral services, often have consistent demand and face little competition. They are typically ignored by the larger investing community, providing opportunities for higher returns.\n\nMy examples: Service Corporation International (SCI) & Matthews International Corporation (MATW)\n\n***It’s a No-Growth Industry:***\n\nContrary to popular belief, Lynch prefers investing in low or no-growth industries as they tend to have less competition and more predictable business. The stability and predictability of such industries can lead to steady returns.\n\nMy examples: Consolidated Edison (ED) & American Water Works (AWK)\n\n***It’s Got a Niche:***\n\nA strong niche market provides a company with a competitive edge and often a virtual monopoly in its area. Niche companies can control pricing and enjoy high barriers to entry for competitors, often leading to sustained profits\n\nMy examples: Idexx Laboratories (IDXX) & WD-40 Company (WDFC)\n\n***People Have to Keep Buying It:***\n\nLynch prefers investing in companies that make essential, habitual or addictive products like drugs, soft drinks, or cigarettes over those making fickle products, as continuous buying ensures steady business.\n\nMy examples: Procter & Gamble (PG) & Reckitt Benckiser (RBGLY)\n\n***It's a User of Technology:***\n\nCompanies that effectively utilize technology to reduce costs or enhance services are appealing. For example, a company benefiting from the technological price war, like Automatic Data Processing using cheaper computers to increase its profitability, is a better bet than the companies making the computers.\n\nMy examples: Walmart (WMT) & Domino’s Pizza (DPZ)\n\n***The Insiders are Buyers:***\n\nInsider buying is a strong positive signal. If the people who know the company best are buying its stock, it's a good indication of confidence in the company's future. Lynch values insider buying as a sign that the company won't go bankrupt soon and that management is aligned with shareholders' interests.\n\nMy examples: Zoom Video Communications (ZM) & Carnival Corporation (CCL)\n\n***The Company is Buying Back Shares:***\n\nCompanies that buy back their own shares reduce the number of outstanding shares, which increases the value of the remaining shares. This action typically indicates the company believes its shares are undervalued and is a way to reward investors. Lynch sees share buybacks as a very positive move, often more beneficial than other use of capital like dividends or acquisitions​.\n\nMy examples: Apple (AAPL) & Berkshire Hathaway (BRK.B)",
  "link_flair_text": null,
  "id": "1ftwftk",
  "num_comments": 27,
  "created_utc": 1727810140,
  "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/",
  "comments": [
    {
      "id": "lpvv5z6",
      "score": 7,
      "body": "Boston omaha can be in several.\n\nIt Sounds Dull—Or Even Better Ridiculous, It Does Something Dull, It’s a No-Growth Industry, It’s Got a Niche :  Billboards, Fiber and insurance (the main 3).\n\n\nThe Institutions Don’t Own It, and The Analysts Don’t Follow It: almost no coverage or Analysts.\n\n\nThe Rumors Abound: It’s Involved with Toxic Waste and/or the Mafia: The departure of one of the CEOs and a bonus paid which they have already admitted was not a very good idea.\n\n\nInsiders are buying and they anounce a 20M buyback ( their market cap is 450M +/-)",
      "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpvv5z6/",
      "created": 1727820986,
      "depth": 0,
      "replies": [
        {
          "id": "lpvymef",
          "score": 2,
          "body": "First time I hear about Boston Omaha. Nice catch, it fits in several attributes. \n\nWhen I check the industries (broadband, billboards, bonds and asset management), I thought this is a growth company. But stock moves like a cyclical. Do you know why?",
          "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpvymef/",
          "created": 1727822232,
          "depth": 1,
          "replies": [
            {
              "id": "lpw230n",
              "score": 2,
              "body": "In short, the two CEOs who were the driving force behind the investment split. Alex Buffett Rozek left and honestly, that's a good thing, firstly because they received a huge bonus 2 years ago for having profits. And then because, despite appearing to be an excellent investor, he was shooting in several directions.\n\nIf we combine this with the lack of communication with shareholders and a somewhat haughty attitude, many shareholders simply stopped believing in the company.\n\nNow the company seems to have a more defined direction. Fewer salaries, more salaries paid in shares and focus on the company's core business, that is, the FCF that exists is to be reinvested to strengthen the existing businesses.",
              "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpw230n/",
              "created": 1727823488,
              "depth": 2,
              "replies": [
                {
                  "id": "lpwfg3p",
                  "score": 2,
                  "body": "Only red flag I see is there cashflow is negative last five years and inconsistent net income.",
                  "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpwfg3p/",
                  "created": 1727828437,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpwiztd",
                      "score": 1,
                      "body": "Their business model is very slow to generate real FCF. These are businesses that require high initial investments, but then low CAPEX to maintain and with a high moat.\n\nIn the case of Billboards, in addition to making some of them digital, they are also buying some of the land where they are located, which will reduce leases in the long term.\n\nFiber has been the most expensive and without a doubt what can make or break the company. They are channeling a large part of the value received to this sector which increases the Gen/ adm expenses.\n\nDue to the model, I believe that currently the two most important indicators are revenue growth and gross profit margin. \n\nMy biggest concern is not so much with the model, but with the management. Let's see if Adam has the ability to deliver on what he mentioned in the letter.",
                      "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpwiztd/",
                      "created": 1727829759,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lpweeyl",
              "score": 1,
              "body": "I have another: landbridge",
              "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpweeyl/",
              "created": 1727828047,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpwme62",
      "score": 7,
      "body": "Tayd - Taylor Devices Inc. it’s boring, not followed by analysts, and a niche product.",
      "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpwme62/",
      "created": 1727831040,
      "depth": 0,
      "replies": [
        {
          "id": "lpxptq8",
          "score": 2,
          "body": "Revenue and income growth, low debt, smart capital allocation. Sounds.good, added to my watchlist.\n\nI see the stock is on rise since 2022 and 2024 performance is remarkable. But the company is 69 years old, do you think it is still ambitious to become mid-cap?",
          "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpxptq8/",
          "created": 1727848413,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpv65fx",
      "score": 3,
      "body": "ZM and CCL prices look really good. Another one for \"People have to have it\" CELH. I know I have to have it! And it's at a discount since pepsi screwed up their inventory which will work itself out next 2 quarters.",
      "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpv65fx/",
      "created": 1727812945,
      "depth": 0,
      "replies": [
        {
          "id": "lpvojmk",
          "score": 1,
          "body": "CELH fits to several categories. It should also be Got A Niche - healthy, zero sugar & tasty energy drink",
          "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpvojmk/",
          "created": 1727818725,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpwplti",
      "score": 3,
      "body": "I will give you one of my hidden gems stocks since it actually has many of the attributes:\n\n\nVALMET (finish company)\nTicker HEL: VALMT\n\n\nIt sounds dull—or even better ridiculous: Valmet…\n\n\nIt does something dull: pulp, paper & energy \n\n\nIt does something disagreeable: Involves industrial processes with environmental and regulatory challenges\n\n\nIt’s a spinoff: Valmet was spun off from Metso in 2013\n\n\nThe institutions don’t own it, and the analysts don’t follow it:  being Finish, it’s not widely followed outside Finland and Europe. I read institutions own around 40%\n\n\nThe rumors abound: No mafia rumors, but operates in industries with environmental scrutiny\n\n\nThere’s something depressing about it: Heavy industry with environmental impacts, which isn’t glamorous.\n\n\nIt’s a no-growth industry: paper…\n\n\nIt’s got a niche: world leaders in pulp and paper machinery\n\n\nPeople have to keep buying it: Constant demand for its industrial equipment and automation services\n\n\nIt’s a user of technology: Automates and optimizes manufacturing processes\n\n\nNo insider buying or share repurchase tho.",
      "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpwplti/",
      "created": 1727832259,
      "depth": 0,
      "replies": [
        {
          "id": "lpwznaf",
          "score": 1,
          "body": "It’s a great suggestion!  What’s with the share issuance a few quarters back? And why are the dividends so inconsistent? If you don’t know, that’s fine. But it would definitely check some boxes for me if it weren’t for those elements.",
          "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpwznaf/",
          "created": 1727835887,
          "depth": 1,
          "replies": [
            {
              "id": "lpyd4vj",
              "score": 1,
              "body": "\nHere you have the share related info:\n\nhttps://www.valmet.com/media/news/?release-type=changes-in-companys-own-share\n\nAlso, the dividends are actually pretty consistent. Maybe you looked at them in dollars? \n\nEUR\t\n\n1.35 (2023) \n\n1.30\t\n\n1.20\t\n\n0.90\t\n\n0.80\t\n\n0.65\t\n\n0.55\t \n\n0.42\t\n\n0.35\t\n\n0.25\n\n0.15 (2013) \n\nhttps://www.valmet.com/investors/shareholders/dividend/",
              "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpyd4vj/",
              "created": 1727864381,
              "depth": 2,
              "replies": [
                {
                  "id": "lpyfyuq",
                  "score": 1,
                  "body": "Thank you, yes. I was using a website that converted to dollars.",
                  "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpyfyuq/",
                  "created": 1727866086,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpwmq9b",
      "score": 2,
      "body": "American Packaging Corporation",
      "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpwmq9b/",
      "created": 1727831171,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpzqsrz",
      "score": 2,
      "body": "WM",
      "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpzqsrz/",
      "created": 1727884287,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpw782o",
      "score": 1,
      "body": "Framework does not have to be perfect for it to fit Peter Lynch's criteria. You said it yourself, its a hypothetical dream company. If a company can be categorized into a large amount of these categories, it may be a candidate for fundamental research.",
      "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpw782o/",
      "created": 1727825363,
      "depth": 0,
      "replies": [
        {
          "id": "lpxzwa6",
          "score": 2,
          "body": "Lots of the criteria seem to be fairly similar. I would even go out to say downright repetitive.",
          "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpxzwa6/",
          "created": 1727855098,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpvv4r3",
      "score": -1,
      "body": "How do you know Peter Lynch even follows these principles? Seems really silly",
      "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpvv4r3/",
      "created": 1727820974,
      "depth": 0,
      "replies": [
        {
          "id": "lpvw6pi",
          "score": 4,
          "body": "In next chapter, He mentions a perfect company that possesses all 13 attributes",
          "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpvw6pi/",
          "created": 1727821351,
          "depth": 1,
          "replies": [
            {
              "id": "lpwefed",
              "score": 1,
              "body": "which company is this?",
              "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpwefed/",
              "created": 1727828052,
              "depth": 2,
              "replies": [
                {
                  "id": "lpxn0bx",
                  "score": 2,
                  "body": "Just checked again, it was a made up \"perfect\" company - not real. He called it Cajun Cleansers\n\nAnyway, he describes it as combination of all of the worst elements Waste Management, Pep Boys and Safety-Kleen, if that would help",
                  "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpxn0bx/",
                  "created": 1727846732,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq32tk7",
                      "score": 2,
                      "body": "I read his books 25 years ago, but I do remember him making a 10 bagger plus off of Leggs Pantyhose after his wife recommended them to him and he checked out the company. I don't think pantyhose are depressing or boring necessarily.....",
                      "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lq32tk7/",
                      "created": 1727926380,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lpwmnvk",
          "score": 1,
          "body": ">How do you know Peter Lynch even follows these principles? \n\nbecause Lynch wrote 2 books on his investing theories, and showed how he picked companies that fit his criteria.",
          "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpwmnvk/",
          "created": 1727831146,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpy9jaf",
      "score": -5,
      "body": "The chances of you going one up on Wall Street like Peter Lynch are zero.  Stop the madness and buy an index.",
      "permalink": "/r/stocks/comments/1ftwftk/challenge_to_find_stocks_matching_13_attributes/lpy9jaf/",
      "created": 1727862007,
      "depth": 0,
      "replies": []
    }
  ]
}