{
  "title": "Nike postpones investor day, posts mixed quarterly results as it gears up for CEO change",
  "score": 167,
  "selftext": "Nike on Tuesday said it was postponining its investor day as it delivered mixed fiscal first quarter results.\n\nHere’s how the world’s largest sneaker retailer performed compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:\n\nEarnings per share: 70 cents vs 52 cents\n\nRevenue: $11.59 billion vs $11.65 billion\n\nOver the last year, Nike has been accused of falling behind on innovation and ceding share to competitors as it focused on selling directly to consumers through its own websites and stores rather than through wholesalers such as Foot Locker and DSW. \n\nThe company announced in September that CEO John Donahoe would be stepping down and would be replaced by company veteran Elliott Hill, who is scheduled to take the helm Oct. 14.\n\nUnder Donahoe’s leadership, the company grew annual sales by more than 31%, but it got there by churning out legacy franchises such as Air Force 1s, Dunks and Air Jordan 1s — not the groundbreaking styles that turned the company into a global powerhouse. \n\nOver the last few quarters, Donahoe has spoken about the need to improve innovation and mend Nike’s relationships with wholesalers, but the company’s board decided that Hill, who spent 32 years with Nike before retiring in 2020, would be the right person to lead its next chapter. \n\nDonahoe is expected to be present during the company’s conference call with investors Tuesday afternoon, but observers will be keen to see if there are any clues into where the company is planning to go under Hill’s leadership. \n\nThe incoming CEO will need to power up Nike’s innovation pipeline, reset its relationships with wholesalers and improve morale after a series of layoffs and a breakdown in culture. \n\nOverall, the sneaker market has been relatively stagnant in the U.S. Consumer spending on discretionary goods such as new clothes and shoes has been sluggish, which has made Nike’s situation that much more difficult. \n\nFootwear sales in the U.S. are projected to grow by just 2% in 2024 compared with 2023 after barely budging between 2022 and 2023, according to Euromonitor. Athletic footwear is expected to grow by about 5.6%, the firm said. \n\nNike’s performance has also been weighed down by the uneven economy in China, Nike’s third-largest market by revenue, which will be another key item to watch for in the earnings report. Nike’s performance in China is often an indicator of the region’s financial health, and in late June, it warned of a “softer outlook” in the region. However, China’s central bank recently unveiled its largest stimulus measures since the Covid pandemic, which is expected to give the region’s economy a much-needed boost. \n\nNike’s fiscal first quarter would have concluded prior to those stimulus measures, but executives may share color on how sales are performing during the current period. \n\nShares of Nike closed at $88.40 on Monday, down about 19% so far in 2024, significantly underperforming the S&P 500′s gains of about 21%.\n\nSource: https://www.cnbc.com/2024/10/01/nike-nke-earnings-q1-2025.html",
  "link_flair_text": null,
  "id": "1fty3mh",
  "num_comments": 42,
  "created_utc": 1727814211,
  "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/",
  "comments": [
    {
      "id": "lpvnd6z",
      "score": 61,
      "body": "They pulled their guidance. Stock selling off more. Personally I think they’re going to give extremely soft guidance to give the incoming CEO a chance to blow the doors off the first year at the helm. \nI’m loaded with puts, happy to see the small sell off but I had them going below 80.",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpvnd6z/",
      "created": 1727818338,
      "depth": 0,
      "replies": [
        {
          "id": "lpvtb7s",
          "score": 1,
          "body": "Any DD ahead of time? Would of been great getting in on a quick put",
          "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpvtb7s/",
          "created": 1727820338,
          "depth": 1,
          "replies": [
            {
              "id": "lpvvabu",
              "score": 0,
              "body": "No none. I play earnings with options mostly. The risk reward was very good for Nike. I hedged 3:1 with 100/105 call spreads which obviously are going to zero but the puts will print. Not a 10 bagger unless it goes to 77 or so.",
              "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpvvabu/",
              "created": 1727821030,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpvtpcn",
      "score": 31,
      "body": "Lots of big fashion retailers going to follow, IMO. Cutting corners for short term EPS as they watch their rev growth slow in key markets due to competition.\n\nLULU, LEVI, have eroded their high-quality brand association and no longer can justify the prices they’re charging. Consumers turning to “generics” from Temu, competitors in Alo and Uniqlo, etc. Lulu’s also had a bunch of straight up strategic misses — fashion failures and recall, failed foray into fitness tech, etc. Forward PE of 20 is too high.",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpvtpcn/",
      "created": 1727820474,
      "depth": 0,
      "replies": [
        {
          "id": "lpwtw8w",
          "score": 9,
          "body": "Never thought I’d ever shop at Temu or SHEIN but here I am ordering off branded clothing for cheap! Not mad about it either",
          "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpwtw8w/",
          "created": 1727833822,
          "depth": 1,
          "replies": [
            {
              "id": "lq3mt6h",
              "score": 1,
              "body": "and when it falls apart after one wash or gives you cancer?",
              "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lq3mt6h/",
              "created": 1727937728,
              "depth": 2,
              "replies": [
                {
                  "id": "lq3wld4",
                  "score": 1,
                  "body": "Are you speaking from experience?",
                  "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lq3wld4/",
                  "created": 1727944743,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq9wn11",
                      "score": 2,
                      "body": "[https://www.lemonde.fr/en/international/article/2024/08/14/shein-and-temu-products-found-to-contain-high-levels-of-toxic-chemicals\\_6715032\\_4.html](https://www.lemonde.fr/en/international/article/2024/08/14/shein-and-temu-products-found-to-contain-high-levels-of-toxic-chemicals_6715032_4.html)",
                      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lq9wn11/",
                      "created": 1728033877,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lqbfdkf",
                          "score": 1,
                          "body": "Article doesn’t say anything about men’s jeans and shirts so I think I’m in the clear. Also, these same chemicals have been found in a shit ton of American products as well so it’s nothing new.",
                          "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lqbfdkf/",
                          "created": 1728057027,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lpwlm8c",
          "score": 1,
          "body": "Price target?",
          "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpwlm8c/",
          "created": 1727830743,
          "depth": 1,
          "replies": [
            {
              "id": "lq1g5wo",
              "score": 2,
              "body": "Called it on Levi’s; did not enter a position. Entered a position for LULU 6/2025 200P since it ran up 5-10% randomly to 280 this week.\n\nI see no scenario in which LULU earnings do well. It’s a sub segment of market data, but paired with their ER / guidance changes:\n\n- Google trends on LULU search keys / combinations are down from their absolute peak — not something  you want to see as they expand into new geographical markets and get exposed to new populations.\n\n- Testimony on LULU is souring, example is on Reddit: across LULU-specific, thrifting, clothing resale, and general fashion / athleisure subreddits.\n\n- Competitors — ALO mentions are trending upwards across both aforementioned forums.\n\n- Prior to them taking down product reviews from their website, couple of my crawlers had the sentiment turning vastly negative, and that’s with the understanding that they’ve historically been highly curated in product reviews.",
              "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lq1g5wo/",
              "created": 1727903651,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpvnkow",
      "score": 10,
      "body": "Hopefully the old CEO gets a fat golden parachute for all the damage he caused the investors.",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpvnkow/",
      "created": 1727818407,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpvkia2",
      "score": 16,
      "body": "\"Nike on Tuesday said it was postponining its investor day\"\n\nSo don't anyone expect anything exciting any time soon. Company also withdrawing guidance.",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpvkia2/",
      "created": 1727817407,
      "depth": 0,
      "replies": [
        {
          "id": "lpzpu5a",
          "score": 3,
          "body": "The investor day was going to be Nov 19th and new CEO doesn't start until Oct 14th. Not really time in a month for the new CEO to have a full plan to present to Investors in only a month.",
          "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpzpu5a/",
          "created": 1727883982,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpwncml",
      "score": 7,
      "body": "Im so glad I dodged Nike. My broker was pumping it and it's such a global brand but it's clearly been on the decline. Good luck to the new CEO. Big job ahead.",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpwncml/",
      "created": 1727831408,
      "depth": 0,
      "replies": [
        {
          "id": "lpy4mk5",
          "score": 2,
          "body": "Yeah whatever. It was also said about Meta and Google that they are on the decline only 1-3 years ago.",
          "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpy4mk5/",
          "created": 1727858501,
          "depth": 1,
          "replies": [
            {
              "id": "lpypflt",
              "score": 2,
              "body": "Not the same mate.\nMETA price was absurdly low when looking at the FCF and the company is more solid than Nike will ever be.\n\nI bought the majority of META near the bottom aswell (128$ average price per share) but I wouldn't dare to touch this company.",
              "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpypflt/",
              "created": 1727870851,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpzqe8k",
          "score": 1,
          "body": "What does your broker pumping it mean?",
          "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpzqe8k/",
          "created": 1727884160,
          "depth": 1,
          "replies": [
            {
              "id": "lpztsph",
              "score": 1,
              "body": "They rated it as overweight and would put out bullish research notes (internal for clients) stating their bullcase for it. When I had money avaliable they would recommend it as a buy. The stock just went down.\nMaybe oneday it comes back but I always thought there were better value options elsewhere.",
              "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpztsph/",
              "created": 1727885209,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lqeqtpe",
          "score": 1,
          "body": "Fire your broker and buy VT, he's clearly got no business in guiding you.",
          "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lqeqtpe/",
          "created": 1728101085,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpvd8ed",
      "score": 19,
      "body": "welp pretty much as expected. Conf call will be helpful. They are doing so many things poorly or just plain wrong that it seems almost unthinkable that they can't get things moving back in the right direction. And despite all the missteps they are still selling $11.6 billion in 90 days worldwide. Just need to stop shooting themselves in the feet",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpvd8ed/",
      "created": 1727815127,
      "depth": 0,
      "replies": [
        {
          "id": "lpvpdlx",
          "score": 9,
          "body": "> They are doing so many things poorly or just plain wrong that it seems almost unthinkable that they can't get things moving back in the right direction\n\nPeople said the same thing when they thought Under Armor was going to unseat Nike, but that didn’t happen.\n\n\nIf Nike stops price gouging I think everything will return to normal. People still like Nike, it just costs too much, especially in a cost of living crises, for most people to bother with.\n\nI highly doubt brands like Hoka or Allbirds will have any real effect on Nike, outside of enthusiast runners. Casuals will go back to Nike due to the brand premium as soon as the prices aren’t as outrageous. Sneakers aren’t an elastic good like food.\n\nAll in my completely uneducated layman opinion of course.",
          "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpvpdlx/",
          "created": 1727819003,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpvr15m",
      "score": 5,
      "body": "A fundamental rule of investing your hard-earned money in any company is to avoid those that frequently hold ‘sales.’ These companies often have excessive inventory, indicating poor sales performance",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpvr15m/",
      "created": 1727819561,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpxj65d",
      "score": 6,
      "body": "buy more nike, it will be good 2 years from now",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpxj65d/",
      "created": 1727844586,
      "depth": 0,
      "replies": [
        {
          "id": "lq9eltr",
          "score": 1,
          "body": "Best believe share this. i guarantee 100%",
          "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lq9eltr/",
          "created": 1728021454,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpvnv5w",
      "score": 11,
      "body": "I love Nike but direct to consumer is an epic fail",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpvnv5w/",
      "created": 1727818503,
      "depth": 0,
      "replies": [
        {
          "id": "lq83nwf",
          "score": 1,
          "body": "They're direct to consumer, but they also closed their online store for my whole country last year.\n  \nThey're the only athletics brand that you straight up can't buy in the country, it's mind boggling.",
          "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lq83nwf/",
          "created": 1728000960,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpvluxc",
      "score": 13,
      "body": "I’m a huge sneakerhead but so fucking done with Nike. They shoot themselves in the dick by making limited numbers of shoes they could sell 20x of and on top of that letting most of them go to resellers before the public even gets a shot. I think I saw over 2 million people tried to get the Travis 1 Lows that just dropped. They made 150k pairs and easily let 1/3 go to resellers who then charge $500-$600 a pair. Nike could seriously sell 2 million pairs of those for $180 instead of 150k for $150 and make a fucking killing. I could go on for hours about ways to fix Nike, but they seem too stupid to get out of their own way.\n\nI entered 9 fucking raffles from various retailers to get those shoes and tried on Nike’s SNKRS app, which has no bot protection by the way. Couldn’t get a pair. I have never bought Reps before but I’m sick of Nikes shit and may look at it in some of their hype shoes. Some Reps are honestly higher quality than the real deal. Nikes Quality Control is dog shit. Get shoes scuffed and covered in glue straight out the box.",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpvluxc/",
      "created": 1727817848,
      "depth": 0,
      "replies": [
        {
          "id": "lpwq9t8",
          "score": 4,
          "body": "Regarding reps, yeah it says a lot when you can get a $20 rep for white air force 1's and they'll have better quality standards than the ones Nike sells for $115. Never buying GR casual sneakers again from them.",
          "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpwq9t8/",
          "created": 1727832508,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpvkrel",
      "score": 7,
      "body": "stock had been bid up too much. High 80's was just asking to get slapped in the nuts.",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpvkrel/",
      "created": 1727817489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpvfjhj",
      "score": 1,
      "body": "Recession looming.",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpvfjhj/",
      "created": 1727815836,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpyx2mm",
      "score": 1,
      "body": "It seems like the corporate equivalent of a miscreant agreeing to rehab is hiring a new CEO.",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpyx2mm/",
      "created": 1727874067,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpx6fm2",
      "score": 0,
      "body": "They said no guidance, no new products coming soon,\nCompetition is high,\nStock is going to 50 soon",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpx6fm2/",
      "created": 1727838537,
      "depth": 0,
      "replies": [
        {
          "id": "lpy95ev",
          "score": 1,
          "body": "People like making predictions",
          "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpy95ev/",
          "created": 1727861740,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpw9uq8",
      "score": -10,
      "body": "Go woke go broke.. I quit buying Nike a couple years ago",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpw9uq8/",
      "created": 1727826339,
      "depth": 0,
      "replies": [
        {
          "id": "lpxeo48",
          "score": 2,
          "body": "goofy wrote go woke go broke lmaoooo",
          "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpxeo48/",
          "created": 1727842269,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpxnf48",
      "score": -3,
      "body": "I got in on the last drop. Give this a little time, and its going to be an opportunity for longer term investors. Nike is just too important of a brand. This is not really about numbers today. Its about believing in the brand and the new CEO. I'll be buying this dip too.",
      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpxnf48/",
      "created": 1727846971,
      "depth": 0,
      "replies": [
        {
          "id": "lpyt4c9",
          "score": 3,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpyt4c9/",
          "created": 1727872470,
          "depth": 1,
          "replies": [
            {
              "id": "lpz8ecb",
              "score": 2,
              "body": "Your analysis is correct \\*today\\*. But this approach is very much like analysts who downgrade stocks at or near bottoms. There is no such thing as a stock which is a great opportunity for future gains if everything is peachy. When I was buying REITs in 2022 and early 2023, the analysts and talking heads were saying CRE is dead. I have made well over 100% gains (not including dividends) on such stocks (with some lots >200% gain). I bought Meta at $100  when everyone was saying the company is done and over. Not saying that you are wrong. You are correct today. I believe Nike will turn around because I believe in the brand, and the new CEO's ability to push innovation. Your thesis is that Nike will continue to decline and no innovation or turn around will happen. Fair enough. Let's see what happens.",
              "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpz8ecb/",
              "created": 1727878249,
              "depth": 2,
              "replies": [
                {
                  "id": "lpzwin9",
                  "score": 1,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lpzwin9/",
                  "created": 1727886045,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq00jao",
                      "score": 1,
                      "body": "Sorry kiddo you may be incorrect in your analysis again. Investing for 26 years (started very young). Almost never sell short term. Six figure dividends per year and not even a dividend investor - still very much into growth primarily. Just a very large portfolio. My school-aged children have larger portfolios than many young adult investors. They of course mostly invest in broad-based ETFs. I think you're a smart guy/gal but perhaps jump to conclusions and overly generalize at times. I wish you all the best in your investing.",
                      "permalink": "/r/stocks/comments/1fty3mh/nike_postpones_investor_day_posts_mixed_quarterly/lq00jao/",
                      "created": 1727887326,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}