{
  "title": "Is CELH a BUY?!",
  "score": 42,
  "selftext": "Celcius has sold off quite a bit after their deal with Pepsi to take over distribution for them. Main issue was that pepsi took too much inventory from them and that invetory caused an oversupply for pepsi to burn through before getting more product from Celcius. This is my limited understanding of the issue. This company also looks great financially and their product is footprint is growing in stores. The have low debt, high equity to liability ratio, retained earning also increasing last two years.  I walked into wegmans today and it was piled up on the floor right in front of all the registers. Anyway, the only thing that gives me pause is their preferred stock issuance and how it relates to their cash see link below. Do you think their cash looks nice becasue of the stock issuance? I'm told that preferred stock is bad because it's a sneaky way to finance with debt instead of through the business. What are your thoughts on CELH?\n\n[https://postimg.cc/jD1SNgKz](https://postimg.cc/jD1SNgKz)",
  "link_flair_text": null,
  "id": "1fu3snb",
  "num_comments": 85,
  "created_utc": 1727829641,
  "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/",
  "comments": [
    {
      "id": "lpwl2zb",
      "score": 70,
      "body": "If I’m not wrong, CELH recognise revenue once it sold their supplies to Pepsi instead of when Pepsi sold their supplies. Because of this, Pepsi bought too much from CELH, making investor thinks that the demand for their drinks is really high and that growth rate was sustainable. \n\nBut a few weeks ago, CELH admitted that Pepsi will not buy as much as last year since Pepsi have overestimated the demand for Celsius, analyst are now predicting a revenue growth of ~15% for the next 2 to 3 years, which I believe that there is still room for the stock price to fall.\n\nIf it falls to somewhere between $30 and mid $20s, that’s when it’s really attractive to buy in.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwl2zb/",
      "created": 1727830542,
      "depth": 0,
      "replies": [
        {
          "id": "lpwlll9",
          "score": 4,
          "body": "Ok I was under the impression the Pepsi thing would work itself out in a few quarters but you’re saying a few years?! Yikes.",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwlll9/",
          "created": 1727830737,
          "depth": 1,
          "replies": [
            {
              "id": "lpwq2ia",
              "score": 6,
              "body": "I’m betting a few quarters also, 26 fwd pe isn’t bad rn",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwq2ia/",
              "created": 1727832432,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lq586xa",
              "score": 1,
              "body": "Plan to hold any company for at least 3-5 years, otherwise you'll just get frustrated...",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lq586xa/",
              "created": 1727966801,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lpx0ql6",
              "score": -13,
              "body": "Bro look what happened to Bang Energy went bankrupt and they were the most hyped before Celsius started getting hyped\n\nhttps://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F60162367-5665-49a5-bcbc-91ee1f615ac7_1600x1476.jpeg",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpx0ql6/",
              "created": 1727836290,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lqkqobg",
          "score": 1,
          "body": "Still, CELH has a very low PE ratio for the industry considering 15% annual growth. ",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lqkqobg/",
          "created": 1728192619,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpwo2hj",
      "score": 13,
      "body": "Im bagholding at around $65/share, far better than the $120 peak but i still feel its a falling knife. Its in good hands with pepsi but i think its gona be a few quarters until their numbers recover. Id say wait for $25, if it doesnt come, then do what you want or invest in something else, theres a lot of stock prices falling right now.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwo2hj/",
      "created": 1727831681,
      "depth": 0,
      "replies": [
        {
          "id": "lpx89og",
          "score": 7,
          "body": "Bought at $90 and kept DCA until my average was $66 per share. I gave up a few months ago and have been watching my shares go down since. Going to be bag holding just cause. I’m sure it’ll go to $25 soon",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpx89og/",
          "created": 1727839316,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpwq78y",
          "score": 1,
          "body": "What are you eyeing to drop and pick up?",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwq78y/",
          "created": 1727832482,
          "depth": 1,
          "replies": [
            {
              "id": "lpyjb85",
              "score": 2,
              "body": "Have my eye on ulta, panw, elf, adbe, goog, at the moment",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpyjb85/",
              "created": 1727867913,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpx2iil",
      "score": 8,
      "body": "I would put a 30 multiple on it.\n\nSo $30-40 depending if you use forward or current.\n\nBalance sheet is good. No debt and will produce FCF going forward and profitable.\n\nAs an energy drinker and use to working in the industry. Has MNST potential or even buyout by Pepsi.\n\nPEP, KO KDP, etc all need growth and usually do buyouts.\n\nMonster might even get bought out. Speculation that founders/CEOs are old and no successors.\n\nWorst case scenario CELH can do buybacks with no debt and FCF. But they can also use it for more international growth.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpx2iil/",
      "created": 1727836955,
      "depth": 0,
      "replies": [
        {
          "id": "lpxkzl1",
          "score": 2,
          "body": "Did my due diligence and came to roughly the same conclusion. Do you have any insights from working in the industry about international markets?  What are the sticking points and hurdles?",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpxkzl1/",
          "created": 1727845583,
          "depth": 1,
          "replies": [
            {
              "id": "lpyc0nv",
              "score": 4,
              "body": "Not sure about international.\n\nBut in the US, energy drinks sell pretty well.\n\nI just stocked the shelves.\n\nAlso Amazon and Costco sell cases in good amounts too. I think CELH is in top 3 selling on Amazon.",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpyc0nv/",
              "created": 1727863671,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lq262n1",
          "score": 0,
          "body": "I'm a CELH bagholder, but don't see why pepsi would buy them unless they want to waste money.\n\nThey already bought Rockstar like 3 years ago and done nothing with it.",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lq262n1/",
          "created": 1727913406,
          "depth": 1,
          "replies": [
            {
              "id": "lq26kgj",
              "score": 2,
              "body": "Mature company and need growth.\n\nPepsi just bought Siete Foods.\n\nAlso Rockstar is stocked and sold. Seen it when I was working in the industry.\n\nMonster even bought Bang when it went bankrupt.\n\nA lot of these consumer brands want to build big portfolios of brands. Especially ones with $1 billion+ revenue ones.\n\nPG even sold off some like Pringles. And restructured what brands they held.",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lq26kgj/",
              "created": 1727913595,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpzx76m",
      "score": 6,
      "body": "I'm a vendor and it's still our most sold item . I bought of what I see when im out n about. People are still chugging them ",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpzx76m/",
      "created": 1727886260,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpwkq0f",
      "score": 17,
      "body": "Still looks like a falling knife...",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwkq0f/",
      "created": 1727830406,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpwkybo",
      "score": 9,
      "body": "As a celh holder. I thought so but the share price keeps proving me wrong.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwkybo/",
      "created": 1727830493,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpwrizv",
      "score": 11,
      "body": "Yes, I would say it is a buy. Even at ~10-20% annual revenue growth it is growing much faster than its competitors and has a similar PE ratio. ",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwrizv/",
      "created": 1727832958,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpxjtgn",
      "score": 3,
      "body": "I have a small position myself. Did a quick DCF:  if revenues continue to grow at 15% it has an intrinsic value of around 36. This gives a moderate margin of safety assuming I didn’t bork the calculations.\n\nOf course, sales could continue to slow, in which case the bottom would fall out of the story that’s been propelling it the last few years.\n\nWouldn’t bet the farm but may be a nice sidebet on an addictive product (about 200mg of caffeine per can).",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpxjtgn/",
      "created": 1727844936,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpxonbv",
      "score": 4,
      "body": "It’s near a bottom, basically trading at single digit growth for the next ten years. The situation with Pepsi is more complicated and this is dead money until the CEO can explain what happened and make more certain projections about the future, esp. with Pepsi focusing on the Gatorade competitor. \n\nBut I think it’s a pretty good product and it sells out regularly at my local grocery store. There’s serious international opportunity. I suspect the stock will outperform expectations over the next few years, but near term is just not compelling.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpxonbv/",
      "created": 1727847702,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpx335a",
      "score": 8,
      "body": "There is a bottom to this.  \n\nOver the years I’ve heard Coca Cola is obsolete.  I’ve heard this upstart Monster is a fad.  I’ve heard soda in general is over.  I’ve heard smoothies will go away.  These fear mongers have all been proven wrong if you just let some time elapse.\n\nCelsius will bottom at some level.  Maybe here, maybe lower.  Then it will show sustainable growth of some rate.  It’s well run and pepsi-backed not like the lunatic running Bang.  \n\nI don’t know if $30 CELH is $140 META from a couple years ago but I know there’s a future there sometime, and from some base.\n\nIf one believes that, it’s just a matter of figuring out what price and how close someone thinks they can get to cherry picking their buy.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpx335a/",
      "created": 1727837172,
      "depth": 0,
      "replies": [
        {
          "id": "lpz9m41",
          "score": -4,
          "body": "Ghost is going to be the energy drink winner long term, and it's because of the most simple business concepts ever. A Ghost can on the shelf looks like a kaleidoscope, and is able to use flavors and imagery from types of candy that people are already addicted to. The Celsius can on the shelf next to it is white and covered with text, with no interesting flavors at all.\n\nDo you want the rainbow reflective can with a drink in it that tastes like sour patch kids, or do you want the nearly pure white can covered in black text with a drink in it that tastes like... drumroll... generic berry? It's simple to predict what the average customer will do with this choice.",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpz9m41/",
          "created": 1727878670,
          "depth": 1,
          "replies": [
            {
              "id": "lpzea53",
              "score": 4,
              "body": "The appearance of a can may be changed with the snap of a finger.  And while I don’t drink any of this crap of any brand or type, nor do I care about any kind of tribal devotion for or against any brand or type, what I have observed is that masses of people have a belief - rightly or wrongly - that Celsius drinks give them a huge energy boost but without sugar crash or other unwanted side effects.  I might find that silly, but they don’t.  I’ve also observed they like the flavors.  Again though, I’m not interested for the drink or the can color, I’m interested for the business.  Red bull and monster have shown that massive money can be made selling something that tastes like armpit in unappealing containers.  It’s about distribution and consumer choice.",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpzea53/",
              "created": 1727880230,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lqr5xwl",
              "score": 3,
              "body": "Celsius has an entirely different positioning. Look at every other energy drink. They have a strong artificial aesthetic characterized by high contrast bright colors and aggressive styling, like monster or rockstar or bang. Celsius is minimalist and quiet, and portrays itself as healthy making it popular with women and health conscious buyers. It's a winning strategy.",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lqr5xwl/",
              "created": 1728295091,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpwzjaa",
      "score": 2,
      "body": "Carrying moderately heavy bags from $51 cost basis.  Selling covered calls conservatively to gradually bring that basis down- one week expirations to keep it on a short leash.\n\nI think the long term growth story is intact with international expansion barely scratched.  A few quarters to work out yet.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwzjaa/",
      "created": 1727835846,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpyfcpy",
      "score": 2,
      "body": "The stock continues to make lower lows so I'm not too confident at the moment. Probably should wait for the stock to become more flat over the next couple of months before making a move. If I had to guess, you won't see any type of price action recovery until later next year. \n\n\n I bought in at 66.80 and I'm down like almost $7,000. Don't think I will average down either. Either going to cut my losses or let it ride out. At the moment, I'm going to let it ride out for the next year or two",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpyfcpy/",
      "created": 1727865727,
      "depth": 0,
      "replies": [
        {
          "id": "lpyh48u",
          "score": 1,
          "body": "I’m in the same boat with the same plan",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpyh48u/",
          "created": 1727866732,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lq05yak",
      "score": 2,
      "body": "I got excited when it dropped to $48, bought a ton of shares and now have sold because I simply can't bear to lose even more money.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lq05yak/",
      "created": 1727889035,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpwsi95",
      "score": 5,
      "body": "No need to catch a falling knife. Wait until she turns the corner.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwsi95/",
      "created": 1727833314,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpwlzmj",
      "score": 3,
      "body": "I picked up a starter pack of shares in the low 30’s",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwlzmj/",
      "created": 1727830884,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpwl6cb",
      "score": 3,
      "body": "So at $30 it will be 30 PE. Market leader (monster) is 32 PE and CELH has been allegedly increasing their market shares so the upside is there if they can report decent revenue growth in next ER.\n\nBut it's also worth noting that this stock lured in bagholders with its strong numbers and then randomly shed 8\\~10% like 4 times in a row now. 5th times the charm maybe? I don't know. The problem is that it's no longer considered hyper growth stock like it used to be, so while it might go up over time, the momentum would be somewhat conservative.\n\nDisclaimer: I was invested for a bit at $32 avg cost basis but kinda got bored of it going sideways forever. Exited position now.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwl6cb/",
      "created": 1727830578,
      "depth": 0,
      "replies": [
        {
          "id": "lpx270w",
          "score": 3,
          "body": "CELH CEO has already stated revenue from Pepsi will be down over $100M next Q. However, think once we get through next 1-2 Qs it’ll stabilize back to growth. Seems to be at fair price now and priced in. \n\nHowever, I’ll buy some now and have some cash in case if falls further in a month after earnings coming in down comparatively.",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpx270w/",
          "created": 1727836836,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpx7v8h",
          "score": 2,
          "body": "I don’t think you know what the word forever means.",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpx7v8h/",
          "created": 1727839142,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpwyja9",
          "score": 3,
          "body": "'Forever'?  Hasn't it only been a few or couple of months since it dropped to low 30s?",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwyja9/",
          "created": 1727835481,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpynlh7",
      "score": 2,
      "body": "If Pepsi doesn't eventually buy it out, they will slowly raise the retail price, killing the volume and the whole line- then blame shifting consumer preferences.  Common play when they or Coke \"take over distribution\".  How is that Fuze and Vitamin Water treating you?  And now that Coke has watered down BodyArmor, its decline has begun, too.  Gotta extract as much as they can, as fast as they can.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpynlh7/",
      "created": 1727869990,
      "depth": 0,
      "replies": [
        {
          "id": "lpyopea",
          "score": 0,
          "body": "Can you say more? Did coke or someone else take over distribution for fuze and vitamin water? Are you saying Pepsi would just do this to kill off celcius? I’m a bit confused here.",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpyopea/",
          "created": 1727870510,
          "depth": 1,
          "replies": [
            {
              "id": "lpyr4f8",
              "score": 2,
              "body": "It's in Pepsis interest to drive down the price to well below their average cost- in the event they do want to buy it out. Reducing their exposure in dilution and premium to the SP from their own stock holdings. ImO Pepsi actually think this is a viable product and nice diversificación and will be driving this bad boy down looking to aquire building on it's ~10% holdings.",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpyr4f8/",
              "created": 1727871610,
              "depth": 2,
              "replies": [
                {
                  "id": "lpyt7lk",
                  "score": 1,
                  "body": "I’ve heard something that they acquired 10% stake around $25 mark. I assume they’d try to drive it down below this?",
                  "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpyt7lk/",
                  "created": 1727872507,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpywzca",
                      "score": 1,
                      "body": "Yeah if they do want to acquire. They just made an acquisition yesterday (PepsiCo) so the board is obviously thinking along these lines.",
                      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpywzca/",
                      "created": 1727874030,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lpyquqh",
              "score": 0,
              "body": "In a typical retail lifecycle of beverages, a new product is developed, then they have to figure out how to sell it.  It is painful to get into the retail space.  Grocery and convenience chains hate setting up new accounts, so they screw over low volume clients- forcing them to go hat in hand to distributors.  Of course distributors demand their cut, so now a cheap beverage gets another layer of markup, before retail gets their 40% margin.  But anyways, you typically have to get into the beer/independents, Coke, Pepsi, or KDP networks to get nationwide distribution.  The issue is, most of those typically already have an existing similar product in their portfolio, so you have to cut them an even sweeter deal to take on your product.  The flip side is, you might get your foot into Walmarts (which is brutal to try on your own).  Coke and Pepsi would rather buy a majority stake to take over distribution for your product.  Then corporate will decide if your product becomes the next best thing (like Monster), or if they can pump and dump it on the market, then move on to the next consumer darling, leaving your product sitting in history like Orbitz.",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpyquqh/",
              "created": 1727871492,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpx1d5i",
      "score": 1,
      "body": "No.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpx1d5i/",
      "created": 1727836525,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpx5myq",
      "score": 1,
      "body": "I wouldn't right now....",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpx5myq/",
      "created": 1727838204,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpxhx7w",
      "score": 1,
      "body": "im a buyer at $26",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpxhx7w/",
      "created": 1727843931,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpxy153",
      "score": 1,
      "body": "It's either at or very near bottom, $25 would be an ideal PT",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpxy153/",
      "created": 1727853774,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpzak7x",
      "score": 1,
      "body": "Celsius should consider CBD and hemp extract beverages.\n\nDoes anyone know where they are on this front?",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpzak7x/",
      "created": 1727878995,
      "depth": 0,
      "replies": [
        {
          "id": "lpzs20u",
          "score": -1,
          "body": "No they shouldn't. No they won't",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpzs20u/",
          "created": 1727884687,
          "depth": 1,
          "replies": [
            {
              "id": "lpzvckl",
              "score": 1,
              "body": "Why shouldn’t they?",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpzvckl/",
              "created": 1727885686,
              "depth": 2,
              "replies": [
                {
                  "id": "lq06p13",
                  "score": 0,
                  "body": "Leave that market to Tilray only",
                  "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lq06p13/",
                  "created": 1727889271,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lq0u0fq",
      "score": 1,
      "body": "It’s still being pumped on twitter X just like PLTR.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lq0u0fq/",
      "created": 1727896682,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq57zhr",
      "score": 1,
      "body": "For a long time hold, it seems fair to pay a PE of about 30 if they can maintain a 15% growth rate. That seems reasonable to me for now. That said, noone knows the future, maybe it explodes; maybe it collapses. I think they have a unique product though. You don't have to go all in, you are allowed to \"nibble\" and 'build' a position over time.\n\n**It seems** like it's everywhere.  Every convenience store seems to have some...   \nI did buy a little bit in the 7.5-7 B MC range and dipped the toe in. If it goes to zero, it won't hurt that much :)",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lq57zhr/",
      "created": 1727966740,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqqiuf8",
      "score": 1,
      "body": "Probably will have a shockingly poor ER with Pepsi not buying more for a bit and that can likely be a good buy in point. If not then I am in no rush to jump in, better risk reward setups elsewhere.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lqqiuf8/",
      "created": 1728279235,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpwxe8l",
      "score": 1,
      "body": "A buy puts",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwxe8l/",
      "created": 1727835076,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpwyht9",
      "score": 1,
      "body": "No no no, not yet",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwyht9/",
      "created": 1727835467,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpyrhc2",
      "score": 0,
      "body": "One would think yes, but I've noticed a shift in the consumer not drinking them anymore.  Use to see them at the gym all the time.  Many are reporting health issues after drinking them ( me included).\n\n  \nSo could be worth a 1% risk, but I can see this ending badly.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpyrhc2/",
      "created": 1727871766,
      "depth": 0,
      "replies": [
        {
          "id": "lpz89xm",
          "score": 1,
          "body": "what kind of health issues?",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpz89xm/",
          "created": 1727878206,
          "depth": 1,
          "replies": [
            {
              "id": "lpzcj0d",
              "score": 0,
              "body": "Extreme headaches for days, heart issues.  Just general feeling of being unwell.  I tried it again and was the cause.  \n\nShame since they taste so good.",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpzcj0d/",
              "created": 1727879652,
              "depth": 2,
              "replies": [
                {
                  "id": "lpzco8e",
                  "score": 3,
                  "body": "but have you tried other energy drinks or coffee and noticed a difference in issues?",
                  "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpzco8e/",
                  "created": 1727879700,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpxjxhc",
      "score": -1,
      "body": "Nope. The drinks aren't impressive and it'll be replaced by the next drink that comes along. Too watered down.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpxjxhc/",
      "created": 1727844998,
      "depth": 0,
      "replies": [
        {
          "id": "lpyexfn",
          "score": 3,
          "body": "I think the product is great. Doesn’t taste like shit like the others. My wife and I buy it all the time",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpyexfn/",
          "created": 1727865476,
          "depth": 1,
          "replies": [
            {
              "id": "lpytn06",
              "score": 1,
              "body": "If buying for taste I’d go with something from Ghost or Alani every time over CELH. CELH has distribution scale and cost in its favor, which may be more important from an investment perspective, but I agree with the above that I find the product pretty meh.",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpytn06/",
              "created": 1727872686,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpyw5pq",
          "score": 2,
          "body": "Doesn't really matter on anyone's individual preference.  All that matters is the revenue growth.  If I bought a Samsung smartphone instead of Apple, it's not going to make a dent in AAPL.  I haven't eat at MCD since I was a kid, but I've held the stock for near 2 decades.",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpyw5pq/",
          "created": 1727873706,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpwkwa5",
      "score": 0,
      "body": "Company looks good on average but they basically had 1 really good year.  Back test their history.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwkwa5/",
      "created": 1727830472,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpwzjh1",
      "score": 0,
      "body": "It is a buy below $25",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwzjh1/",
      "created": 1727835848,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpy1zi0",
      "score": 0,
      "body": "The last time this happened to an energy drink company it was Bang. They went bankrupt.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpy1zi0/",
      "created": 1727856591,
      "depth": 0,
      "replies": [
        {
          "id": "lpyezvd",
          "score": 1,
          "body": "What exactly happened to them?",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpyezvd/",
          "created": 1727865517,
          "depth": 1,
          "replies": [
            {
              "id": "lpzmhpx",
              "score": -1,
              "body": "Bang energy went bankrupt and had a dispute with Pepsi a choice for a fascist generation.",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpzmhpx/",
              "created": 1727882901,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpzcran",
      "score": 0,
      "body": "You need to look at sell-through rates in order to see how they're really doing in the marketplace. Also, the CEO seems to be dumping a lot of stock. Too much for my comfort.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpzcran/",
      "created": 1727879729,
      "depth": 0,
      "replies": [
        {
          "id": "lpzdex3",
          "score": 2,
          "body": "How do you see “sell through”?",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpzdex3/",
          "created": 1727879944,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lq3fixo",
          "score": 1,
          "body": "The CEO \"dumped\" stock to pay taxes on the exercise of his options \n\nToby David (Celsius Chief of Staff) clarified that on Twitter",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lq3fixo/",
          "created": 1727933061,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lq4vakx",
      "score": 0,
      "body": "Whenever a stock is at $100, the time to buy it is below $90. Whenever the same stock is at $31, the right time to buy it is in the mid $20s. \n\nThe correct formula for fair valuation doesn’t use sales, earnings, book, or PEG. Fair valuation is actually (current price * 0.85 = attractive entry price). Ironically, in reality we usually buy stocks when they go up +20% rather than down -20%. \n\nWho knows if CELH will be a good stock going forward. Financially it looks like it will be a successful company: rapid historic growth, high margins, nice incremental margins, and market share gains both in units and dollars. \n\nThe stock is essentially priced for low sustained growth (high 25-30x pe) for an ultra high margin/ROE consumer staple. \n\nIf CELH can grow sales 10%+ over time they’ll likely be a great stock. People are extremely fixated on short-term results and particularly sell-in vs sell-through with PEP. \n\nPersonally I think CELH has a lot more growth. They seem to have close to full shelf space in gas stations and club stores. But they seem to lack in grocery stores. They likely can increase their sales per user as they become a habitual vs exploratory purchase. MNST and Red Bull delivered most of their dollar value sales growth many years after initial popularity. \n\nI’ve liked CELH from $30>100>$30, so I’m extremely biased/emotionally compromised. Nonetheless, I don’t see how they stop growing long term, and if they grow, the stock should go up over time.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lq4vakx/",
      "created": 1727962784,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpx5heh",
      "score": -3,
      "body": "I only paid <$5/s and was sitting on it after it reached sky.   I have sold some earlier between $60-80 in the summer.  Then I forget about the rest.  Not until recently I realized I have to do something. All sold at $33 ish.  This teaches me not to just check losses and once reach some level I meed to take profit. \n\nBut it shows I have $13K long term capital gain taxes from CELH + some short term gain taxes suggesting meaning I paid $3.67/s earlier.   I am out.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpx5heh/",
      "created": 1727838139,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpwzlky",
      "score": -5,
      "body": "Business Has no moat. Income can be unpredictable from year to year. Can they prove the taste of their drink is in the tier that no others can replicate like Wingstops claim on their sauces.",
      "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpwzlky/",
      "created": 1727835869,
      "depth": 0,
      "replies": [
        {
          "id": "lpxhsjw",
          "score": 6,
          "body": "I believe a company should have a moat as well, but using Wingstop’s sauces as an example is hilarious",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpxhsjw/",
          "created": 1727843862,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpxj6na",
          "score": 3,
          "body": "Having PEP distribution is a pretty solid moat",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpxj6na/",
          "created": 1727844593,
          "depth": 1,
          "replies": [
            {
              "id": "lpxm09l",
              "score": 1,
              "body": "Wouldn’t call it a moat per se but I do think it helps entrench it as what Prof Aswath Damodaran calls a ‘teenage’ company",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpxm09l/",
              "created": 1727846157,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpyf5kd",
          "score": 1,
          "body": "It’s the only energy that we buy as adults. It’s the only one that doesn’t taste like shit. Their branding is good. Monster is for jacked up young coke heads. Celcius doesn’t have that image.",
          "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lpyf5kd/",
          "created": 1727865609,
          "depth": 1,
          "replies": [
            {
              "id": "lq44hso",
              "score": 2,
              "body": "As someone in digital marketing I agree with that analysis re: branding. \n\nThey know exactly who they’re gunning for: the packaging is pretty agnostic since they’re hoping to appeal to both sporty men and women in terms of brand positioning (think the ladies who wear Lululemon etc). The fact that they have a pretty equal proportion of male and female consumers is telling.",
              "permalink": "/r/stocks/comments/1fu3snb/is_celh_a_buy/lq44hso/",
              "created": 1727950309,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}