{
  "title": "Private payrolls show better-than-expected growth of 143,000 in September, ADP says",
  "score": 94,
  "selftext": "**Private payrolls show better-than-expected growth of 143,000 in September, ADP says**\n\n[https://www.cnbc.com/2024/10/02/private-payrolls-show-better-than-expected-growth-of-143000-in-september-adp-says.html](https://www.cnbc.com/2024/10/02/private-payrolls-show-better-than-expected-growth-of-143000-in-september-adp-says.html)\n\n&#x200B;\n\n*Key Points*\n\n* *Private companies added 143,000 jobs in September, an acceleration from 103,000 in August and better than the 128,000 consensus forecast, ADP reported Wednesday.*\n*  *Job gains were fairly widespread, with leisure and hospitality leading at 34,000, followed by construction (26,000) and education and health services (24,000).*\n\n&#x200B;\n\n*Private sector hiring picked up in September, indicating the labor market is holding its ground despite some signs of weakness, payrolls processing firm ADP reported Wednesday.*\r  \n\r*Companies added 143,000 jobs for the month, an acceleration from the upwardly revised 103,000 in August and better than the 128,000 consensus forecast from economists polled by Dow Jones.*\r  \n\r*While hiring increased, the rate of pay growth took another step down. The 12-month gain for those staying in their jobs nudged lower to 4.7%, while tumbling to 6.6% for job switchers, down 0.7 percentage point from August.*\r  \n\r*Job gains were fairly widespread, with leisure and hospitality leading at 34,000, followed by construction (26,000), education and health services (24,000), professional and business services (20,000) and other services (17,000).*\r  \n\r*Information services was the lone category posting a loss, down 10,000.*\r  \n\r*Service providers accounted for 101,000 of the total, with goods producers adding the rest.*\r  \n\r*From a size standpoint, all of the growth came from companies with more than 50 employees. Small firms saw a loss, with those employing fewer than 20 workers down by 13,000.*\r  \n\r*The ADP count comes two days ahead of the Labor Department’s nonfarm payrolls report, which is expected to show growth of 150,000, following August’s disappointing showing of 142,000, of which 118,000 came from private sector hiring.*\r  \n\r*While the ADP report serves as a precursor to the official count, the two can differ, sometimes by wide margins.*\r  \n\r*Federal Reserve officials are watching the jobs numbers closely as they contemplate the next move for monetary policy and interest rates. In a speech Monday, Fed Chair Jerome Powell characterized the labor market as “solid” while noting that it has “clearly cooled” over the past year.*\r  \n\r*The Fed is expected to follow up its half percentage point rate cut in September with further reductions in November and December. The main question is whether the central bank will move in the same large increment or pivot back to a more conventional quarter-point move.*\r  \n\r*Futures market pricing currently points to a quarter-point cut in November then a half-point move in December. Powell indicated that consecutive quarter-point moves are the more likely scenario now, though policymakers remain attuned to the data and will adjust accordingly.*",
  "link_flair_text": "Broad market news",
  "id": "1fuerjj",
  "num_comments": 20,
  "created_utc": 1727871436,
  "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/",
  "comments": [
    {
      "id": "lpz38v9",
      "score": 41,
      "body": "The tech recession continues. \n\nIt is not that great that the leading hiring are waiters and construction workers. Neither of those pay especially well.",
      "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lpz38v9/",
      "created": 1727876426,
      "depth": 0,
      "replies": [
        {
          "id": "lpz7hg7",
          "score": 46,
          "body": "Waiters and construction workers indicate consumer demand. Entry/Mid-level tech workers being paid like doctors was never sustainable.",
          "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lpz7hg7/",
          "created": 1727877931,
          "depth": 1,
          "replies": [
            {
              "id": "lpzf0e3",
              "score": 16,
              "body": "Agreed, this is my beef with the finding a job stories being incredibly difficult. Most of them are in tech but don't share that info until it's asked. I'm not suggesting the job market is roses, there is certainly strife and outsourcing going on but some industries are returning to a mean that exploded during covid.",
              "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lpzf0e3/",
              "created": 1727880469,
              "depth": 2,
              "replies": [
                {
                  "id": "lq1d69x",
                  "score": 5,
                  "body": "Exactly. I feel many of the people hired into tech during and right after covid (when tech companies were handing out high paying jobs like candy) had no business being in that field. Not trying to bring anyone down or be an asshole, but many people won't be able to find those types of high paying tech jobs again.",
                  "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lq1d69x/",
                  "created": 1727902713,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lq5hoxa",
                  "score": 4,
                  "body": "I empathize with those people but the reality is they're demanding to be paid like high skill high demand jobs when the market is not seeing it as such compared to before. The nirvana has ended.",
                  "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lq5hoxa/",
                  "created": 1727969583,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lpzjot8",
                  "score": 5,
                  "body": "I don't get why tech is considered the holy grail of employment on reddit. It's like the days of the British Empire, the ways of tech redditors are the ways of the world and all fortunes rise and fall in the hands of tech.",
                  "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lpzjot8/",
                  "created": 1727881992,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq1dfna",
                      "score": 7,
                      "body": "[removed]",
                      "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lq1dfna/",
                      "created": 1727902792,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lq5hvxc",
                          "score": 3,
                          "body": "They're coping because they want to believe they're better and smarter than people who work at McDonalds.",
                          "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lq5hvxc/",
                          "created": 1727969640,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lq0b05m",
              "score": 2,
              "body": "yeah, I'm kinda concerned about that myself. I'm fairly far into mid-level at this point, but I need to get some certs to back it up because most people with my title make way less\n\nI'm gonna have to study a BIT more to make a leap into an advanced role (I mean, I \\*kinda\\* am, I am principal engineer, but like, I could stand to have a deeper and wider skill set for sure). being on that cusp has really lit a fire under my ass\n\n...because you're right. hitting six figures three years in with no masters degree is insane, something I saw a lot of during covid (both for engineers, but also just six figure entry level PM roles in tech that seem to have dissipated)",
              "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lq0b05m/",
              "created": 1727890627,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpzkweq",
          "score": 16,
          "body": "We need a fuck ton more construction workers though for both housing and infrastructure which is good to see",
          "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lpzkweq/",
          "created": 1727882384,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lq3iig7",
      "score": 7,
      "body": "How long before it gets downgraded? Herp derp.",
      "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lq3iig7/",
      "created": 1727934897,
      "depth": 0,
      "replies": [
        {
          "id": "lqn3wct",
          "score": 2,
          "body": "After next month’s election.",
          "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lqn3wct/",
          "created": 1728234000,
          "depth": 1,
          "replies": [
            {
              "id": "lqn4l39",
              "score": 2,
              "body": "Das a bingo!",
              "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lqn4l39/",
              "created": 1728234219,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lq81rms",
          "score": 1,
          "body": "I know this is a sarcastic question but just to be clear (or maybe for others reading this) the ADP report numbers cited are based off of the hard numbers of the companies they (ADP) process payroll for. If the companies they process payroll for add a job, that’s another check they process, and of course the opposite for job losses. Since the ADP numbers come from their own live data there aren’t revisions to the ADP report.\n\nBLS nonfarm payrolls are primarily based off of survey results from businesses. Initial headline releases are based off of early responders and are revised over time as additional responses and other data come in. Hence, revisions.",
          "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lq81rms/",
          "created": 1728000255,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpz16kz",
      "score": 13,
      "body": "I don’t believe it before the revision",
      "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lpz16kz/",
      "created": 1727875652,
      "depth": 0,
      "replies": [
        {
          "id": "lpzulu0",
          "score": 8,
          "body": "100%. August was revised up so it looks like the economy is going even better than the reports are saying",
          "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lpzulu0/",
          "created": 1727885456,
          "depth": 1,
          "replies": [
            {
              "id": "lq306rn",
              "score": 1,
              "body": "Yep, I too will wait for the revision",
              "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lq306rn/",
              "created": 1727925201,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lpzhb8x",
      "score": -4,
      "body": "Recession! Bond guys keep saying it’s true",
      "permalink": "/r/stocks/comments/1fuerjj/private_payrolls_show_betterthanexpected_growth/lpzhb8x/",
      "created": 1727881217,
      "depth": 0,
      "replies": []
    }
  ]
}