{
  "title": "Tesla stock slips after it reports 462,890 total deliveries during the third quarter",
  "score": 430,
  "selftext": "Tesla posted its third-quarter vehicle production and deliveries report on Wednesday. The stock fell about 2% in premarket trading after the report.\n\nHere are the key numbers:\n\nTotal deliveries Q3 2024: 462,890\n\nTotal production Q3 2024: 469,796\n\nAnalysts were expecting deliveries of 463,310 in the period ending Sept. 30, according to estimates compiled by FactSet StreetAccount.\n\nDeliveries are not defined in Tesla’s financial disclosures, but are the closest approximation to units sold reported by the company. It’s one of the most closely-watched metrics on Wall Street.\n\nIn the year-ago period, Tesla reported 435,059 deliveries and production of 430,488 EVs. Last quarter, the company reported 443,956 deliveries, and production of 410,831 vehicles.\n\nTesla is facing increased competitive pressure, especially in China, from companies like BYD and Geely, along with a new generation of automakers, including Li Auto and Nio.\n\nIn the U.S., EV competitors like Rivian are maturing, while legacy automakers Ford and General Motors are selling more electric vehicles after walking back more ambitious goals for electrification.\n\nGM this week reported a roughly 60% increase in EV sales for the third quarter from a year earlier. Still, its electric business is tiny compared to Tesla’s, with just 32,100 units sold in the latest period, accounting for 4.9% of the company’s total sales.\n\nFord plans to report results on Wednesday.\n\nTesla hasn’t issued specific guidance for 2024 deliveries, but executives have said they expect a lower delivery growth rate this year versus last despite the company having added a new vehicle, the angular stainless steel Cybertruck, to their lineup.\n\nThe company also said on Wednesday that it deployed 6.9 GWh of energy storage products in the quarter.\n\nShares of Tesla climbed 32% in the third quarter, erasing their loss for the year in the process. The stock is now up almost 4% in 2024, trailing the Nasdaq, which has gained 19%.\n\nTesla’s brand has been under pressure in the U.S. due in part to the antics of CEO Elon Musk, who, in addition to endorsing former President Donald Trump, has shared what the White House called “racist hate,” and false claims about immigrants and election fraud on X, his social media app.\n\nBut Tesla still sells more battery electric vehicles in the U.S. than any other automaker, with Hyundai a distant second.\n\nIn its third-quarter earnings report later this month, investors will be particularly focused on profit margins.\n\nTesla has continued to offer attractive financing options and an array of incentives to drive sales volume in recent months in China as well as in the U.S. Prior to earnings, Tesla will host a marketing event on Oct. 10, and is expected to show off the design of “dedicated robotaxi.”\n\nMusk has promised Tesla self-driving cars for years, but the company has yet to deliver. Meanwhile competitors like Waymo and Pony.ai have begun operating commercial robotaxi services.\n\nSource: https://www.cnbc.com/2024/10/02/tesla-tsla-q3-2024-vehicle-delivery-and-production-numbers.html",
  "link_flair_text": null,
  "id": "1fuftc7",
  "num_comments": 245,
  "created_utc": 1727874606,
  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/",
  "comments": [
    {
      "id": "lpz2d8x",
      "score": 265,
      "body": "Tesla would need to deliver 514,925 in Q4 for zero growth in 2024 over 2023. Unlikely that they’ll top 500k.",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz2d8x/",
      "created": 1727876099,
      "depth": 0,
      "replies": [
        {
          "id": "lq09zrd",
          "score": 16,
          "body": "Why is a capital intensive car company trading at 70x earnings if they aren't growing?",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq09zrd/",
          "created": 1727890307,
          "depth": 1,
          "replies": [
            {
              "id": "lq0d0dt",
              "score": 9,
              "body": "People tell me it’s because of their BESS business, which is ridiculous.\n\nIt’s because people trust the hype.",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0d0dt/",
              "created": 1727891260,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lqb87gr",
              "score": 2,
              "body": "Elon Cult",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lqb87gr/",
              "created": 1728054722,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpz5a3e",
          "score": 176,
          "body": "And margins will continue to be lower vs 2023 Qs.\n\nTesla is on track to make about $2 EPS yearly with flat to no growth. Fair price would be about $30.",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz5a3e/",
          "created": 1727877161,
          "depth": 1,
          "replies": [
            {
              "id": "lpz812f",
              "score": 85,
              "body": "But the age old question—will it matter?",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz812f/",
              "created": 1727878120,
              "depth": 2,
              "replies": [
                {
                  "id": "lpz98wn",
                  "score": 75,
                  "body": "It doesnt matter, when you have a legion of fan boys willing to buy Tesla shares, the same way they bought DOGE. Reality doesn't matter at the short or medium term. But at the long term.... it will eventually crash hard",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz98wn/",
                  "created": 1727878543,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpzi81c",
                      "score": 11,
                      "body": "Yeah but they won't stay solvent forever",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzi81c/",
                      "created": 1727881514,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lq0aadr",
                          "score": 8,
                          "body": "It depends. Tesla might be overvalued relative to its financials, but it's also still turning a profit, so insolvency doesn't seem to be a serious risk at this time. Of course, that could change in the future.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0aadr/",
                          "created": 1727890399,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lq0ryp3",
                              "score": 11,
                              "body": "[deleted]",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0ryp3/",
                              "created": 1727896026,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lq2rkab",
                                  "score": 6,
                                  "body": "Yeah, the institutions are going to have to get realistic soon. With no growth there’s no reason for them to hold that stock. No amount of TSLA fanboys can hold up this $800 billion bag of hot shit",
                                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq2rkab/",
                                  "created": 1727921593,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lq0slcn",
                          "score": 0,
                          "body": "Not when hybrid is going mainstream via Camry",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0slcn/",
                          "created": 1727896229,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lpzf9os",
                      "score": 1,
                      "body": "How long?",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzf9os/",
                      "created": 1727880554,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lq00t97",
                      "score": -2,
                      "body": "So based on ur login only fanboys are hodl the stock, no institutions and big money?",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq00t97/",
                      "created": 1727887413,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lq0k4ye",
                          "score": 5,
                          "body": "There are managers of institutional money that are cloud chasers and very naive people believing Tesla is going to build a trillion dollar business in IA, in robot taxis and in humanoid robots. So also Tesla fan boys",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0k4ye/",
                          "created": 1727893532,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lq00xup",
                  "score": 6,
                  "body": "Have you factored in dancing robots replacing humans for live events? 24/7 Moulin Rouge!",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq00xup/",
                  "created": 1727887453,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lq09eom",
                  "score": 1,
                  "body": "It hasn’t until this point. ",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq09eom/",
                  "created": 1727890124,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lq3v9y7",
                  "score": 1,
                  "body": "Yeah, I doubt it matters much for the next quarter. But as much as I wouldn't bet against Tesla's ferocious fanboys by shorting its stock, I wouldn't touch it with a ten-foot pole either.",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq3v9y7/",
                  "created": 1727943781,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lpzb5m6",
                  "score": 1,
                  "body": "Eventually.",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzb5m6/",
                  "created": 1727879195,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lpz6icr",
              "score": 20,
              "body": "Indeed. This stock is priced as if there was an obvious growth expectation. There is one for EVs more broadly. But Tesla in particular? I just don’t see it. Half of their sales this quarter were in China. Other markets will have to grow rapidly for Tesla to simply offset the decline they’ll suffer there over the coming years.",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz6icr/",
              "created": 1727877590,
              "depth": 2,
              "replies": [
                {
                  "id": "lpz8680",
                  "score": 24,
                  "body": "Hang on, Elon said you gotta price the company as an automation company or else you have no idea what you are doing. And he NEVER lies...\n\nHonestly I've found Tesla to be overpriced for a long time. They took their eye off the ball which was making EVs more mass market, and they are loosing market share because of it. The robotaxi thing is still a pipe dream from what I've seen of FSD at the moment. So yeah...",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz8680/",
                  "created": 1727878170,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpzif7m",
                      "score": 12,
                      "body": "Remember when FSD arrived in 2016 ?",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzif7m/",
                      "created": 1727881579,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lq05pbu",
                          "score": 9,
                          "body": "I forgot about FSD arriving in 2016, I was too busy enjoying the Robotaxi and living off all that passive income it was able to generate!\n\nMy robot butler, that’s totally not controlled by a human off stage, and I are too busy stylin’, profilin’, limousine riding, jet flying, kiss-stealing, wheelin’ and dealin’ to care about FSD.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq05pbu/",
                          "created": 1727888956,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lq0sgqb",
                      "score": 4,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0sgqb/",
                      "created": 1727896188,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lq05pqu",
                      "score": 1,
                      "body": "It doesn't help that people are attacking robo taxis. Doesn't matter if you make fsd if people won't tolerate it because it replaces them",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq05pqu/",
                      "created": 1727888960,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lpzbhcj",
                  "score": -6,
                  "body": "The expectation is that battery storage keeps growing. 100% growth in a sector that has 50% margins makes pretty much everything else they’re doing irrelevant",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzbhcj/",
                  "created": 1727879303,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq0o5yo",
                      "score": 6,
                      "body": "Battery storage will be a race to the bottom on profitability. There's no technological moat and the massive battery cell manufacturers are already winning the biggest contracts in the world (CATL, Samsung, BYD, LG, etc). And Tesla will be reliant on their competitors like CATL to grow their production so they'll just get undercut by the people who control the battery cell supply.\n\nStatic battery storage will be commoditized at maturity. There might be decent margins early on as capacity is lagging demand but companies will ramp up to meet that demand and Tesla has a very small minority of total storage sales so profit margins will erode and trend to single digits as everyone cuts prices to keep market share.",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0o5yo/",
                      "created": 1727894817,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lpzds3e",
                      "score": 17,
                      "body": "But it’s such an incredibly small portion of their revenue. Even if it maintained such high margins, which is optimistic, the battery business would need to grow by multiples to move the needle for the overall company",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzds3e/",
                      "created": 1727880064,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpzik6y",
                          "score": 3,
                          "body": "Profit is what matters here. 75% of Amazon’s profit comes from AWS despite it being 15% of their revenue. \n\nIn Q1, Tesla made $1.13B profit and $0.5B of that came from energy and services, despite those divisions making up a tiny fraction of the revenue.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzik6y/",
                          "created": 1727881624,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpzjpk5",
                              "score": 11,
                              "body": "Profit isn’t the whole picture. AWS could only succeed because of the massive retail side that carried the weight of the business. When their retail numbers struggle, the stock price struggles no matter how well AWS does, because AWS can’t carry the business yet. Same with Tesla. Tesla is valued at 3/4 of a trillion dollars currently. Obviously a half billion of profit cannot sustain that valuation. They are priced for tremendous growth, and any hurdle in that growth story is a real issue",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzjpk5/",
                              "created": 1727881998,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lpzh53j",
                          "score": 0,
                          "body": "It's also easy to copy.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzh53j/",
                          "created": 1727881162,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lpzc1ya",
                      "score": 8,
                      "body": "Why does it have 50% margins? What is Tesla bringing to the table here? They buy the cells, do some software, design, marketing and servicing and that’s it. Can’t anyone do that?",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzc1ya/",
                      "created": 1727879493,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpzekpp",
                          "score": 9,
                          "body": "It's unwise to dismiss the value created in hardware and software integration.  Tesla's solutions are close to turnkey and are relatively simple to drop onto a site and connect.\n\nIn 2007-2008 there wasn't much special about iPhone either: commodity LCDs & battery packs, ARM cores that anyone could buy, some design, and a lot of marketing, but the sum ended up much greater than the parts and Apple's revenue growth reflected that.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzekpp/",
                          "created": 1727880326,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lq0ohws",
                              "score": 2,
                              "body": "Tesla has a very small percentage market share of BESS. CATL, BYD, Samsung, LG, SK have also developed turnkey solutions. They are beating Tesla out for some of the biggest new projects in the world. This will be a race to the bottom on profitability and commoditized product.",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0ohws/",
                              "created": 1727894922,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lq0xh1r",
                                  "score": 2,
                                  "body": "[https://www.ess-news.com/2024/08/26/global-energy-storage-cell-shipment-h1-2024-retrospect-and-prospect/](https://www.ess-news.com/2024/08/26/global-energy-storage-cell-shipment-h1-2024-retrospect-and-prospect/)\n\n>The **global energy storage system shipment volume stood at 90 GWh in the first half of this year.**\n\n>The **top five BESS integrators on the AC side** are **Tesla**, Sungrow, CRRC ZHUZHOU INSTITUTE, Fluence, and Envision, having shipped more than 30 GWh together.\n\n>The **top five BESS integrators on the DC side** are **CATL**, BYD, HyperStrong, RelyEZ Energy, and Narada Power, which together shipped more than 20 GWh.\n\n>In both categories, the top two manufacturers account for the lion’s share of shipments, leaving the rest far behind.\n\nWe know from Tesla's 10-Q filing for Q2 '24:\n\n[https://www.sec.gov/Archives/edgar/data/1318605/000162828024032662/tsla-20240630.htm](https://www.sec.gov/Archives/edgar/data/1318605/000162828024032662/tsla-20240630.htm)\n\n>In 2024, **we deployed 13.46 GWh of energy storage products through the second quarter.**\n\nTesla had just under 15% global market share total, and nearly half of the top 5 for AC systems.\n\nSo while it is accurate to say that their market share is small currently, Tesla is relatively larger than most of its competitors.\n\nNote:\n\n* Tesla's Megapack factory in Lathrop, California is not fully ramped (40 GWh/year expected full capacity)\n* Tesla has a 2nd Megapack factory under construction in Shanghai, China.  Expected production capacity is at least 40 GWh/year.\n\n>This will be a race to the bottom on profitability and commoditized product.\n\nTime will tell.",
                                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0xh1r/",
                                  "created": 1727897785,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lpzfpfh",
                              "score": 1,
                              "body": "BESS isn’t a branded item. No one cares which company put together their solar modules. No one cares who made their BESS. Least of all utility companies who buy it for grid storage. They’re incredibly price sensitive.",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzfpfh/",
                              "created": 1727880695,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lpzxwhy",
                                  "score": 4,
                                  "body": "Unless you're in power systems engineering or a similar field, you're simply talking out of your ass.\n\nIntegration is *the* value-add for this kind of market. Nobody on the ownership side wants to put together an entire department of engineers to bring the system design, vendor selection, manufacturing supervision, field installation support, and maintenance in-house. Offering these solutions turnkey is how the entire facilities industry works. HUGE companies like Bechtel, Jacobs, CB&I, all do this same kind of thing in their specific area. Having the manufacturing part in-house is a HUGE moat.",
                                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzxwhy/",
                                  "created": 1727886485,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "lpzgrmu",
                                  "score": 4,
                                  "body": "Again, Tesla's energy solutions are close to turnkey and easy to deploy.  Branding isn't part of my argument for why Tesla's energy sales continue to grow rapidly.  \n\nThe SEC 10-Qs from 2023 reported that Tesla deployed 4 GWh of storage in Q3 '23, and today's press release reports that grew to 6.9 GWh in Q3 of this year.  That's 72.5% YoY growth.  Tesla is clearly creating value here for their customers.",
                                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzgrmu/",
                                  "created": 1727881040,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lpzpddi",
                                      "score": -2,
                                      "body": "fragile resolute important tie poor normal deserted long toothbrush unite\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzpddi/",
                                      "created": 1727883834,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lpzcvlu",
                          "score": 5,
                          "body": "People said the same thing about EVs. Ford, GM, and VW all claimed they’d surpass Tesla by 2025 in production. It’s now looking like all of them combined won’t be anywhere close. Manufacturing and logistics are a tough area to break into, where the first movers typically see massive success.\n\nThere’s a desperate need for energy storage and Tesla is the only game in town capable of scaling",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzcvlu/",
                          "created": 1727879768,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpzf83h",
                              "score": 7,
                              "body": "BESS integration won’t be a high-margin business for long. It’s like solar modules. For consumers it’s a simple no-brand commodity item, where price matters above all else. And for large-scale grid storage where the customers are utilities or municipalities even more so.\n\nTrying to justify 12 figure valuations based on that is ludicrous.",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzf83h/",
                              "created": 1727880539,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lpzhzqy",
                                  "score": 1,
                                  "body": "It’s impossible to say what the long-term 20+ year outlook will be. But to compete in the space and build out a factory like Tesla’s megapack facility is a 5+ year commitment that no one else is currently biting at. Until there’s competition Tesla can charge whatever they want as they’re currently sitting on a 2+ year order backlog. \n\nI don’t own Tesla, I’m just pointing out the reality of why it’s priced the way it is. 99.99% of people in these threads don’t seem to understand the landscape of the power industry. They just know they don’t like Elon and look for reasons why the stock should be $10 instead of objectively valuing all pieces of the business. Tesla is currently on track for their energy and service division to be making more profit than the rest of the company combined by 2025, while growing at high double digits or low triple digits.",
                                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzhzqy/",
                                  "created": 1727881439,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lpz8lr0",
              "score": 4,
              "body": "dont worry theyre going to announce their highly profitable robotaxi any day now",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz8lr0/",
              "created": 1727878321,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lq0rf3x",
              "score": 4,
              "body": "Its seems they play accounting tricks with their carbon credits.  The amount they report in a quarter has varied greatly and seems to be higher during tougher quarters.",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0rf3x/",
              "created": 1727895851,
              "depth": 2,
              "replies": [
                {
                  "id": "lq1skol",
                  "score": 2,
                  "body": "Oh, I 100% think Elon is trying to buy Trump precisely because of accounting fraud.\n\n\nI suspect we will learn a lot about Tesla over the next 1 to 2 years as their huge sales years get far enough back and we learn how warranty maintenance, and depreciation impact their finances with a mature fleet. Especially since leases are tracked as sales.",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq1skol/",
                  "created": 1727908065,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lq56ry6",
              "score": 1,
              "body": "Cultish idiots continue to pile into TSLA though",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq56ry6/",
              "created": 1727966377,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lq4al4e",
          "score": 3,
          "body": "It's also a worrying trend of overproduction.   They are delivering less vehicles than they're making by a relatively wide margin, which suggests softening demand and will eat into their profitability.  With an ageing design for most of the range and a failed new product launch (cybertruck), it's heading in the wrong direction just as more competitors join the EV market.\n\nBut will it matter?  He will come out and announce something ridiculous that they will never deliver and the stock will surge.",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq4al4e/",
          "created": 1727953922,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpzs0wq",
          "score": 1,
          "body": "And that’s assuming the books aren’t already being cooked by Enron Musk.",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzs0wq/",
          "created": 1727884677,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpz0vzh",
      "score": 122,
      "body": "Total deliveries Q3 2024: 462,890 (vs. analyst expectations of 463,310).\n\nMissed by 420 ![gif](emote|free_emotes_pack|feels_good_man)",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz0vzh/",
      "created": 1727875543,
      "depth": 0,
      "replies": [
        {
          "id": "lpzam0w",
          "score": 44,
          "body": "Honestly sounds like fraud, like it's all made up, but at this point nobody cares, to the point that subtle jokes like this can be made",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzam0w/",
          "created": 1727879012,
          "depth": 1,
          "replies": [
            {
              "id": "lpzd7n6",
              "score": 8,
              "body": "Indeed, there has not been a grown up in charge in our society for quite a few years now",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzd7n6/",
              "created": 1727879878,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lpzgwow",
              "score": 8,
              "body": "I just wonder if they ever get bent over by having to refund FSD money.",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzgwow/",
              "created": 1727881086,
              "depth": 2,
              "replies": [
                {
                  "id": "lq06xpf",
                  "score": 7,
                  "body": "Nobody with HW3/4 will ever get a robotaxi. And no Musk won't refund you, at worst he pays a fine orders of magnitude less than his gain.",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq06xpf/",
                  "created": 1727889348,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lq09uid",
                  "score": 1,
                  "body": "With the latest judge ruling that musk’s statements were puffery, I’m guessing not. ",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq09uid/",
                  "created": 1727890260,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq0bjm1",
                      "score": 3,
                      "body": "Huh, interesting. Although I think a big factor is that it was brought by shareholders. A lawsuit from consumers that say they aren't getting what they paid for may be more successful.",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0bjm1/",
                      "created": 1727890798,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpz58l2",
      "score": 87,
      "body": "82 fucking FWD PE",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz58l2/",
      "created": 1727877146,
      "depth": 0,
      "replies": [
        {
          "id": "lpz71nt",
          "score": 66,
          "body": "Mostly supported on the vague promises of robotaxis, FSD, and robots",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz71nt/",
          "created": 1727877777,
          "depth": 1,
          "replies": [
            {
              "id": "lpzeyag",
              "score": 10,
              "body": "Aren't we supposed to be getting a robotaxi announcement from Tesla in October (after years and years of delay)?",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzeyag/",
              "created": 1727880450,
              "depth": 2,
              "replies": [
                {
                  "id": "lpzgaj3",
                  "score": 24,
                  "body": "Yeah but I'm skeptical its gonna be much different than the previous 5 years",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzgaj3/",
                  "created": 1727880887,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lpzih3r",
                  "score": 7,
                  "body": "There has only been two months of delay for the robotaxi.\n\nTesla tried to say for years that regular Teslas would become robotaxis and that there would be no need to build a unique vehicle for it.\n\nBut it seems like Elon pulled this out of his ass earlier this year to stem the stock crashing after Reuters reported they stopped plans to make a new, cheaper sedan from the ground up.",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzih3r/",
                  "created": 1727881596,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq07aom",
                      "score": 2,
                      "body": "Pretty sure Elon has been promising FSD since ~2016 and Robotaxis since ~2019.",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq07aom/",
                      "created": 1727889461,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lq0bq2b",
                          "score": 1,
                          "body": "Not as a separate vehicle. He wanted to turn customers' Teslas into robotaxis.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0bq2b/",
                          "created": 1727890854,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lpzh3c0",
                  "score": 4,
                  "body": "Supposed to be on the 10th, but honestly hard to believe they’re anywhere close to it. They don’t even have first mover advantage anymore considering that companies like Waymo are starting to roll out.\n\n(and yes, FSD’s promess is to be more flexible than Waymo since it could potentially go anywhere while Waymo is limited to a map of a city. But I believe Waymo’s strategy is enough to cover 95% of the robotaxi needs tbh)",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzh3c0/",
                  "created": 1727881146,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq0o3vd",
                      "score": 3,
                      "body": "FSD promises a lot but reality has been different. In my mind if they were so sure of FSD, they would have at least gotten L3 permissions in some states, in limited conditions just for bragging rights and testing liability issues.\n\nWaymo has been doing actual driverless driving for a while now and I do agree with you their method works. We don't need robotaxis outside of major cities now. Also maps are needed in both cases, FSD can't also navigate without an accurate map but it is true that it doesn't need a high fidelity map like Waymo. ie without a map FSD will also not now it shouldn't take a turn when the road dead ends with U turn that's hard to make.\n\nHowever that's a scale issue really. If Waymo wants to expand to an area, mapping it wouldn't be a big hassle.",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0o3vd/",
                      "created": 1727894798,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lq6wncs",
                      "score": 1,
                      "body": "They haven't even begun applying for actual FSD testing licenses on US roads without drivers yet. It's all smoke.",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq6wncs/",
                      "created": 1727986033,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lq0agcc",
                  "score": 2,
                  "body": "We were supposed to get one in August after years of delay. And then THAT was delayed. You should expect the October announcement to be delayed too.",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0agcc/",
                  "created": 1727890452,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lq09zqp",
                  "score": 1,
                  "body": "Aspirational announcement. ",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq09zqp/",
                  "created": 1727890306,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lq2hn8m",
                  "score": 1,
                  "body": "It’s next week on 10/11. Invites already sent out and everything. No way it’s cancelled now. It’s at hollywood studios though so expect robots to be guys on suits and be skeptical of everything",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq2hn8m/",
                  "created": 1727917811,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lpzkt2i",
          "score": 17,
          "body": "Bro it’s a tech company bro I swear FSD is ahead of the competition bro it’s gonna be in every car in 5 years bro",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzkt2i/",
          "created": 1727882354,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpyzqk8",
      "score": 92,
      "body": "Tesla lacks strong leadership focus and so is letting much larger competitors catch up to them",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpyzqk8/",
      "created": 1727875107,
      "depth": 0,
      "replies": [
        {
          "id": "lpz1i6c",
          "score": 15,
          "body": "Luckily for Tesla theres still no domestic competition \n\nTeslas only worry is China, which again luckily for Tesla is also a worry for everyone.",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz1i6c/",
          "created": 1727875775,
          "depth": 1,
          "replies": [
            {
              "id": "lpz1pco",
              "score": 51,
              "body": "No domestic competition? Ford and gm are ramping up their ev deliveries and even Rivian gained a toehold. Tesla went from no competition to an increasingly flooded market",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz1pco/",
              "created": 1727875851,
              "depth": 2,
              "replies": [
                {
                  "id": "lpzsfl5",
                  "score": 3,
                  "body": "Ford and GM hahahahahaha....hahahahahaha",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzsfl5/",
                  "created": 1727884806,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq0vw2m",
                      "score": 20,
                      "body": "Not sure if you can laugh about it. The EV delivery from both companies are going up. \n\nNot to mention Hyundai/Kia, Volvo, Rivian, VW, and even Toyota with their PHEV. \n\nTesla will continue to be the largest EV seller for this decade. However, they will just lose market share to the late starters.",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0vw2m/",
                      "created": 1727897278,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltpqboq",
                          "score": 1,
                          "body": "Been an interesting couple days for TSLA...",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/ltpqboq/",
                          "created": 1729876770,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lq2tuza",
                      "score": 8,
                      "body": "Get a clue, man. They are catching up. IDK why you think Tesla's position can't be unrivaled. Look at the numbers and see if you can laugh at that.",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq2tuza/",
                      "created": 1727922512,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lpzvsv8",
                      "score": 19,
                      "body": "Two car companies that sell many times more cars than Tesla, and are slowly catching up on ev market share… so funny",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzvsv8/",
                      "created": 1727885825,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lq15oqg",
                  "score": 2,
                  "body": "There is competition but many customers won’t have confidence in Gen 1 EVs from Ford or GM.  I bought a Tesla Dec 2023 because they are the safe choice when it comes to quality. \n\nIn 3-5 years once these companies have some runtime in their vehicles more people will have confidence in them.  But that will come quickly.\n\nIt doesn’t help Elon is a shit talker and has pissed off people on the left who are most likely to buy an EV.",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq15oqg/",
                  "created": 1727900392,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lpz6xh8",
                  "score": -20,
                  "body": "Ford and GM lmaoooo",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz6xh8/",
                  "created": 1727877736,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpz7go8",
                      "score": 16,
                      "body": "What’s funny about two massive legacy auto makers with rising EV market share?",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz7go8/",
                      "created": 1727877923,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpzfgpz",
                          "score": 7,
                          "body": "The fact that they're losing more money per EV sold than a Tesla costs in the first place. It would literally be more profitable (less unprofitable) for Ford to buy Teslas and sell them at a small loss than it is to sell their own EVs.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzfgpz/",
                          "created": 1727880617,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpzgh9q",
                              "score": 5,
                              "body": "Tesla also started with negative margins, that’s how the build phase of the business goes. That’s what teslas advantage has been. But since EVs represent such a small part of the revenue of ford or gm, they can stomach the negative margins while they build up the ev business. Tesla is fully tied to their ev sales and margins currently. This is about competing with Tesla in their own space",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzgh9q/",
                              "created": 1727880948,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lq2s1lv",
                              "score": 4,
                              "body": "[deleted]",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq2s1lv/",
                              "created": 1727921782,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lq3tcn4",
                                  "score": 1,
                                  "body": "It's hilarious that you're trying to lecture me while not understanding that capex has nothing to do with gross margins but with operating margin.\n\n[Tesla was never gross margin negative, except for a one-off outlier quarter.](https://x.com/alojoh/status/1826694840567931308) [Ford is hovering at -200%.](https://www.shacknews.com/article/140697/ford-f-model-e-ev-q2-2024-margins)\n\n> To put it plainly: Ford & GM are not spending the amount of a Tesla on every vehicle on a unit basis.\n\nTo put it plainly: Yes they are. That's exactly what gross margins mean.",
                                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq3tcn4/",
                                  "created": 1727942386,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lpz7q3y",
                          "score": 7,
                          "body": "GM put up a new record for EV sales this quarter and it’s still not even 10% of what Tesla did\n\nIf Tesla and China didn’t exist this would matter.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz7q3y/",
                          "created": 1727878015,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpz88gp",
                              "score": 21,
                              "body": "The fact that a legacy automaker with a p/e of 5 is taking almost 10% market share from Tesla in EVs is a huge deal. Tesla, for comparison, has a p/e of almost 70 and sells far, far fewer total cars. Losing an market share of EV sales is a significant problem for them",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz88gp/",
                              "created": 1727878191,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lpzea9e",
                              "score": 6,
                              "body": "No one is saying Tesla is in trouble. But you stated it exactly. GM is putting up new records in sales. Tesla is declining. This would not matter except that 90% of Tesla's share value is based on Tesla maintaining massive growth.",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzea9e/",
                              "created": 1727880231,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lpzi1jb",
                                  "score": 6,
                                  "body": "Teslas GROWTH is declining. They are still growing overall \n\nUnlike GM, who peaked in 2017. They’ve just managed to trick idiots into paying more for the same junk.",
                                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzi1jb/",
                                  "created": 1727881455,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lpzio3i",
                                      "score": 6,
                                      "body": "Actually no. They sold few cars than last year and their margins got way smaller. They are making about half the profit they did from last year. That is a significant decline in every metric. \n\nGM stock price is reasonable based on their profits and growth. Tesla stock price is based on 50% growth year after year. It took about a 50% decline this year in profit and 10% decline in manufacturing.\n\nAnd their key product they say their value is based on, Self Driving? On average requires critical intervention every 360 miles. To be mainstream, it needs to extend that to about 1 million miles between critical intervention.",
                                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzio3i/",
                                      "created": 1727881660,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lq04ktr",
                                          "score": 1,
                                          "body": "430k \n\nVs \n\n443k\n\nIs not a decline",
                                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq04ktr/",
                                          "created": 1727888596,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "lpzgqdf",
                              "score": 3,
                              "body": "Then buy calls 🤡",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzgqdf/",
                              "created": 1727881029,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lpzi8ry",
                                  "score": 1,
                                  "body": "I’ve been DCA out of Tesla since like $260. Sure as shit wouldn’t buy GM tho",
                                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzi8ry/",
                                  "created": 1727881521,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lpzdz5i",
                      "score": 3,
                      "body": "GM has a full frame truck that gets far more range then the CT, hauls more, and has a lower price. The CT had a initial demand that helped this one quarter but we are seeing a flood of CT for sale already on the used market. \n\nWho do you think will lead in the truck market? Tesla with a unibody and odd configuration along with low range or GM with conventional frame, decent range at a lower price?",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzdz5i/",
                      "created": 1727880128,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lq7tssb",
                          "score": 1,
                          "body": "\"initial demand\"\n\nOh wow, a talking point from 2017. Haven't seen that in a long time.\n\n\nSo if GM, an \"American\" company that makes oversized crome plated plastic disposible cars in Mexico and then sells it to misguided Americans who think they are being patriotic by buying \"American made\", actually made good cars, they would be able to sell a car or two in other markets where their Murica shtick doesn't work. Like Japan, or Europe, or rest of Asia. But nope, they can't. \n\nNot only do they not make good cars, they make dangerous cars. 200 Americans died due to the ignition issue which GM knew about for a decade but they didn't fix it. This isn't some 70s story, this happened in 2016 with the \"new\" GM. And then they fought the victims in court trying to weasel out of a settlement. Fuck GM.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq7tssb/",
                          "created": 1727997327,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lq7uvhz",
                              "score": 1,
                              "body": "LOL. The CT is not even allowed for sale in Europe because it is dangerous to pedestrians. It has sharp edges and lack of collapsible panels that is now expected to pass EU standards. GM trucks pass those safety standards and actually are allowed for sale there. \n\nSo please to do not talk about safety when it comes to the CT in any way. Tesla does not even allow 3rd party crash testing and only does it 'own' testing. Ford, GM, Toyota.... all are third party tested and certified.",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq7uvhz/",
                              "created": 1727997726,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lpz46l7",
                  "score": -5,
                  "body": "Eh, still can't compare. Look at the roads. Like 9/10 EVs are still tesla cars.",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz46l7/",
                  "created": 1727876769,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpz4ck7",
                      "score": 8,
                      "body": "Right, but only a couple years ago it was 99% Tesla. The major competitors are starting to close the gap, and Tesla appears to be slowing down",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz4ck7/",
                      "created": 1727876829,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lq0pe8p",
                      "score": 2,
                      "body": "There are two things going on:\n\n* PHEVs are more suitable for most people in rural areas so they are still not getting an EV. A few people I know got a PHEV instead of an EV waiting for charging network to get better (Washington has decent gaps in popular spots like Lake Chelan even for Teslas)\n\n* In Seattle, when it used to be 9/10 Tesla for EVs it is more like 7/10 now. I see a lot more other EVs around especially newer cars. Ioniq 5 was fairly popular last year, Rivian and Ariya's seem to be the popular choices these days if I look at cars with temp plates.\n\nThe point is, Tesla now will grow with the EV market. Their first mover advantage is gone and Musk is doing significant damage to the brand. So that 7/10 will be 5/10 next year, 3/10 the year after and then 1/10 in 5 years if this trend continues.",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0pe8p/",
                      "created": 1727895205,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lpz4ia6",
                      "score": 8,
                      "body": "In California, yes. Not true anywhere else in the US. Where I live Hyundai EVs are becoming very common.",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz4ia6/",
                      "created": 1727876885,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpz8kqz",
                          "score": 2,
                          "body": "Hertz has been offering more Kia EV6s and IONIQs lately as they’ve sold off their Teslas.\n\nE: at least to me as a frequent car renter through Hertz",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz8kqz/",
                          "created": 1727878311,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lpz6pw2",
                      "score": 4,
                      "body": "I would argue that creating a distinction between EVs and ICE creates a false dichotomy. Its rare that customers are 100% on either team EV or team ICE. EVs are competing against ICE cars and hybrids so its all the same market",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz6pw2/",
                      "created": 1727877663,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lpz6def",
                      "score": -4,
                      "body": "I see a lot of Rivians now, no way Teslas are 90% any more. I don’t see 9 teslas for every other EV. I’d say it’s probably 50/50 now",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz6def/",
                      "created": 1727877542,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpzhd5h",
                          "score": 3,
                          "body": "Your intuition is actually right. Tesla has 49.7% market share as of Q2.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzhd5h/",
                          "created": 1727881235,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpzj4e4",
                              "score": 5,
                              "body": "Yeah; that makes sense. I probably see more Rivians since I’m buying one, but I see tons of non Tesla EVs for sure",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzj4e4/",
                              "created": 1727881808,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lpz8pmv",
                          "score": 3,
                          "body": "Rivian has sold 70k cars in its history. Thats 15% of what Tesla sold this quarter.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz8pmv/",
                          "created": 1727878359,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpzfu65",
                              "score": -3,
                              "body": "So? Im just saying I’m seeing more and more of them",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzfu65/",
                              "created": 1727880738,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lpzkkx0",
                                  "score": 5,
                                  "body": "I dont even like Tesla but it was just a stupid comment. Theres 1% as many Rivians on the road as there are Teslas. The reason seeing a Rivian is so significant to you is because theyre so rare.\n\nAlso acting like having “only 50%” market share of a huge growing product is funny. Apple has been losing market share since 2012. What a suffering stock its been since /s",
                                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzkkx0/",
                                  "created": 1727882282,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lq1otur",
              "score": 2,
              "body": "> Luckily for Tesla theres still no domestic competition\n\nIronically because Biden introduced the 100% tariff on Chinese EV's saving their ass.",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq1otur/",
              "created": 1727906521,
              "depth": 2,
              "replies": [
                {
                  "id": "lq1tgop",
                  "score": 5,
                  "body": "Saving legacy autos ass\n\nIf $15k China EVs came to the states and succeeded it would instantly murder all legacy autos EV divisions.\n\nIt would slowly eat away at Tesla until they weren’t profitable at all and cause huge struggle possibly bankruptcy 5+ years in.\n\nThen once consumers fully moved away from ICE legacy auto would be completely gone.\n\nIt has nothing to with saving Tesla and everything to do with saving America",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq1tgop/",
                  "created": 1727908422,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lq2r55g",
                  "score": 3,
                  "body": "Ford and GM needed that far more than TSLA did",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq2r55g/",
                  "created": 1727921421,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq5gzxu",
                      "score": 1,
                      "body": "Sure, but most of those chinese EVs look good aesthetically and provide serious value for the consumer. give them a few years in the US market and they'd take tesla's lunch too.",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq5gzxu/",
                      "created": 1727969382,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lpzd2dx",
              "score": 4,
              "body": "Chevy truck is a full frame truck. It costs less than the CT and gets far more range. It actually may be able to do truck things. \n\nI do not plan on getting it anytime soon. Too many variables in new EV. But it has far better specs at a lower price. Pont being, their flagship truck that helped this quarter is an extremely niche and gimmicky product. Their FSD on all their vehicles is only averaging 360 miles between critical intervention.  You need that around 1 million miles before you exceed that of humans. Much of their hype is based on gimicky features and that gets old. Eventually it comes down to profits and margins. And that is being squeezed hard.",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzd2dx/",
              "created": 1727879829,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lpz69fy",
              "score": 4,
              "body": "GM is making some serious Tesla killers right now. They are competing on price and the build quality and interior of these cars is leaps above Tesla. As they now have access to the Tesla supercharger network I don't see much of a compelling reason to buy a Tesla unless you are a hardcore fan. Equinox and Blazer are direct competitors to Model Y, Lyriq compares favorably to the Model X and Silverado EV blows the Cybertruck out of the water in almost every metric.",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz69fy/",
              "created": 1727877503,
              "depth": 2,
              "replies": [
                {
                  "id": "lpzyzt0",
                  "score": 6,
                  "body": "> Tesla killers\n\nOh god, he used the words.",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzyzt0/",
                  "created": 1727886834,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lpz7xi4",
                  "score": 2,
                  "body": "Subjective. Sales says other wise.\n\nLet’s wait and see if GM has the balls to post their losses like Ford. Will it be a -100% margin as well?",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz7xi4/",
                  "created": 1727878087,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lq0b7fd",
              "score": 2,
              "body": "Hyundai/Kia makes better EVs, and is building factories to qualify for federal tax credits. A year that passes where they build up and release a 3-row SUV while Tesla does nothing except release a meme truck is a good year for Hyundai/Kia",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0b7fd/",
              "created": 1727890692,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lq0cxbl",
              "score": 0,
              "body": "Why would you say something so demonstrably untrue?",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0cxbl/",
              "created": 1727891234,
              "depth": 2,
              "replies": [
                {
                  "id": "lq0isg8",
                  "score": 1,
                  "body": "Why would you say something dramatically vague with no proof to back up your claim?\n\nThe article is praising GM for not even selling 10% of what Tesla sold",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0isg8/",
                  "created": 1727893104,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lpz9bld",
          "score": -1,
          "body": "They are not just a car company and they missed the estimate by less than 500 vehicles. Energy Storage is up from last years 4.0 GWh which is a sign of good growth.  We will have to wait for the deck to know how well they are truly doing. \n  \nI am not worried about Elon's political issues as he is backing a losing candidate, I would prefer he stay out of US politics but he is as free as any of us to put his cards on the table.",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz9bld/",
          "created": 1727878569,
          "depth": 1,
          "replies": [
            {
              "id": "lpza1mx",
              "score": 12,
              "body": "In less concerned with Elons political issues (from a business sense, personally I don’t like it), but rather with his lack of focus. He is the ceo of 3+ companies, and spends a lot of time publicly commenting on Twitter. Tesla is a major company that needs focused and strong leadership. The more than a car company is a good line, but is it one that can be supported empirically? Automotive sales are still the vast majority of their revenue",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpza1mx/",
              "created": 1727878819,
              "depth": 2,
              "replies": [
                {
                  "id": "lpzfr3o",
                  "score": 0,
                  "body": "He's been the CEO of at least 4 companies for almost 8 years now. I'd say Tesla and SpaceX have done quite a lot better than they would've with any other CEO despite his \"lack of focus\".",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzfr3o/",
                  "created": 1727880710,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpzgpzd",
                      "score": 9,
                      "body": "And I disagree. I think spacex has done quite well, but Tesla has lagged. Obviously the boring company didn’t do so well, and of course X is doing very poorly",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzgpzd/",
                      "created": 1727881025,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lq11hlr",
                          "score": 0,
                          "body": "Tesla went through production hell and managed to scale from ~100K sales a year to 2M over that period. They grew revenues faster after reaching $10B than any company in history. How is that lagging?\n\nAlso X is obviously doing great, seeing as Twitter was on course to be bankrupt by now and X is still going and rumoured to be close to running break-even.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq11hlr/",
                          "created": 1727899061,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lq130k7",
                              "score": 3,
                              "body": "They are lagging because they are ceding market share. They went from being the only game in town to having multiple rivals. \n\n\nX has allegedly lost 80% of its value since musk bought it. Advertisers have fled the platform. It’s delusional to say he’s been running it well",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq130k7/",
                              "created": 1727899551,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lpz4067",
          "score": -2,
          "body": "Meanwhile every other automaker sells 10% of Tesla's EV number and Reddit is hailing it a gigantic success.",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz4067/",
          "created": 1727876704,
          "depth": 1,
          "replies": [
            {
              "id": "lpz47sc",
              "score": 30,
              "body": "2 things. One, other carmakers sell multiple of Tesla in total vehicles, the fact they are catching up on EVs is a huge problem for Tesla. And also look at any automaker valuation next to Tesla, you’ll see Tesla is valued for exponential future growth, so any sign of that not materializing is very bad",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz47sc/",
              "created": 1727876781,
              "depth": 2,
              "replies": [
                {
                  "id": "lpz9c4o",
                  "score": 5,
                  "body": "Get outta here with your common sense and understanding of the industry!",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz9c4o/",
                  "created": 1727878575,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpzab44",
                      "score": 13,
                      "body": "Honestly the thing I notice most from a lot of comments I’m seeing is a lack of understanding about the future looking nature of the market. So many people have told me how ford/gm have only a fraction of the ev market share and don’t seem to realize that the current percentage is much less important than the direction. Competitors share is growing. Tesla share is flat or shrinking in many markets. That’s the story",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzab44/",
                      "created": 1727878908,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpzdv75",
                          "score": 4,
                          "body": ">!I was joking, of course, I wish more posters were rational and understood how it all works!<\n\nAgreed, and you can argue your fact based rationale in here, but most posters in here don’t care to understand.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzdv75/",
                          "created": 1727880092,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lpzxyeq",
                          "score": 2,
                          "body": "Do you forget that companies need to actually make money to continue operations? None of that is relevant if ford and gm don't have viable paths to profitability selling EVs. And at this point, they don't.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzxyeq/",
                          "created": 1727886502,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpzyawa",
                              "score": 8,
                              "body": "Dude I’m not sure what world you’re living in, but both ford and gm are profitable businesses. They are using that profit to launch their ev business which is new and obviously not profitable yet",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzyawa/",
                              "created": 1727886614,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lq0qrvo",
                                  "score": 3,
                                  "body": "I believe the concern is they (ICE companies) will run out of money or never reach profitability with their EVs. EVs like ICE can only be profitable at scale, you can't profit only making 10k cars/yr. Hence why Lucid, Rivian, etc. releasing much cheaper models, as they all use common SW/HW platforms or components. \n\n  \nBillions in losses isn't surprising, Lucid and Rivian doing the same. Just question on burn rate, since the EVs are being supported concurrently with ICE cars.\n\n  \nBMW and Cadillac are aggressively pricing EVs at substantial reductions of MSRP to get them moving. Often with tax credits or really low interest rates just like Tesla. By the time the ICE companies actually get a profitable economy of scale they'll be fighting several EV only companies along with Asian (BYD/KIA, Hyundia) ones. \n\n  \nThe good news for ICE companies is there's still several decades of ICE car sales remaining so they do have time.",
                                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0qrvo/",
                                  "created": 1727895642,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lpzfxee",
                  "score": -1,
                  "body": "It's hardly a problem for Tesla that legacy OEMs are bankrupting themselves by selling EVs at a 30-50K loss per vehicle sold.",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzfxee/",
                  "created": 1727880768,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lpzgsxs",
                      "score": 13,
                      "body": "You think gm and ford are bankrupting themselves? They are not",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzgsxs/",
                      "created": 1727881052,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lpzxo52",
                          "score": 4,
                          "body": "... Because they're clinging to ICE sales. Their EV business are hugely unprofitable and ramping slowly. No clear path to success there.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzxo52/",
                          "created": 1727886411,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lpzxz4q",
                              "score": 8,
                              "body": "Their ev businesses are a minuscule fraction of the larger businesses, which can easily prop them up as they scale and ramp. You make it sound as though these massive legacy automakers are dependent on their nascent ev businesses which is so far from the case",
                              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzxz4q/",
                              "created": 1727886508,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lq11e5e",
                          "score": 1,
                          "body": "Yes, they are. They are clinging to ICE/Hybrid sales which will be largely gone in 5 years, yet they have no realistic path to making money on EVs.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq11e5e/",
                          "created": 1727899031,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lpz6mts",
              "score": 6,
              "body": "Look at valuations buddy. Thats the problem with Tesla",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz6mts/",
              "created": 1727877633,
              "depth": 2,
              "replies": [
                {
                  "id": "lpzqejz",
                  "score": 3,
                  "body": "But like in the other thread, valuations no longer matter! /sarc",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzqejz/",
                  "created": 1727884163,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lpz5g1q",
              "score": -2,
              "body": "To be fair, that’s their claimed number. Read survey after survey that say that 90% of people with a college degree will never buy a Tesla. Never. Ever.",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz5g1q/",
              "created": 1727877219,
              "depth": 2,
              "replies": [
                {
                  "id": "lq07mcu",
                  "score": 3,
                  "body": "Those surveys don't sound very serious... it's easy to say outrageous things when you have no stake in the decision. Once \"Emily BLM ACAB TRAHR\" graduates and is looking to buy a car, the real cost of ownership and operation numbers make a Tesla more attractive",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq07mcu/",
                  "created": 1727889564,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq0dwoc",
                      "score": 1,
                      "body": "Tesla is more attractive than ICE cars, but not more attractive than competing EVs.\n\nEmily can buy an Ioniq 6 and get a better vehicle, period. And it'll be capable of charging at Superchargers soon.",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0dwoc/",
                      "created": 1727891542,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lpzg6bs",
                  "score": 5,
                  "body": "If anything, people who can do basic maths are more likely to buy a Tesla since they're the cheapest cars to own in the world all costs considered. If anything, it's unintelligent people who only look at a sticker price and don't realise they could be saving thousands of dollars per year.",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzg6bs/",
                  "created": 1727880848,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq0d4fn",
                      "score": 6,
                      "body": "My Kia Niro cost less to buy than a Tesla, is cheaper to repair because the parts are easy to come by and it was designed for repairability, and because of that is cheaper to insure.\n\nTesla's problem is that they aren't the only EV in town now and they no longer get to claim EV advantages as Tesla advantages.",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0d4fn/",
                      "created": 1727891296,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lq10ox7",
                          "score": 3,
                          "body": "Fair enough, the KIA Niro is pretty similar if not a bit cheaper in cost of ownership, but it's a rare exception.\n\nBesides, the Niro is significantly less safe than the Model Y, has only 65% of the Y's cargo capacity, is much slower, has worse software, worse warranty, and I could keep going for a while, so it's not exactly a comparable car.\n\nThat said, it's definitely still a decent EV and a cheap one at that. The insurance isn't that much cheaper (at least where I live) though. Either way, I would easily pay the 6K extra to get a Tesla, but if you're only looking at price you make a good point. It's still the 0.1% of cars that as cheap or cheaper than Teslas though.",
                          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq10ox7/",
                          "created": 1727898809,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lpzhzy7",
                  "score": 5,
                  "body": "Those are the same people that claim that Blackrock&Vanguard abuse financial power and buy politicians, and yet they have most of their portfolios in VUAAs and iShares.",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzhzy7/",
                  "created": 1727881441,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lpz8y2i",
                  "score": 3,
                  "body": "😂. \n\nAll the Teslas you see driving on the road, must be faked.",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz8y2i/",
                  "created": 1727878440,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lpz11xb",
          "score": -7,
          "body": "Tesla currently set a new record in Norway. In Norway new cars sales in September where 96,4% electric. Tesla had 30% of the market share of ALL cars sold here, 3 times as many as the next one on the list. A new record. Norway is a nice picture of how it will look like elsewhere when infrastructure catches up. Its probably going to be bump going forward but im sure the sales are gound to rocket next year.",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz11xb/",
          "created": 1727875605,
          "depth": 1,
          "replies": [
            {
              "id": "lpz1a29",
              "score": 13,
              "body": "The issue is if major competitors with much stronger footholds in the U.S., like GM and Ford, catch up to Tesla as infrastructure is building out. Norway is a fairly small car market",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz1a29/",
              "created": 1727875689,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lpz3kum",
              "score": 16,
              "body": "Nobody can support a $1T valuation on the “we’re big in Norway” pitch.",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz3kum/",
              "created": 1727876549,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lpz5tgh",
              "score": 4,
              "body": "In 2024 their market share is 20.8%, VW group is at 21.6%. Yes, Tesla has a solid market share, but it was 22.8% in 2023.",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz5tgh/",
              "created": 1727877349,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lq233n1",
              "score": 2,
              "body": "Norway has the same population as Minnesota. It's really quite irrelevant.",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq233n1/",
              "created": 1727912284,
              "depth": 2,
              "replies": [
                {
                  "id": "lq3rrvi",
                  "score": 1,
                  "body": "Irrelevant ok, but all cars will be electric by 2040 anyway, you dont agree on that?",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq3rrvi/",
                  "created": 1727941233,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lpz4df2",
              "score": 3,
              "body": "Norway numbers are sometimes quite skewed because Tesla ships in large quantities at a time, so sometimes they peak quite high and dip for a while depending on the shipment timing. So I am not sure it is that representative.\n\nYou really have to look at Norway per year, it spikes too much on a quarterly basis.",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz4df2/",
              "created": 1727876838,
              "depth": 2,
              "replies": [
                {
                  "id": "lpz8g3c",
                  "score": 2,
                  "body": "Insightful, thank you",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz8g3c/",
                  "created": 1727878266,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpzi18x",
      "score": 14,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzi18x/",
      "created": 1727881453,
      "depth": 0,
      "replies": [
        {
          "id": "lq0cfrq",
          "score": 10,
          "body": "Wait until they pull out their profit numbers at the end of the month.\n\nThe only reason their delivery aren't worse is because of their 0% financing.",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0cfrq/",
          "created": 1727891081,
          "depth": 1,
          "replies": [
            {
              "id": "lq21bpg",
              "score": 7,
              "body": "yeah they juiced the deliveries numbers as hard as they could and they still came up short, sad",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq21bpg/",
              "created": 1727911605,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lqepu9h",
              "score": 2,
              "body": "Sounds like a good 2 DTE yolo opportunity on some OTM puts.",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lqepu9h/",
              "created": 1728100580,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lq0b8tr",
          "score": 1,
          "body": "To be fair, this wasn't a big miss. Overall, Tesla's future looks suspect, but not meaningfully more suspect than it did before the release of its Q3 deliveries, so whatever fears the market has about Tesla were mostly already priced in.",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0b8tr/",
          "created": 1727890704,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lq1shom",
          "score": 0,
          "body": "They also barely missed deliveries bby about 500 cars.  Less than 0.1%.",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq1shom/",
          "created": 1727908030,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lpz5faa",
      "score": 31,
      "body": "Tesla shouldn't be worth more then Toyota.",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz5faa/",
      "created": 1727877211,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpzonmn",
      "score": 6,
      "body": "remember the inverse Reddit strategy",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzonmn/",
      "created": 1727883604,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpz7tcu",
      "score": 16,
      "body": "Their valuation is unjustified",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz7tcu/",
      "created": 1727878047,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpz6p6r",
      "score": 18,
      "body": "Who would have thought that a company run by a terminally online CEO would have QA/QC problems. Word of mouth marketing goes a long long long way in the automobile industry.",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpz6p6r/",
      "created": 1727877656,
      "depth": 0,
      "replies": [
        {
          "id": "lpzhdzc",
          "score": 4,
          "body": "We cancelled our Tesla (would have been our second after selling our 2021 for more than we bought it for during Covid) right before we were about to pick it up because he was posting offensive nonsense on Twitter.  He just doesn’t understand who his buyers are.  I love the environment, being kind to people, etc., being associated with him via my car is a no-go.",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzhdzc/",
          "created": 1727881242,
          "depth": 1,
          "replies": [
            {
              "id": "lpzycef",
              "score": 1,
              "body": "More than that Tesla has a very bad build quality. Can't have a good reputation when Rich Rebuilds mocks your engineering.",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzycef/",
              "created": 1727886627,
              "depth": 2,
              "replies": [
                {
                  "id": "lqpcpwm",
                  "score": 1,
                  "body": "This is absolutely no longer true and even when it was it was just fit and finish. Tesla is the most reliable EV you can buy when you care about just getting from point A to point B",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lqpcpwm/",
                  "created": 1728260750,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lpzkp47",
              "score": 1,
              "body": "Not everyday you hear about selling a car with profit lol",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzkp47/",
              "created": 1727882319,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lq0fl56",
          "score": 1,
          "body": "Who would have thought that vehicles designed to be as cheap to produce as possible would have QC issues?\n\nI don't know how Tesla gets such a pass on things like not having an instrument panel or steering wheel stalks, for no reason other than to save them money on manufacturing. Call me crazy, but I'll pay an extra $500 if it means I can see my speed without looking to the side. \n\nOr no one talks about Elon literally telling people building the cars to use fewer bolts to save money. \n\nWhen I'm driving a multi-ton machine that can kill me and others at any moment, I don't like knowing that the CEO pinches pennies on construction of it, but apparently that makes me weird.",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0fl56/",
          "created": 1727892069,
          "depth": 1,
          "replies": [
            {
              "id": "lq0r6ex",
              "score": 1,
              "body": "I mean, most cars you have to look down to see your speed. Still requires you to look away from the road so what’s the concern there?",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0r6ex/",
              "created": 1727895773,
              "depth": 2,
              "replies": [
                {
                  "id": "lq0wkg8",
                  "score": 1,
                  "body": "Most cars you can keep both your speed and the road in your field of view. You can't focus on both at once, but you can passively view the road while you focus down. \n\nTeslas make that much harder with the speed further down and well to the side.",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0wkg8/",
                  "created": 1727897493,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq18le4",
                      "score": 1,
                      "body": "That’s fair but from my 5 years experience driving both a Y and a S you can quickly glance to see speed while keeping traffic in your periphery for the split second you glance it similar to any other standard vehicle. \n\nAnd I say this after turning in my rental car with a standard cluster that still required me to glance away at similar intervals and length of time.",
                      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq18le4/",
                      "created": 1727901298,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpzfnzc",
      "score": 20,
      "body": "\"But they're a tech company!!!!\" - this sub, 3 years ago.",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzfnzc/",
      "created": 1727880682,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpzocwk",
      "score": 3,
      "body": "So glad i realized my losses yesterday. Opened a short position as well",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzocwk/",
      "created": 1727883508,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpzoc4c",
      "score": 5,
      "body": "Company whose CEO routinely makes ridiculous promises fails to meet expectations? Color me shocked!",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzoc4c/",
      "created": 1727883501,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpzdf5u",
      "score": 3,
      "body": "Are they still making 20 million cars by 2030 as promised?",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzdf5u/",
      "created": 1727879946,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpzbd0v",
      "score": 4,
      "body": "Surprised it’s not down more.",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzbd0v/",
      "created": 1727879264,
      "depth": 0,
      "replies": [
        {
          "id": "lq4r9va",
          "score": 1,
          "body": "Just wait! Mellon the felon will be bringing that stick down like xitter!",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq4r9va/",
          "created": 1727961297,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lq2he9b",
      "score": 2,
      "body": "It’s pretty much in line so the # is meaningless now. We all know what everyone wants to see. Next week’s Robotaxi event at Hollywood Studios. \n\nThat’s the real pumper",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq2he9b/",
      "created": 1727917719,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqg0c1z",
      "score": 2,
      "body": "This company is a joke.  And nobody buys Trumpsla’s anymore.  The guy went full Mike Lindell and ruined the company.",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lqg0c1z/",
      "created": 1728130319,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpzoqf4",
      "score": 7,
      "body": "Meanwhile Stellantis (Chrysler, jeep, ram) sold 305,294 for the quarter, down 20%.  Ford did ok with 504,039, a 0.7% increase, and GM did 659,601 total vehicles, down 2%.  When you look a Tesla, they only have 5 models to choose from, and somehow they sell about the same or more than the big 3.  The last two models tesla introduced are the model Y, which is now the world best selling car, and the cybertruck, which is now the best selling automobile over 100k in the USA.  Whatever the next model is will move the needle significantly and the stock will reflect that.",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzoqf4/",
      "created": 1727883629,
      "depth": 0,
      "replies": [
        {
          "id": "lq0zr7s",
          "score": 9,
          "body": "Values from Y! Finance. When you're trading 10x PE from other automakers you are under much more increased scrutiny.\n\nStellantis - 2.75 FWD PE  \nFord - 5.43 FWD PE  \nGM - 4.59 FWD PE  \nToyota - 7.59 FWD PE  \nTesla - 87.72 FWD PE",
          "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq0zr7s/",
          "created": 1727898512,
          "depth": 1,
          "replies": [
            {
              "id": "lq1nfps",
              "score": 0,
              "body": "Check with all those GM shareholders who got wiped out in the last recession and lost everything while the “new” GM took all the assets.  Most car companies are just government job programs.",
              "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq1nfps/",
              "created": 1727906042,
              "depth": 2,
              "replies": [
                {
                  "id": "lq1w9qj",
                  "score": 3,
                  "body": "You do realize that a positive PE ratio means the company is making money, right?\n\nGM TTM net income is $10.8B. TSLA TTM net income is $12.4B.\n\nInterestingly, TSLA Q1/Q2 2024 carbon subsidy was $440M/$890M. So basically of the $12.4B in net income, about 1/3-1/2 is from direct government subsidies.",
                  "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq1w9qj/",
                  "created": 1727909628,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lq11dyg",
      "score": 2,
      "body": "Tesla is an enigma of sorts. Every year it's something else and it always seems to trade on the future of whatever's next, never the facts of the present day. It's a car company. An energy company. An autonomous driving company. Robotaxi. An AI company. Oh and they will have a robot soon... I'll give Elon that he's an absolute genius - not at inventing things, at hype. \n\nAll of that said, if they pull of autonomous driving, robotaxi and the Optimus robot in the next 18 months, the shares are not undervalued. It's just that he rarely delivers on these lofty promises.",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq11dyg/",
      "created": 1727899029,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq9c2cy",
      "score": 1,
      "body": "462k MAGA hats is a lot tho",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lq9c2cy/",
      "created": 1728019912,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpzrqjd",
      "score": 1,
      "body": "I used to want one and now I refuse to buy one because of Musk, great job",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzrqjd/",
      "created": 1727884586,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpzl9sy",
      "score": 1,
      "body": "See this is why you never short TESLA,!",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzl9sy/",
      "created": 1727882505,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpzhyds",
      "score": -1,
      "body": "It’s already bouncing back. Since selling 460,000 teslas in 3 months is actually quite incredible, and that’s the most cars they sold ever in a Q3 of any year. Q4 sales are exploding now that the FED FINALLY dropped rates. This is that elusive ‘bargain’ price you always hear about. Buying when others are fearful!",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzhyds/",
      "created": 1727881426,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpzzd0x",
      "score": 0,
      "body": "Luckily the next scam is scheduled for next week....something something robo taxi",
      "permalink": "/r/stocks/comments/1fuftc7/tesla_stock_slips_after_it_reports_462890_total/lpzzd0x/",
      "created": 1727886953,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "Tesla stock slips after it reports 462,890 total deliveries during the third quarter.",
    "companies": [
      "Tesla",
      "BYD",
      "Geely",
      "Li Auto",
      "Nio",
      "Rivian",
      "Ford",
      "General Motors",
      "Hyundai",
      "Waymo",
      "Pony.ai",
      "FactSet"
    ],
    "tickers": [
      "TSLA",
      "GM",
      "F"
    ],
    "main_ticker": [
      "TSLA"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Tesla reports third-quarter vehicle production and deliveries, facing increased competition but sees stock slip after falling short of delivery expectations.",
    "stock_recommendations": "The user is not recommending to buy or sell Tesla stock.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "The sentiment is neutral as there is no explicit recommendation on buying or selling Tesla stock, despite reporting figures and market context.",
    "sentiment": "neutral"
  }
}