{
  "title": "What’s going on with Novo Nordisk (NVO)?",
  "score": 59,
  "selftext": "The stock did have a pretty nice run in the last year, but it’s slid in the past few months (~20% since it’s High in June) for no clear reason (I understand it should have dropped short term based on the below, but this seems a little more than I would have expected). Their capacity was stretched, so they acquired manufacturers and also are working to expand their own internal capacity. Compared to LLY it seems like this company is more focused and leaner, which to me seems like a plus. They lowered forecasts, but I didn’t see this as warranting the drop it ended up seeing.\n\nPeople aren’t going to just stop needing their medication, also from what I understand right now they have one of the most competitive oral pills for weight loss in the pipeline right now and working to offer their medication in China which has one of the largest obese populations in the world. \n\nLastly it’s PE/Forward PE aren’t too high versus the average of the industry. LLY on the other hand has a PE over 100 right now and a forward PE in the 30 range. I don’t particularly buy this, both LLY and NVO have research in the pipeline, but don’t see how LLY can lower their PE by that much in the next year or so. \n\nI only bring up LLY in all of this because it seems like it’s been hit less than NVO. Both drugs are pretty overpriced (can stem from a  lack of regulation of PBMs) so for all this senate hearing noise, I don’t see why it effects one more than the other besides the fact that LLY is a US company and NVO is not.\n\nWhat’s everyone else’s take on this? Is there something I’m missing here?\n\nEdit: in regard to capital structure, LLY also has a greater reliance on debt than NVO. Dont necessarily think this is a bad thing, but worth noting NVO isn’t growing/expanding through added debt. ",
  "link_flair_text": "Company Discussion",
  "id": "1fuia8k",
  "num_comments": 54,
  "created_utc": 1727881291,
  "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/",
  "comments": [
    {
      "id": "lpzk31p",
      "score": 31,
      "body": "LLY's more diversified, has had success elsewhere beyond obesity + their obesity drug is more highly regarded then NVO's. There is already discussion of the next generation of obesity drugs and NVO's CB-1 drug didn't have great results the other week in terms of side effects/AE: https://www.fiercebiotech.com/biotech/novos-obesity-drug-linked-mild-moderate-neuropsychiatric-side-effects-phase-2. VKTX's drug (https://vikingtherapeutics.com/pipeline/metabolic-disease-program/vk2735/) is highly regarded, with lower side effects than most.\n\n\"Compared to LLY it seems like this company is more focused and leaner, which to me seems like a plus.\"\n\nIt can be but that's often an \"it is until it isn't\" imo; it's great when the theme in question is big but the moment others start to become competitive (I'd be surprised if a large pharma co w/o obesity exposure doesn't eventually buy VKTX) and/or trials start disappointing, the name is going lower. I'd rather the more diversified company. \n\nI think the NVO selloff is overdone at this point, but not without some reason behind it imo.\n\nInteresting discussion of tirzepatide vs semaglutide https://www.reddit.com/r/tirzepatidecompound/comments/1bzskn9/how_much_better_is_tirzepatide_semaglutide/",
      "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lpzk31p/",
      "created": 1727882120,
      "depth": 0,
      "replies": [
        {
          "id": "lq41zj6",
          "score": 5,
          "body": "NVO will likely acquire Nanexa within months for their PharmaShell technology. Nanexa’s tech allows for monthly injections with lower side effects, due to the technology basically drip feeding the medicine.\n\nThey’re about 2 years in with a development deal with an undisclosed amount of substances. Nanexa’s own phase 1 with Liraglutide is about a month from concluding and they’ve presented great results so far.\n\nMight give NVO the edge longterm.",
          "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq41zj6/",
          "created": 1727948616,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lq12dcn",
          "score": 3,
          "body": "If LLY cannot compound and supply tirzapetide and other simpler made GLP-1 receptor agonist drugs, how is LLY going to supply is mass quantity their better GLP1 agonists? Also the CB-1 drug failure was so fucking predictable its funny--Why would you go after cannabinoid receptors when there are so many other better targets in the brain and mechanisms of action to go after? Of course the cannabinoid receptors are going to have more side effects if you modify them strictly.",
          "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq12dcn/",
          "created": 1727899343,
          "depth": 1,
          "replies": [
            {
              "id": "lq1dxeq",
              "score": 6,
              "body": "I hope you’ve seen LLY $4.5B investment announced today amongst a myriad of other investments to bolster their TZP manufacturing capabilities. They will absolutely be able to meet demand. And that doesn’t take into consideration their potential upcoming weightloss pill that will allow further market penetration/consolidation. \n\nThings look solid for LLY",
              "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq1dxeq/",
              "created": 1727902945,
              "depth": 2,
              "replies": [
                {
                  "id": "lq1rhjw",
                  "score": 3,
                  "body": "Comparatively NVO spent upwards of $10B already this year to expand their production capacity with a M&A deal with Catalent. They announced those steps to improve production 8 months ago. This isn’t including any internal investment. As I said earlier too LLY tends to prefer taking on debt as well for expansion, whereas Nordisk doesn’t have their capital structure set up like this. \n\nAdditionally, orforglipron (Eli Lilly’s weight loss pill) leads to ~8-10% weight loss in 3 months whereas amycretin (Nordisk’s) leads to ~13% in the same time period. I’m just trying to understand why it seems the market is treating Nordisk as losing in this race when so far its future in this specific space looks brighter in terms of efficacy and production growth prospects.\n\nMy point in all this is it makes sense the stock did drop in the short term, but 20% feels overblown given their long-term prospects haven’t dramatically changed.",
                  "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq1rhjw/",
                  "created": 1727907552,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq24ijo",
                      "score": 4,
                      "body": "Oh I totally understand all your points and it’s fair. What you are missing are the other investments Lilly has made including a previously announced $9B manufacturing facility in Lebanon, IN. None of that includes the myriad of other therapeutic spaces they are actively investing. \n\nI would also double check your data for orforglipron. Data presented by Lilly suggests weightloss up to 14% with statistically significant weightloss of ~13% at a dose that appears to be lower than what NVO uses for their pill. \n\nI don’t think folks are treating NVO as the loser but semaglutide is an older generation drug and LLY has started to outpace them. NVO will of course present some amazing next gen products including their triple agonist that is in development. \n\nAt the moment LLY is the better bet but they will both see strong performance over the next 5 years with their own ups and downs.",
                      "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq24ijo/",
                      "created": 1727912820,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lpznzy0",
          "score": 2,
          "body": "Saw the CB-1 results. This isn’t necessarily a bad thing though. Drug companies might test out different types of drugs that treat the same things. Their CB-1 drug isn’t their frontrunner when it comes to the oral pills they’re researching, that would be amycretin. Each drug has a different approach to achieving weight loss. I think of it as them testing which one performs best overall.  \n\nI agree on how being leaner isn’t necessarily a good thing all the time. 40% of LLYs revenue comes from obesity and diabetes medication versus around 75% for NVO. All to say a sizable chunk of revenue for both companies is in this segment. But to be fair most of LLYs profit comes actually from other drugs. \n\nWhen it comes to companies like Viking Therapeutics my opinion is they’d still run into capacity problems that the bigger manufacturers are running into. In that regard I can’t see it eating into LLY and NVOs sales.",
          "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lpznzy0/",
          "created": 1727883391,
          "depth": 1,
          "replies": [
            {
              "id": "lq12prs",
              "score": 2,
              "body": "I certainly like how NVO has a sole focus on obesity and metabolic health for their company. Their drugs like semaglutide are easier to make and compound, and distribute with more storied research behind them. I feel like most people do not know shit about the differences between these drugs, especially those pesky suits on CNBC.",
              "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq12prs/",
              "created": 1727899454,
              "depth": 2,
              "replies": [
                {
                  "id": "lq1levj",
                  "score": 2,
                  "body": "Based on the market reaction it definitely seemed that way. Guess that’s part of the risk of healthcare stocks.",
                  "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq1levj/",
                  "created": 1727905358,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpzzhiy",
      "score": 13,
      "body": "Isn’t NVO being grilled by the congress for their pricing strategies?",
      "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lpzzhiy/",
      "created": 1727886993,
      "depth": 0,
      "replies": [
        {
          "id": "lq06r60",
          "score": 10,
          "body": "Meanwhile congress just looking for insider trading",
          "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq06r60/",
          "created": 1727889290,
          "depth": 1,
          "replies": [
            {
              "id": "lq0mowx",
              "score": 1,
              "body": "Very possible",
              "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq0mowx/",
              "created": 1727894349,
              "depth": 2,
              "replies": [
                {
                  "id": "lq82zx1",
                  "score": 2,
                  "body": "For themselves to do",
                  "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq82zx1/",
                  "created": 1728000712,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lq0lhzu",
          "score": 2,
          "body": "True, but not their fault. Just the messed up system of the US… like.. obvious?",
          "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq0lhzu/",
          "created": 1727893970,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lq1mlfi",
          "score": 2,
          "body": "They are but when you compare, really LLY should be getting grilled for the same thing, and the PBMs should be getting called to hearings as well. \n\nTo me it seems like election year virtue signaling. You have a regulatory body asking why unregulated drug list pricing is so high. It’s their job to add regulations so that there’s a cap. Practically every other country does, we don’t and politicians at this point choose not to. \n\nIn the case of obesity and diabetes PBMs drive up list prices during negotiations so they can get favorable rebates. PBMs are middlemen that are also publicly traded like Cigna and CVS so they stand to lose more performance wise if they don’t keep those prices high. NVO could slash prices and still keep a very healthy margin and potentially even sell more volume, but if they don’t agree to PBM list prices they risk getting removed from their formularies which means lower sales all together and people not getting medication from NVO. \n\nIt’s one major factor (not all) that causes the price of diabetes and obesity medication to be so high in the US but low everywhere else.",
          "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq1mlfi/",
          "created": 1727905758,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lq27f65",
          "score": 1,
          "body": "NVO has been getting grilled by Congress for the last 15 years. Same song and dance but like in the past nothing substantial will come of it.",
          "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq27f65/",
          "created": 1727913921,
          "depth": 1,
          "replies": [
            {
              "id": "lq2c3yf",
              "score": 1,
              "body": "Oh okay…I figured the stock was dropping due to this congress thing. Still a solid long term stock",
              "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq2c3yf/",
              "created": 1727915727,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lq6mibm",
      "score": 3,
      "body": "I can't speak for other drugs, but Lilly is far ahead of Novo in the obesity medicine space at the moment. They may have gotten a head start with Ozempic, but Lilly now has more effective drugs in play that are no longer in shortages. Semaglutide (Ozempic/Wegovy) is significantly less effective than Tirzepatide (Mounjaro/Zepbound). Retratutide is coming down the line soon enough for Lily and all indications are that it will be even more effective than Tirzepatide. No one wants a less effective weight loss plan, especially when you're talking about $1,000+ per month for folks who pay out of pocket.",
      "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq6mibm/",
      "created": 1727982816,
      "depth": 0,
      "replies": [
        {
          "id": "lq7g8dv",
          "score": 1,
          "body": "I’ve heard Retratutide is better than Cagri-Sema in how it works and has less symptoms. They’re both injectables though and thinking towards the long-term personally I don’t think injectables for obesity treatment are the future. \n\nFor the long-term imo, the one who wins in the obesity space is whoever nails the oral treatment strategy, including having favorable \ncost and production capacity. That means amycretin vs orforglipron. \n\nI think people will prefer oral vs injectable at a slight cost to effectiveness. In that sense I lean towards focusing on that race for oral treatment over injectable treatments.",
          "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq7g8dv/",
          "created": 1727992352,
          "depth": 1,
          "replies": [
            {
              "id": "lq849ms",
              "score": 2,
              "body": "I'm very curious to see how it will all eventually pan out. Given a choice at a similar cost I would prefer a once a week injectable over something I have to remember to take daily.",
              "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq849ms/",
              "created": 1728001186,
              "depth": 2,
              "replies": [
                {
                  "id": "lq8wasq",
                  "score": 1,
                  "body": "Yeah that’s the one drawback of oral treatments, should be interesting to see once they roll out at scale what people tend to prefer.",
                  "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq8wasq/",
                  "created": 1728011962,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lqxzxzs",
                  "score": 1,
                  "body": "you are probably in a \"very big\" minority. the only reason why im not on these drugs yet is because i dont like the whole aspect of injecting... and i suspect 95% of people are like me... give me this drug in a pill and i'm signing up in a queue on day 1.",
                  "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lqxzxzs/",
                  "created": 1728397753,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpzjum4",
      "score": 7,
      "body": "NVO has a forward P/E of 29. I fail to see what the discrepancy here is. Stocks run up, then they rebalance to fair value. That fair value seems to be similar to LLY.",
      "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lpzjum4/",
      "created": 1727882044,
      "depth": 0,
      "replies": [
        {
          "id": "lq12sa5",
          "score": 5,
          "body": "LLY is comparatively overvalued in my opinon",
          "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq12sa5/",
          "created": 1727899477,
          "depth": 1,
          "replies": [
            {
              "id": "lq1qogf",
              "score": 4,
              "body": "Believe it or not, it's possible for multiple companies in an industry to be overvalued.",
              "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq1qogf/",
              "created": 1727907171,
              "depth": 2,
              "replies": [
                {
                  "id": "lq1ty5y",
                  "score": 2,
                  "body": "I think the point is the industry has an estimated CAGR of 8-10% over the next few years and one of the two companies we’re discussing is much much closer to fair value and yet comparatively slid more than twice as much in the same period of time. It’s not so much why it dropped, it makes sense that it did, it’s more so why its dropped so much.",
                  "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq1ty5y/",
                  "created": 1727908617,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq1undn",
                      "score": 5,
                      "body": "LLY will drop too sooner or later. Both NVO and LLY had parabolic price moves upward. Neither is sustainable.",
                      "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq1undn/",
                      "created": 1727908903,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lq6m9ge",
                          "score": 1,
                          "body": "I agree some of the highs for NVO specifically felt premature given their product capacity issues. It those jumps also occurred close to announcements around amycretin which also probably added momentum. \n\nI will say their growth trajectory was notable over the past few years, and there’s going to be some work on their end before it can start picking up momentum again. Seems like it’ll be some time before momentum builds up again.",
                          "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq6m9ge/",
                          "created": 1727982738,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ls3gqo2",
                          "score": 1,
                          "body": "Analysis ratings suggest a strong buy. Is that for long term horizon? Are you suggesting this correction soon?",
                          "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/ls3gqo2/",
                          "created": 1729024179,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ls3xfnq",
                              "score": 1,
                              "body": "I don't give a damn about analyst ratings. They're meaningless. I expect Novo Nordisk to continue to correct.",
                              "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/ls3xfnq/",
                              "created": 1729029694,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ls4wxg3",
                                  "score": 1,
                                  "body": "Correct to how much?",
                                  "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/ls4wxg3/",
                                  "created": 1729042952,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lpzxflh",
      "score": 4,
      "body": "I mean with all the hype over the past year its expected to finally rebalance right? Just like the clean energy, EV, AI hype.",
      "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lpzxflh/",
      "created": 1727886335,
      "depth": 0,
      "replies": [
        {
          "id": "lq1nqb7",
          "score": 3,
          "body": "I agree that hype can drive up stock prices. \n\nBut whereas AI and EVs are a market where people can lose interest and the value of such products /services can change, you may NEED medication if you’re morbidly obese and you NEED medication for some forms of diabetes. Additionally, you may prefer medication if you’re not morbidly obese but feel the need to lose weight. \n\nIn that sense it’s an industry based a little more on need rather than preference, and growing need at that (ex. ~14% people in China are obese up from just 8% in 2018).",
          "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq1nqb7/",
          "created": 1727906143,
          "depth": 1,
          "replies": [
            {
              "id": "lq1sckz",
              "score": 2,
              "body": "Im not an expert trader, let alone a regular trader, but as one thing I have realized is that the market can and will be irrational. I don't think everything can be explained. This 20% drop is probably insignificant in the grand scheme of things. If you got in a year ago this is just regular variability of a crazy hot stock. And sure, demand has probably increased over the past year, but I don't think revenue from this drug has increased dramatically from this drug to explain this 2x increase in company value. So to me, this just feels like FOMO and people wanting to take profits. Again, I do not have a finance background. But to your point, I don't think the company stock price will dramatically decrease, this miracle drug will continue to be in demand. What I obviously can't predict is how much higher the stock will go.",
              "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq1sckz/",
              "created": 1727907968,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lr66g2c",
      "score": 2,
      "body": "Now is the time to get 2026 calls",
      "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lr66g2c/",
      "created": 1728516362,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq7lnii",
      "score": 1,
      "body": "They are leaner than Lilly, but not in a good way in the US. \n\nrecognize the gorilla in the room.",
      "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq7lnii/",
      "created": 1727994312,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqi8gof",
      "score": 1,
      "body": "What are everyone's thoughts on HIMS?",
      "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lqi8gof/",
      "created": 1728157730,
      "depth": 0,
      "replies": [
        {
          "id": "lqkeb6e",
          "score": 2,
          "body": "HIMS is something I’m a bit weary of. They have an oral medication that’s only a short-term treatment, and it’s not a compounded medication so it would be less effective than your traditional GLP-1. Plus from what I understand it’s $2400 upfront for a year or something like $250-$400 per month. Being non-compounded it’s not as effective and not intended to be a long term treatment. So it doesn’t work for everyone and I don’t think it’s covered by insurance. In that regard it sounds like a niche market. \n\nIt should be noted that none of what it sells is FDA approved. Not sure if this would really affect their oral medications. \n\nAs for the GLP-1 HIMS recently began offering, this would be compounded and can be a longer term treatment, but my understanding is they’re only allowed to sell this in the first place because there’s a shortage right now. If/when Nordisk ends its shortage on GLP-1s I think the FDA at that point would demand HIMS to pull GLP-1s from their shelves. \n\nSo yes, they do have that loophole to sell without approval because of the shortages, but at the same time we don’t even know if HIMS is violating patents or is unsafe and ineffective as far as their GLP-1s go.\n\nPersonally, I’m not a fan of tossing someone desperate to lose weight who took a 10 minute survey and never talked to a doctor some drugs to inject into themselves. Don’t know if when all is said and done FDA approved GLP-1 makers or the FDA would be okay with this either so IMO it’s sounding real risky.",
          "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lqkeb6e/",
          "created": 1728186340,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr2clwe",
      "score": 1,
      "body": "Im going with a NVO bounce back up to new high now that profit takes are gone. Buying more shares now",
      "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lr2clwe/",
      "created": 1728464547,
      "depth": 0,
      "replies": [
        {
          "id": "lvv3a3d",
          "score": 2,
          "body": "I was hoping it'd bounce back but it keeps dropping...",
          "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lvv3a3d/",
          "created": 1730965058,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lq35185",
      "score": 1,
      "body": "Buy GILD",
      "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq35185/",
      "created": 1727927423,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lpzs4vi",
      "score": -4,
      "body": "H&S pattern shows price target to 100$. I dumped over a week ago.",
      "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lpzs4vi/",
      "created": 1727884713,
      "depth": 0,
      "replies": [
        {
          "id": "lq0wo6u",
          "score": 1,
          "body": "Elaborate?",
          "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq0wo6u/",
          "created": 1727897526,
          "depth": 1,
          "replies": [
            {
              "id": "lq11r5t",
              "score": 0,
              "body": "There is a technical pattern called head and shoulders that you see at the ends of trends. It's a reversal signal. Read more on the Google.",
              "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq11r5t/",
              "created": 1727899146,
              "depth": 2,
              "replies": [
                {
                  "id": "lq1onhu",
                  "score": 1,
                  "body": "I don’t know how much H&S applies here, with news waves around congressional hearings and mixed runner-up oral pill results this added some noise to the charts. Some of that noise imo is short-term. \n\nI’m looking at this from a long term perspective. With all the shorter term noise aside, if it’s a failing business. I’m not seeing why they would be, they they didn’t take any substantial debt via M&As to expand their capacity which is impressive and often ran into a problem where they didn’t have enough medication to distribute rather than not having someone to distribute to. It’s still a problem but certainly a better problem to have.",
                  "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq1onhu/",
                  "created": 1727906460,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lq31i0t",
      "score": 0,
      "body": "Profit taking. Any stock that runs up so much is at risk of dropping.",
      "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq31i0t/",
      "created": 1727925787,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq1r4ay",
      "score": -3,
      "body": "The stock is overvalued. Simple as that.",
      "permalink": "/r/stocks/comments/1fuia8k/whats_going_on_with_novo_nordisk_nvo/lq1r4ay/",
      "created": 1727907354,
      "depth": 0,
      "replies": []
    }
  ]
}