{
  "title": "Hedge Funds are dumping energy stocks at the fastest pace since June 2022 according to Goldman Sachs",
  "score": 42,
  "selftext": "https://twitter.com/Barchart/status/1840982914831438207?t=KGgpDh5eP2UpJBngLtMX0w&s=19\n\n funds have been offloading US energy stocks at the fastest rate seen in five years marking the sector as the most heavily sold on Goldman Sachs’ prime brokerage trading desk last week, according to a report by Reuters.\n\nThe report cites a note sent to clients on Friday as highlighting that the rapid increase in short positions came as the S&P Energy Index (SPNY) dropped nearly 5% in the week leading up to 26 September. Although the sector rebounded with a 1% rally on Friday, driven by hopes of more Federal Reserve rate cuts following a soft inflation report, hedge funds had already ramped up their bearish bets.\n\nGoldman Sachs noted that hedge funds targeted a variety of US energy companies, including oil and gas firms, consumable fuel providers, and equipment suppliers. The proportion of short bets outpaced long positions by a ratio of nearly six to one, signalling significant bearish sentiment in the sector.\n\nThe surge in short selling last week continued a broader trend of sustained divestment, with hedge funds having been selling off energy stocks for five consecutive weeks.\n\nThe selloff comes amid a gloomy outlook for oil prices. A recent Reuters poll of 41 analysts and economists projected that Brent crude would average $81.52 per barrel in 2024—its lowest forecast since February and down from August’s estimate of $82.86.",
  "link_flair_text": null,
  "id": "1fukus9",
  "num_comments": 18,
  "created_utc": 1727887610,
  "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/",
  "comments": [
    {
      "id": "lq04g90",
      "score": 88,
      "body": "When GS publishes this, it’s already late. \n\nBuy energy stocks it is.",
      "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq04g90/",
      "created": 1727888556,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq0olnb",
      "score": 25,
      "body": "Buy signal",
      "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq0olnb/",
      "created": 1727894956,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq1x2up",
      "score": 14,
      "body": "A qualifier should have been added: not all energy companies, but mostly oil and gas-related companies were shorted.  Energy producers and distributors did quite all right thank you.",
      "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq1x2up/",
      "created": 1727909955,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq2lcwo",
      "score": 5,
      "body": "Why is XOM pumping then?",
      "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq2lcwo/",
      "created": 1727919201,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq4c07u",
      "score": 5,
      "body": "China's financial data is a black box. Nothing their government says about their economy can be independently verified in any way. The wars in the middle east have been going on for literal thousands of years, and through all that time, you can almost say that western actions have *never once* had a desired result. On top of all of that, energy is an inherently volatile sector. It bounces all over the place like a fuckin hippity hop toy from the 90s any time there is news... any news, at all, about anything.\n\nThese are dumb categories to target for additional exposure. A targeted Defense and Aerospace position of some kind doesn't hurt to buy and hold, but you should already have enough China exposure through your previously established Emerging Market coverage. Anyone who doesn't already have some exposure to energy: this is what people mean when they tell you to diversify. You wouldn't be chasing performance and trying to add something if you already had exposure to energy because you bought it for diversification before any of this news.",
      "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq4c07u/",
      "created": 1727954655,
      "depth": 0,
      "replies": [
        {
          "id": "lq84anv",
          "score": 2,
          "body": "I have a couple quick questions, since you seem knowledgeable on these topics (if you happen to have the time)\n\n1. I keep hearing China is a black box. Do we appear to be one to them? Or are they uniquely shut off, moreso than, say, Bureau of Labor & Statistics stuff is in the US (couldn't they make up numbers too? or is ours more reproducible/documented?) Is it that they've been proven untrustworthy, or they're truly just private?\n2. I'm 80% VOO ATM. was considering 60/20/20 VOO/AVUV/VXUS, but then heard some people shitting on ex-US. How do I actually decide for myself what diversification matters? I'm willing to do the work and research, just wondering how you even decide whether to add VXUS",
          "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq84anv/",
          "created": 1728001197,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lq1nc55",
      "score": 5,
      "body": "I’d think China stimulus and war in the Middle East would be bullish no?",
      "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq1nc55/",
      "created": 1727906008,
      "depth": 0,
      "replies": [
        {
          "id": "lq3zv42",
          "score": 3,
          "body": "China stimulus maybe, maybe not\n\nWar in the middle east is always a nothingburger - even the huge surge of ISIS in 2014 didn't disrupt any Iraqi oil shipments in the end, despite only being 30 miles from the capital at one point\n\nAnd now you have an escalation to be sure, but among factions who have been fighting for decades, none of which are major oil suppliers. And the strait of Hormuz fears are also always a nothingburger",
          "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq3zv42/",
          "created": 1727947104,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lq320xb",
          "score": 1,
          "body": "I think the ME earnings are actually the main cause for any and all recent up action.",
          "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq320xb/",
          "created": 1727926019,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lq2cx7e",
          "score": -1,
          "body": "I understand China long term is stimulus for lng\n\nNot sure oil\n\nI think China buying from russia for oil as part of brics?",
          "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq2cx7e/",
          "created": 1727916037,
          "depth": 1,
          "replies": [
            {
              "id": "lq50asu",
              "score": 2,
              "body": "China buys 80% of its oil from the persian gulf countries...",
              "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq50asu/",
              "created": 1727964403,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lq2bq2z",
      "score": 4,
      "body": "NONE OF THE GOLDMAN sachs reports come true.",
      "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq2bq2z/",
      "created": 1727915578,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq4emt8",
      "score": 2,
      "body": "CEG is at ATH.\n\nI would read this as hedge funds like to buy in energy stocks with interest rates dipping at cheaper price.",
      "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq4emt8/",
      "created": 1727955957,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq35ybc",
      "score": 3,
      "body": "How about nuclear? I just bought RYCEY today. ",
      "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq35ybc/",
      "created": 1727927878,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq48cek",
      "score": 1,
      "body": "So, short squeeze coming cuz Iran and Isreal conflict gonna make this “sell off” a joke.",
      "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq48cek/",
      "created": 1727952682,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq49v4n",
      "score": 1,
      "body": "That sucks. I just bought 10k in Devon shares at $40. Why didn't GS release this report a week ago?😃  I guess it's time to buy the dips. Could be fun.",
      "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lq49v4n/",
      "created": 1727953529,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lql1xmd",
      "score": 1,
      "body": "So Goldman is short energy and wants everyone to panic sell",
      "permalink": "/r/stocks/comments/1fukus9/hedge_funds_are_dumping_energy_stocks_at_the/lql1xmd/",
      "created": 1728199585,
      "depth": 0,
      "replies": []
    }
  ]
}