{
  "title": "Here’s How Bad China’s Economy Really Is. Can It Be Fixed?",
  "score": 61,
  "selftext": "_china don’t care_ so now that Uncle Xi clearly does care all the new bling bling it shows how fukt things got\n\n> excepts from center of the editorial\n\n> China’s $18 trillion economy has been struggling across a range of sectors. Manufacturing activity, as of September, has been in contraction since April 2023, bar three months. Exacerbating the outlook are US efforts to cut China off from supplies of advanced semiconductors and other technologies set to drive future economic growth — an approach that officials in Washington call “strategic competition” and China decries as “containment.” Confidence at home became so fragile that China’s bank loans to the real economy shrank this summer for the first time in 19 years. The balance sheets of cash-strapped local governments, which are already laden with hidden debt, are among the casualties of slumping property prices. Their revenue from land sales has been declining at a record clip, making it harder to reverse a drop in budget expenditure just when economy is in dire need of fiscal support.\n\n> Optimism was high as China exited pandemic curbs in late 2022 and reopened its borders that the nation would see a rapid recovery in consumer spending fueled by “revenge shopping,” eating out and travel. That boost failed to materialize as people fretted about what weak growth means for unemployment and incomes. The years-long real estate crisis also wiped out an estimated $18 trillion in wealth from households, prompting people to save rather than spend and pushing China into its longest streak of deflation since 1999. Chinese consumption edged up slightly during a major holiday in September, adding to signs the rebound in spending by households still had a way to go. \n\n> Unemployment remains a concern, made worse by a regulatory crackdown on big technology companies that deprived many young, ambitious graduates of a lucrative career path. The youth jobless rate rose in August for the second straight month to its highest level this year.\n\n> Real estate has been the main engine of China’s economic growth since President Xi Jinping came to office a decade ago. The government attempted to crack down on heavily indebted developers in 2020 to reduce risks to the financial system. That pushed house prices down and many weaker companies defaulted. Many developers stopped building homes they had already sold but hadn’t yet delivered, prompting some people to stop paying their mortgages. This turbulence was a wakeup call for many Chinese, who have long considered property a sure-bet investment and used it as a store of wealth. The pain continued into 2024, extending a trend of declines in place since early 2022. In May, China unveiled its most far-reaching attempt to revive the property market. But progress has been slow on plans that include a program to provide 300 billion yuan ($43 billion) of central bank funding to help government-backed firms buy unsold homes from developers. And given the unattractive economics of the plan for local authorities, only a fraction of more than 200 cities urged to participate by the central government are heeding the call to help absorb an excess of housing. \n\ntldr; young generation fukt, no consumers, deflation, housing/housing banking rekt\n",
  "link_flair_text": "News",
  "id": "1fv5oh7",
  "num_comments": 76,
  "created_utc": 1727955759,
  "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/",
  "url_overridden_by_dest": "https://www.bloomberg.com/news/articles/2024-10-03/can-china-s-stimulus-package-help-save-its-economy-property-markets",
  "comments": [
    {
      "id": "lq4e8b0",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 2246 | **Previous Best DD** | \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq4e8b0/",
      "created": 1727955765,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq57ad3",
      "score": 47,
      "body": "I had thought that the Chinese were sacrificing the economy at the highest levels in an attempt to make it sanction proof in preparation for a Taiwan invasion",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq57ad3/",
      "created": 1727966530,
      "depth": 0,
      "replies": [
        {
          "id": "lq5nius",
          "score": 56,
          "body": "It will come as a shock and a surprise to people in this subreddit, but not all leaders care about the economy, economics, or even the economic well-being of their people.\n\nConsider this op-ed.\n\n[https://www.ft.com/content/4079c3f7-75f0-4d5e-9c9d-bc673d26cfd9](https://www.ft.com/content/4079c3f7-75f0-4d5e-9c9d-bc673d26cfd9)\n\n>Kasparov thinks the issue is a tendency to presume that everyone else shares your innate world view. The key here is western ideas of motive and rationality. Western culture is soaked in a capitalist ethos, underpinned by a widespread assumption that the profit motive rules supreme in terms of shaping political calculations, and that it’s “the economy, stupid” that drives decision-making in Russia and elsewhere. The collapse of the USSR reinforced this view, since it seemed that market principles and global business interests had triumphed.\n\n>As a consequence, western leaders and business groups generally turned a blind eye when Putin gave speeches that clearly demonstrated his nationalist, expansionist agenda and then annexed Crimea. Worse, they failed to appreciate how isolated Putin had become. Instead, as Russian oligarchs became a fixture of global business, Putin was seen as an extrapolation of this group. ***The idea that he might be so hell-bent on the destruction of democracy and the expansion of Russia that he would be willing to accept deep economic pain wasn’t taken seriously.***\n\nTBH, Xi is in exactly the same place. They've been remarkably consistent over the years about Taiwan and they have been taking actions to prepare themselves for conflict.",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5nius/",
          "created": 1727971331,
          "depth": 1,
          "replies": [
            {
              "id": "lq7umgx",
              "score": 1,
              "body": "This is actually the best take. These are unrelated issues for the CCP.\n\nThe CCP was clear in instructing the PLA and PLAN to prepare for a hot war within a few years. \n\nSince then they have been very aggressive with Bhutan, Philippines, Vietnam and Japan to name few potential flare-ups. \n\nIt’s doubtful that the CCP will green-light Taiwan with an untested military. Especially in light of the lack of success Russia has had. \n\nThe CCP has seen first hand how new Russian weapons fare against decommissioned and older NATO weapons platforms. It’s not pretty. \n\nUndoubtedly the CCP has systems developed that the west hasn’t seen. And those systems might provide an edge in a lightning attack and amphibious invasion but if the PLA and PLAN aren’t able to assert complete control across Taiwan their edge will be gone and they will get a taste of NATO’s newest platforms. \n\nIf the CCP can quickly control all of Taiwan the question of foreign intervention becomes murky. A stout defense of the Island would likewise buy the time the west needs to build a coalition and bring in the devil dogs. Taiwan is exactly the type of war Marines are made for.\n\nSo clearly the CCP needs a non-peer military to test themselves against. They don’t need to invade the Philippines, Vietnam or Japan to fight a limited engagement over a few islands, so the west will yell but not strike. \n\nBhutan has no military to speak of and no navy so the lessons there will be logistical. Assuming India doesn’t want to scrap, the west will again be vocal but do nothing. India has not been a reliable partner to the west so it will need to handle a Chinese takeover in Bhutan on its own.\n\nI can’t imagine the CCP going from zero experience to a full blown war in Taiwan with the west without any relevant, and recent, experience.",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq7umgx/",
              "created": 1727997631,
              "depth": 2,
              "replies": [
                {
                  "id": "lq89fn0",
                  "score": -2,
                  "body": "They'll go in when we are distracted elsewhere. Despite all the talk of fighting 2 simultaneous wars, the reality is that we can only do so against small or medium sized adversaries. Yes, we beat Germany and Japan in WW2, but Russia is about 2x Germany in population and 50x in size, while China is about 10x and 20x Japan's respectively.",
                  "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq89fn0/",
                  "created": 1728003091,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq8i1dv",
                      "score": 4,
                      "body": "With respect, Russia, minus nukes, is not a neer peer. We wouldn’t put boots on the ground there as that would actually trigger a nuclear response. \n\nRussia has shown itself to be a paper tiger, there is nothing left for them other than rhetoric. \n\nDon’t forget Wagner squared-up against the US military in Syria at Conoco Fields. \n\nClaiming we beat Germany is a myopic view of what actually happened. Watch this: [The Fallen of WW2](https://vimeo.com/128373915)\n\nNow you understand how you will never again claim “we” beat Germany in WW2, our victory is bathed in Russian blood. Without Russia that war would have been far worse for the Allies.\n\nAny war with China over Taiwan will not include any boots on the ground on the mainland. No one wants it to go nuclear and that would be an actual red line. \n\nWe will use air superiority and naval power to launch precision strikes but we will never invade. That would end life on the planet. We will have boots on the ground in Taiwan. The devil dogs will be there quickly. \n\nThe Chinese have very sophisticated and layered A2/AD. They will make it very hard on us. They will have victories on their path to defeat. The S China Sea is going to require us to knife fight in a floating phone booth. It’s going to be brutal and bloody. Far worse than Iwo Jima, Okinawa and Leyte Gulf.\n\nIn the case of Russia and China, no boots on the ground does not mean we won’t send the Teams in. They live for that shit. Both would be conflicts that play into the individual strengths of Delta/Seals etc. \n\nYou completely do not understand our ability to project power if you think we are only built for small to medium wars. We can project power globally for an extended amount of time. \n\nPlus our superpower is logistics. No one on the planet can compete with our abilities in that area. \n\nTo give you some perspective, the US National Guard could defeat Russia in a conventional war. \n\nAsk yourself in a fight with just our guard, what good are Russian numbers when they run out bullets? Our military will deny them while suppling us. What target in Russia is out of reach of the Guard’s F22s? \n\nIf we toss just the USN and some ballistic missiles into the mix and Russian imports will disappear as the seas will be blockaded. Their subs are their only useful tools in the oceans and we have the ability to hunt and kill them. It won’t happen overnight, and they will get some kills but they won’t be able resupply the few that survive once they are out of cruise missiles and torpedos. \n\nYou should do some research before you make such bold assumptions cotton.",
                      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq8i1dv/",
                      "created": 1728006322,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lq8rlia",
                          "score": -7,
                          "body": "> Russia is a paper tiger\n\n> Russia beat Germany in WW2\n\nRight.\n\nThe rest of your post is nothing more than US military propaganda. How's that naval deployment against Yemen going? Last I heard, we are also out of AA missiles to give to Ukraine and I'd give the latest showing against Iran a 2/10.",
                          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq8rlia/",
                          "created": 1728010019,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lq99joi",
                              "score": 2,
                              "body": "Did you watch the link about WW2 casualties? \n\nIf you think Russia is a peer state explain how Ukraine with hand me down weapons and limits on long range strikes into Russia managed to keep from being overrun in weeks. \n\nCompare Ukraine with the Iraqi military during Gulf War. How long did it take for the US to occupy completely the country with the 4th largest army in the world (at that time). \n\nYou have no understanding that these scenarios have been gamed out by RAND and other think tanks to exactly the ends I describe. \n\nYour knowledge is from bad tv and movies and not history. \n\nWatch the video link I sent and educate yourself about the true cost in WW2.\n\nAs for the reasons the missiles that you saw on tv were not intercepted has to do with recognizing that a weapons system can’t intercept every missile. So missiles unlikely to strike designated targets or civilian centers are allowed to fall into the desert or industrial areas. That way the missiles that are tracking to areas that must be protected get extra redundancy or three during the intercept. \n\nThe fact you don’t know that illustrates how you are out of your depth. You have Dunning Kruger. \n\nWatch the video and learn something today.",
                              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq99joi/",
                              "created": 1728018454,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lq5t26j",
              "score": -11,
              "body": "of course they care, why would russia want Ukraine or China Taiwan otherwise? A huge risk just to get some more land in the name of nationalism? Ultranationalism is just a tool, political and economical power is the target. They are accepting the risk as a form of high-risk investment.",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5t26j/",
              "created": 1727973500,
              "depth": 2,
              "replies": [
                {
                  "id": "lq6cck6",
                  "score": 19,
                  "body": "Wow you’re literally an example of what OP was talking about",
                  "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq6cck6/",
                  "created": 1727979610,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq6rllo",
                      "score": -5,
                      "body": "I simply don't agree. Maybe I just misunderstand his point, but they simply have a different angle. It's always about power and money. In the case of Putin it might be the finances of his friend mob-bosses.",
                      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq6rllo/",
                      "created": 1727984434,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lq8s4lv",
                          "score": 1,
                          "body": "Even when it’s about money and power, it can take so many forms. Reuniting the Soviet Union might make Russia poorer but it will make Putin more powerful. Taking Taiwan by force might make China poorer, but it’ll give Xi the Mandate of Heaven, which money can’t buy. What’s a little more money when you can become a godking? Money’s just numbers when you can move an entire nation to your whims",
                          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq8s4lv/",
                          "created": 1728010238,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lq75749",
              "score": -3,
              "body": "brexit and trump does show the western ideas of motive and rationality",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq75749/",
              "created": 1727988690,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lq6it5c",
      "score": 9,
      "body": "Wait a second? China still got an Economy? I thought it collapsed at least 15 times in the past 20 years.",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq6it5c/",
      "created": 1727981638,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq57ffo",
      "score": 28,
      "body": "I talked to Xi, he assured me it's a-ok! so no worries",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq57ffo/",
      "created": 1727966573,
      "depth": 0,
      "replies": [
        {
          "id": "lq5dzvq",
          "score": 15,
          "body": "This is the insider info I come to WSB for, calls it is.",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5dzvq/",
          "created": 1727968511,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lq7r6ls",
          "score": 2,
          "body": "https://preview.redd.it/mwi6r5fdgmsd1.jpeg?width=786&format=pjpg&auto=webp&s=2de690b4a882af0910f1fefc1a27125f9782fb5b",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq7r6ls/",
          "created": 1727996365,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lq6gd6h",
          "score": 1,
          "body": "Sir that was actually Winnie the Pooh you talked to",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq6gd6h/",
          "created": 1727980872,
          "depth": 1,
          "replies": [
            {
              "id": "lq7rbj7",
              "score": 5,
              "body": "https://preview.redd.it/hq68qayigmsd1.jpeg?width=2880&format=pjpg&auto=webp&s=1f6855716bc05de56791829865ce98e1a8e3a7d3",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq7rbj7/",
              "created": 1727996416,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lq4fjth",
      "score": 54,
      "body": "Buy china stocks, got it",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq4fjth/",
      "created": 1727956384,
      "depth": 0,
      "replies": [
        {
          "id": "lq4hcgv",
          "score": 37,
          "body": "That’s *never* the answer.",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq4hcgv/",
          "created": 1727957211,
          "depth": 1,
          "replies": [
            {
              "id": "lq5squ2",
              "score": 17,
              "body": "China options? Got it!",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5squ2/",
              "created": 1727973395,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lq5k9m5",
              "score": 1,
              "body": "Stonks never the answer? say again, over.",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5k9m5/",
              "created": 1727970332,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lq5hz7e",
      "score": 4,
      "body": "Why do you sound like President Camacho?",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5hz7e/",
      "created": 1727969667,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq5fdua",
      "score": 7,
      "body": "All in China",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5fdua/",
      "created": 1727968914,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq4imsx",
      "score": 52,
      "body": "You can also look from another perspective: \n\n-Popping the real state bubble, so houses are for living, not especulation\n\n-Youth unemployment, although high it's still way way lower than the developed world \n\n-Consumer confidence is low, but at least chinese people are not overburdened by debt and the savings rate is going up\n\n-As for deflation, hey, screw corporations, as a normal person I love when prices go down. Unfortunately you've drinken too much coolaid to think that deflation is bad for the general population. I think you still want to be fleeced by the corporations",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq4imsx/",
      "created": 1727957785,
      "depth": 0,
      "replies": [
        {
          "id": "lq55qoi",
          "score": 31,
          "body": "First….what developed would are you talking about that has a youth unemployment rate this high, with THIS big of a population and this much impact on the global economy?\n\n20% youth unemployment (and we can assume that number is soft…as China isn’t known for transparency right?) in China with over a billion people is a LOT different than 20% youth unemployment in….say Portugal. \n\nThat is MANY more mouths to feed and house providing zero productivity.\n\n\nSecond: Deflation is good for consumers on the price front….if they have money and enough savings. But you are stuck in first level thinking.\n\nPeople stop buying, companies drop prices, to remain profitable they have to cut workers and overhead, more people unemployed and not buying anything, and so on. \n\nDeflation and inflation are not bad. SPIRALS are bad.",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq55qoi/",
          "created": 1727966063,
          "depth": 1,
          "replies": [
            {
              "id": "lq5okt2",
              "score": 7,
              "body": "Does their high unemployment rate have something to do with their high automation rate,   Remember this is a communi$t country…   In america people fear losing their jobs to automation but having less human labor required for the same or more productivity might be considered a boon there",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5okt2/",
              "created": 1727971668,
              "depth": 2,
              "replies": [
                {
                  "id": "lq9c88q",
                  "score": 1,
                  "body": "Imagine if China succeeded in moving away from capitalism. That would be incredible",
                  "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq9c88q/",
                  "created": 1728020009,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lq6m67b",
                  "score": 1,
                  "body": "I’m not discounting it…but typically high automation rates would be coupled with efficiencies and cost savings…which would be coupled with excellent economic growth….none of which we are seeing.",
                  "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq6m67b/",
                  "created": 1727982709,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lqb1rn5",
                      "score": 1,
                      "body": "Im suggesting that what would normally be economic gains is being converted into societal benefits like increasing qol, affordability of housing, and increasing education.   It might be disingenuous to try to measure communis t success by a capitalist metric.    China is the most productive country in the world morseso than ever before and if you look we are seeing their populations qol go up by any metric as well as more and longer higher education rates.",
                      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lqb1rn5/",
                      "created": 1728052632,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lq58kxz",
              "score": 14,
              "body": "Yeah like youths from portugal can freely move to another european country to work. Thats not possible for the same group from china (also because there is just so many of them).",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq58kxz/",
              "created": 1727966917,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lq5hn79",
              "score": 8,
              "body": "Why are you so fixated in youth unemployment? You think people from 16-24 years should be working?\n\nMost of people between 18-24 years are still studying and they are not actively looking for a job.\n\nThe reality is, the unemployment rate in China (overall, not youth) is around 5.3% and the European Union's is 6.4%. The US unemployment rate is 4.4% but due to how this is calculated, the actual number is likely much higher (wink wink labor force participation)\n\nRegarding the deflation, I agree with you that extremes are bad, however, let me ask you something:\n\n1- When is the last time, prices of consumer goods have dropped in the US or the West in general? \n\nLet me give you an example, here in Spain, the government lowered the VAT (value added tax) 2 years ago, did the price of goods go down? Absolutely not, same price for everything. Now the government is reverting the policy (so VAT increase), and what do the corporations do? They transfer the cost to the final consumer. \n\n2- US corporations are having record profits and revenues, why are the wages not growing? \n\nIt's simple, because corporations want to maximize the \"shareholders\" return and wages are considered as a cost in the balance sheet. That's why the stock price is going through the roof while wages are stagnant. \n\nTo be honest, we live in a very unequal world, where those who are rich (mainly those who have assets like real state, stocks, alternative investment, you name it) are getting richer  and those who are poor (people without assets) are getting poorer because they don't have any way to fend off the inflationary tendencies.",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5hn79/",
              "created": 1727969569,
              "depth": 2,
              "replies": [
                {
                  "id": "lq5n1qv",
                  "score": 10,
                  "body": "He's fixated on the specific issue that you blatantly lied about. Why lie if it's not important?\n\nBTW wages are absolutely growing in the US, they've outpaced inflation since February of 2023. So, this is also a lie. All of this is easily debunked with open data. \n\n[https://www.statista.com/statistics/1351276/wage-growth-vs-inflation-us/](https://www.statista.com/statistics/1351276/wage-growth-vs-inflation-us/)",
                  "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5n1qv/",
                  "created": 1727971178,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq5vhix",
                      "score": 4,
                      "body": "Soviet statistics.",
                      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5vhix/",
                      "created": 1727974294,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lq5qa88",
                      "score": -2,
                      "body": "Yeah, that's why 95% of the US people are looking to switch jobs:\n\nhttps://fortune.com/2024/01/30/95-percent-employees-want-a-new-job-great-resignation-appears-unlikely/\n\nIf you think inequality is not a problem... then we don't have much to talk. \n\nJust look up at: productivity vs wages charts, real purchasing power historical charts...",
                      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5qa88/",
                      "created": 1727972299,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lq6lsw9",
                          "score": 9,
                          "body": "The culture in the US is to switch jobs to rapidly work more. Why? Not because people are unhappy or frustrated, but because companies typically cap how much of a raise you can get as an internal hire / promotion. \n\nInternal Hires / Promotions at most levels are typically capped at 20% increase. External hires have much higher budgets to attract talent.\n\nWhy? Because most people don’t want the risk of changing companies. Most people want security. Which means if you want to TAKE them from a competitor…you have to account for that.\n\nSo job switching is HUGE in the US for people who want their careers to progress, especially their pay. \n\nAgain…you have no clue what you’re talking about.",
                          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq6lsw9/",
                          "created": 1727982592,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lq6l5vj",
                  "score": 5,
                  "body": "So others have already corrected you, but I will as well:\n\n1: Youth unemployment in China is currently around (as of last reporting) 18% - 20%. This number does NOT reflect those in college our outside of the labor force. So OF THOSE youth looking for a job, 18% - 20% of them can’t find one. That’s pretty bad for many reasons.\n\n2: Why is it important?\n\nA: Younger workers (not those in school, but those looking for jobs) tend to work more manual labor / entry level jobs. Not only in restaurants / clothing stores / consumer goods areas….but also physically demanding jobs like construction for example. \n\nThe jobs that these people work are typically unskilled. The fact that the production capital of the world is having trouble finding jobs for these people is terrible and can be viewed as a proxy for capital investment by Chinese companies.\n\nB: Being unemployed in your 20s (assuming you aren’t in school or building other skills) can have DRASTIC impacts on the earnings of these people throughout their lives. Which reduces how much they have to spend.\n\nThis all has knock on effects to consumers strength in the country.\n\n\n3: When was the last time prices dropped in the US? Who cares?! That is a good thing! We want growth. We WANT controlled inflation. That means the system is working. No price increases means no growth and no o e is doing better than they were last year. \n\n4: Wages in the US are ABSOLUTELY BOOMING!!!\n\nESPECIALLY at the lower, unskilled area of the workforce. You have no idea what you’re talking about.",
                  "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq6l5vj/",
                  "created": 1727982387,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq6l5wn",
                      "score": 1,
                      "body": "4288 UNITS! BOOM!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq6l5wn/",
                      "created": 1727982387,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lq591hr",
              "score": 1,
              "body": "Cough labor force participation rate cough",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq591hr/",
              "created": 1727967054,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lq53ya6",
          "score": 21,
          "body": "I'm not sure if this is satire or just regarded",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq53ya6/",
          "created": 1727965526,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lq4rsdj",
          "score": 6,
          "body": "Bullish",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq4rsdj/",
          "created": 1727961489,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lq4syje",
          "score": 4,
          "body": "I‘m in China. Unemployment rate here is faked. Thousands of people are unemployed.",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq4syje/",
          "created": 1727961925,
          "depth": 1,
          "replies": [
            {
              "id": "lq4tx1w",
              "score": 24,
              "body": "“Thousands of people are unemployed”\n\nThousands? BULLISH!! ALL IN!!",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq4tx1w/",
              "created": 1727962273,
              "depth": 2,
              "replies": [
                {
                  "id": "lq506pv",
                  "score": 14,
                  "body": "I'm in Mars and no unemployment here 👍",
                  "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq506pv/",
                  "created": 1727964367,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lq55aup",
                      "score": -2,
                      "body": "Well, good luck with that.![img](emote|t5_2th52|12787) You're really limited in your perceptions, and every single one of the points you've written is ridiculous, with no common sense in economics and no common sense in life.",
                      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq55aup/",
                      "created": 1727965931,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lq56vys",
                  "score": 1,
                  "body": "What I want to say is that unemployment is more serious than the news and data.",
                  "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq56vys/",
                  "created": 1727966411,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lq55cf5",
              "score": 15,
              "body": "\"Thousands\" unemployed in a nation of 1.4 billion. Holy xi jinping truly is the GOAT.",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq55cf5/",
              "created": 1727965945,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lq7ki8e",
          "score": 1,
          "body": "It’s lower than the developed world because they’re running out of youth you dumb dumb",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq7ki8e/",
          "created": 1727993888,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lq5cdev",
          "score": 1,
          "body": "This is pants on head regarded. Bag holder spotted.",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5cdev/",
          "created": 1727968036,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lq5023y",
          "score": -3,
          "body": "Yeah, a prof tried to explain deflation to me using TVs. He said are you going to buy a TV today. Knowing it will be cheaper tomorrow? Yes, and I might buy one tomorrow too. \n\nIn the end TVs, Cars, Appliances, pretty much everything is cheaper 'tomorrow' because they get phased out for the newer thing. Yes, I know this isn't deflation but the mentality carries over. Most of us dgas about the newer thing. We just want stuff that works. When it breaks we fix it or then go get the new one, maybe. Maybe we will find a deal on NoS. \n\nI say if my ground beef will be cheaper tomorrow? Im buying some today and throwing it in the freezer. (Edit)Then getting more tomorrow. If deflation means the cost of food will go down? All else be damned imo.",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5023y/",
          "created": 1727964326,
          "depth": 1,
          "replies": [
            {
              "id": "lq55hb1",
              "score": 6,
              "body": "It's probably bad for the economy in general, but I don't mind prices going down on recurring consumable purchases like food.\n\nLuxury goods maybe it's not so good...",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq55hb1/",
              "created": 1727965985,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lq550ao",
              "score": 2,
              "body": "That would be good for general people, very bad for shareholders and govs. \n\nYou don't skip food and other basic stuff, because it will get cheaper. You'll skip New iPhone.",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq550ao/",
              "created": 1727965842,
              "depth": 2,
              "replies": [
                {
                  "id": "lq587k0",
                  "score": 1,
                  "body": "Unless Apple slows down your current phone to push you to buy a new one.https://www.bbc.com/news/technology-67911517",
                  "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq587k0/",
                  "created": 1727966806,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lq6r6kp",
          "score": 0,
          "body": "I was just in China, it's the fucking future man, all EVs, robots deliver food to rooms, cigs cost $1 USD",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq6r6kp/",
          "created": 1727984300,
          "depth": 1,
          "replies": [
            {
              "id": "lq7g4kg",
              "score": 2,
              "body": "Cheap VPN to visit Reddit!",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq7g4kg/",
              "created": 1727992314,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lq5g3e7",
      "score": 10,
      "body": "\"China will fail next Monday\", every piece of western media since the mid XX century.",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5g3e7/",
      "created": 1727969120,
      "depth": 0,
      "replies": [
        {
          "id": "lq7j2ac",
          "score": 2,
          "body": "Im fucking tired of this “china is about to collapse “ thing",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq7j2ac/",
          "created": 1727993365,
          "depth": 1,
          "replies": [
            {
              "id": "lq7mcb8",
              "score": 0,
              "body": "They're not going to collapse but they will probably have one of those 'lost decades' situations like Japan did",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq7mcb8/",
              "created": 1727994568,
              "depth": 2,
              "replies": [
                {
                  "id": "lq7y24o",
                  "score": 3,
                  "body": "This is basically a mild expression of collapse. Japan is special, and the other four Asian tigers with similar development models have not stagnated like Japan.",
                  "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq7y24o/",
                  "created": 1727998904,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lq5aew0",
      "score": 15,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5aew0/",
      "created": 1727967458,
      "depth": 0,
      "replies": [
        {
          "id": "lq5dwur",
          "score": 4,
          "body": "+1000 social credits",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5dwur/",
          "created": 1727968487,
          "depth": 1,
          "replies": [
            {
              "id": "lq5e00g",
              "score": 12,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5e00g/",
              "created": 1727968512,
              "depth": 2,
              "replies": [
                {
                  "id": "lq5fwv5",
                  "score": 8,
                  "body": "IDK but I’m posting from a [cave](https://www.bbc.com/travel/article/20100915-the-cave-dwellers-of-21st-century-china)",
                  "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5fwv5/",
                  "created": 1727969068,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lq5lqgw",
                  "score": 2,
                  "body": "Interesting. I would have given you the benefit of the doubt you were being sarcastic when comparing the great standard of living in China to the US.",
                  "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5lqgw/",
                  "created": 1727970762,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lq5ew0o",
          "score": -1,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5ew0o/",
          "created": 1727968770,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lq5xwyt",
      "score": 2,
      "body": "BUY THE DIP XD",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5xwyt/",
      "created": 1727975067,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq5a3em",
      "score": 3,
      "body": "and most of reddit seems to want communism",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq5a3em/",
      "created": 1727967364,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq6hhrk",
      "score": 1,
      "body": "No country shall fail. They (we) all just print money when it's needed.",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq6hhrk/",
      "created": 1727981226,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq7nd60",
      "score": 1,
      "body": "reddit weekely",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq7nd60/",
      "created": 1727994946,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq7x8l5",
      "score": 1,
      "body": "A logical response on THIS subreddit???",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq7x8l5/",
      "created": 1727998605,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq76bqh",
      "score": 1,
      "body": "Me Chinese, me play joke, my economy is broke.",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq76bqh/",
      "created": 1727989040,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq6ndu6",
      "score": 0,
      "body": "Japan took 25 years to pull out of its demographics induced recession and Japan was already rich, had friends and supply/markets open in the US and Europe and was a manageable political situation. China is the opposite in all of these aspects so if it can be fixed it’s going to be a long road to haul and the bottom is going to be a lot deeper.",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq6ndu6/",
      "created": 1727983097,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq71pml",
      "score": 0,
      "body": "How long we’ve been saying this?",
      "permalink": "/r/wallstreetbets/comments/1fv5oh7/heres_how_bad_chinas_economy_really_is_can_it_be/lq71pml/",
      "created": 1727987601,
      "depth": 0,
      "replies": []
    }
  ]
}