{
  "title": "Meituan co-founder cashes out US$44.3 million amid Chinese stock rally",
  "score": 44,
  "selftext": "Insider of Meituan \\[3690.HK\\] sold his stake at 171.80 per share whereas the latest closing price was 213.40 per share (i.e. 24% difference) ... what a pity!\n\n&#x200B;\n\n**Meituan co-founder cashes out US$44.3 million amid Chinese stock rally**\n\n[https://www.scmp.com/news/article/3281032/meituan-co-founder-cashes-out-us443-million-amid-chinese-stock-rally](https://www.scmp.com/news/article/3281032/meituan-co-founder-cashes-out-us443-million-amid-chinese-stock-rally)\n\n&#x200B;\n\n*KEY POINT*\n\n* *Mu Rongjun, an executive director of the on-demand delivery firm, sold the shares after a 240 per cent price rally since a February low*\n\n*A co-founder of Chinese food delivery giant Meituan sold 2 million of his Hong Kong-listed shares in the company on Monday, cashing out about HK$344 million (US$44.3 million) amid a recent rally in Chinese stocks.*\n\n*Mu Rongjun, an executive director and senior vice-president at the Beijing-based on-demand delivery firm, sold the shares at a price of HK$171.8, according to a disclosure filed to the Hong Kong stock exchange on Thursday. His Meituan stake now stands at 1.02 per cent, down from the 1.06 per cent previously. Mu is worth US$3.4 billion, according to Forbes.*\n\n*Meituan shares rose 3.3 per cent to HK$211.8 in Hong Kong on Friday morning. The stock has rallied 240 per cent since hitting a low in early February.Mu cut his holdings three months after Meituan announced a plan to buy back shares valued up to US$2 billion. The company said the buy-back was not guaranteed in terms of timing, quantity or price.Meituan’s second-quarter revenue surged 21 per cent year on year, reaching 82 billion yuan (US$11.6 billion), bolstered by steady growth in its core local commerce operations focused on food and grocery delivery. Profit jumped 142 per cent to 11 billion yuan for the quarter.On Thursday, the company announced the issuance of US$2.5 billion in senior notes to professional investors. This includes US$1.2 billion in notes with a 4.5 per cent coupon due in 2028 and US$1.3 billion in notes with a 4.625 per cent coupon due in 2029.Meituan is seen as one of the Chinese tech stocks to benefit the most from a rebound in domestic consumer spending.A new exchange-traded fund nicknamed “China Dragon”, which tracks major Chinese tech stocks, landed on the US stock market on Thursday. The fund’s components include Meituan, along with other Chinese tech giants such as Tencent Holdings, PDD Holdings and Alibaba Group Holding, owner of the South China Morning Post.Separately, Alibaba said on Wednesday that it bought back 414 million ordinary shares in the quarter ending September 30 for US$4.1 billion. It had US$22 billion remaining in its buy-back programme as of September 30.*",
  "link_flair_text": "Company News",
  "id": "1fvw5wd",
  "num_comments": 6,
  "created_utc": 1728038681,
  "permalink": "/r/stocks/comments/1fvw5wd/meituan_cofounder_cashes_out_us443_million_amid/",
  "comments": [
    {
      "id": "lqa6pfc",
      "score": 42,
      "body": "He sold like 4% of his holdings?  Not that big of a deal.  Probably just wants some liquidity for his personal life. $44mm isn't huge for a founder of a business as large as Meituan.",
      "permalink": "/r/stocks/comments/1fvw5wd/meituan_cofounder_cashes_out_us443_million_amid/lqa6pfc/",
      "created": 1728040176,
      "depth": 0,
      "replies": [
        {
          "id": "lqab1wl",
          "score": 10,
          "body": "The amount of clickbait stuff you'll see around Chinese stocks will just keep increasing. Then after chinese stocks run up 10x and go -50%, people will scream \"rug pull\", whatever that means.",
          "permalink": "/r/stocks/comments/1fvw5wd/meituan_cofounder_cashes_out_us443_million_amid/lqab1wl/",
          "created": 1728042352,
          "depth": 1,
          "replies": [
            {
              "id": "lqbfzpm",
              "score": 2,
              "body": "People post shit like this about every major company when some C suiter will cash out <5% of their holdings. It's a little strange.",
              "permalink": "/r/stocks/comments/1fvw5wd/meituan_cofounder_cashes_out_us443_million_amid/lqbfzpm/",
              "created": 1728057222,
              "depth": 2,
              "replies": [
                {
                  "id": "lqc1zm1",
                  "score": 2,
                  "body": "It might just be anecdoctal, but through my interactions with people about stocks, most people don't actually care about profits, but rather wanting to be right and have something to brag about. The terms one of my colleague came up with is that people come to stock to nurture certain feelings: gambling tendency, bragging rights, get rich quick scheme,...",
                  "permalink": "/r/stocks/comments/1fvw5wd/meituan_cofounder_cashes_out_us443_million_amid/lqc1zm1/",
                  "created": 1728064237,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lqaka2j",
      "score": -4,
      "body": "Pump and Dump. Suckers welcome!",
      "permalink": "/r/stocks/comments/1fvw5wd/meituan_cofounder_cashes_out_us443_million_amid/lqaka2j/",
      "created": 1728046351,
      "depth": 0,
      "replies": []
    }
  ]
}