{
  "title": "Ubisoft shares skyrocket 33% after report Tencent, Guillemot family considering buyout",
  "score": 172,
  "selftext": "“Shares of French video game publisher Ubisoft surged over 30% on Friday after a media report that Tencent and the firm’s founding Guillemot family are considering a potential buyout of the company.\n\nBloomberg News reported Friday that Tencent and the Guillemot family, which are both minority shareholders of Ubisoft, are considering a buyout among other options after the company lost more than half its market value this year.\n\nShares of Ubisoft spiked 33% by the market close Friday following publication of the report.”\n\nSource: https://www.cnbc.com/2024/10/04/ubisoft-shares-skyrocket-after-report-tencent-guillemot-family-considering-buyout.html\n\nWith Tencent already being very involved with the Guillemot family and helping Ubisoft survive a hostile takeover, I could definitely see this happening.\n\nMy only question is if the French government will allow a Chinese company to purchase an iconic French company like Ubisoft, ",
  "link_flair_text": "Company News",
  "id": "1fw2h0z",
  "num_comments": 60,
  "created_utc": 1728057108,
  "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/",
  "comments": [
    {
      "id": "lqbh8aj",
      "score": 101,
      "body": "Nice, I bought puts the other day. Straight up cooked ![gif](emote|free_emotes_pack|dizzy_face)",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbh8aj/",
      "created": 1728057610,
      "depth": 0,
      "replies": [
        {
          "id": "lqccjng",
          "score": -17,
          "body": "Jesus, why? Obvious takeover play.",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqccjng/",
          "created": 1728067639,
          "depth": 1,
          "replies": [
            {
              "id": "lqdb1ei",
              "score": 5,
              "body": "Hey we can't win them all my friend.",
              "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqdb1ei/",
              "created": 1728079222,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lqbwktm",
      "score": 67,
      "body": "If you're in it, that's your cue to get out. Lock in those gains or whatever losses you have remaining and be grateful you got this opportunity!",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbwktm/",
      "created": 1728062510,
      "depth": 0,
      "replies": [
        {
          "id": "lqculvk",
          "score": 5,
          "body": "I'm really confused. Seeing a lot of comments from people saying they wish they bought stock yesterday, and then comments like yours saying SELL. Please, treat me like im dumb to try and understand lol",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqculvk/",
          "created": 1728073526,
          "depth": 1,
          "replies": [
            {
              "id": "lqcvelx",
              "score": 22,
              "body": "The people who say they wish they bought yesterday do so because the stock shot up insanely high due to the news.  \nMy comment says, if you were in this stock beforehand, use today's opportunity to get out.\n\nThe business alone arguably doesn't warrant the price in it's current state, and the current price is a reflection of the hope of Tencent/Guillemot making a bid to take the company private. The news are about nothing more than this being a consideration. Stuff like this can take a long time, even if they decide to go for it, and if the move fails to materialise, the stock is gonna tank on those news because everyone who was in it for potential gains courtesy of the takeover would get out as soon as they can.\n\nIf you want to see how this could look, take a look at the chart of IRBT. Can you tell when rumors that Amazon was considering a takeover hit?  \nAnd more than that, focus on the time around January of 2024. That's when the news hit that Amazon was abandoning plans of the takeover. It's not inconceivable (even if Ubisoft is a much better business than iRobot) that something like this happens here as well.\n\nTherefore my appeal was: Make use of the +33% of today, take your money and run.   \nUsually, one of two things happens from now on: Either there is a slow decline in price as the story develops until there's eventually a conclusion, or the price of a suggested takeover bid is made public and the price moves in the vicinity of that takeover bid (usually it gets to 10-20% below acquisition price because that seems to be the sweet spot for a lot of investors in these kinds of plays. Above that, selling pressure increases. Below that, the price becomes more attractive for a gamble on the acquisition materialising because the gains would be higher).",
              "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqcvelx/",
              "created": 1728073794,
              "depth": 2,
              "replies": [
                {
                  "id": "lqcweyl",
                  "score": 6,
                  "body": "Not to mention EU anti-trust could come into this, Tencent being chinese, and Macron being *very* vocal about the need for EU to protect itself.",
                  "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqcweyl/",
                  "created": 1728074129,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lqihnf2",
              "score": 3,
              "body": "If you bought the stock before you jumped 33%, and then sold after the 33% jump. You made 33% gains.",
              "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqihnf2/",
              "created": 1728160718,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lqd3fv2",
              "score": -3,
              "body": "There are people who tell you to buy a stock after a huge runup (SMCI at $1200, every redditor was bullish, every analyst was bullish giving price targets of $1500, now it sits at $400), and there are people who keep on bashing something after literally all the bad which is out there is priced in, it is called herd mentality.\n\nUbisoft definitely has problems, but my bet is that the company with such a history (which had its ups and downs) does probably have some smart people in the management and will figure things out, probably smarter than the average redditor who started investing 2 months ago.",
              "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqd3fv2/",
              "created": 1728076509,
              "depth": 2,
              "replies": [
                {
                  "id": "lqff44n",
                  "score": 0,
                  "body": "Thanks for the downvotes folks, just shows how delusional people really are. \n\nAll I hear and read is too much bla bla, \"Macron bla, China bla, woke bla bla\", in the end, no one knows and it will turn out differently than you imagined.\n\nBut numbers don't lie, build a quantitative model, evaluate risk, evaluate return to risk, increase your likelihood of bets succeeeding and in the long run you will make profits.",
                  "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqff44n/",
                  "created": 1728116584,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lqeswta",
          "score": 1,
          "body": "Exactly. Just like the overselling after some bad news in recent days was a cue to get in. Easiest play. Didn’t expect 33%, just aimed for 10% recovery but not complaining.",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqeswta/",
          "created": 1728102178,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqbgfwh",
      "score": 19,
      "body": "For reference, Tencent and the Guillemot family currently control over 25% of Ubisoft’s share capital.",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbgfwh/",
      "created": 1728057364,
      "depth": 0,
      "replies": [
        {
          "id": "lqcnl5t",
          "score": 10,
          "body": "> iconic French company like Ubisoft\n\n\nLoL! Nothing about Ubisoft is iconic nor French. All their games seem like a copy paste template, just different \"scenery on screen\".",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqcnl5t/",
          "created": 1728071207,
          "depth": 1,
          "replies": [
            {
              "id": "lqct3yr",
              "score": 3,
              "body": "Still, quite a lot if good intellectual property owned by them.",
              "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqct3yr/",
              "created": 1728073026,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lqefpzl",
              "score": -2,
              "body": "You don't seem to know what Ubisoft was.\nIt is like saying Nokia? Nothing about Nokia is iconic, I haven't even heard of them. \nOn second thought you might not have heard of Nokia in its prime either.",
              "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqefpzl/",
              "created": 1728095810,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lqbo2b7",
      "score": 23,
      "body": "Bad news for Tencent unless they plan on removing the Guillemots. Helping the management that has completely destroyed the company take them private is baffling. What even would be the trajectory for a turnaround? Spend 5-10  years (2 cycles of AAA game dev) executing a turnaround? The risks involved are incredible. \n\nIf you're Ubisoft being private helps keep the scale of the massive layoffs that are coming obfuscated and out of the headlines 🙃",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbo2b7/",
      "created": 1728059805,
      "depth": 0,
      "replies": [
        {
          "id": "lqbowji",
          "score": 7,
          "body": "The whole point is to turn the company private. This is just my anecdoctal experience, but family businesses including those that turned public, are always siphoning the money out of the company when it's public through many ways, waiting for these types of exact moment to buy back the company they put on public in the first place, then build up value or whatever and repeat.",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbowji/",
          "created": 1728060073,
          "depth": 1,
          "replies": [
            {
              "id": "lqdao4l",
              "score": 2,
              "body": "Didn’t Dell go public/private/public?",
              "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqdao4l/",
              "created": 1728079086,
              "depth": 2,
              "replies": [
                {
                  "id": "lqdbp2j",
                  "score": 2,
                  "body": "Yea man these things are very common actually, but it's usually not too heavily covered in news cycle that we tend to forget about it.",
                  "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqdbp2j/",
                  "created": 1728079468,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lqelse2",
                  "score": 1,
                  "body": "Dude…. you’re gettin’ a Dell! (fist bump)",
                  "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqelse2/",
                  "created": 1728098593,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lqbz8wy",
              "score": 2,
              "body": "Can I ask which companies you’ve noted that did this? I’m curious.",
              "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbz8wy/",
              "created": 1728063364,
              "depth": 2,
              "replies": [
                {
                  "id": "lqc1h6f",
                  "score": 5,
                  "body": "Recently most noted one is Kohl I think is trying to take private? Honestly i saw this too much that I don't know where to start. I'm in Vietnam and these things happen everywhere: vietnam, china, singapore, indonesia, korea... Samsung tried to go private i believe 15 years ago too? Like tbh, if you want to improve fundamental of a company, taking private is always the way to go.",
                  "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqc1h6f/",
                  "created": 1728064075,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lqcc5y6",
          "score": 3,
          "body": "Why would they want to \"obfuscate\" layoffs? Doing them publicly would likely help their stock price lmao.\n\nUbisoft historically avoids large-scale layoffs, they rather rely on wider attrition factors to reduce their headcount, which is also what they are doing right now.",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqcc5y6/",
          "created": 1728067516,
          "depth": 1,
          "replies": [
            {
              "id": "lqcfx45",
              "score": 1,
              "body": "They are French (harder to fire people, way more bad press if you do) and they rely on a lot of different industry wide subsidies in multiple European countries. They are in a very tough spot.\n\nI'll concede I'm probably wrong to explicitly state this as a reason to be private, but I think they are trying to avoid headlines about it.",
              "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqcfx45/",
              "created": 1728068711,
              "depth": 2,
              "replies": [
                {
                  "id": "lqcit6i",
                  "score": 2,
                  "body": "They only have a handful of studios in France and many of those are tiny, like Ubisoft Nadeo, Ubi Owlient, and Ketchapp. The government subsidies do likely affect team sizes, though, and Ubisoft is better at getting them than most.",
                  "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqcit6i/",
                  "created": 1728069650,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lqc3ly6",
      "score": 15,
      "body": "The post yesterday filled with comments saying the company is pretty much dead was the indicator to buy.",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqc3ly6/",
      "created": 1728064756,
      "depth": 0,
      "replies": [
        {
          "id": "lqgxifb",
          "score": 3,
          "body": "The company is pretty much dead, that's why hienas like tencent wants to scoop it up.",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqgxifb/",
          "created": 1728142696,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqeq6gj",
          "score": 2,
          "body": "Yeah, I was doing some buys yesterday and came across it; didn't buy of course!\n\nAll my stuff I did buy was up though, so whateva!",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqeq6gj/",
          "created": 1728100753,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqblvm2",
      "score": 10,
      "body": "i was looking into buying UBSFY and should have but ultimately I still think their leadership is poor and this is a pump",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqblvm2/",
      "created": 1728059102,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqc52c4",
      "score": 3,
      "body": "I was literally thinking yesterday that I should buy Ubisoft stock because of how much it has dropped recently. \n\nNeed more doing and less thinking...",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqc52c4/",
      "created": 1728065224,
      "depth": 0,
      "replies": [
        {
          "id": "lqcsltg",
          "score": 1,
          "body": "Same here. Currently at $3/share. Would you still consider buying now?",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqcsltg/",
          "created": 1728072860,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqbj83f",
      "score": 12,
      "body": "Congrats to all those who bought it!",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbj83f/",
      "created": 1728058245,
      "depth": 0,
      "replies": [
        {
          "id": "lqc55ic",
          "score": 11,
          "body": "Well. Those who bought it in the last month…",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqc55ic/",
          "created": 1728065252,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqduq6l",
      "score": 3,
      "body": "Literally a couple days ago someone made a post about potential Ubisoft takeover and he got absolutely shit on",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqduq6l/",
      "created": 1728086911,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqc11oy",
      "score": 2,
      "body": "I was going to wait another couple of weeks but I knew their stock would pop after their earnings. The stock has dropped too much for management to do nothing. Shame on me for not pulling the trigger earlier.",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqc11oy/",
      "created": 1728063939,
      "depth": 0,
      "replies": [
        {
          "id": "lqcsbmg",
          "score": 1,
          "body": "It's up about 80 cents from its low these past few weeks right? Is buying in at its current $3/share still not a safe buy in point?",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqcsbmg/",
          "created": 1728072766,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqc5do7",
      "score": 2,
      "body": "I wonder what a good price for this would be. Currently at a $2 billion market cap but their assets are worth at least $4 billion at a discount. So this ship could go even further",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqc5do7/",
      "created": 1728065325,
      "depth": 0,
      "replies": [
        {
          "id": "lqcgeah",
          "score": 2,
          "body": "You need to include $2 billion in debt",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqcgeah/",
          "created": 1728068868,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqd7amy",
      "score": 2,
      "body": "Fuck. I was just eyeing it after latest gamer upset on Monday thinking “hmm fundamentals aren’t as bad as you’d think from outrage and tanking price but nahhhh I’ll pass”. Onwards to jumping on next shark (to bottom) thinking I’m smarter now.",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqd7amy/",
      "created": 1728077874,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqf36jt",
      "score": 2,
      "body": "That's what a company with no credibility needs, get bought by a Chinese company.",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqf36jt/",
      "created": 1728108276,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqbkbp5",
      "score": 4,
      "body": "Should of bought some shares when they were trading at just over €10 a share, no way they would let a massive games publisher like Ubisoft go down especially when it has a lot of great IP’s that will do well if taken care of properly.",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbkbp5/",
      "created": 1728058599,
      "depth": 0,
      "replies": [
        {
          "id": "lqbmv7d",
          "score": 14,
          "body": "Hindsight is a b*tch",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbmv7d/",
          "created": 1728059420,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqc59ig",
          "score": 2,
          "body": "Yeah and I thought the same a 20 euros. Falling knives are hard to catch.",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqc59ig/",
          "created": 1728065288,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqcm605",
          "score": 2,
          "body": "Their ips alone are worth 3 billion and you didn’t buy at 1 billion dollar market share",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqcm605/",
          "created": 1728070744,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqbp745",
      "score": 1,
      "body": "Got lucky and bought 13s and 9s on the way down, sold 14.05.",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbp745/",
      "created": 1728060166,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqdag4v",
      "score": 1,
      "body": "I don’t think the French will allow the sale to foreign corps",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqdag4v/",
      "created": 1728079004,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqbstji",
      "score": 1,
      "body": "Bought this around 10$ not knowing of the takeover; currently around 1% of portfolio.  \nTencent on the other hand is a far larger position.  \nWe'll see where this goes.",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbstji/",
      "created": 1728061309,
      "depth": 0,
      "replies": [
        {
          "id": "lqd0ykv",
          "score": 2,
          "body": "Same. I'm up 50% from last week and chewing my nails on whether I should hold or sell and take my gains.",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqd0ykv/",
          "created": 1728075646,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqbi0tg",
      "score": -2,
      "body": "**I KNNNNEW IT!!!!**  \nSomething told me that Ubisoft was \"too big to fail.\"\n\nI even looked into buying it, but didn't pull the trigger.\n\nOne thing I've learned recently in the stock market is that the biggest companies always come back. Ignore the naysayers if you're interested in one of the Big Boys; close your eyes and buy it.",
      "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbi0tg/",
      "created": 1728057861,
      "depth": 0,
      "replies": [
        {
          "id": "lqbk97l",
          "score": 17,
          "body": "there’s been people saying this all the way since low 20s.\n\n\n\nClassic example of hindsight bias, no positions, no gains.\n\n\nHe just knew it",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbk97l/",
          "created": 1728058576,
          "depth": 1,
          "replies": [
            {
              "id": "lqbl4oq",
              "score": -2,
              "body": "LOL!!! I hear you, and in the spirit of being a chilled-out person I'll even give you my upvote.   \nMy feeling about Ubisoft was neither scientific nor repeatable, and yes, I didn't do anything about it. It is what it is.",
              "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbl4oq/",
              "created": 1728058861,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lqbjsej",
          "score": 12,
          "body": "Zoom out the chart man",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbjsej/",
          "created": 1728058426,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqbjopx",
          "score": 5,
          "body": "It would have been blind luck",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbjopx/",
          "created": 1728058393,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqbmn67",
          "score": 3,
          "body": "Clearly didnt though otherwise you would've bought lol",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbmn67/",
          "created": 1728059348,
          "depth": 1,
          "replies": [
            {
              "id": "lqbmv5p",
              "score": 1,
              "body": "True. The stock market is a big beast, and I'm scared! LOL!!!!",
              "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbmv5p/",
              "created": 1728059420,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lqbos9c",
          "score": 2,
          "body": "ah yes the good old 20/20 \"I knew it!\"",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqbos9c/",
          "created": 1728060035,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqcry3z",
          "score": 1,
          "body": "wouldnt the $3 a share pricepoint still be a good/cheap buy in point? I have no stock knowledge. I'm just very curious",
          "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqcry3z/",
          "created": 1728072640,
          "depth": 1,
          "replies": [
            {
              "id": "lqd411j",
              "score": 2,
              "body": "u/Waytogo15  It's probably not a buy anymore, if this buyout talk is real. If the buyout talk is seen by \"Mr Market\" as having substance to it, the stock price is unlikely to go up much more than today's closing price. In the coming days (and probably weeks), stock market insiders will hear more than we outsiders do on this topic, and so the stock is unlikely to move up much beyond where it is now, until the talks are resolved one way or the other.\n\nI saw the same thing happen with Abcam, a British biotech company which moved from the UK to be listed in the Nasdaq, only to get bought out. Once there was an announcement that Dannaher Corporation were looking into buying Abcam and taking it private, Abcam's stock price pretty much froze at around $24, compared with the $14-and-change area which was its price when it moved from being listed on the AIM stock exchange in the UK to being listed on the NASDAQ in the US.\n\nAnother company, SPAR Group, a multinational retail franchise, has been stuck at under $3 for months, ever since news began to circulate that it might be bought by Highwire Capital. It has since been officially confirmed - as of around 4 weeks ago - that SPAR Group will indeed be bought out by Highwire Capital For $2.50/share in cash.\n\nIn other words, once a story emerges that a company is seeking a buy-out, it's probably not wise to step into the stock anymore, because if the board of directors accept a bid, whatever the stock price  is on either the day of acceptance, or on the day the reports were first published, will likely be the ceiling of the stock price.\n\nOf course, if the buyout talks fail, the stock will continue to be listed, and you can then make a decision whether to buy it or not, based on the company's fundamentals as well as the stock price. But for me, once I hear buyout rumours, I stay away.",
              "permalink": "/r/stocks/comments/1fw2h0z/ubisoft_shares_skyrocket_33_after_report_tencent/lqd411j/",
              "created": 1728076716,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}