{
  "title": "Opinions on Autodesk? (ADSK)",
  "score": 34,
  "selftext": "I think Autodesk is like the Microsoft of the built environment, providing critical software that engineers, product designers, and architects use as building plans become more digitally drawn, and the need for sustainable architecture demands more software intensive analysis of the conditions, and modelling complex geometries. AI in Architecture is also still in its early stages, and Autodesk has a plethora of software tools, not just 2d and 3d drawing/modelling.\n\nAutodesk's softwares are widely used among engineering firms and architecture firms, and have a history, so there will be alot of switching costs and dependency on the software, making customers sticky.\n\nAutodesk also has a business model which provides free educational license accesses to their software in architecture/engineering schools, this makes students dependent on the software from the very start.\n\nAutodesk is also a widely known industry standard for building blueprints, yes there is Sketchup, Rhino, and Grasshopper, but they are more specialised for product design, interior design, and parametric building facades which can also be exported to Autodesk's Revit to then be used in the 3d modelling there.\n\nThe above 3 points boast a very strong moat for Autodesk in my opinion.\n\nIm an architecture student, and I dont hold any position in Autodesk yet but I most likely will in the future.\n\nTL;DR : Microsoft of the built environment, moat of dependency, industry standard for building blueprints, AI in architecture is still early, demand for digital software to improve efficiency and sustainability of planning buildings/cities/products",
  "link_flair_text": null,
  "id": "1fxbycj",
  "num_comments": 12,
  "created_utc": 1728203498,
  "permalink": "/r/stocks/comments/1fxbycj/opinions_on_autodesk_adsk/",
  "comments": [
    {
      "id": "lqlf76u",
      "score": 21,
      "body": "As an engineer, Siemens and Dassault are the go to in industry but who knows 🤷‍♂️",
      "permalink": "/r/stocks/comments/1fxbycj/opinions_on_autodesk_adsk/lqlf76u/",
      "created": 1728208763,
      "depth": 0,
      "replies": [
        {
          "id": "lqm47xh",
          "score": 28,
          "body": "As an Architect, revit and Autocad are the industry standard",
          "permalink": "/r/stocks/comments/1fxbycj/opinions_on_autodesk_adsk/lqm47xh/",
          "created": 1728221996,
          "depth": 1,
          "replies": [
            {
              "id": "lrgur36",
              "score": 1,
              "body": "Engineering is a much larger part of the CAD software market cap",
              "permalink": "/r/stocks/comments/1fxbycj/opinions_on_autodesk_adsk/lrgur36/",
              "created": 1728678701,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lqm31t6",
          "score": 4,
          "body": "I came here to say something similar. As a mechanical engineer (doing a sim based PhD currently), Ansys and solidworks are far superior and I personally don’t like the autodesk suite. That being said, my uni has switched to autodesk purely because of the free licenses.",
          "permalink": "/r/stocks/comments/1fxbycj/opinions_on_autodesk_adsk/lqm31t6/",
          "created": 1728221525,
          "depth": 1,
          "replies": [
            {
              "id": "lqqu3e5",
              "score": 1,
              "body": "Siemens also does free licenses for universities and schools in general.",
              "permalink": "/r/stocks/comments/1fxbycj/opinions_on_autodesk_adsk/lqqu3e5/",
              "created": 1728286543,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lqlxobp",
      "score": 4,
      "body": "its decent , but with limited upside ( Meaning you will get very meh profits )",
      "permalink": "/r/stocks/comments/1fxbycj/opinions_on_autodesk_adsk/lqlxobp/",
      "created": 1728219250,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqmy1q0",
      "score": 10,
      "body": "It depends on sector.\n\nEngineering - autodesk is big but it isnt really the leader.\n\nFusion360/inventor/autocad, their 3 main cad platforms, have about 20-30% market share.\n\nSolidworks is the big kahuna here, and by itself has about 30-40% market share. NX, creo, and catia together have about 15-20%.\n\nThing is, most big companies do not use autodesk. Smaller companies yea, but industries like automotive, aero and medical all gravitate toward NX, catia, and creo, simply because they manage huge assemblies better than autodesk.\n\nSwitching costs- no not really. Once you know one you can get around to the other quite quickly. I was trained on solidworks and picked up fusion 360 in a few weeks. I can do creo as well, but not as good. \n\nAutodesk has been pushing fusion 360 hard and it has eaten into solidwork's space but i feel it will never get very far in industry with their cloud setup.\n\nIn architecture, autocad and revit are indeed the standard. \n\nIn 3d graphics, theres maya and 3dsmax, but they are nowhere as dominant here, lots of alternatives. \n\nI think they are a good company but nowhere as dominant or with a moat as strong as microsoft.",
      "permalink": "/r/stocks/comments/1fxbycj/opinions_on_autodesk_adsk/lqmy1q0/",
      "created": 1728232137,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqlsfo7",
      "score": 5,
      "body": "I'm also convinced that Autodesk has a strong moat (architect here), but I just don't like the stock dilution (due to stock based comp.). For a mature company you would expect the shares outstanding going down. That's why I like Adobe and Trimble (Sketchup owner) more.",
      "permalink": "/r/stocks/comments/1fxbycj/opinions_on_autodesk_adsk/lqlsfo7/",
      "created": 1728216777,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqoc35j",
      "score": 3,
      "body": "As a mechanical engineer, I really hate working with Autodesk products. While I can get over the UI and design fundamentals, they force me to install a client and I end up with multiple softwares I do not want. I can't properly deinstall it either. Their FEM and MBD simulation also provide inconsistent results. Dassault beats them with every product in my book.",
      "permalink": "/r/stocks/comments/1fxbycj/opinions_on_autodesk_adsk/lqoc35j/",
      "created": 1728247835,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqlb7an",
      "score": 1,
      "body": "Agreed on their market position. Expensed R&D levels are impressive too.\n\n58bio mkt cap, annual revenue almost 6bio, growing revenues at 15% annually, approaching 20% NIM. No div with buyback being used to sterilise stock comp.\n\nIf everything goes perfectly in next 5 years, they'll be at 25x current mkt cap.\n\nPrefer to buy at 25x (buying at a premium to normal entry to pay for the competitive position) and wait for the market to get excited over the next 5 years and sell when at 55x at double the NI. NI will be about 2.5bio, mkt cap at 55x will be ~135bio, and this would be a 300% total return. If multiples stay at 25x entry, return is 15% CAGR. If I buy tiday at 55x and multiples stay at the level, I get the 15%. But if they shrink to 25x, I flatline over 5 years.  Prefer to position for the upside.\n\nSo what do I need to see to consider? A rout to say 30bio mkt cap, perhaps as part of a broader mkt collapse, rather than anything idiosyncratic. So I'd wait for 145 then revisit.",
      "permalink": "/r/stocks/comments/1fxbycj/opinions_on_autodesk_adsk/lqlb7an/",
      "created": 1728205948,
      "depth": 0,
      "replies": []
    }
  ]
}