{
  "title": "Lowest Fed rate for 2025",
  "score": 48,
  "selftext": "What is your expectation of FED lowest possible rate in 2025? I asking because there was a high expectation of FED rate cut in September with growing unemployment and inflation going down. Now we have:\n\n* Unemployment rate declining in September is 4.1% (4.3% in July and 4.2% in August)\n* Oil prices somewhat elevated in September and it is not clear where they will go from here, as they could decline if exporters increase production.\n* Larger war could cause more inflation pressure because of potential global logistic issues.\n\nThis makes me believe that it would be hard to motivate FED to decrease rates much. Would you expect rate to go below 3% in 2025? I not see why would it happen.\n\nIf the assumption above is true, then companies benefiting on higher rates will still have significant advantage. Among them are payment systems (PAYO, WISE.LSE). While PAYO have core team located in Israel, their computing power is outside. The WISE.LSE seems more secure as they distributed among safer areas.\n\nFrom other point retail construction heavily dependent on low rates. However the 2024 proven that those with strong balance sheet, low debt and good management have not suffered much of losses. There are few good companies in industry (like LEN or MHO) with PE less than 15. Taking into consideration the inflation would stay within 2-3% such PE seems good enough to consider them as investment, even though risk of FED rate could stay quite elevated is high.\n\nWould love to hear opinions on FED rates or some related interesting companies examples.",
  "link_flair_text": null,
  "id": "1fxr7py",
  "num_comments": 25,
  "created_utc": 1728249566,
  "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/",
  "comments": [
    {
      "id": "lqosyoc",
      "score": 31,
      "body": "I think the neutral interest rate is somewhere around 4%.\n\nI expect a series of 25 basis point cuts with a target of 3.75% to 4.25% by the end of 2025.",
      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqosyoc/",
      "created": 1728253465,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqojksn",
      "score": 40,
      "body": "Barring a major economic recession, it's unlikely to go below about 4% I would say.  The Fed was pretty aggressive with the last rate cut, but I see them going back to form with minor adjustments depending on how things are shaking.\n\n\n Even in a relatively medium grade recession, I doubt less than 2-3%.  It will only go below that if the economy blows up for some reason.",
      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqojksn/",
      "created": 1728250269,
      "depth": 0,
      "replies": [
        {
          "id": "lqppuwf",
          "score": 2,
          "body": "And the government would also have to stop printing so much money. That isn’t going to happen. ",
          "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqppuwf/",
          "created": 1728265921,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqolfjl",
      "score": 22,
      "body": "Just look at the most recent dot plot. Seems like Fed governors have a consensus ranging from 3 to 3.5 %",
      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqolfjl/",
      "created": 1728250871,
      "depth": 0,
      "replies": [
        {
          "id": "lqor7kh",
          "score": 1,
          "body": "that dot plot also assumed a 4.4% unemployment rate and 2.0% GDP in 2024. The GDP assumption is definitely wrong. The unemployment rate is probably too high unless if we tip into a recession this year.",
          "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqor7kh/",
          "created": 1728252852,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqq1bww",
      "score": 8,
      "body": "2.5% chance of 250-275 would be lowest possible\n\n50%+ chance of 325-350 or higher\n\n[https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html?redirect=/trading/interest-rates/countdown-to-fomc.html](https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html?redirect=/trading/interest-rates/countdown-to-fomc.html)",
      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqq1bww/",
      "created": 1728270514,
      "depth": 0,
      "replies": [
        {
          "id": "lqqqda6",
          "score": 3,
          "body": "Props for sharing this tool. I like to check it throughout the week before/after big data prints.",
          "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqqqda6/",
          "created": 1728283968,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqoriz6",
      "score": 17,
      "body": "I’m expecting the economy to have a tough time, post election. From here to end of 2025, I’m completely guessing at a 175bp reduction. I’m also guessing the economy will have a rough time, as well. However, with 16 of the last 17 jobs numbers reports revised down, after the fact, I feel like the feel good statistics are on their last legs. I have no experience or education in economics, just a gut feeling that things are going to get bumpy. The numbers don’t match the sentiment",
      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqoriz6/",
      "created": 1728252965,
      "depth": 0,
      "replies": [
        {
          "id": "lqoyd2r",
          "score": 1,
          "body": "Why?",
          "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqoyd2r/",
          "created": 1728255394,
          "depth": 1,
          "replies": [
            {
              "id": "lqp6dk7",
              "score": 16,
              "body": "A large number of people are reportedly financially hurting right now. Our recent economic numbers have looked good, but they don’t reflect how the average consumer has felt lately. Then, those economic numbers are often revised lower than initially reported, well after the fact. \n\nI don’t think I’ll ever short a stock in my life, it’s not my thing. And I’m not going to stop buying at any point in the next 30 years or so. I’m not any kind of bear. I just feel like the covid response/money printer broke the economy more than we’ve allowed ourselves to feel, so far. I think Powell’s doing a good job, but we printed a ton of money, and the government seems intent to continue spending more than they should. His job is damn near impossible, especially in an election cycle with two ‘change’ candidates in the running. \n\nI’ll be forever impressed if we avoid a recession. I just don’t think we’re going to avoid one. It won’t be the end of the world",
              "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqp6dk7/",
              "created": 1728258310,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lqp7tts",
              "score": 2,
              "body": "Many Fed officials are kinda panicking, while trying hard to not look like it. Powell took the risk of starting the cutting cycle with 50 basis point, and probably tried really hard to convince multiple Fed officials to go along with the 50 bps cut (I think Barkin, Waller, Schmid, Logan, Musalem, Bostic) would've all preferred starting with 25 bps (and 75bps total in 2024). \n\n7 people wanted 75 bps total in 2024 and 2 wanted 50 bps cut total in 2024. So to start with 50 bps cut and only cut 25 bps in 1 out of 2 remaining meetings, just gives off an inconsistent/bizarre message instead of 25 bps in each of the 3 remaining meetings.\n\nEven if the economy is fine, doing so really risks the financial market taking it the wrong way and thinking the Fed is worried about recession. So if market thinks so and sell off, that would kill consumer sentiments, and would lead to an actual recession. So that's the big risk.\n\nThere's really no huge benefit to 50 bps cut other than if the Fed needs to cut 75bps in the next meeting to react to a recession, they are in a better position to do so. If they cut 25 basis point in Sept and gave a really dovish speech, even saying they'll cut 50 bps in Nov, the market would've priced in more Fed cuts, and the net effect on financial condition would've been pretty similar. So I wasn't sure why they did the 50 bps cut for minimal benefits and huge tail risk. It's even more bizarre they made that decision during the blackout no communication period, which further gives the impression they're panicking. As you can see below, we're at the same restrictiveness as where we were in summer 2022 when Fed fund rate was around 2%, and the loosening happened in May 2024, months ago.\n\n[https://www.frbsf.org/research-and-insights/data-and-indicators/proxy-funds-rate/](https://www.frbsf.org/research-and-insights/data-and-indicators/proxy-funds-rate/)\n\nOf course lower inflation gave the Fed reason to cut 50 bps. But doing so 1.5 months early makes little difference, and they took huge risk of the market misinterpreting the message. So I don't know why they did that, if they weren't actually concerned themselves. Maybe their local business contacts have been telling them negative things.",
              "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqp7tts/",
              "created": 1728258871,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lqowp3r",
      "score": 2,
      "body": "Median 3.5, lower bound 3%, if anything goes wrong though. Unemployment really begins to ramp up, the stock market is off north of 10%, unexpected events, that's how you get the Fed rate into the 2s. \n\nIf you're looking to strategize interest rates, the easy trade is being short atm puts on rate products that expire, maybe January 2026. While I think we probably have 6x 25 point cuts between right now and the end of next year, this strategy doesn't really require that to play out. You just need things to not get worse from an inflationary perspective\n\nAs long as you watch your deltas and overall exposure You have a pretty straightforward trade on your hands",
      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqowp3r/",
      "created": 1728254800,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqpsi10",
      "score": 2,
      "body": "I think we get 100 bps cuts this year and then another 150 next year. 3.5% seems like a good place for the Fed to go down to and then pause while they wait to see the effects from the cuts.",
      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqpsi10/",
      "created": 1728266967,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqtt1r1",
      "score": 2,
      "body": "It’s hard to see the Fed cutting rates below 3% in 2025, given the current economic factors you mentioned. With unemployment stabilizing and oil prices uncertain, along with the potential for inflationary pressure from geopolitical issues, the Fed might be cautious about making deep rate cuts. This environment could favor companies that benefit from higher rates, like payment systems (e.g., PAYO, WISE.LSE). On the other hand, some retail construction companies with strong fundamentals, like LEN and MHO, might still be attractive investments even if rates stay elevated.",
      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqtt1r1/",
      "created": 1728330418,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqqg3zk",
      "score": 3,
      "body": "Luckily the fed publishes a report with expert projections that will be much more accurate than redditors.   \n\nFigure 2 \n https://www.federalreserve.gov/monetarypolicy/files/fomcprojtabl20240918.pdf\n\nAbout 3.25-3.5.",
      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqqg3zk/",
      "created": 1728277680,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqopr1t",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqopr1t/",
      "created": 1728252345,
      "depth": 0,
      "replies": [
        {
          "id": "lqq9rdg",
          "score": 0,
          "body": "Quantitative tightening isn’t happening, it stopped a while ago. The m2 money supply shows this’s",
          "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqq9rdg/",
          "created": 1728274415,
          "depth": 1,
          "replies": [
            {
              "id": "lqqbztk",
              "score": 3,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqqbztk/",
              "created": 1728275527,
              "depth": 2,
              "replies": [
                {
                  "id": "lqqe8vd",
                  "score": 1,
                  "body": "https://fred.stlouisfed.org/series/M2SL",
                  "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqqe8vd/",
                  "created": 1728276706,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lqqf9g3",
                      "score": 2,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqqf9g3/",
                      "created": 1728277230,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lqqh0lu",
                          "score": 1,
                          "body": "I see, thanks for explaining :)",
                          "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqqh0lu/",
                          "created": 1728278178,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lqru658",
      "score": 1,
      "body": "3.75-4% if no recession. That said the economy \nMight just be strong enough for the fed to maintain  4.25-4.75% indefinitely",
      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqru658/",
      "created": 1728307262,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqsntm7",
      "score": 1,
      "body": "I'll be happy if I see it get below 5.5%. the recent jobs report was disappointing for future cuts.",
      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqsntm7/",
      "created": 1728317389,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqyl9vh",
      "score": 1,
      "body": "8%",
      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqyl9vh/",
      "created": 1728404714,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqpxl0q",
      "score": 1,
      "body": "I don't see much reason for any major change. We might see .25 or .5 drop from here. But things are pretty stable right now and it will be tough for the fed to make the case for a major change UNLESS some outside factor happens, which is totally possible. \n\nThe most obvious potential factor is if there's a regime change and Trump wins and then makes major policy changes that have some form of economic impact at home or abroad. But aside from that, Israel is getting out of hand and may cause this localized conflict to become a bigger regional problem. The Arab governments are already unstable and their inaction against Israel has their citizens ready to riot. I was just in Turkey and there is constant discussions on the news, in the streets and in Taxis about the need for Turkeys military to join Iran and intervene. Also saw regular rallies and protests against Israel and America.",
      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqpxl0q/",
      "created": 1728268967,
      "depth": 0,
      "replies": [
        {
          "id": "lqq0gsm",
          "score": 1,
          "body": "There will be well over 100 bps in cuts coming our way in the next year… we aren’t close to the neutral rate yet.",
          "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqq0gsm/",
          "created": 1728270153,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqow7mx",
      "score": -1,
      "body": "I'm not going to believe any government numbers right now until after the election.",
      "permalink": "/r/stocks/comments/1fxr7py/lowest_fed_rate_for_2025/lqow7mx/",
      "created": 1728254630,
      "depth": 0,
      "replies": []
    }
  ]
}