{
  "title": "Activist investor Starboard Value takes $1 billion stake in Pfizer (Reuters)",
  "score": 50,
  "selftext": "Oct 6 (Reuters) - Activist investor Starboard Value has taken a stake of about $1 billion in Pfizer (PFE), opens new tab and wants the U.S. drug giant to make changes to turn its performance around, sources familiar with the matter said on Sunday.\n\nStarboard has also approached Ian Read, a former Pfizer CEO, and Frank D'Amelio, who served as CFO until 2021, and both have expressed interest in helping the activist investor, the sources said.\n\nRead served as CEO until Albert Bourla took the position in 2019. Bourla was instrumental in working with BioNTech to develop a COVID-19 vaccine.\n\nPfizer declined to comment and Starboard did not immediately respond to a Reuters request for comment.\n\nhttps://www.reuters.com/business/healthcare-pharmaceuticals/activist-investor-starboard-value-takes-1-billion-stake-pfizer-wsj-reports-2024-10-07/",
  "link_flair_text": "Company News",
  "id": "1fxzh1h",
  "num_comments": 22,
  "created_utc": 1728275244,
  "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/",
  "comments": [
    {
      "id": "lqr2obz",
      "score": 29,
      "body": "Big pharma isn’t the kind of business you can just swoop into and make big changes in a month and turn things around.  Drug pipelines take decades to coalesce and patent cliffs are slow moving icebergs.  \n\nThis isn’t “add more salt to the meals at Olive Garden and then charge more for beverages” kind of one quarter lift type of thing.\n\nI mean, there are ways to make a quick impact, but they’d probably be along the lines of burning the furniture for warmth or doing some Shkreli type badness.",
      "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqr2obz/",
      "created": 1728292812,
      "depth": 0,
      "replies": [
        {
          "id": "lqrxvlm",
          "score": 7,
          "body": "Agreed. Drug development takes time, and quick fixes could lead to bigger problems. It’s all about making smart, long-term changes instead of rushing into drastic moves",
          "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqrxvlm/",
          "created": 1728308685,
          "depth": 1,
          "replies": [
            {
              "id": "lqrz5et",
              "score": 6,
              "body": "That said, I’m tempted.  6% yield that’s covered (unless vulture activists target it) \n\nHow much downside is there?  It bottomed at $26 when it had a run of bad news flow.  And maybe the drug developments actually are in the pipeline some years ago, and activists will get to free ride any news that comes along now.  Maybe Seagen starts to look good.  Maybe quick moves like how they recently dumped sensodyne will be catalysts.",
              "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqrz5et/",
              "created": 1728309151,
              "depth": 2,
              "replies": [
                {
                  "id": "lqthjro",
                  "score": 4,
                  "body": "It’s not about if but when.  They will be back in the 30s most likely by year end.  The whole sector has been down lately and they did raise their dividend as they do every year.  I’d say that’s a good dividend company.",
                  "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqthjro/",
                  "created": 1728326746,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lqrltl7",
      "score": 18,
      "body": "I think it's wild that all the expertise Pfizer would have gained going through a pandemic is basically written off as having no value. I mean, I'm sure this pushed mrna research timelines ahead by huge amounts. Not to mention, if there's ever another pandemic the gov is obviously going to work with the companies they worked with previously. And yet, $0 value for all that science and partnership buildout. \n\nMeanwhile, my Tesla wants to drive me off the road using FSD and Tesla stock almost doubles because Musk says robotaxis are ready.  \n\nWe're living in an era where hype seems to be everything.",
      "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqrltl7/",
      "created": 1728303778,
      "depth": 0,
      "replies": [
        {
          "id": "lrfkif6",
          "score": 1,
          "body": "Hypes and fads are everything now. And pharma is just not built for that. Any pharma company that isn’t novo or Lilly is getting punished as if they haven’t been doing well and you can just flip a switch and make your own obesity drug.",
          "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lrfkif6/",
          "created": 1728663473,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqqjjkw",
      "score": 20,
      "body": "1 Billion of a 160 Billion company is nothing",
      "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqqjjkw/",
      "created": 1728279651,
      "depth": 0,
      "replies": [
        {
          "id": "lqra0wg",
          "score": 18,
          "body": "It’s not about money, it’s about influence. Check their track record. These guys flip board seats like Wendy’s flips burgers.",
          "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqra0wg/",
          "created": 1728297695,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqqf0wi",
      "score": 9,
      "body": "Cramer did tell us to buy it 🤷‍♂️",
      "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqqf0wi/",
      "created": 1728277104,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqqyuhp",
      "score": 7,
      "body": "With less than 1% ownership, can someone explain how they plan to change things?",
      "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqqyuhp/",
      "created": 1728290022,
      "depth": 0,
      "replies": [
        {
          "id": "lqsdvrk",
          "score": 6,
          "body": "By making enough noise that other big shareholders listen and take notice. You don't need 51% of a company to affect change you just need enough to scare whoever does.",
          "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqsdvrk/",
          "created": 1728314176,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqqn5ps",
      "score": 6,
      "body": "It’s time to shake it up. Pfe is undervalued for long.",
      "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqqn5ps/",
      "created": 1728281881,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqr0psr",
      "score": 2,
      "body": "Needs a new CEO from outside the company. After Immelt departed, GE eventually brought in Larry Culp, who should be in the CEO hall of fame for that turnaround - but before that they had someone who was at the company since the 1980's and it just accelerated the decline. \n\nPFE has gone nowhere for 20 years and people keep handwaiving/excusing away failures (\"it's undervalued\" - no, it's been poorly run for ages) like the recent withdrawal of a drug made by a company they just spent about 5.4B in 2022 to buy, or disappointing obesity results or the disappointing Duchenne gene therapy \n results (https://www.reuters.com/business/healthcare-pharmaceuticals/pfizers-gene-therapy-muscle-wasting-disorder-misses-main-goal-late-stage-study-2024-06-12/ - see also: \"How Pfizer’s grand gene therapy ambitions crumbled\" - https://www.statnews.com/2024/07/26/pfizer-gene-therapy-hemopilia-rare-disease/)",
      "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqr0psr/",
      "created": 1728291399,
      "depth": 0,
      "replies": [
        {
          "id": "lqti1ul",
          "score": 1,
          "body": "I upvoted you because of Larry culp, ceo god who knows how to get rid of unprofitable business and focusing on their core.  Ge aerospace, ge Vernova, ge healthcare.  If Pfizer got a new or good ceo it would be trading mid 30s fast",
          "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqti1ul/",
          "created": 1728326905,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqr4hpn",
      "score": 1,
      "body": "Alpha. Thanks you.",
      "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqr4hpn/",
      "created": 1728294092,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqqihwm",
      "score": -6,
      "body": "Just as facts surrounding \"emergency measures\" taken during covid are comming out ..now this? I smell a rat.  \n  \nNew owners to anything ..can blame past owners for wrong doings ..to spare the company from the fall out.",
      "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqqihwm/",
      "created": 1728279029,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr3uqum",
      "score": 1,
      "body": "I watched my networth depreciation in real time because of this stock. Do not buy.",
      "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lr3uqum/",
      "created": 1728488765,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqrzefs",
      "score": -3,
      "body": "Are they planning another pandemic? And if so, what are the chances Pfizer lobbyists will get them the contract? I missed the boat with the first one, dont want to miss it again. I have a sizeable position in novavax and some moderna stock, but nothing in Pfizer at the moment.",
      "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqrzefs/",
      "created": 1728309241,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqrmzr8",
      "score": 0,
      "body": "Laughing about the two former CEOs involvement as they are ones that transition PFE from an innovative company to one that acquires technology, and in many instances, integrates them poorly.   All I see from this is a significant manpower reduction further impacting innovation.",
      "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqrmzr8/",
      "created": 1728304299,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqs6kgg",
      "score": -2,
      "body": "Activist?  An activist for what? Idk too many \"activists\" that would invest in big pharma lmfao.",
      "permalink": "/r/stocks/comments/1fxzh1h/activist_investor_starboard_value_takes_1_billion/lqs6kgg/",
      "created": 1728311750,
      "depth": 0,
      "replies": []
    }
  ]
}