{
  "title": "Shares of generator maker Generac soar, insurance stocks fall as Hurricane Milton intensifies",
  "score": 53,
  "selftext": "",
  "link_flair_text": "News",
  "id": "1fyecd0",
  "num_comments": 20,
  "created_utc": 1728324535,
  "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/",
  "url_overridden_by_dest": "https://www.cnbc.com/2024/10/07/generator-maker-generac-soars-insurance-stocks-fall-on-hurricane-milton.html",
  "comments": [
    {
      "id": "lqtaicv",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 370 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lqtaicv/",
      "created": 1728324539,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqu0tic",
      "score": 12,
      "body": "I was real bullish on GNRC until I had one of their sales people come to my house.  They wanted $20k to install a $5k generator, and the sales guy had no fucking clue about basic shit.  It's not like I would expect most people to know what Locked Rotor Amps means on a pump, but I sure as hell would expect a guy from a generator company trying to spec out a solution for me to know.  Maybe I'm expecting too much, but if you want me to pay $20k for a generator install you better send a fucking engineer or at least a qualified electrician.\n\nAfterwards they kept calling me so much that I blocked their number, and instead I'm going to purchase a Champion standby generator and hire my own contractors to install it.  I'll be able to get it done for $8k instead of $20k for the same size generator.\n\nEDIT: I should clarify it was a 3rd party installer that I dealt with, but they seem to be a large multi-state partner of Generac's.  It was, however, Generac who sent this installer and it was also Generac who wouldn't stop calling me.\n\nEDIT2: I also think you should still be bullish on Generac, they're going to sell every generator they can make.",
      "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lqu0tic/",
      "created": 1728332874,
      "depth": 0,
      "replies": [
        {
          "id": "lr8w15k",
          "score": 2,
          "body": "Every person I know in Oregon with a generac tells me to never buy one because they have been pieces of shit since the start. The actual generator not the people 🤷🏼‍♂️",
          "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lr8w15k/",
          "created": 1728565821,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqv7w2s",
          "score": 1,
          "body": "Before I buy a vehicle I talk to a mechanic. Might be a good idea to do the same here so you can get some idea of what gens are shit before you pull the trigger. Industrial suppliers/rental companies buy a lot of gens and usually do their own maintenance. Maybe stop in and talk to one of their mechs if you live near one? As someone who's worked 25 years industrial, 99% of the gens for temp power on sites I've worked at were Generac's. Must be a good reason for that and it would be a shame to buy a substandard gen because of 1 or 2 dumbass slimy commission rats. \n\nNot saying Champion sucks, and I'm not a mechanic or electrician. Maybe they're all the same IDK. gl tho",
          "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lqv7w2s/",
          "created": 1728347887,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqveziu",
          "score": 1,
          "body": "You got someone to come by?\n\nI live in Houston and requested a quote 2 months ago. \n\nBut there’s NFW I’m paying $10k to install a $5k generator. \n\nFor a more basic setup, the electrical switch is $900 and a 20kW generator is $4k. \n\nOddly, I can get a generac delivered for $5k but my regular electrician won’t do an automatic standby installation. ",
          "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lqveziu/",
          "created": 1728350465,
          "depth": 1,
          "replies": [
            {
              "id": "lr16oct",
              "score": 1,
              "body": "Home backups need either a natural gas line or a propane tank, if you don’t have either of those I’d bet that would be a big portion of the high install cost",
              "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lr16oct/",
              "created": 1728439238,
              "depth": 2,
              "replies": [
                {
                  "id": "lr3p0p7",
                  "score": 1,
                  "body": "I have a natural gas line. \n\nOn the wall next to the circuit breaker. \n\nIt’s a non issue. ",
                  "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lr3p0p7/",
                  "created": 1728486912,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lr2d70k",
              "score": 1,
              "body": "To clarify, they wanted $20k all in, $5k for the generator and transfer switch + labor and materials.",
              "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lr2d70k/",
              "created": 1728464978,
              "depth": 2,
              "replies": [
                {
                  "id": "lr3m4f1",
                  "score": 1,
                  "body": "Yeah. $15k for $1k in work. ",
                  "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lr3m4f1/",
                  "created": 1728485950,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr3slk0",
                      "score": 1,
                      "body": "Eh it was definitely more than $1k in work, they wanted to trench a 125' gas line, which was the wrong move.  Everyone else I talked to said you put the generator next to the gas meter and trench your electrical.  That said, I can get someone to trench that electrical work for <$2k.  The plumbing will be <$500, then the rest is just installing the transfer switch so maybe $1k tops for that.",
                      "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lr3slk0/",
                      "created": 1728488076,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lqvfye2",
          "score": 1,
          "body": "We’re getting ready to have electrical work done on our house, with the final project being a generator, this makes me feel better about getting a qualified electrician to do it, my boomer dad is always like get a generac from lowes like it’s the gold standard, we’ve never gone wrong using references from our real estate agent (we bought our house over a decade ago)",
          "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lqvfye2/",
          "created": 1728350827,
          "depth": 1,
          "replies": [
            {
              "id": "lqvlnna",
              "score": 1,
              "body": "The research I've done points to Kohler being the preferred brand of installers that have done multiple brands, but you have to maintain them with a $500/yr service contract.  In 10 years you'll have paid another $5000 for the generator.  Those generators seem to last 20 years+ if they're maintained, however.  \n\nI like the Champion standby units because they have these big gull-wing doors so everything should be easy to service.  The downside is there are no dealers in my area so I'm 100% on my own when it comes to servicing and maintaining it.  However, allegedly their phone support is pretty good, and I'm comfortable doing the service and any troubleshooting that may need to be done.  A minor concern would be that a discerning future home buyer may not see the generator as a value add since there's no dealer to call to service it.\n\nOther Champion notables:\n\n- warranty is 10 years vs 5 with both Generac and Kohler.  \n- 24V starter will start the engine down to at least -22F without an additional heater \n- A bit quieter than the other manufacturers\n- I've seen several reviews from folks claiming their electricians said the Champion was by far the easiest to install generator they've done and it was their first time doing one.\n\n\nThe last option is Cummins.  Unfortunately they don't use Cummins engines in the residential air cooled units, they use Briggs and Stratton, but they are allegedly very well made and a solid generator.  My issue with them is the complexity of service. It's not a problem if you intend to use a service contract and have a good dealer, but if you want to service it yourself, they're allegedly annoying to work on, eg there's like 17 screws just to get the covers off.",
              "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lqvlnna/",
              "created": 1728352985,
              "depth": 2,
              "replies": [
                {
                  "id": "lqvmklt",
                  "score": 3,
                  "body": "Love the homework, have heard you need yearly service, no issue with that, have also heard there’s a lifetime to the systems, 20 years being optimal, any additional info you come across would be greatly appreciated",
                  "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lqvmklt/",
                  "created": 1728353332,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lr1707d",
              "score": 1,
              "body": "I recently read a thread where a generator service tech was telling his experience repairing all brands in the field and his personal recommendation was Briggs and Stratton. Said they’re good quality and had the best warranty on the market \nHe wasn’t real high on Generac due to what he said was cheaper windings in the motor that wore out quick and needed replaced. Other than that he said they were very good quality",
              "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lr1707d/",
              "created": 1728439382,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lr16gy2",
          "score": 1,
          "body": "I recently read a thread where a generator field repair tech was discussing the pros and cons of brands and what he’s buy if it was his own. \nHe wasn’t real high on generac because he said the windings of the motor wear out the quickest of the brands. Some of his opinions were based off inventory part levels on his truck, basically saying I’ve o it for a few parts on my service truck for brand x because they wear out whereas brand b I’ve got plenty of parts due to their durability. \nHis personal recommendation was Briggs and Stratton. Said they were good quality and had the best warranty on the market",
          "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lr16gy2/",
          "created": 1728439157,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqtoek4",
      "score": 2,
      "body": "Damn I didn’t even think about that",
      "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lqtoek4/",
      "created": 1728328925,
      "depth": 0,
      "replies": [
        {
          "id": "lqv90y5",
          "score": 4,
          "body": "Just started looking. Hurricanes are bullish for construction and home supply stores. Also generators.\n\n Might buy some calls for 1 -2weeks out\n\nMarkets are usually RED day of =ODTE SPY PUTS BABY!!\n\n*disclaimer I failed inside the line coloring and duck duck goose as a child",
          "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lqv90y5/",
          "created": 1728348296,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqtu2q0",
          "score": 4,
          "body": "There's always next year.",
          "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lqtu2q0/",
          "created": 1728330745,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr48u7n",
      "score": 1,
      "body": "https://trends.google.com/trends/explore?geo=US&q=%2Fm%2F0l4dz&hl=en",
      "permalink": "/r/wallstreetbets/comments/1fyecd0/shares_of_generator_maker_generac_soar_insurance/lr48u7n/",
      "created": 1728493265,
      "depth": 0,
      "replies": []
    }
  ]
}