{
  "title": "Wells Fargo downgrades Amazon on slowing growth expectations & Walmart competition",
  "score": 141,
  "selftext": "Amazon Inc. shares fell on Monday, following a rare analyst downgrade that cited concerns over margin trends into next year, which growth in the cloud computing business is unlikely to compensate for.\n\nWells Fargo Securities cut the stock to equal weight from overweight, with analyst Ken Gawrelski becoming one of the few analysts tracked by Bloomberg who doesn’t have a buy recommendation on the stock. He also cut his price target from $225 to $183, one of the lowest on Wall Street.\n\nAm I the only one that thinks AMZN is still undervalued? ",
  "link_flair_text": "Company News",
  "id": "1fyvb52",
  "num_comments": 38,
  "created_utc": 1728377867,
  "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/",
  "comments": [
    {
      "id": "lqwvlk3",
      "score": 92,
      "body": "Bought the dip",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqwvlk3/",
      "created": 1728378430,
      "depth": 0,
      "replies": [
        {
          "id": "lqyr1aw",
          "score": 8,
          "body": "I dip you dip we dip",
          "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqyr1aw/",
          "created": 1728406554,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqz661h",
          "score": 5,
          "body": "Yeh, in 2016, they had also downgraded NVDA 🤣",
          "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqz661h/",
          "created": 1728411572,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqwy6x1",
      "score": 41,
      "body": "On Prime day no less, brutal",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqwy6x1/",
      "created": 1728380292,
      "depth": 0,
      "replies": [
        {
          "id": "lqx0wxt",
          "score": 26,
          "body": "I blame Bezos, 8 isn't a prime number",
          "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqx0wxt/",
          "created": 1728382141,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqwxl1r",
      "score": 48,
      "body": "Added 40 shares on sale yesterday",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqwxl1r/",
      "created": 1728379862,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqxk08d",
      "score": 46,
      "body": "Amazon abuses the hell out of the USPS\n\nAmazon also did nothing to combat cheap chinese knockoff goods and dropshippers that flooded the market place\n\nSKU mixing allowed for counterfeit products to be mixed in with legitimate products so you'll never be sure you are getting a legitimate product.",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqxk08d/",
      "created": 1728391843,
      "depth": 0,
      "replies": [
        {
          "id": "lqz4cv7",
          "score": 24,
          "body": "this is my biggest issue with Amazon on a personal level as a customer. you have no idea what the hell you're buying because all of the reviews are fake. Amazon has also been making it more difficult to get refunds. I dont feel like going to whole foods to return an illegitimate product that was falsely advertised.",
          "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqz4cv7/",
          "created": 1728410961,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr0ue97",
      "score": 5,
      "body": "Wells Fargo the Wal-Mart of banking.",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lr0ue97/",
      "created": 1728433801,
      "depth": 0,
      "replies": [
        {
          "id": "lr90t9a",
          "score": 1,
          "body": "Wal-Mart randomly opens up lines of credit in your name also?",
          "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lr90t9a/",
          "created": 1728567666,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqww4ck",
      "score": 30,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqww4ck/",
      "created": 1728378806,
      "depth": 0,
      "replies": [
        {
          "id": "lqx70d1",
          "score": 19,
          "body": "Cathie has one playbook and it was the right investing place/right investing time during 2020/21 but arguably it didn't work that well in previous AB funds she managed and the Ark funds have done horribly since 2021\n\nRather than thoughtfully consider ways to change her approach and/or admit that she was wrong, she is now churning the portfolio hoping something works (including buying AMZN at the wrong time which - given her low quality growth universe - is practically like her buying a value name) and doing things like betting on things right before earnings in the hopes that it provides a quick portfolio boost. \n\nShe invests like someone who just opened their Robinhood account but her inability to admit error (she literally tried to spin her giant losses a positive in a since-deleted tweet)/make any sort of thoughtful change whatsoever (goes on CNBC - who keeps having her on for some reason - and says the same things every single interview) makes it worse.\n\n She's really provided people a lot of examples of what not to do (do have some flexibility; the average investor is not stuck in a Morningstar style box; if something is not working do not blame everyone else or just sit there as months/years go by under the belief that the market doesn't get it/you couldn't possibly be wrong; not every \"disruptive growth\" theme is a compelling one, etc) over the last few years.",
          "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqx70d1/",
          "created": 1728385788,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqxm64x",
          "score": 14,
          "body": "What’s the criticism here? She literally bought the dip.",
          "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqxm64x/",
          "created": 1728392717,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqx39xt",
      "score": 7,
      "body": "Yawn",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqx39xt/",
      "created": 1728383643,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqypi44",
      "score": 3,
      "body": "Now Amazon will climb 🚀📈",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqypi44/",
      "created": 1728406056,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqxdcrh",
      "score": 13,
      "body": "Aws isn't the infinite growth machine it appears to be. Businesses aren't seeing the returns they want on private/public cloud, some are going back to hybrid which Aws isn't overly competitive on. I think azure and gcp will move in on their share.",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqxdcrh/",
      "created": 1728388928,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqxtr3i",
      "score": 7,
      "body": "With Amazon trading at only 22x next year's estimates, Amazon is actually cheaper than WalMart (28x).  They are just now realizing the payoff from the build out of their infrastructure in recent years, demand for cloud services is continuing to grow, streaming is growing, and prime is a good source of revenue and makes their customers stickier than on other platforms.\n\nEven if their earnings growth slows to mid teens for the next several years from the 20%+ they see now, that means they are trading at about 11x what their earnings will be in 5 years.  This seems like a bargain to me.",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqxtr3i/",
      "created": 1728395596,
      "depth": 0,
      "replies": [
        {
          "id": "lqy55fb",
          "score": 8,
          "body": "My only concern is that Amazon will not have the talent to follow through on their plans. \n\nTheir 5-day RTO mandate is a thinly-veiled layoff. They would be smart to simply perform a layoff because then at least the company would have the choice of who gets shown the door, versus this pseudo-layoff where only the people with options (aka top-performers and higher-level engineers) are going to leave. \n\nAmazon will then have to pay out-the-nose for the talent it needs to bring on and offer flexible work environments. Or they will pay a lesser premium (but a premium nonetheless) for middling employees who are willing to tolerate Amazon's work environment. \n\nI'm even more Bearish on Amazon long term because of their recent Prime Day stats; [the spending by Millennials was actually net-negative by 1.3%, and Gen X only had 1% growth.](https://www.bloomberg.com/news/newsletters/2024-07-25/amazon-s-prime-day-sale-loses-a-bit-of-appeal-for-millennials) Standard jokes abound about Millennials not having money, they're actually starting to enter the age where they do actually have some money. Most Millenials are doing far better now than in the early to mid 2010's. But Gen X is entering their prime spending years, and Amazon is only seeing a net growth of 0.3% among these two age groups? Yeah, not good.",
          "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqy55fb/",
          "created": 1728399484,
          "depth": 1,
          "replies": [
            {
              "id": "lqy9r0l",
              "score": 7,
              "body": "Amazon already pays a premium for talent, and Amazons work culture has always been notorious.  RTO will have some effect on the margins, but plenty of engineers want to work for Amazon, at least for a few years to get the experience and bank some cash.  This is how they've always run things, and they have been able to keep staffed with talented people.\n\nThe effect of promotions fades over time.  Black Friday sales used to be a huge driver of sales; now it is just another holiday on the promotional calendar; similarly, Prime Day isn't a big deal anymore.  Amazon doesn't need to raise its brand awareness like it did earlier, so they are cutting back on the deals, letting prime day become less important, and getting customers to buy when they want at regular price instead of training them to only buy when they get deep discounts (which is something that stores like legacy department stores have become reliant on, to their detriment).\n\nYou can't evaluate a company based on a single annual promotion.",
              "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqy9r0l/",
              "created": 1728400990,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lr61kh9",
      "score": 2,
      "body": "Didnt Wells Fargo get sued for scamming their customers?",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lr61kh9/",
      "created": 1728514519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqxe74n",
      "score": 5,
      "body": "The average analysts price is over 200.\n\nIf people think Amazon is going to go bankrupt I'd say short it but it won't end well.\n\nIt moves slower than other stocks but its stable.  Amazon is way more than localized in the USA.  WAY MORE.",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqxe74n/",
      "created": 1728389317,
      "depth": 0,
      "replies": [
        {
          "id": "lqz4lq7",
          "score": 16,
          "body": "no one in their right mind would think Amazon is going bankrupt",
          "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqz4lq7/",
          "created": 1728411044,
          "depth": 1,
          "replies": [
            {
              "id": "lr09kfy",
              "score": 2,
              "body": "Amazon is 43X earnings, Wal mart is 40X.  I'll bet Amazon is far more undervalued than Wal mart with AWS.\n\nI'm not selling a god damned thing.  WF can say it's worth 180 it isn't.",
              "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lr09kfy/",
              "created": 1728425080,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lqyi7j8",
      "score": 5,
      "body": "Walmart competition argument is nonsense it was always there, amazon diluting shares too much that's the real problem.",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqyi7j8/",
      "created": 1728403724,
      "depth": 0,
      "replies": [
        {
          "id": "lqysilf",
          "score": 4,
          "body": "Plus walmarts online/app experience is utter garbage compared to AMZN.",
          "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqysilf/",
          "created": 1728407039,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqxh8iq",
      "score": 3,
      "body": "Imagine down grading a company by 25% \nOnly 1 analyst  (Ken gawrelski) has it as a downgrade and the others don’t. Who’s the outlier.. especially when you can make multiple billions in sales in a day… shouldn’t change the price. Buy the dip!",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqxh8iq/",
      "created": 1728390676,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqyee97",
      "score": 3,
      "body": "I bought the dip.\n\nI think Amazon's growth will skyrocket within a year, on the consumer side. We have had millions of non-english speaking immigrants come to the US recently. I would say that the majority of those people are Amazon customers.\n\nFirst of all, Amazon hires these people like crazy, unlike Walmart. That gets them, their families, and their friends into the Amazon ecosystem. That's millions of customers. \n\nWalmart is keeping up with Amazon and are doing great, but Amazon is still out pacing them. 10 years ago, when people thought of the US, the first store to come to mind was Walmart. Present day? It's mixed but probably Amazon.\n\nThen there is the election. I work at Amazon warehouse FYI, but we still so much election garbage that it's insane. That's extra sales this quarter that otherwise wouldn't be there, and it's a lot.\n\nThis is just strictly speaking on the warehouse side of Amazon, as that's why Wall Fargo downgraded.",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqyee97/",
      "created": 1728402496,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrlcxsw",
      "score": 3,
      "body": "No matter what they say, I have full faith in five companies:\n\nAmazon\n\nMSFT\n\nBerkshire\n\nNvidia\n\nCostco",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lrlcxsw/",
      "created": 1728753511,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqxjjj1",
      "score": 1,
      "body": "Wait till Amazon catches on to these other big ballers wanting to compete with them. They know competition is all over the place but I am sure they don't want anyone else even close to their level. Once the race becomes tight, I am sure they will upgrade their game x2 and continue leading the way. Amazon will always have something up their sleeve and will continue leading the way long-term. \n\n**Always bullish on Amazon and Bezos' leadership team.**",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqxjjj1/",
      "created": 1728391649,
      "depth": 0,
      "replies": [
        {
          "id": "lqy55j0",
          "score": 4,
          "body": "I'm really not sure. Jassy has been doing nothing but nonsense since he came in, and a LOT of high-skilled corporate workers are threatening to leave.",
          "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqy55j0/",
          "created": 1728399485,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqxbi56",
      "score": 1,
      "body": "Grateful for the dip. He came on cnbc if you’re curious for his reasoning.",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqxbi56/",
      "created": 1728388064,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqxhvnp",
      "score": 0,
      "body": "I find myself in disagreement with WFC again. Good.",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqxhvnp/",
      "created": 1728390954,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqy73cd",
      "score": 0,
      "body": "Yep, undervalued and when they do layoffs stock will climb higher 📈",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqy73cd/",
      "created": 1728400122,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqyd5ur",
      "score": 0,
      "body": "lol wmt right",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqyd5ur/",
      "created": 1728402098,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqx5ew2",
      "score": -11,
      "body": "Did Bezos fallen of the face of the planet? I haven't heard his name now in well over a year.",
      "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqx5ew2/",
      "created": 1728384908,
      "depth": 0,
      "replies": [
        {
          "id": "lqxqvb3",
          "score": 7,
          "body": "He’s not the CEO anymore and hasn’t been in a few years",
          "permalink": "/r/stocks/comments/1fyvb52/wells_fargo_downgrades_amazon_on_slowing_growth/lqxqvb3/",
          "created": 1728394533,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}