{
  "title": "Roblox: Inflated Key Metrics For Wall Street And A Pedophile Hellscape For Kids",
  "score": 205,
  "selftext": "[https://hindenburgresearch.com/roblox/](https://hindenburgresearch.com/roblox/)\n\nHindenburg just put out their latest short report, and it features none other than everyone's favorite ~~parenting substitute~~ child-oriented gaming platform Roblox. In a way the allegations are unsurprising to anyone that's been following this company, but this goes WAY more in depth than anything that has come out before.  \n  \nSummary bullet points from the beginning of the article:\n\n*  Roblox is a $27 billion online gaming platform headquartered in San Mateo, CA. The company was incorporated in 2004 and is led by founder and CEO David Baszucki.\n* The company has reported net losses every quarter since becoming a public company, with last twelve months (LTM) losses totaling $1.07 billion. Its stock trades at 8.6x sales, a 57% premium to gaming peers, pricing in expectations of rapid future growth and profitability.\n* Insiders have cashed out $1.7 billion in stock since the company’s 2021 direct listing. In the last 12 months, insiders have sold \\~$150 million in stock, including \\~$115 million by CEO Baszucki personally.\n* Since Roblox isn’t profitable, its stock price (and, in turn, insiders’ ability to dump hundreds of millions of dollars of stock) is reliant on the growth metrics it presents to Wall Street.\n* Our research indicates that Roblox is lying to investors, regulators, and advertisers about the number of “people” on its platform, inflating the key metric by 25-42%+. We also show how engagement hours, another key metric, is inflated by an estimated 100%+.\n* Since prior to going public, Roblox has reported the number of “people” on its platform in dozens of official investor communications. Among many examples, Roblox wrote in a 2022 quarterly report, “there are over 54.1 million **people** coming to Roblox every day”.\n* Our findings show that the company’s reported number of “people” regularly matches Roblox’s reported Daily Active Users (DAUs).\n* But DAUs, according to Roblox’s own disclosures, “are not a measure of unique individuals accessing Roblox” because they can include numerous accounts run by a single person, such as alternate or bot accounts.\n* Given these definitions, we believe Roblox intentionally conflates “people” with DAUs, consistently inflating the reported number of people on its platform.\n* In 2023, Roblox told the SEC it is “unable to identify if a user has multiple accounts”. The company’s response to the SEC appears to be a flat out lie.\n* Multiple former employees told us that Roblox does internally track single users with multiple accounts, referring to the process as ‘de-alting’.\n* Interviews reveal Roblox effectively has two sets of books for counting users: one for internal business decisions, in which multiple accounts are ‘de-alted’, and one used by the finance team that reports higher metrics to investors.\n* “If that number \\[DAUs\\] is not de-alted, I think the actual one would be like anywhere between 30 to 20 percent lower”, a former data scientist told us.\n* Roblox forums detail how users regularly have dozens of alternate accounts to “farm” for goods on Roblox, avert bans and increase their follower counts, among other reasons.\n* In addition to alternate accounts, bots are rampant on the platform. For example, Roblox’s 7^(th) most popular game, Adopt Me!, has garnered over 83,000 [Change.org](http://Change.org) signatures to remove it from the platform due to extensive “botting” that “breaks” Roblox.\n* Roblox’s 2^(nd) most visited game, Blox Fruits, was dominated by traffic from Vietnam, where we found numerous Facebook groups, including 5 with 50,000 to 117,000 members each, advertising and soliciting tools to run 20+ Roblox bot tabs at a time.\n* A former data scientist told us that activity in Vietnam “inflated a lot of our numbers. Like crazy, insane, in terms of engagement, DAU\\[s\\]”.\n* In addition to inflating the reported number of “people” on its platform, we also suspect Roblox massively inflates a second key metric, “engagement hours”. The company reported an extraordinary 2.4 average hours of engagement per day per user in 2023.\n* This level of engagement is 58% higher than the average time spent by U.S. 8-12 year olds playing all mobile games (including tablet), according to a 2021 survey, and 26%-166% more time than leading social media platforms such as YouTube, TikTok and Instagram.\n* To better understand the company’s reported engagement, we hired a technical consultant that monitored the top \\~7,200 Roblox games across \\~2.1 million Roblox servers, collecting 297.7 million rows of real-time player data.\n* The data suggests that Roblox could be massively overstating the true level of user engagement across its platform: our review of an average of 30.4 million unique daily users found they spent just \\~22 minutes in games per day.\n* Further analysis of play times showed numerous games in which obvious bot accounts remained in-game for more than 24 hours straight. Our representative sample flagged millions of ‘zombie’ engagement hours that can majorly skew Roblox’s reported “average” engagement.\n* Roblox incentivizes developers to create ‘AFK’ (Away From Keyboard) games that artificially inflate engagement by tying developer pay in part to engagement. Web forums detail developer strategies for creating features that encourage bots and zombie engagement.\n* We think Roblox can and should report its estimated de-alted and de-botted metrics so that investors, advertisers, and regulators can be better informed about the actual number of “people” on the platform, and their genuine level of engagement.\n* Beyond inflated key user metrics, our in-game research revealed an X-rated pedophile hellscape, exposing children to grooming, pornography, violent content and extremely abusive speech.\n* Roblox is compromising child safety in order to report growth to investors, per our interview with a former senior product designer: “If you’re limiting users’ engagement, it’s hurting your metrics…in a lot of cases, the leadership doesn’t want that.”\n* For the second quarter of 2024, in a push toward profitability, Roblox reported a 2% year-over-year decline in its trust and safety expenses.\n* Core to the problem is that Roblox’s social media features allow pedophiles to efficiently target hundreds of children, with no up-front screening to prevent them from joining the platform.\n* For example, in 2018, prior to Roblox going public, a 29-year-old was caught by police with 175 hours of video footage of him grooming and engaging in explicit behavior with 150 minors using online platforms, namely Roblox.\n* Media and non-profit exposés from 2020 to July 2024 revealed digital strip clubs, red light districts, sex parties and child predators lurking on Roblox. The National Center on Sexual Exploitation in 2024 labeled Roblox “a tool for sexual predators, a threat for childrens’ safety”.\n* Numerous criminal indictments from 2019-2024 allege that sexual predators groomed children in-game, ranging from 8-14 years old, then kidnapped, raped or traded sexual content with them.\n* Following years of scandals, we performed our own checks to see if the platform had cleaned up its act. As a test, we attempted to set up an account under the name ‘Jeffrey Epstein’…only to see the name was taken, along with 900+ variations.\n* Many were Jeffrey Epstein fan accounts, including “JeffEpsteinSupporter” which had earned multiple badges for spending time in kid’s games. Other Jeff Epstein accounts had the usernames “@igruum\\_minors” \\[I groom minors\\], and “@RavpeTinyK1dsJE” \\[rape tiny kids\\].\n* We attempted to set up a Roblox account under the name of another notorious pedophile to see if Roblox had any up-front pedophile screening: Earl Brian Bradley was indicted on 471 charges of molesting, raping and exploiting 103 children. The username was taken, along with multiple variants like earlbrianbradley69.\n* After we found a username, we listed our age as “under 13” to see if children are being exposed to adult content. By merely plugging ‘adult’ into the Roblox search bar, we found a group called “Adult Studios” with 3,334 members openly trading child pornography and soliciting sexual acts from minors.\n* We tracked some of the members of “Adult Studios” and easily found 38 Roblox groups – one with 103,000 members – openly soliciting sexual favors and trading child pornography.\n* The chatrooms trading in child pornography had no age restrictions. Roblox reports that 21% of its users are under the age of 9, a number that is likely underestimated given that Roblox has no age verification aside from users seeking 17+ experiences.\n* Registered as a child, we were also able to access games like “Escape to Epstein Island” and “Diddy Party”. We found over 600 “Diddy” games, including “Survive Diddy” and “Run From Diddy Simulator”.\n* Since September 2nd, 2024, third-party monitor ‘Moderation For Dummies’ has reported \\~12,400 erotic roleplay accounts on Roblox. These include everything from “rape/forceful sex fetishes” to underage users “willing to do anything for Robux”.\n* Users seeking sexual experiences on Roblox are so pervasive that there are thousands of Roblox sex videos on porn sites, inviting users of unknown ages to make explicit content on the platform.\n* We tested out Roblox’s experiences to see what else kids were being exposed to. We quickly encountered images of male genitalia and hate speech in Roblox’s “school simulator” game, which had registered 28.9 million visits with no age restrictions.\n* Despite the company’s mission “to connect a billion users with optimism and civility”, we found games such as “Beat Up Homeless Outside 7/11 Simulator”, which had 1 million visits and 15,000 favorites before being removed from Roblox.\n* Nonetheless, Roblox users identifying as 9 years old and up can still beat up homeless people in “Beat Up People Outside of 7/11” with over 900,000 visits.\n* In the game “Beat Up The Pregnant”, users hacked pregnant women to death in a Wal-Mart parking lot with machetes or killed them with frying pans or a selection of guns.\n* We played “\\[GUNS\\] Work at a Hospital” where users can go on a hospital shooting rampage. The game has \\~1.6 million visits and remains on the platform with no age restrictions. The game’s thumbnail is a picture of a terrified pregnant woman.\n* “LGBTQ+ Vibes” is a game available to all ages that has accumulated over 40.6 million visits and over 224,000 favorites. Users regularly described lewd sex acts while others used hateful slurs.\n* “Palestine And Israel Hangout” allows kids of all ages to purchase bombs and knives and attack each other. This game has \\~13 million visits and \\~7,200 favorites and remains on the platform.\n* Posing as a child in Roblox’s “therapy” experience, our therapist introduced himself as a “rapper with only one p”. We were advised to run away from home and that he would come pick us up so we could move into his basement in exchange for paying rent with our body.\n* Some games seem to encourage illicit interactions, like “Public Bathroom Simulator Vibe” and “XYZ Club Vibe” with 31 million collective visits. Both are available to users who self-identify as 9+ years old, who can simulate sex in bathrooms wearing skimpy outfits.\n* Other Roblox users have identified issues of simulated rape, naked users, and rampant in-game sexual harassment.\n* Despite Roblox’s claims of “best in the world” content moderation, our interviews with moderators show safety was largely outsourced to Asian call centers. Moderators described being paid $12 a day to review countless instances of child grooming and bullying with a limited ability to keep perpetrators off the platform permanently.\n* Compounding all of the above issues, Roblox faces saturation in its top markets like the U.S. and Europe. It is now attempting to keep the appearance of growth alive by adding loss-generating users in markets like Asia, per a former employee. Profitability has plummeted despite reporting higher user metrics.\n* The conversion rate of new daily active users to paying users has been in steady decline since 2020. Roblox is now hoping to drive incremental growth by pitching advertisers that \\~79.5 million “people” spend an average of 2.4 hours per day on the platform.\n* As noted earlier, we suspect these metrics are wildly inflated and that the platform poses major reputational risks for advertisers. For instance, we found Instagram ads in the same school simulator game with Nazi hate speech and photos of male genitalia.\n* Overall, we think Roblox has adopted the Silicon Valley approach of ‘growth at all costs’, whether by misleading or outright lying to investors about its key metrics or by opening its platform to dangerous predators and illicit content unsuitable for children.",
  "link_flair_text": "Company News",
  "id": "1fz4zma",
  "num_comments": 45,
  "created_utc": 1728407375,
  "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/",
  "comments": [
    {
      "id": "lqz1jbh",
      "score": 107,
      "body": "Wow. I had no doubt it was overvalued, and I knew it could be a place for predators, but sweet Jesus Christ \"pedophile hellscape\" somehow doesn't do the problem enough justice. (As in is too light a description*.)",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqz1jbh/",
      "created": 1728410029,
      "depth": 0,
      "replies": [
        {
          "id": "lqz4733",
          "score": 38,
          "body": "Funny thing is that the fraudulent numbers will be the part that the market will actually focus on and punish the stock price for. The pedo stuff is icing on the cake, but that's been known for a while and I don't doubt they would look the other way if the company was actually making money...",
          "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqz4733/",
          "created": 1728410907,
          "depth": 1,
          "replies": [
            {
              "id": "lqz4y46",
              "score": 13,
              "body": "Unfortunately you're definitely right market wise. Here's hoping law enforcement sees the report and looks into things.",
              "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqz4y46/",
              "created": 1728411158,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr0t22z",
              "score": 9,
              "body": "I use to work with vulnerable children, if they wanted to play roblox... regardless of their age, we had to watch over their shoulder, it is a cess pool.  This was in 2016, so ya the market doesn't care.",
              "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr0t22z/",
              "created": 1728433212,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lqzury3",
              "score": 2,
              "body": "Pedo icing leaves a sour taste in my mouth.",
              "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqzury3/",
              "created": 1728419812,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr3b9i6",
              "score": 1,
              "body": "No effect on pricing. Stock is even up today",
              "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr3b9i6/",
              "created": 1728482232,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lr214b1",
          "score": 2,
          "body": "I wonder what happened? I played it for a while in the late 2000s and never encountered any creeps or inappropriate games. They really ramped up the monetization of the platform sometime after that with outside advertisements, I thought they would have kept it clean to keep advertisers happy. Like how naughty words can get a youtube video demonitized, but now that I bring up youtube I'm reminded of how much weird shit they recommend to kids (\"elsagate\").\n\nAlso how in the world are they not profitable? They run servers and let kids do the labor of making the games for free.",
          "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr214b1/",
          "created": 1728456096,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqyzb47",
      "score": 35,
      "body": "And yet Roblox shot up when market opened",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqyzb47/",
      "created": 1728409296,
      "depth": 0,
      "replies": [
        {
          "id": "lqz0a3e",
          "score": 20,
          "body": "Likely because most people already knew the company is involved in some shady business, and this is just another confirmation of that. Unfortunately anyone still invested in it probably doesn't care and sees this as a buying opportunity.\n\nHow much longer can they go on before there are actual consequences? It's anyone's guess... maybe this report ends up being the wakeup call.",
          "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqz0a3e/",
          "created": 1728409617,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqzy7am",
          "score": 15,
          "body": "In my experience watching stocks like Trump’s company after bad news, as well as other Hindenburg shorts(I’m subbed to their emails) these things take time.  Weeks sometimes. \n\nFirst, you get the algos and other short term traders who are more interested in momentum and volume. Catching “dead cat bounces” etc. They had stops set ahead of time to purchase if the price fell below a certain dollar. \n\nOther long term buyers might disregard the report and see opportunities to buy and hold as it falls, thinking it will come out of this a stronger company. Btfd \n\nBig institutional sellers can not sell large amounts of a company quickly without losing a significant amount of the value. So if this short report does scare someone with a lot of shares, they will likely exit over the course of the whole month.",
          "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqzy7am/",
          "created": 1728420963,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqz9nar",
          "score": 3,
          "body": "It has massive potential. But, unfortunately, likely has a terrible culture. With the right people in charge it could become a household brand for years to come. Unfortunately they may be doing the opposite, and un reparably hurting the brand",
          "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqz9nar/",
          "created": 1728412745,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr0rxpr",
      "score": 13,
      "body": "Ive read  a few Hindenburg reports, but this one seems the most damning, with further societal implications running rampant.\n\n\nI wouldnt be shocked to find out some of the board are keeping this place afloat due to the child exploitation angle. Theres no way they cant know how toxic it is, and knowing that, why would none speak up, considering the game is primarily targeted at children. ",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr0rxpr/",
      "created": 1728432729,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr0v3dk",
      "score": 16,
      "body": "I hate Roblox so much. It was the one game I refused to let my kids play, and many of your bullet points do a great job illustrating why. \n\nCan’t wait to see this predatory company go tits up.",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr0v3dk/",
      "created": 1728434108,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqzeo16",
      "score": 8,
      "body": "I remember in late 2021 this was trading at a higher marketcap to Activision/Blizzard (pre-MSFT buy out), seemed insane then, no idea about the current valuation but I'm surprised they are still negative EPS after all this time, probably needs some major employee bloat reduction.",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqzeo16/",
      "created": 1728414417,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr17y7y",
      "score": 2,
      "body": "So calls",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr17y7y/",
      "created": 1728439809,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr2x25v",
      "score": 3,
      "body": "How can they not be profitable? As far as I understand their business model, Roblox itself is just a rather shitty platform/launcher with some dev tools to create your own game, which you can then publish on the platform for others to play. So the content is user created and doesn't cost them a thing, other than maintaining the launcher and dev tools.\n\nClearly it's not going to moderators either, considering it gets dubbed as pedophile heaven. Where's all the money going?",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr2x25v/",
      "created": 1728476534,
      "depth": 0,
      "replies": [
        {
          "id": "lrdhuxs",
          "score": 2,
          "body": "[RND mainly](https://www.matthewball.co/all/roblox2024), but because of their model they need to payout developers etc. for content. What's really sus though is that if the DAU manipulation is true:\n\n> So to achieve overall profitability, Roblox needs to either increase its average bookings per DAU from $13 to at least $18 or achieve a level of revenue scale such that all fees other than developer payouts (currently $3.38 per $13) are effectively halved. In practice, both pushes will likely be needed; fortunately, there are a few mechanisms for each.\n\n\"path to profitibility\" might be rather difficult",
          "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lrdhuxs/",
          "created": 1728627368,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqzy7rc",
      "score": 3,
      "body": "I have actually considered working there, but their suspicious balance sheet (like OP stated) gave me pause. \n\n\nI can't speak for the other allegations.",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqzy7rc/",
      "created": 1728420968,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr17sym",
      "score": 2,
      "body": "I haven't read the Hin. Report yet but when I listened  to an NPR report on Roblox over a year ago, it convinced me they were not controlling pedophiles enough and I sold my stock.",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr17sym/",
      "created": 1728439745,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqz2ntv",
      "score": 1,
      "body": "Definitely a pedophilic hellscape \n\nBut so is Meta Instagram and Reels",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqz2ntv/",
      "created": 1728410398,
      "depth": 0,
      "replies": [
        {
          "id": "lqza7jb",
          "score": 30,
          "body": "Those don’t specifically cater to kids. Roblox preaches the moderating measures they take to keep kids safe.",
          "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqza7jb/",
          "created": 1728412931,
          "depth": 1,
          "replies": [
            {
              "id": "lr0nene",
              "score": -1,
              "body": "there’s weird stuff on youtube for kids too. they turn off comments i think. That’s the issue with gaming because you can’t have multiplayer without chat, and there’s nothing to stop kids from using third party chat apps. The only way to protect kids is to completely shut off the internet for kids. I heard strange things being the first generation of kids with internet in their room, but on the plus side I had to learn independence on my own what to avoid. \n\nSocial media apps are getting kids addicted to digital alerts and casino-like flashes. Everyone is targeting kids for more money. Not sure why you think the burden of raising children is the job of roblox. \n\nnot specific to your comment, Am I the only one who read all those “scary” points and thought yea, that’s just 12 year olds trying to be edgy. Also, nobody is slinging CP except for feds, has nobody figured that out yet. ",
              "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr0nene/",
              "created": 1728430787,
              "depth": 2,
              "replies": [
                {
                  "id": "lr0w0ar",
                  "score": 5,
                  "body": "Even if you boil it down to \"kids being kids\" it's still a massive failure on the company to let the lack of moderation get out of control like this. When you own what is effectively a massive social network for children you have to spend incredible amounts of resources to keep things clean. Otherwise there is a point where parents and advertisers are simply going to say no more, and those are the people who actually pay your bills...",
                  "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr0w0ar/",
                  "created": 1728434509,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr5uy11",
                      "score": 1,
                      "body": "If there’s pedos that’s law enforcements job not roblox. I totally disagree with any censorship or moderation, it never ends well, where do you stop pulling the strings once you start. ",
                      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr5uy11/",
                      "created": 1728512047,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lr5l7mq",
                  "score": 1,
                  "body": "> That’s the issue with gaming because you can’t have multiplayer without chat, and there’s nothing to stop kids from using third party chat apps. \n\nThere actually is something that keeps kids from using third party apps, it’s called parenting/monitoring your kids computer/app usage. Sounds like you’re just making up a “whataboutism” though so I’ll move on…\n\n\n> The only way to protect kids is to completely shut off the internet for kids.\n\nNot really, again, see how other online kid games just don’t have the chat features or at least allow you to shut it off if it is system based chat(eg making it so randoms can’t message them through psn) \n\n> Social media apps are getting kids addicted to digital alerts and casino-like flashes. Everyone is targeting kids for more money. Not sure why you think the burden of raising children is the job of roblox. \n\nNot every kid has social media apps or unfettered access to all of this stuff. I’m not sure why you assume I’m thinking the burden of raising kids is their job. The fact of the matter is when you make a product for primarily kids, you take on the responsibility to make it safe. Adding social features meant they took on that moderation responsibility. If they can’t handle that then parents will just stop allowing their kids to play it. \n\n> Also, nobody is slinging CP except for feds, has nobody figured that out yet. \n\nUnfortunately that’s just not true. A couple of dudes in my city run a website/tiktok/IG where they bust predators Chris Hanson style and it’s surprisingly common. You sound very Q conspiracy theorist about it though so you’re gonna think your crazy thoughts. Gl",
                  "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr5l7mq/",
                  "created": 1728508732,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr5w0v2",
                      "score": 2,
                      "body": "I didn’t read up on the specifics but if they say they make an effort to protect kids then it’s probably true. If predators flock to a popular game, that’s not the fault of the game. \n\nEven if you make parental controls lock down friend messaging, they will just make fake accounts to circumvent their parents. \n\nAccess is unfettered. It always has been. \n\nYou only have reinforced my point about honeypots. Republicans have just as many honeypots, nice try trying to group me in with a debunked idea. ",
                      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr5w0v2/",
                      "created": 1728512444,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lr09afi",
          "score": 4,
          "body": "and reddit for that matter",
          "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr09afi/",
          "created": 1728424969,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lr0ihuw",
          "score": 2,
          "body": "waiting for their short report",
          "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr0ihuw/",
          "created": 1728428701,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr0poin",
      "score": 4,
      "body": "So, if they took content moderation and child protection seriously then whatever remaining meaningful engagement dies out. The hollow shell that remains consists of bot farms, gold/robux sellers and botting whales.\n\nThis platform needs to die with fines, lawsuits and jail time for the owners.",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr0poin/",
      "created": 1728431756,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr5dxlj",
      "score": 1,
      "body": "ok, now rblx can finally climb to 50 .",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr5dxlj/",
      "created": 1728506371,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr7xk2x",
      "score": 1,
      "body": "I love video games and looked into Roblox about 3 years ago because my kids said “everyone at school plays it”. It took me about an hour to conclude that Roblox is banned in our house (and to be clear, my kids get plenty of video gaming time). But I would have been very nervous shorting it because it is insanely popular among the kids at school.",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr7xk2x/",
      "created": 1728545992,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr0jrad",
      "score": 1,
      "body": "accurate",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr0jrad/",
      "created": 1728429233,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr0nt1z",
      "score": 1,
      "body": "Took them long enough.",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr0nt1z/",
      "created": 1728430959,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr0whai",
      "score": 1,
      "body": "Very old news ",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr0whai/",
      "created": 1728434716,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr1a4f0",
      "score": 0,
      "body": "\"Survive Diddy\" and \"Run from Diddy\" sound fun ngl",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr1a4f0/",
      "created": 1728440770,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqzikkh",
      "score": -3,
      "body": "Wouldn't this go for any platforms that kids play games on? Why single out roblox?  And what about parental supervision?",
      "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqzikkh/",
      "created": 1728415731,
      "depth": 0,
      "replies": [
        {
          "id": "lqznwr9",
          "score": 10,
          "body": "The number of safeguards on Roblox is much lower due to its customizability. In other games you can be reasonably sure your child isn't going to see anything worse than some inappropriate messages in chat. On Roblox you can literally create anything and once you have that all bets are off.\n\nIt's one thing if the company is doing all it can to prevent the worst offenses, but according to their latest earnings report they've actually been diverting resources away from this area. Doesn't look like a company that's taking the problem seriously at all.",
          "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqznwr9/",
          "created": 1728417519,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqzne3p",
          "score": -4,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqzne3p/",
          "created": 1728417348,
          "depth": 1,
          "replies": [
            {
              "id": "lqznnab",
              "score": 1,
              "body": "[removed]",
              "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lqznnab/",
              "created": 1728417432,
              "depth": 2,
              "replies": [
                {
                  "id": "lr00pbu",
                  "score": 5,
                  "body": "It can but most other games that cater to a wide age range have very strict age restrictions/safeguards for players. For example, just not having the chat/social features in the first place. \n\nLike the report explains, there’s also the whole part where your kid just enters a world that shouldn’t be allowed for their age or really for anyone in general. Their biggest competitor, Minecraft, wouldn’t even have the capability to allow a world with pictures of penises in it or an Epstein rape island",
                  "permalink": "/r/stocks/comments/1fz4zma/roblox_inflated_key_metrics_for_wall_street_and_a/lr00pbu/",
                  "created": 1728421826,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}