{
  "title": "Homeowners hate this one simple trick after hurricanes!",
  "score": 159,
  "selftext": "",
  "link_flair_text": "Meme",
  "id": "1fza1up",
  "num_comments": 48,
  "created_utc": 1728420105,
  "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/",
  "url_overridden_by_dest": "https://i.redd.it/rdb4jmzcgltd1.png",
  "comments": [
    {
      "id": "lqzvoei",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 230 | **Previous Best DD** | \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzvoei/",
      "created": 1728420112,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqzxzcy",
      "score": 53,
      "body": "Unfortunately, in December 2023, Florida’s legislature, in a persistent effort to protect the insurers, removed any entitlement to attorneys fees in litigating against insurance carriers.\n\nMeaning, if you’re an insured and your insurer doesn’t pay on a claim, eg a property insurance claim, but also other types of policies, then EVEN IF you win, and prove they breached the policy, there is no right to recover your lawyer’s fees in litigating that dispute.\n\nIt had been the case that insurers who denied legitimate claims, then lost in litigation, were required to pay both the amount of the claim, and the insured’s lawyer fees in litigating that dispute.\n\nWhy does that matter?\n\nIt used to be, insurance lawyers would sue insurance companies, and would have a contingent fee relationship with their client, the insured. So, the lawyer only wins when the insured wins. \n\nNow, however, it’s not viable for a lawyer to litigate property insure be disputes, premised upon denied coverage for claims.\n\nHurricanes, typically, would be a covered loss under most policies.\n\nNow, they can deny your claim, tell you to pound sand. \n\nIf you want, you can sue them still, but that lawyer is going to want $450 an hour for 2 years worth of litigation.\n\nThat doesn’t make sense for an insured who just lost their house.\n\nSo, these insurance companies will deny everyone’s claims because they know there isn’t a sufficient incentive for a lawyer to litigate these cases.",
      "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzxzcy/",
      "created": 1728420888,
      "depth": 0,
      "replies": [
        {
          "id": "lqzz7ir",
          "score": 23,
          "body": "I didn’t know Boeing was in the insurance game",
          "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzz7ir/",
          "created": 1728421304,
          "depth": 1,
          "replies": [
            {
              "id": "lqzzmag",
              "score": 10,
              "body": "🌎 👨‍🚀🔫 👨‍🚀🌕",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzzmag/",
              "created": 1728421449,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lqzzbee",
          "score": 5,
          "body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4275)",
          "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzzbee/",
          "created": 1728421343,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqzzejc",
          "score": 8,
          "body": "Your comment is mostly accurate, and raises good points. Theres a couple things that might have been overlooked though:\n\n1. That legislation was passed in Dec 2022, not 2023\n\n2. You suggest insurers will now deny claims knowing that litigation is unaffordable for many. While this could be an outcome, it’s more speculative. The intent behind the law, as described by lawmakers, was to reduce frivolous lawsuits and bring stability to Florida’s troubled insurance market. \n\nIf insurers were to do that, there’d be lawyers frothing at the mouth for all the Bad Faith claims they’d win. Not to mention insurers are still heavily regulated by the Florida Office of Insurance Regulation (OIR), which monitors claim-handling practices.",
          "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzzejc/",
          "created": 1728421373,
          "depth": 1,
          "replies": [
            {
              "id": "lr01611",
              "score": 9,
              "body": ">The intent behind the law, as described by lawmakers, was to reduce frivolous lawsuits and bring stability to Florida’s troubled insurance market.\n\nHow would that reduce frivolous lawsuits?  The insurance companies weren't forced to pay attorneys fees for the opposing party in a frivolous lawsuit, also most lawyers aren't going to take up a frivolous lawsuit on contingency, because they're probably going to lose and not get paid.",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr01611/",
              "created": 1728421991,
              "depth": 2,
              "replies": [
                {
                  "id": "lr03mki",
                  "score": 1,
                  "body": "They got rid of the one-way attorney’s fees rule to cut down on lawsuits overall. The idea is that without guaranteed lawyer fees if you win, fewer people will sue over smaller or questionable claims. Lawyers are less likely to take those cases without a good shot at winning big, so it discourages people from filing weaker lawsuits.",
                  "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr03mki/",
                  "created": 1728422865,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr07o5t",
                      "score": 5,
                      "body": "There never was a 1 way fee rule tho. \n\nOr at least one I’ve ever seen enforced in any setting\n\nIf one side has the right to recover prevailing party fees, and they lose, the other side will be entitled to fees.\n\nI’m sure I can find a case on it, it’s certainly never the expectation that you’d have a 1 way fee right. Both sides are subject to a fee award",
                      "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr07o5t/",
                      "created": 1728424348,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr00opf",
              "score": 12,
              "body": "“Heavily regulated”. I can’t stop laughing. Good one.",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr00opf/",
              "created": 1728421820,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr07a0z",
              "score": 2,
              "body": "You’re right, it is December 2022, not 2023. My mistake.\n\nAnd insofar as you seem informed, I’d propose a solution to your assertion.\n\nAnd this is deep in the legal weeds.\n\nBefore the complete abolishment of attorney fees in insurance litigation, *in December of 2022*, the Florida legislature actually had a prior amendment to the fee statute, in July of 2022, that was a great idea.\n\nThey just didn’t keep it.\n\nGoogle:  Fla. Stat. 627.70152(8)(2022).\n\nIt didn’t last, it was only in effect for 6 months, before fees were removed. \n\nBut, that framework was actually very reasonable and clever. I’ll briefly summarize, but you’d have to pull the statute for specifics: \n\nThe statute required:\n\nBefore filing suit against its insurer, an insured was required to send a pre suit notice and demand letter, where basically they would set forth an itemized breakdown as to the amount owed under the policy.  The plaintiff / insured was required to also provide supporting documents/invoices, etc.\n\nThe demand letter *required the plaintiff insured to demand a specific amount of money, inclusive of attorney fees.*\n\nWhy’s that matter?\n\nThe statute said that, IF, they end up in litigation, the plaintiff / insured ONLY wins attorneys fees depending on HOW CLOSE their judgment was, versus the presuit demand.\n\nIt was a sliding scale system.\n\nSo, basically, if I demanded $100,000 in my presuit demand, then won, and showed $100k in damages,  then I’m going to get my full attorneys fees.\n\nIf I only won, say, $50k, then I’m gonna get 50% of my claimed attorneys fees. And so on.\n\nIt’s all broken down by percentage in the statute referenced above.\n\nThat was a perfect solution bc it required plaintiff lawyers to be very reasonable in their presuit demand, otherwise they’ll never get their fees. \n\nBut it still kept insurers honest with the potentiality for fees.\n\nWithout a right to recover fees against insurers, there’s very little appetite for plaintiff lawyers to sue insurers, unless the damages are some enough that the client can afford/justify paying the lawyer hourly.",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr07a0z/",
              "created": 1728424199,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lr0363l",
          "score": 1,
          "body": "[removed]",
          "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr0363l/",
          "created": 1728422700,
          "depth": 1,
          "replies": [
            {
              "id": "lr03b4o",
              "score": 3,
              "body": "This sounds like a robot response.\n\nHow do you advocate?\n\nGo vote. \n\nWhich candidate? Probably not the ones in office who have put these laws into effect.",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr03b4o/",
              "created": 1728422750,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr05pwq",
              "score": 1,
              "body": "How do we advocate to fix a broken system?",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr05pwq/",
              "created": 1728423620,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lr03pv8",
          "score": 1,
          "body": "What about the attorneys who send “loss consultants” to an inspections purposely with zero knowledge and trained to not say anything to the insurance adjuster, while also purposely pushing inspections back to milk the clock. \n\nOr the attorneys that are in bed with PAs that would have the PA open bogus denial claims because the attorney was still racking up large fees. Insured gets a nuisance fee after 1-2 years while the attorney makes 30k. \n\nLet’s not even mention their 100k+ estimates for a bathroom leak damaging 2-3 rooms. \n\nStop trying to scare people, an insurance company won’t deny your claim after a hurricane just because they feel like telling you to pound sand. They will deny your claim for not having hurricane coverage. Flood will also be denied if you don’t have flood coverage. \n\nStop trying to make it seem like the insurance companies are out to screw everyone. \n\nI think the system is broken. Every appraisal/umpire work is broken.",
          "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr03pv8/",
          "created": 1728422898,
          "depth": 1,
          "replies": [
            {
              "id": "lr08y53",
              "score": 2,
              "body": "Ok firstly, the PAs are doing their own thing, they have their own % they’re winning based on their contact with the insured, it has no effect on the lawyer fees. \n\nThe PAs job is done when the claim is denied or the lawsuit starts.\n\nI don’t know why you’re suggesting a PA would “delay inspections” to “push back the clock”\n\nThat’s the last thing they want done.\n\nIf you’re in litigation and you didn’t give timely access to the property after the loss, or don’t give docs, or don’t sit for an exam under oath, etc., they’re going to deny your claim.\n\nThe litigation will be shit for the plaintiff bc there’s ample policy exclusions for failing to comply with policy requirements, such as giving timely access.\n\nMeaning, “waiting out the clock” is a terrible strategy. It will result in your claim being denied, and will result in you losing your lawsuit.\n\nAnd for all this shit about PAs exaggerating the loss, I would love to see an insurer actually prepare an estimate for the loss.\n\nThey don’t do anything. I’ve seen ppl go without running water for months while they dragged ass trying to get an adjuster out.\n\nI’ve personally watched insurers “adjust a claim” for 2 years, and on the day we filed suit, they spammed out a denial letter.\n\nI watched an insurer deny a $25k claim stemming from a pipe break, then spend 2 years fighting it tooth and nail, only to pay that $25k, and then 10x that in attorneys fees.\n\nThey aren’t / weren’t making rational choices; not all insurers, but many.  \n\nOf course, I’m not saying all plaintiff and insurers are legit, of course not; but they still have to prove up their damages in court, so phantom damages aren’t gonna work. Fraud will be ferreted out.",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr08y53/",
              "created": 1728424836,
              "depth": 2,
              "replies": [
                {
                  "id": "lr43x35",
                  "score": 1,
                  "body": "You clearly haven’t seen a PA get a kick back from an attorney for those denial claims. Thank god AOB are gone. \n\nThe PA job is not done when the claim is denied. Ive seen a PA reopen a claim and get it paid. \n\nI’m not suggesting a PA would delay an inspection on purpose but I have seen it done. No PA is busy enough to need to have their first available inspection 1-2 months out. A non license loss consultant is who is sent out by the attorney and they are 100% clueless and trained by the attorney to not say anything. \n\nYou should be able to give timely access to inspect a loss if you’re the one opening the claim. Don’t open a claim and then ask for an inspection 2 months out. Your claim isn’t also “denied” by waiting 2 months, chances are you filed a sketchy claim and pushed the inspect date out far on purpose. \n\nMost PA I see exaggerate their estimate. How can you say the all ceiling, wall and flooring need to be replaced because of a tiny stain on the ceiling? Let me ask you, would you pay that 100k estimate if the damage was in your house? Best part is most PA I see don’t even write their own estimate because they claim “I’m too busy to prepare the estimate” so how can you defend an estimate you didn’t prepare? Yet a carrier adjuster doesn’t have their own scheduler like the PA, and is also doing a photo report, sketch, estimate, collecting and reviewing invoices, prior losses, reviewing the bogus PA estimate, and closing the file.\n\nUnfortunately some insureds get screwed. Claim volume can insanely high during a CAT deployment and we’re short staffed. Some carriers screw their clients and those are obvious. You also can have a new desk adjuster and they interpret the policy wrong. Shit does happen.",
                  "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr43x35/",
                  "created": 1728491710,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lr065kx",
              "score": 1,
              "body": "You don't think the insurance might have just bitten off more than they can chew? ![img](emote|t5_2th52|8883)",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr065kx/",
              "created": 1728423779,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lqzw8wl",
      "score": 32,
      "body": "More than half of Floridians are on the state plan called Citizens since almost all the private  insurance companies left town. The  big battle will be with the state this time around.",
      "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzw8wl/",
      "created": 1728420304,
      "depth": 0,
      "replies": [
        {
          "id": "lqzwi9p",
          "score": 14,
          "body": "Lmao I am on Citizens, I didn't know that was a state plan. I guess that makes it a little more secure?",
          "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzwi9p/",
          "created": 1728420392,
          "depth": 1,
          "replies": [
            {
              "id": "lqzz5ov",
              "score": 34,
              "body": "Buddy that means ron desantis is in charge of your insurance.  You are turbo fucked.",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzz5ov/",
              "created": 1728421287,
              "depth": 2,
              "replies": [
                {
                  "id": "lr012cq",
                  "score": 11,
                  "body": "![img](emote|t5_2th52|4260)",
                  "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr012cq/",
                  "created": 1728421955,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lr08cut",
                  "score": -1,
                  "body": "Turn your brain on bud. Assuming Ron desantis was even remotely in control of the insurance payouts, don't you think the guy who's entire career relies on public opinion would... Rule in favor of the public?",
                  "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr08cut/",
                  "created": 1728424608,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr0c0rw",
                      "score": 0,
                      "body": "Dont you think if his state was getting hit by back to back natural disasters and he cared about his constitutes he would pick up the phone when the president or vice president calls to coordinate relief efforts?  Maybe he'll think helping people will help him politically, or maybe he'll think denying them and blaming democrats will help him politically more, or maybe he'll just do whatever he thinks will get him more campaign contributions.  I dont know what he'll do, but i guarantee one thing that wont factor into his decision at all is actually helping citizens.",
                      "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr0c0rw/",
                      "created": 1728426045,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr0d6f6",
                          "score": -1,
                          "body": "Hello RepostBot, \n\nHe just got off the phone w Biden yesterday. Maybe you should think before you speak",
                          "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr0d6f6/",
                          "created": 1728426514,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lr0e43m",
                              "score": 0,
                              "body": "Wow so he initially refused the call because he thought it would play out well with his base then when he got called out in the national media and realized it was hurting him he backtracked and took the call? You see how that just proves my point?  Its all a poIitical calculation with him.",
                              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr0e43m/",
                              "created": 1728426895,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lr159r2",
                                  "score": 0,
                                  "body": "Right. Which is my original point. It's in his interests to pay off his constituents. I knew this app was filled with commie bots but goddamn are y'all stupid",
                                  "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr159r2/",
                                  "created": 1728438632,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lt6kv2z",
                                      "score": 1,
                                      "body": "https://www.newsweek.com/florida-largest-insurer-denies-hurricane-debby-claims-1972227\n\n\n\n\nWow, look at that.  Youre a moron",
                                      "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lt6kv2z/",
                                      "created": 1729609507,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lqzyh0t",
              "score": 8,
              "body": "Citizens is actually one of the better insurers in the state in terms of paying on covered losses.\n\nNever ever ever have insurance with Universal Property and Casualty.\n\nThey’re the worst, but there’s some other bad ones.\n\nUniversal denies almost every claim, irrespective of the facts and the loss.  I’ve seen them commit fraud in litigation. Bury documents. Lie under oath. Get caught, have their lawyers sanctioned, then beg for a settlement to just bury the issue.\n\nTotal scumbags",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzyh0t/",
              "created": 1728421055,
              "depth": 2,
              "replies": [
                {
                  "id": "lqzzb3u",
                  "score": 6,
                  "body": "[deleted]",
                  "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzzb3u/",
                  "created": 1728421340,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr00upu",
                      "score": 3,
                      "body": "Indeed you’re correct and that’s probably why they’re the most legitimate.\n\nAnd ya, I’m not sure what solution there is tbh.\n\nWe both live in Florida, presumably. You know the deal here.\n\nI once saw that the elevation above sea level in Orlando was like ‘75 feet.\n\nThink ab that for a second.\n\nThat’s the damn middle of the state, maybe not the high point, but the damn middle.\n\nThis entire southern part of the state is a fuckin swamp we paved over and built condos on top of\n\nShort of some elaborate levy system, or walls, I don’t know what solution there really is.\n\nYes, climate change is a huge factor, but it’s just the physical reality that there’s gonna be canes, there’s gonna be massive flooding bc we live on a floating jungle.\n\nIt may be best to have the state go all in on insurance, like citizens … rates will still be high AF, but it’s better than dealing with these private insurers who collect premiums and deny all claims",
                      "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr00upu/",
                      "created": 1728421879,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lr00759",
                  "score": 1,
                  "body": "🔴",
                  "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr00759/",
                  "created": 1728421652,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lqzx3wp",
              "score": 12,
              "body": "Supposedly we’ll find out lol",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzx3wp/",
              "created": 1728420594,
              "depth": 2,
              "replies": [
                {
                  "id": "lqzz437",
                  "score": 2,
                  "body": "![img](emote|t5_2th52|4640)![img](emote|t5_2th52|4275)",
                  "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzz437/",
                  "created": 1728421271,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lqzx8gy",
                  "score": 3,
                  "body": "![img](emote|t5_2th52|4258)",
                  "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzx8gy/",
                  "created": 1728420638,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lqzyyt9",
              "score": 3,
              "body": "I wouldn't trust Desantis for shit.",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzyyt9/",
              "created": 1728421221,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr02teb",
              "score": 2,
              "body": "It means they aren't leaving town, but it could definitely mean problems since most state funded insurers are underfunded. I'm in Louisiana so not familiar with the state-run policies in Florida, but the ones here suck compared to what you can get from regular insurers. So you may also be in a position where the coverage that is there simply isn't very good.",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr02teb/",
              "created": 1728422574,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lqzy0uf",
              "score": 3,
              "body": "The only thing secure is the rate increases you are about to get railed by.  State insurance will be making a lot of special levy events as Helene and Milton will clean out the accounts.  You gonna have a bad time.",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzy0uf/",
              "created": 1728420903,
              "depth": 2,
              "replies": [
                {
                  "id": "lqzyv3v",
                  "score": 3,
                  "body": "And you can't even opt out because it's required for the mortgage! ![img](emote|t5_2th52|4271) You will pay whatever they tell you to or lose your house ![img](emote|t5_2th52|4271)",
                  "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzyv3v/",
                  "created": 1728421187,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lqzz3pc",
              "score": 2,
              "body": "Ron is gonna make the mouse pay! Yeah!",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzz3pc/",
              "created": 1728421268,
              "depth": 2,
              "replies": [
                {
                  "id": "lr00huv",
                  "score": 1,
                  "body": "I wonder if Disney gets a tax credit for offering their buildings as hurricane shelters or if they do it out the goodness of their cold dead hearts 🤔",
                  "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr00huv/",
                  "created": 1728421755,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lqzzic1",
          "score": 4,
          "body": "Anyone who tries to make a claim to Citizens is going to get a pudding smeared letter from Ron Desantis that reads “stop being woke”",
          "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzzic1/",
          "created": 1728421410,
          "depth": 1,
          "replies": [
            {
              "id": "lr00qf5",
              "score": 1,
              "body": "Very interesting. This is not going to go well.",
              "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr00qf5/",
              "created": 1728421837,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lqzzg6l",
      "score": 3,
      "body": "Insurance companies have their own insurance policies with reinsurance companies to mitigate bankruptcy risk. If the storm damage exceeds a certain amount the reinsurance policy will cover most of the rest.",
      "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lqzzg6l/",
      "created": 1728421389,
      "depth": 0,
      "replies": [
        {
          "id": "lr00m7l",
          "score": 0,
          "body": "How is that working out in North Carolina?",
          "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr00m7l/",
          "created": 1728421796,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr06mx6",
      "score": 2,
      "body": "Most of what you said is accurate to a point.  First off Florida has the highest rate of insurance fraud in the US.  Did the pendulum swing too far to the other side, very possible.  But to Florida’s slight credit they were trying to cut down on all the fraud that drives up rates.   \n\nSecondly, and just as important, because of all the insurance fraud that goes on in Florida and because of the huge claims year after year, many insurance providers have left the state.  A problem CA is having to a slightly less degree as well.  Therefore Florida is trying to entice insurers to come back to the state as the state insurance program of last resort has absolutely exploded with participants. \n\nDon’t get me wrong, insurers have fucked many of folks and will continue to do so well into the future.  They have also had huge losses in the last few years so it’s not like they are making any money either.",
      "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr06mx6/",
      "created": 1728423958,
      "depth": 0,
      "replies": [
        {
          "id": "lr06my0",
          "score": 1,
          "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1fza1up/homeowners_hate_this_one_simple_trick_after/lr06my0/",
          "created": 1728423958,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}