{
  "title": "Bloomberg: US Says It’s Weighing Google Breakup as Monopoly Case Remedy",
  "score": 489,
  "selftext": "The US Justice Department told a federal judge it is considering recommending that Google be forced to sell off parts of its operations to alleviate the harm caused by its monopolization of the online search market, in what would be a historic antitrust breakup.\n\nIn a court filing Tuesday, antitrust enforcers said Judge Amit Mehta could also force the Alphabet Inc. unit to provide access to the underlying data it uses to build its search results and artificial intelligence products.\n\nThe Justice Department “is considering behavioral and structural remedies that would prevent Google from using products such as Chrome, Play, and Android to advantage Google search and Google search-related products and features — including emerging search access points and features, such as artificial intelligence — over rivals or new entrants,” the agency said in the filing.\n\nThe filing represents Washington’s first push to dismantle a company for illegal monopolization since unsuccessful efforts to break up Microsoft Corp. two decades ago. The 32-page filing lays outs a framework of potential options for the judge to consider as the case moves to the remedy phase.\n\nAntitrust enforcers said Google gained scale and data benefits from its illegal distribution agreements with other tech companies that made make its search engine the default option on smartphones and web browsers.\n\nMehta, who ruled this summer that Google broke antitrust laws in both online search and search text ads markets, plans to hold a trial on the proposed remedy next spring and issue a decision by August 2025. Google has already said it plans to appeal Mehta’s decision, but must wait until he finalizes a remedy before doing so.\n\nGoogle’s Android business encompasses the operating system used on smartphones and devices as well as apps.\n\nOn Monday, a different federal judge ordered Google to open up its app store for the next three years to resolve a separate antitrust case related to its dominance of app distribution on Android smartphones. The company also plans to appeal that decision.\n\nhttps://www.bloomberg.com/news/articles/2024-10-09/us-says-it-s-weighing-google-breakup-as-remedy-in-monopoly-case",
  "link_flair_text": "Company News",
  "id": "1fzhd9r",
  "num_comments": 174,
  "created_utc": 1728441178,
  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/",
  "comments": [
    {
      "id": "lr1kbyi",
      "score": 131,
      "body": "The biggest problem I see with splitting Google up is that Google Search and everything tied in so closely with it that it can't really be separated are the parts of the company that got them into trouble for their monopolistic behavior. So even if you cut Google Search and it's advertising off from the rest of it's business, it would still be an anti-competitive monopoly.\n\nSo what can they realistically do that involves splitting it up that prevents this problem? It's not like Standard Oil where you can just easily split it up into different search engines. Even if you tried that, whoever gets the Google.com domain will obviously win out in the market.",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1kbyi/",
      "created": 1728445590,
      "depth": 0,
      "replies": [
        {
          "id": "lr24s1j",
          "score": 100,
          "body": "You could, in theory, split YouTube off.\n\nNothing else really could survive on their own",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr24s1j/",
          "created": 1728458720,
          "depth": 1,
          "replies": [
            {
              "id": "lr2j1fn",
              "score": 62,
              "body": "I think there is way more that works as a stand alone Company: Adroit and Google Play, Google Cloud Platform, Chrome",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2j1fn/",
              "created": 1728469084,
              "depth": 2,
              "replies": [
                {
                  "id": "lr2k1wi",
                  "score": 23,
                  "body": "Hmm droid + the store is a good catch. But who do you give the add services? Search or Android?",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2k1wi/",
                  "created": 1728469734,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr2o7ff",
                      "score": 19,
                      "body": "If I were Alphabet I would like to leave it in core Google & search. The DOJ may see that differently. \n\nOverall I think breaking up Alphabet but also Amazone, & Microsoft would be a great unlock of Value for Shareholders. The individual parts would do better than the consolidated share prices at the moment.",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2o7ff/",
                      "created": 1728472179,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr2ow4a",
                          "score": 13,
                          "body": "Absolute 0 chance with Microsoft.\n\nWe’ve already done this before and I don’t even think the government bothers to turn their way anymore.",
                          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2ow4a/",
                          "created": 1728472552,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lr632ox",
                              "score": 5,
                              "body": "Google didnt grease the right palms the way msft and amzn have. Thats why this is a discussion to begin with",
                              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr632ox/",
                              "created": 1728515088,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lr3wvui",
                              "score": 3,
                              "body": "They will look there if they make it happen with Google",
                              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr3wvui/",
                              "created": 1728489446,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lr4615y",
                                  "score": 2,
                                  "body": "I mean, as far as I know, there's no ongoing 'suit here. The places to look for are Amazon, Apple, etc, they do.\n\n\nAnd it's fairly clear now if the threat looks serious, that the company probably wouldn't follow the NDX in movement if it's positive.",
                                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr4615y/",
                                  "created": 1728492383,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lr2rsuu",
                              "score": 0,
                              "body": "Not saying it is going to happen just saying it would be the most valuable for shareholders.",
                              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2rsuu/",
                              "created": 1728474056,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lr30t24",
                                  "score": 11,
                                  "body": "but so many google services are unprofitable alone, the value comes from all the non quantitative pieces from their individual services. Obviously ads makes the revenue, but where do they get their data, all the services operating at a loss. How are shareholders truly getting value?",
                                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr30t24/",
                                  "created": 1728478169,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lr3dma5",
                                      "score": 1,
                                      "body": "I think you point out where the value is for shareholders is by getting rid of the unprofitable services.",
                                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr3dma5/",
                                      "created": 1728483073,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lr3he4o",
                                          "score": 3,
                                          "body": "theyre valuable and probably crucial for everything to work together. Google has been so good at cutting projects early that anything maintained over a long period of time are probably critical",
                                          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr3he4o/",
                                          "created": 1728484370,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "lr6kwgb",
                                      "score": 1,
                                      "body": "Then split it regionally",
                                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr6kwgb/",
                                      "created": 1728521769,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lr3bezz",
                  "score": 9,
                  "body": "all of those except gcp are funded by profits from ad revenue from the business as a whole though, they wouldn't survive on their own. if android had to charge the actual cost of the os... i don't think it would be affordable",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr3bezz/",
                  "created": 1728482286,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr3d9na",
                      "score": 7,
                      "body": "That sounds to me like a good argument for the DOJ. Google is using its dominant position in search and adds to corner the mobile OS market with a below cost offering.",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr3d9na/",
                      "created": 1728482949,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr47ii6",
                          "score": 3,
                          "body": "Google is losing massive market share on that front to iOS. As a Android engineers I am worried as hell",
                          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr47ii6/",
                          "created": 1728492850,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lr4bjrp",
                              "score": 11,
                              "body": "Maybe in the US, worldwide a market share of 71% sounds just fine to me.",
                              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr4bjrp/",
                              "created": 1728494135,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lr4e40c",
                                  "score": -2,
                                  "body": "They are losing market shares rapidly in the only markets that matters. The morale is really bad at google’s android team",
                                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr4e40c/",
                                  "created": 1728494946,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lr70rvo",
                                      "score": 1,
                                      "body": "And what are the only market that matters?",
                                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr70rvo/",
                                      "created": 1728527993,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lr71mqa",
                                          "score": 2,
                                          "body": "US by far, Europe, Japan, and Korea in that order.\n\nAlmost 50% of Alphabet revenue comes from US alone. 30% from Europe, 20% from Asia, 5% rest.\n\nAndroid is just a small part Google's revenue but I doubt revenue breakdown by countries is much different. Android having 70%+ global market share matters little when a lot of it is in countries that produce little income like Africa/SA/China",
                                          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr71mqa/",
                                          "created": 1728528345,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr3dgy8",
              "score": 6,
              "body": "I'm sure you could split most of Google into other companies that could survive, but most of the obvious ways of splitting them up do nothing to solve the Google search problem, which was my point.\n\nAndroid was their own company before Google bought them, so they could definitely survive on their own. Might as well give them Chrome to in order to weaken Google search since it's most closely associated with them and Android.\n\nWaymo is almost certainly going to be continuing to lose lots of money for a while yet due to their expensive R&D costs, but they should be able to issue more equity for a while to self fund.\n\nGoogle Cloud should be fine on it's own.\n\nNo idea what they'd do with Gemini and other AI products, they're definitely bleeding tons of money, and will almost certainly continue to do so for years to come. They need someone to subsidize them and their losses.",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr3dgy8/",
              "created": 1728483021,
              "depth": 2,
              "replies": [
                {
                  "id": "lr47t6m",
                  "score": 7,
                  "body": "It is different to survive as a startup vs mature company. Android won't be able to survive on its own vs the continous iOS onslaught",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr47t6m/",
                  "created": 1728492943,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lr6ngtd",
              "score": 1,
              "body": "If pieces of a company can't survive playing legally it shouldn't survive",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr6ngtd/",
              "created": 1728522759,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrhe4rt",
              "score": 1,
              "body": "If splitting YouTube from Alphabet means I see less ads in my face every 5 seconds, then I’m all for it.",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lrhe4rt/",
              "created": 1728685665,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr3e6v9",
              "score": 1,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr3e6v9/",
              "created": 1728483272,
              "depth": 2,
              "replies": [
                {
                  "id": "lr4ot7h",
                  "score": 4,
                  "body": "Also, why is breaking off YouTube even being discussed? It has nothing to do with the trial and was not one of the remedies proposed by the DOJ.",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr4ot7h/",
                  "created": 1728498392,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lr5pyjo",
                  "score": 0,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr5pyjo/",
                  "created": 1728510341,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr84fvh",
                      "score": 1,
                      "body": "Is there a source for your current information?",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr84fvh/",
                      "created": 1728550952,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrc095f",
                          "score": 1,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lrc095f/",
                          "created": 1728603771,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrc53wa",
                              "score": 1,
                              "body": "Could you quote the relevant part directly? Because I'm not going to go hunting for this supposed information in their earnings reports or the Bible just because you said it's in there. Don't be lazy when the burden of proof is on you.",
                              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lrc53wa/",
                              "created": 1728605615,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lrcynrs",
                                  "score": 1,
                                  "body": "They don’t report YouTube earnings separately anymore, ironically the person you’re replying to has outdated info",
                                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lrcynrs/",
                                  "created": 1728617054,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lresmp7",
                                      "score": 1,
                                      "body": "I know that, which is why I'm trying to get the other person to embarrass themselves further.",
                                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lresmp7/",
                                      "created": 1728654072,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lr5c7hw",
                  "score": -6,
                  "body": "Source? \n\n\nApparently they are profitable \n\n\n\"YouTube generated $31.5 billion revenue in 2023, a 1.3% increase year-on-year\"\n\n\nhttps://www.businessofapps.com/data/youtube-statistics/",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr5c7hw/",
                  "created": 1728505821,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr5tk1b",
                      "score": 7,
                      "body": "Revenue is not profit",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr5tk1b/",
                      "created": 1728511548,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lr3woj4",
          "score": 3,
          "body": "Youtube, adsence, google word/sheets and email could be split out?",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr3woj4/",
          "created": 1728489381,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lr2qigt",
          "score": 5,
          "body": "They certainly can. They tied so closely today because they are same company, but there are third party search engines in the market to prove search itself can run separately",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2qigt/",
          "created": 1728473404,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrdedfr",
          "score": 1,
          "body": "Nope. Those other entities absolutely can be separated and forced to find a new business model that isn't comprised of illegally funneling traffic to a search and advertising monopoly. The Court doesn't care whether they end up being outcompeted by legal businesses because their original business model was illegal. That's their problem. The Court is only concerned with protecting fair competition and consumer choice. Maybe Windows Phone, whose business model was selling the operating system for a small fee unlike Android which was to give the OS away for free in exchange for steering traffic, wins over Android afterall. Oh the irony.",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lrdedfr/",
          "created": 1728625223,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lr61rve",
          "score": -1,
          "body": "Google search is ass now anyways.",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr61rve/",
          "created": 1728514597,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr1nwpa",
      "score": 90,
      "body": "Who cares about Google? Separate the grocery store conglomerates like Kraft and PepsiCo.",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1nwpa/",
      "created": 1728447473,
      "depth": 0,
      "replies": [
        {
          "id": "lr6myxp",
          "score": 0,
          "body": "I agree about groceries, but I also get nervous around tech companies that effectively control huge swaths of the economy. ",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr6myxp/",
          "created": 1728522564,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr1jasy",
      "score": 14,
      "body": "Will be appealed to kingdom come",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1jasy/",
      "created": 1728445084,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr3wkbx",
      "score": 14,
      "body": "But what about Apple and Microsoft? Shouldn't the law be equal for everybody or its just me being naive?\n\n1. Google cant have both the store and the operating system but apple does?\n\n2. Microsoft can have them aswell on PC but Google can't on smartphones?\n\n3. Google cant make revenue sharing agreements with phone manufacturers but other can?\n\nIf they where coherent Apple shouldn't receive any money from the search engine (no revenue sharing) nor should be able to make its own (you cant own both the search engine and the operating system). So should they host them for free?",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr3wkbx/",
      "created": 1728489344,
      "depth": 0,
      "replies": [
        {
          "id": "lr5gmcz",
          "score": 1,
          "body": "If the DOJ is investigating my assumption is Google is just an easier target because of the market share/way they capture the search/ad space. Apple/MSFT could be next but I think Apple is more likely. \n\n1. I think nobody wants that but our law is pretty out dated and slow to change.  \n2. I think the issue is search is the default on ALL? mobile devices(android/ios).  \n3. Refer to 2, revenue sharing might not be an issue directly but in this case it leads to a large share of search going to google.\n\nReally Google just owns so much of the ad space that it seems easy for the DOJ to break them up. It's probably good for consumers depending on how they split them up. Or at least for innovation.",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr5gmcz/",
          "created": 1728507233,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrds0rs",
          "score": 1,
          "body": "It seems Google doesn't invest into lawyers like other companies, they lost the case to epic , but epic lost the same case vs apple while its much much easier to loud out of store app on Android phones than apple",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lrds0rs/",
          "created": 1728634280,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrg1w1o",
          "score": 1,
          "body": "Google has like 90% of the search market share and that makes them a target. Apple and Microsoft don’t have those kinds of monopolies in their products. \n\nWindows is about 61% while iPhone is at 62% for the US.\n\niPhone has great competitors. Windows has macOS and Linux as competitors.",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lrg1w1o/",
          "created": 1728669098,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr1di3a",
      "score": 46,
      "body": "This is already priced in right? Because it’s just a proposal at this point and the judge won’t actually rule on it until August 2025",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1di3a/",
      "created": 1728442313,
      "depth": 0,
      "replies": [
        {
          "id": "lr2vags",
          "score": 29,
          "body": "Also Google can keep this tied up in court for many years",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2vags/",
          "created": 1728475728,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr1c2zy",
      "score": 84,
      "body": "What new companies could this spawn? Last time in the case against Microsoft we actually got Google",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1c2zy/",
      "created": 1728441646,
      "depth": 0,
      "replies": [
        {
          "id": "lr1dntx",
          "score": 49,
          "body": "I'm obviously not an expert at this sort of thing, but Google's main segments (as I see it) are: Search, YouTube, Web Services, AI (and other research), Waymo, and Hardware. The various segments of the company are different in size and make wildly different amounts of revenue. Right now their AI research and tools probably don't produce very much (if much at all), because at the moment they're subsiding research and effort in that area with their ad revenue from YouTube and Search. Their hardware segment exists, but they do a couple phones a year, some home speakers, and the tensor chip. Not too much as far as I can tell. The web services, if they're anything like Microsoft of Amazon's, are a cash cow. Waymo would be easy to separate, Intel did it with Mobile-Eye a while ago and it went smoothly enough. \n\nSo, going off of my totally uninformed opinion, we could end up with: YouTube, Google, Waymo, Hardware (I'll dub it 'Pixel'), Gemini, and whatever they'd call the new web services company. \n\n(I realize now I've also forgotten about Android - that could just get turned into Android as well.)",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1dntx/",
          "created": 1728442388,
          "depth": 1,
          "replies": [
            {
              "id": "lr1kmhf",
              "score": 13,
              "body": "I see a few potential problems with some of your split ideas:\n\n* I'm deeply skeptical that Waymo is anywhere close to profitable, or that it'll be anywhere close to profitable in a while. There's just WAY too much continuing R&D costs, and way too much that still needs to be done to get it to work on a nationwide or worldwide basis. Though theoretically it could fund itself for a while by issuing more shares, Google has raised some cash for Waymo this way in the past.\n\n* Gemini is 100% not making any profits anytime soon, the whole industry is in capture market share mode, not make profits mode. And quite frankly I'm not sure how you could really separate this from the Google Search business without killing a good chunk of what little revenue it brings in already. Most of the other bets from Google have this same problem for funding and dependence on Google and it's brand.",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1kmhf/",
              "created": 1728445737,
              "depth": 2,
              "replies": [
                {
                  "id": "lr1pe11",
                  "score": 2,
                  "body": "I agree that Gemini splitting off is definitely the most far-fetched of those proposed. Research and development is too expensive, as is buying more processors, as is pivoting it into a profitable business, etc. I'm just spitballing ideas for how I'd split it purely on a departmental basis - Gemini would definitely need something to keep it afloat or would need to monetize aggressively.\n\nIn regards to Waymo I agree there as well, but similar to the above, I'm just looking for a place to make the cut / spin-off that's conveniently compartmentalized. That said, ask the Tesla bulls and they'll say self-driving cars are a trillion dollar industry! ![gif](emote|free_emotes_pack|facepalm)",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1pe11/",
                  "created": 1728448295,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lr276n7",
              "score": 10,
              "body": "Android itself has no reasonable way to get nearly enough revenue to continue existing.",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr276n7/",
              "created": 1728460515,
              "depth": 2,
              "replies": [
                {
                  "id": "lr39tqk",
                  "score": 2,
                  "body": "Android revenue is tens of billions annually. How do you figure?",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr39tqk/",
                  "created": 1728481712,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr3qc7d",
                      "score": 6,
                      "body": "Where did that number come from? Device sales are not OS profit. Android is open source.",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr3qc7d/",
                      "created": 1728487342,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr3xbwd",
                          "score": 2,
                          "body": "Android and the app store always would be together.",
                          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr3xbwd/",
                          "created": 1728489589,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lr3y4pl",
                              "score": 1,
                              "body": "Play and Android are separate. Android, Inc. was acquired into Google and is an open source operating system project.",
                              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr3y4pl/",
                              "created": 1728489848,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lr405ud",
                                  "score": 1,
                                  "body": "If you are splitting up google those 2 will be taken out of search + the rest at minimum",
                                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr405ud/",
                                  "created": 1728490506,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "lr4g6eq",
                                  "score": 1,
                                  "body": ">Play and Android are separate.\n\nThis is wrong.",
                                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr4g6eq/",
                                  "created": 1728495602,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lr4ggj9",
                          "score": 1,
                          "body": "As has been pointed out, Google Play and Android are not separate. Same goes for Android related mobile advertising.",
                          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr4ggj9/",
                          "created": 1728495692,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr1ma4x",
              "score": 41,
              "body": "> we could end up with: YouTube, Google, Waymo, Hardware\n\nIf they get to keep the Adsense marketplace, Google Search, Android, Google Services, Google Maps etc. in one entity called Google, what even is the point. \n\nThey have to separate Ad marketplace from Google Search and allow other market places to offer ad placements on Google.",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1ma4x/",
              "created": 1728446595,
              "depth": 2,
              "replies": [
                {
                  "id": "lr1ord0",
                  "score": 13,
                  "body": ">If they get to keep the Adsense marketplace, Google Search, Android, Google Services, Google Maps etc. in one entity called Google, what even is the point.\n\nYou're right - there wouldn't be a point. I have no idea how they'd even tackle going about splitting apart Google, but I gave it my best shot!",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1ord0/",
                  "created": 1728447941,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lr2adrl",
                  "score": 5,
                  "body": "I‘m not gonna cry over the “ad market” but being able to push an international standard through Chrome and Android that is very much shaped by ad-needs actually *is* dangerous. If they could split that up, it would actually help with a more open web and OS market.",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2adrl/",
                  "created": 1728462902,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lr4qzqh",
                  "score": 2,
                  "body": "How do you separate ads from search? Search generates nothing but expenses by itself, its only revenue is ads.",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr4qzqh/",
                  "created": 1728499089,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lr1kntm",
              "score": 31,
              "body": "I’m afraid if Android spun off it would die and we’d only be left with iPhones.",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1kntm/",
              "created": 1728445756,
              "depth": 2,
              "replies": [
                {
                  "id": "lr1ozyh",
                  "score": 13,
                  "body": "I like to think that Samsung, whatever was left of Google, and the other brands that use Android would feel very incentivized to keep Android alive. Not only that, but if IOS was the only one remaining then they would be forced to split apart too because then they're a monopoly as well. It could end up becoming a situation similar to the Microsoft investment in Apple back in 1997 to help the company against bankruptcy - it was in their own best interest, true, but Apple bounced back pretty good from that.",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1ozyh/",
                  "created": 1728448073,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr4pie8",
                      "score": 2,
                      "body": "It's not against the law to be a monopoly. It's only illegal if achieved through exclusionary or predatory acts. Since Apple has nothing to do with the ruling on a potential breakup there it not much the government could do about it.",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr4pie8/",
                      "created": 1728498614,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr1gix3",
              "score": 10,
              "body": "Did you mean to put a common between YouTube and Web Services? If not where are you including [one of their biggest segments](https://i.redd.it/pd0qs13iweed1.png) in Google Cloud Platform (GCP)?",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1gix3/",
              "created": 1728443724,
              "depth": 2,
              "replies": [
                {
                  "id": "lr1xjh6",
                  "score": 2,
                  "body": "I had intended to use a comma I've corrected it now. Sorry!",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1xjh6/",
                  "created": 1728453592,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lr1po4y",
                  "score": -6,
                  "body": "Can’t believe GCP brings in 10 bills. I don’t know any f500 using it for anything other than niche testdev instances. Maybe some sw vendors doing weird container stuff. But it’s a distant third to azure and aws",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1po4y/",
                  "created": 1728448458,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr241h1",
                      "score": 6,
                      "body": "I don't understand why you're getting downvoted. I'm a DevOps engineer and work with many companies on the vendor side. as you said, it's a distant third\n\nSO distant, it's the only cloud provider I haven't had to learn (and I had to learn Tanzu)\n\nevery time I make a post saying anything even slightly negative about Google I get downvoted, I think there's a large crowd on here who believes the company is the perfect value buy and are staking half their fortune on it",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr241h1/",
                      "created": 1728458176,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr24wfd",
                          "score": 3,
                          "body": "All I know is the company that’s named after cave exploring is heavily invested, and literally no one else. Agreed there’s a weird cult narrative going on",
                          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr24wfd/",
                          "created": 1728458811,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lr1wrnn",
                      "score": 2,
                      "body": "Big query is very good and doesn’t really have a competitor at least the last time I looked and ml teams seem to love gcp from my experience at a few companies",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1wrnn/",
                      "created": 1728453065,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr2elsx",
                          "score": 2,
                          "body": "When's the last time you looked?\n\nRedshift, Snowflake, Synapse...",
                          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2elsx/",
                          "created": 1728466006,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr2t6dn",
              "score": 2,
              "body": "if YouTube gets sold off, it could really become a force in terms of media conglomerate. I just cut my cable out for YouTube TV and it's an infinitely better and modern experience for television. The fact that old TV providers forced you to get those giant clunky boxes is such a scam. Also I am able to watch whatever I want anywhere on as many screens as I want. That means when the NFL is on I'm able to put a multiview of games on one screen and then load up a laptop with YT TV on another. No limitation whatsoever. Best part is I can cancel anytime I want. \n\nIn terms of talent and content YouTube is unmatched, everybody wants to get big off a YouTube channel, so many creators pop up every day and so many ones are making content better than big guys. The best part is the freedom is offers. You don't need to sign an exclusive deal with Netflix to get on, you can just find a few guys, get the equipment and market yourself. In terms of pure quality, YouTube is unmatched from the excellent creators that put up things that no one could ever put up.",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2t6dn/",
              "created": 1728474732,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lr1over",
          "score": 7,
          "body": "With respect to IE dominance? Google came into perspective around 1998, before then it was Altavista. Microsoft had long held dominance as an OS and then supplanted Netscape (Nutscrape). Microsoft used its dominance to shoehorn IE as the browser to push out Netscape and crowd out Opera. This allowed Chrome to insert itself that was solidified with marketing agreements with Apple and their trojan horse, Android.\n\nIt's not the same: the terms have been more a murmur with an insidious consequence that evolved over 2 decades.",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1over/",
          "created": 1728448003,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lr26fgu",
          "score": 6,
          "body": "No you got apple.",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr26fgu/",
          "created": 1728459948,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lr4nwxh",
          "score": 2,
          "body": "Sounds like it was good for industry then since so many companies were able to develop after the Microsoft case, including Microsoft",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr4nwxh/",
          "created": 1728498102,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrg27ph",
          "score": 1,
          "body": "No we didn’t get anything.",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lrg27ph/",
          "created": 1728669200,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lr1lg76",
          "score": -4,
          "body": "And before that they tried to break up IBM, that's how we got Microsoft.",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1lg76/",
          "created": 1728446157,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr2glaq",
      "score": 9,
      "body": "Meanwhile ISPs and utilities companies be like:",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2glaq/",
      "created": 1728467427,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr2ajbg",
      "score": 31,
      "body": "Judge named Mehta is hitting Google with an antitrust\n\nWe live in a fucking simulation",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2ajbg/",
      "created": 1728463015,
      "depth": 0,
      "replies": [
        {
          "id": "lr7kjre",
          "score": -2,
          "body": "Huh? That doesn’t make any sense. DOJ and 38 state AGs hit Google with the antitrust lawsuit in 2020. \n\nDoesn’t mean we aren’t living in a simulation, but it’s just a different one.",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr7kjre/",
          "created": 1728537559,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr1eawu",
      "score": 90,
      "body": "Google Search is being eaten by AI threats and yet it is also a monopoly? Funny how behind the times the DoJ can be. They are always fighting the last war.",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1eawu/",
      "created": 1728442685,
      "depth": 0,
      "replies": [
        {
          "id": "lr1q0y6",
          "score": 62,
          "body": "Apparently what Google needs is a new fucking legal team. \n\nForget making search better or improving AI, they need to win some goddamn court cases. \n\nI have made the same point you just did for months now. Either Google is an unstoppable monopoly, or they are going to get rocked by Bing (lol), it cannot be both. Hell, the DOJ should go crawl up OpenAI’s ass next. Word is that Sam Altman literally told investors they wouldn’t be able to access the current round if they invested in Ilya’s company. Collusion in plain sight right there.",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1q0y6/",
          "created": 1728448668,
          "depth": 1,
          "replies": [
            {
              "id": "lr2vdfv",
              "score": 11,
              "body": "Maybe a new CEO as well",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2vdfv/",
              "created": 1728475766,
              "depth": 2,
              "replies": [
                {
                  "id": "lr61kam",
                  "score": 3,
                  "body": "Stock will pop 10% the moment Sundar is shown the door",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr61kam/",
                  "created": 1728514517,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lr6q9gk",
              "score": 1,
              "body": "exclusivity & non-compete clauses are pretty standard in business dealings, and afaik, its not collusion.",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr6q9gk/",
              "created": 1728523843,
              "depth": 2,
              "replies": [
                {
                  "id": "lr7g7by",
                  "score": 1,
                  "body": "For one, non-competes are essentially unenforceable now. \n\nThis goes well beyond a non-compete. This is a market player literally mandating that investors not invest in other companies in order to participate. That’s unheard of.",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr7g7by/",
                  "created": 1728535176,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr9v7ks",
                      "score": 1,
                      "body": "at an individual employee level, that is true. at organizational/business levels, thats not the case.\n\nbusinesses and corporations have the right to refuse anything (within the constitution) inside their domain.\n\nnone of this adds upto collusion.",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr9v7ks/",
                      "created": 1728577951,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr29z1s",
              "score": -3,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr29z1s/",
              "created": 1728462594,
              "depth": 2,
              "replies": [
                {
                  "id": "lr2zpb9",
                  "score": 16,
                  "body": "Bullshit. It's the only company that is still meaningfully growing. \n\n\nApple has utterly stalled out and is out of new ideas. If the iPhone goes the way of literally every other handheld device in history, they are fucked big time. I would be way more concerned about the iPhone's moat than Google's search moat, based on historical trends. ",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2zpb9/",
                  "created": 1728477698,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lr25681",
          "score": 5,
          "body": "The issue is their ad business and how they provide ads to themselves and push their own products in search results, not about the ubiquity of Google search. ",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr25681/",
          "created": 1728459013,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lr1jqrt",
          "score": -8,
          "body": "You have to be delusional to deny Google is a monopoly bruh",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1jqrt/",
          "created": 1728445304,
          "depth": 1,
          "replies": [
            {
              "id": "lr1py9a",
              "score": 40,
              "body": "Its main income which is ads is only 50% of the market these days. Meta, tiktok and amazon have really eaten into their share.",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1py9a/",
              "created": 1728448625,
              "depth": 2,
              "replies": [
                {
                  "id": "lr1ztt5",
                  "score": 0,
                  "body": "Antitrust cases always come down to how to define the market. \n\nGoogle essentially owns the entire ad tech stack, which means they can be involved in every stage of a deal to sell ad space online, driving up prices. In court, the government even used an email from a Google employee that compared that arrangement to allowing a bank to own the New York Stock Exchange.\n\nAdd to that, the $20b yearly payment to Apple to make google the default search on iphones, and you have several layers of monopolistic practices.",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1ztt5/",
                  "created": 1728455188,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr2v2ax",
                      "score": 8,
                      "body": "They don't own the whole ad stack if their market share of ads is below 50%...",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2v2ax/",
                      "created": 1728475622,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lr2v1jp",
                      "score": 6,
                      "body": ">Add to that, the $20b yearly payment to Apple to make google the default search on iphones\n\nThen wtf else is apple going to do? They have to set a default search engine for safari to something.",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2v1jp/",
                      "created": 1728475612,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr46bjq",
                          "score": 3,
                          "body": "My guess is the Justice Department views deals like the $20b to apple as functional payoffs to not build a search engine themselves.",
                          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr46bjq/",
                          "created": 1728492474,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lr5evmt",
                      "score": 1,
                      "body": "they literally forgot to renew their domain google.com\n\npersonally i dont see them as a monopoly. people can use bing, duck duck go or whatever. if they are the leaders and bring us a reliable product then so be it",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr5evmt/",
                      "created": 1728506674,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr1ksj6",
              "score": 1,
              "body": "Explain it then",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1ksj6/",
              "created": 1728445822,
              "depth": 2,
              "replies": [
                {
                  "id": "lr1sn5m",
                  "score": -5,
                  "body": "Next time you have to find a local dentist you should look it up in chatgpt.",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1sn5m/",
                  "created": 1728450325,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr1vj3m",
                      "score": -8,
                      "body": "Just did. Prompt “find me a dentist in city, state”",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1vj3m/",
                      "created": 1728452252,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lr1l7xj",
                  "score": -8,
                  "body": "What other search do you use",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1l7xj/",
                  "created": 1728446038,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr1md8q",
                      "score": 23,
                      "body": "That’s not how you prove a monopoly. \n\nYahoo, Bing, Duck Duck Go, Brave Search, ChatGPT, etc exist and do search. \n\nIf a product quality is better, I use it. A monopoly, in this sense, is defined by the reality that the supply of search engine services are exclusively controlled by one entity and that’s not the case here. ",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1md8q/",
                      "created": 1728446641,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr1syg2",
                          "score": 1,
                          "body": "No Monopoly has ever been exclusive literally unless you are talking about the Soviet union or some obscure industrial material. You measure market concentration and define a threshold above which a company has such an extreme amount of pricing power that it is effectively a monopoly.",
                          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1syg2/",
                          "created": 1728450537,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lr1vbua",
                              "score": 13,
                              "body": "You’re forgetting something.\n\nGoogle and Apple were just reprimanded by the DOJ for conditions of exclusivity, which created a monopoly on search within the Apple ecosystem. \n\nGoogle might pay $100M in fines but they’re no longer paying Apple $20B for exclusivity.\n\nSo, since there are no conditions of exclusivity on the general marketplace… then there is no monopoly.\n\nGoogle doesn’t require customers to use their product. Why penalize them for a superior product? ",
                              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1vbua/",
                              "created": 1728452117,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lr1yhwj",
                                  "score": -7,
                                  "body": "Again monopoly is measured by dominance in market. In the search market they have over 90% usage. This is monopoly level concentration. https://gs.statcounter.com/search-engine-market-share",
                                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1yhwj/",
                                  "created": 1728454261,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lr2xsre",
                                      "score": 2,
                                      "body": "Search Market usage can change on a dime. Google doesn’t control the logistics chain of this product. They have the best search out there…. So let’s penalize them for it is what I’m interpreting.\n\nAdvertising and pushing their own stuff up to the top is unethical and worth checking, but breaking them up because their product is great is stupid. I hope the judge seeing this case comes to the same conclusion. ",
                                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2xsre/",
                                      "created": 1728476864,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "lr25t10",
                                      "score": -2,
                                      "body": "Sincerely, why am I getting downvoted? Can someone leave a comment explaining their disagreement with the previous comment I made",
                                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr25t10/",
                                      "created": 1728459485,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lr1pbkd",
                      "score": 2,
                      "body": "AskJeeves",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1pbkd/",
                      "created": 1728448256,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lr1pz87",
                      "score": 1,
                      "body": "ChatGPT",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1pz87/",
                      "created": 1728448641,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lr1rxfp",
                  "score": -7,
                  "body": "They have such a stranglehold over the search engine space, that they’re able to take advantage of some very shady monopolistic practices. Such as placing their own products higher in search results.",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1rxfp/",
                  "created": 1728449856,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr1vn2l",
                      "score": 8,
                      "body": "I’ve not experienced what you’ve typed",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1vn2l/",
                      "created": 1728452325,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr2bsy4",
                          "score": 1,
                          "body": "It’s called self-preferencing and obviously it’s much more subtle and nuanced than the examples I used(which I’ll edit out, since they’re more likely to detract from the point). \n\nThey’ve had billions in fines imposed by the EU for this, these are some recent examples:\n\n>The European Commission has informed Google of its preliminary view that the company breached EU antitrust rules by distorting competition in the advertising technology industry (‘adtech’). The Commission takes issue with Google favouring its own online display advertising technology services to the detriment of competing providers of advertising technology services, advertisers and online publishers.\n\nhttps://ec.europa.eu/commission/presscorner/detail/es/ip_23_3207\n\n>On 10 September 2024, the European Court of Justice upheld a €2.42 billion fine imposed by the Commission in the Google Shopping case: the EU’s highest court confirmed a finding that Google had abused its dominant position by favouring its own comparison-shopping service in search results while unfairly demoting results from competing services. Google’s appeal to the European Court of Justice against the General Court’s 2022 ruling, which largely upheld the European Commission’s 2018 decision that Google had abused multiple dominant positions related to the Android mobile operating system to strengthen its dominance in web search, is still pending. \n\nhttps://www.goodwinlaw.com/en/insights/publications/2024/10/insights-technology-cldr-the-general-court-of-the-european-union#",
                          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2bsy4/",
                          "created": 1728463951,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lr1y78o",
          "score": 1,
          "body": "It probably took them 6 years to build the case to this point.",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1y78o/",
          "created": 1728454053,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr46juo",
      "score": 6,
      "body": "My guess is Google will make a deal with DOJ to avoid being broken up but it will be a king's ransom. \n\nPeople are making comparisons to MSFT antitrust case where their API patents had a stranglehold on the tech industry and since they had to give those up it lead to the creation of other big tech giants including Google. \n\nGoogle is gonna make sure their golden goose egg search + ADs is intact but probably means they have to off load their android to another company and youtube to somebody else.",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr46juo/",
      "created": 1728492547,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr2fdsa",
      "score": 19,
      "body": "I wonder who they really pissed off. It's obvious that Apple and Microsoft are far better candidates to be considered monopolies, yet they aren't the ones making headlines and being dragged in the court with threats of being broken up.",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2fdsa/",
      "created": 1728466570,
      "depth": 0,
      "replies": [
        {
          "id": "lr5ftat",
          "score": 3,
          "body": "Apple doesn't do search, AI or video or much for ads\n\nMS doesnt do Mobile, search, maybe maps? or ads\n\nLike others have said Google just has a huge stack of the ad space in search/Android/YT. Eventually AI but I do think Google is prime to be ripped apart.   \n  \nI feel apple is more likely to be after Google but the DOJ is just going for low hanging fruit.  MSFT owns business but Google and other companies compete. With search there are other options but IDK they might have a bigger advantage in that space.",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr5ftat/",
          "created": 1728506977,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lr2pbk3",
          "score": 2,
          "body": "Have to agree with hacking the gibson tbh.\n\nThey need to fire their legal team and hire Microsoft’s, otherwise there’s a very good shot the final decision does at the very minimum mean a spin-off or two occurring at the rate this is going.",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2pbk3/",
          "created": 1728472784,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr50elt",
      "score": 5,
      "body": "It is the best thing it can happen for Google stock owners. If it breaks in two companies, one will be run by Sundar Pichai and the other NOT and this other company will thrive for sure.\n\nIf it is divided into three companies, then two thirds of Google will not be run by Sundar Pichai, even better.",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr50elt/",
      "created": 1728502094,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr2923b",
      "score": 3,
      "body": "Is there a way to read the full document?",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2923b/",
      "created": 1728461913,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr2wlk7",
      "score": 3,
      "body": "If ya think people will start using other search engines, you are mistaken.",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2wlk7/",
      "created": 1728476326,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr1hvo7",
      "score": 27,
      "body": "I'm sorry but if Google was able to build such a good eco-system then they should be rewarded for it. Dismantling a well run (yes, the Sundar haters come at me) seems to be the opposite of a free market. \n\nAlternatively, they need to hire the entire lobbying team from MSFT and call it a day. We could make similar arguments for the breakup of MSFT as well, and it has been floated before.",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1hvo7/",
      "created": 1728444381,
      "depth": 0,
      "replies": [
        {
          "id": "lr1l6iy",
          "score": 14,
          "body": "Companies that become monopolies should be able to keep their monopolization on markets? Huh?\n\nedit. This was so fucking dumb I have to 'fReE mArKeT'. Go do your homework lmfao.",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1l6iy/",
          "created": 1728446019,
          "depth": 1,
          "replies": [
            {
              "id": "lr2bssr",
              "score": 19,
              "body": "nobody is stopping competitors from starting their own search, own smartphone, etc and Google has competition\n\n\nbreak up the farming oligopolies, the oil oligopolies, reverse the cable monopoly legalization, destroy food chain brands that own everything in the grocery store \n\n\nthose would actually help Americans much more, than google made a mobile operating system too good while also being free and had agreements for a default browser",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2bssr/",
              "created": 1728463947,
              "depth": 2,
              "replies": [
                {
                  "id": "lr4nk6j",
                  "score": -1,
                  "body": "nobody is stopping competitors from starting their own farms, oil exploration companies, cable companies, food processing company\n\nthats you. thats how you sound",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr4nk6j/",
                  "created": 1728497985,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr4o3l5",
                      "score": 5,
                      "body": "yeah.... the regulations and start up costs of, say, running an oil rig, means competition as a startup is much more difficult \n\nas opposed to, say downloading open source software on your PC at home to scan the Internet and rebranding open source \"chrome\" to \"boob search central\"\n\n\ngoogle making Android and chrome open source, saves startups millions in start up costs",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr4o3l5/",
                      "created": 1728498162,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr1oiyr",
              "score": 21,
              "body": "Yeah, I don't think this person knows the historical end results of monopolies. They also say we could make similar arguments to break up MSFT as well like that would be a bad thing? I work in tech and actually enjoy Microsoft software, but I would still see that as a net positive.",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1oiyr/",
              "created": 1728447812,
              "depth": 2,
              "replies": [
                {
                  "id": "lr1ovyp",
                  "score": 2,
                  "body": "Yeah maybe someone not fucking clueless could take over Teams and we'd get a not shit product that doesn't have to be lumped in with their other semi decent ones (Outlook, that's it).",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1ovyp/",
                  "created": 1728448012,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr1p8e5",
                      "score": -1,
                      "body": "Have you used the new Outlook? They are trying to ruin it as well haha.",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1p8e5/",
                      "created": 1728448206,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr1y1qy",
                          "score": 2,
                          "body": "They broke spell check in the subject line. Just a minor thing made the product unusable for me.",
                          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1y1qy/",
                          "created": 1728453945,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lr1vh05",
                      "score": 0,
                      "body": "Teams is the worst. So buggy and shitty.",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1vh05/",
                      "created": 1728452214,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr1tesi",
              "score": 4,
              "body": "I think people suffer from lack of imagination when it comes anti competitive action. Incredible amount of value can be unlocked for investors if companies are broken up as past experiences have shown.",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1tesi/",
              "created": 1728450843,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr1x4wr",
              "score": 1,
              "body": "They should if I hold shares😂",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1x4wr/",
              "created": 1728453317,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lr1kehh",
          "score": 3,
          "body": "Also, I don’t get the argument that this company can’t highlight its own products over competitors in their search or products. It’s their company, of course you’d want to highlight your products first. Amazon shows their products at the top often before other sellers, is that a monopolistic behavior too? My Microsoft laptop comes with edge, isn’t that the same thing?",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1kehh/",
          "created": 1728445625,
          "depth": 1,
          "replies": [
            {
              "id": "lr1zdnn",
              "score": 5,
              "body": "The overall problem is that if a company gets too large it stifles innovation which is the ultimate downfall of a capitalist system. These big tech companies shouldn’t have been able to buy many of their divisions but they did and now the market needs to be corrected.\n\nIf the market isn’t a breeding ground for innovation/competition, capitalism is failing and then the government needs to step in.\n\nWe all yell capitalism when it’s about corporations making a shit ton of money, so we need to yell capitalism when the market is starting slow down its capitalistic tendencies and venture into something monopolistic.",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1zdnn/",
              "created": 1728454877,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr1p7eb",
              "score": 2,
              "body": "Don't be surprised if action is taken against Amazon for that, plus end running sellers of the top products on their marketplace. Realistically, Amazon's marketplace, products, and logistics branches should be broken up for similar competitive reasons.",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1p7eb/",
              "created": 1728448190,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr1zqbm",
              "score": 2,
              "body": "This kind of illegal practice has two prongs: first—*what is the relevant market and does Google have “substantial power” in this market?*\n\nSeems like the answer to this was AdWords and search. Anything above 30% market share is when things start to get dicey, as the larger your market share, the less it takes of the second prong to get in trouble.\n\nSecond prong: *does Google act in such a way that they harm consumers or inhibit competition?*\n\nAsk yourself this: does Google act in such a way that consumers are forced to use their products with no recourse or alternative? Does Google have predatory pricing? Do they subsidize their losing projects with this income to screw the competition?\n\nThis doesn’t have anything to do with Google’s success. There doesn’t seem to be an alternative in the search market. What is stopping Google from raising prices and shoving them down peoples throats? Nothing. Then the fact that they can pick and choose who appears first may be a concern.\n\nIn your Amazon example, Amazon can show its stuff first, but you as a consumer have plenty of other outlets (online and offline) to buy a comparable good. Even though that practice is bad for the other sellers, they (Amazon) simply do not have substantial power in the relevant market, so they can probably get away with it. If they did this and raised prices, you could simply go somewhere else, even within their own site.\n\nNow, if Amazon suddenly became the only outlet for PlayStation 5 online due to an exclusive deal with Sony, for example, then the online video game console market may be affected negatively. In that particular market, they may get in trouble if they suddenly decided to raise prices 100% or to force you to buy Amazon Prime with your PS5.",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1zqbm/",
              "created": 1728455120,
              "depth": 2,
              "replies": [
                {
                  "id": "lr2c8by",
                  "score": 3,
                  "body": "there are alternatives, bing, duck duck go, and I'm sure others as \n\nwhat's stopping them from raises prices? on search it's the fact there are free alternatives already \n\non android? the open source licensing means anybody can spin up a competitor with the same source code \n\nin chrome? chrome is open source, even edge is based on chrome and it doesn't send data to google at all - anybody can create a competitor to Google's version of chrome",
                  "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2c8by/",
                  "created": 1728464267,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr3gc18",
                      "score": 2,
                      "body": "Im not arguing in favor or against Google, I’m just trying to illustrate why it is they are in trouble.\n\nYou do need to focus on search, though. That’s the market being studied by the DOJ.",
                      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr3gc18/",
                      "created": 1728484010,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr4ggwu",
                          "score": 1,
                          "body": "they use open data to catalog the Internet, you could start competing with them over a weekend \n\nand there are alternatives",
                          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr4ggwu/",
                          "created": 1728495695,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lr5c3gd",
                              "score": 2,
                              "body": "Yeah but what would be my market share? Google is not a monopoly, it engages in monopolistic practices while having substantial power. It’s not the same.",
                              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr5c3gd/",
                              "created": 1728505785,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lr5iavb",
      "score": 2,
      "body": "Kinda funny. \n\nGoogle has dominated the search for decades and then they're on a decline since GPT they aim to break it up",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr5iavb/",
      "created": 1728507769,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr5rnrw",
      "score": 2,
      "body": "i hope the stock drops on this news so i can buy more",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr5rnrw/",
      "created": 1728510930,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr1tbm8",
      "score": 5,
      "body": "August 2025? Pretty fing slow.",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1tbm8/",
      "created": 1728450785,
      "depth": 0,
      "replies": [
        {
          "id": "lr2s7hh",
          "score": 5,
          "body": "Then the appeal in another 2 years and then the supreme court and by then the ai took over",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2s7hh/",
          "created": 1728474258,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr1pizm",
      "score": 3,
      "body": "Doesn't even make any sense",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1pizm/",
      "created": 1728448373,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr1spn9",
      "score": 2,
      "body": "Think this is such a bad idea for the consumer.   But a broken up Google would be good for investors, IMO.",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1spn9/",
      "created": 1728450371,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr61wk9",
      "score": 1,
      "body": "Interesting. \n\nTIL the following are not monopolies:\n\nMSFT: office software suite\n\nAAPL: iPhone market share\n\nAMZN: e-commerce platform\n\nMETA: SOCIAL MEDIA (like seriously?)\n\n\nHow are these not the dam defacto options in their respective realms with the same concerns as raised by this case?",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr61wk9/",
      "created": 1728514645,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr6cs9q",
      "score": 1,
      "body": "If they break up google same will\nhappens to Amazon, Microsoft, and Apple. All have monopolistic services.",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr6cs9q/",
      "created": 1728518723,
      "depth": 0,
      "replies": [
        {
          "id": "lrgexl9",
          "score": 1,
          "body": "If the US governments breaks all those companies up, the real winner will probably be China.",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lrgexl9/",
          "created": 1728673381,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr7e4b7",
      "score": 1,
      "body": "DOJ got it wrong, Mehta got it wrong-errr. I thought just the Europeans were out to get our top notch businesses but this DOJ’s just piling on to the EU nonsense. ",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr7e4b7/",
      "created": 1728534092,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr8ypjo",
      "score": 1,
      "body": "Google is apart of Alphabet. Shit won’t matter. \n\nThe same with Amazon or other companies",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr8ypjo/",
      "created": 1728566862,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lreor2w",
      "score": 1,
      "body": "This feels like trying to shut the barn door after the horse has already left. Alphabet’s search ad revenue has fallen to around 50% and is projected to fall below 50% next year, so do they even still have a monopoly to break up?",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lreor2w/",
      "created": 1728652594,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr1v9a9",
      "score": 2,
      "body": "blah blah blah.  something is always a monopoly needing breaking up",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1v9a9/",
      "created": 1728452071,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr1y1cz",
      "score": 0,
      "body": "Fuck I sold mine today, it’s going to look suspicious.",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1y1cz/",
      "created": 1728453938,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr2c1mg",
      "score": 1,
      "body": "Been saying Google has been a trap for a while. Thankfully I dumped it 2 years ago. \n\nFirst AI beating them down and now a possible DOJ breakup",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2c1mg/",
      "created": 1728464130,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr1nci7",
      "score": 1,
      "body": "Aight bois duck duck go is the way from hereon",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1nci7/",
      "created": 1728447167,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr1jhf5",
      "score": -5,
      "body": "Huh??? Google won’t even have 50% of the search market in a few years. They are no longer a monopoly",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1jhf5/",
      "created": 1728445175,
      "depth": 0,
      "replies": [
        {
          "id": "lr1mebo",
          "score": 7,
          "body": "How you so sure?",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1mebo/",
          "created": 1728446658,
          "depth": 1,
          "replies": [
            {
              "id": "lr1r7qb",
              "score": -8,
              "body": "Have you used Google lately? Even Bing is less annoying to use.",
              "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1r7qb/",
              "created": 1728449403,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lr1ppwe",
          "score": 1,
          "body": "?",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1ppwe/",
          "created": 1728448487,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr3iml9",
      "score": 0,
      "body": "GOOD",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr3iml9/",
      "created": 1728484794,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr2fxuc",
      "score": -1,
      "body": "Good!",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr2fxuc/",
      "created": 1728466970,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr5c9dp",
      "score": -1,
      "body": "good.  fuck Google and fuck Gemini",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr5c9dp/",
      "created": 1728505837,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr64zzy",
      "score": -1,
      "body": "Break it up. Break it up. \n\nThe potential benefits of breaking it up are hard to imagine now but we can look at how the bream up of other massive companies had all kinds of benefits in terms of competition and innovation down the line",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr64zzy/",
      "created": 1728515823,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr6tsf1",
      "score": -1,
      "body": "Meta, twitter, Microsoft, Walmart, Amazon.  All of them.   Break them all up.",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr6tsf1/",
      "created": 1728525211,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr1vawk",
      "score": -3,
      "body": "You must abide by what the all mighty \"Godgle\" says",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr1vawk/",
      "created": 1728452100,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr3aucc",
      "score": -4,
      "body": "Holding Google is foolish right now. So glad I dumped it 2 years ago. ",
      "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr3aucc/",
      "created": 1728482084,
      "depth": 0,
      "replies": [
        {
          "id": "lr635ow",
          "score": 2,
          "body": "Yeah everyone is gonna use AskJeeves now",
          "permalink": "/r/stocks/comments/1fzhd9r/bloomberg_us_says_its_weighing_google_breakup_as/lr635ow/",
          "created": 1728515120,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ],
  "stockTickers": {
    "post_summary": "The US Justice Department is considering breaking up Google as part of a monopoly case remedy.",
    "companies": [
      "Google",
      "Alphabet Inc.",
      "Microsoft Corp."
    ],
    "tickers": [
      "GOOGL",
      "MSFT"
    ],
    "main_ticker": [
      "GOOGL"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The US Justice Department considers recommending Google's breakup as a remedy for monopolization in the online search market.",
    "stock_recommendations": "The user does not recommend buying or selling any specific stocks.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "The sentiment is neutral as the post only discusses potential legal actions against Google without any stock recommendations.",
    "sentiment": "neutral"
  }
}