{
  "title": "Bayer shares drop 7% after U.S. court announces review of Monsanto case",
  "score": 279,
  "selftext": "Shares of German life sciences company Bayer fell nearly 7% on Wednesday, after a U.S. court said it would review a case alleging that exposure to products of the company’s Monsanto unit harmed individuals.\n\nThe Washington Supreme Court this week accepted a review of litigation against the German company over the impact of polychlorinated biphenyls (PCBs) exposure at the Sky Valley Education Center in Washington state, one of many related cases Bayer is fighting. Previously, an appeals court had overturned a $185 million award in the trial after finding flaws in the case in May, according to Reuters.\n\nBayer shares were 6.76% lower at 12:45 p.m. London time, putting the stock on course for its worst performance since March and extending a loss of 13% in the year to date. Shares had tumbled more than 30% last year amid challenges including ongoing litigation over the Monsanto unit and high net debt.\n\nThe company said in a statement Wednesday that there was “no basis for a different outcome on appeal,” and that it believed the Washington Court of Appeals’ decision had identified three errors in the case, including that testimony for the plaintiffs regarding PCB exposure lacked scientific validity.\n\nBayer argues the claims relate to industrial materials which Monsanto voluntarily ended manufacture of in 1977.\n\nBayer acquired U.S. agrichemical-maker Monsanto in 2018.\n\nThe deal has led to the company fighting myriad legal challenges in various U.S. courts over alleged negative health effects, including cancer, from exposure to Monsanto products including Roundup weed killer.\n\nAccording to Reuters, around 125,000 charges have been brought against the product in the U.S., more than half of which had been resolved following a $10.9 billion settlement in 2020.\n\nIn September, the company secured a legal win when the 3rd U.S. Circuit Court of Appeals in Philadelphia found in its favor in a claim that Monsanto violated state law by failing to add a cancer warning to the Roundup label.\n\nSource: https://www.cnbc.com/2024/10/09/bayer-shares-drop-after-us-court-announces-review-of-monsanto-case.html",
  "link_flair_text": null,
  "id": "1fzqto3",
  "num_comments": 48,
  "created_utc": 1728478828,
  "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/",
  "comments": [
    {
      "id": "lr3km7t",
      "score": 120,
      "body": "Paid 63 billion for Monsanto, Bayer market map now 29 billion. One of the worst acquisitions in corporate history. Used to work for this company (which was great) until Werner Baumann destroyed it.",
      "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr3km7t/",
      "created": 1728485456,
      "depth": 0,
      "replies": [
        {
          "id": "lr3maok",
          "score": 34,
          "body": "I could tell it was a shit deal after taking a single look, back when they decided to buy Monsanto. I really don't know what clown world these executives/board members are living in that made them think it was a good idea.",
          "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr3maok/",
          "created": 1728486007,
          "depth": 1,
          "replies": [
            {
              "id": "lr4dkt4",
              "score": 18,
              "body": "They're living in the world where they make lots of money from the deal regardless of whether it's any good or not, aka the real world",
              "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr4dkt4/",
              "created": 1728494779,
              "depth": 2,
              "replies": [
                {
                  "id": "lr7t832",
                  "score": 0,
                  "body": "Sounds like German economy.",
                  "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr7t832/",
                  "created": 1728542976,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lr64b5y",
              "score": 6,
              "body": "At the time there was major industry consolidation (with ChemChina having just acquired Syngenta) and Bayer didn't want to get left out. They grossly underestimated the negative image Monsanto had, and how that would impact glyphosate jury trials. As others pointed out, the claims are baseless and the jury awards are purely emotional. This is the part Bayer didn't anticipate.",
              "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr64b5y/",
              "created": 1728515563,
              "depth": 2,
              "replies": [
                {
                  "id": "lrfb2sx",
                  "score": 2,
                  "body": "If you knew how many people in the agriculture industry are currently dieing of cancer I don't think you would say these claims are baseless. There's millions of cases where people are just ignorant and don't realize roundup caused their cancer. This is the tip of the iceberg.",
                  "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lrfb2sx/",
                  "created": 1728660403,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lr3w55e",
          "score": 17,
          "body": "Bayer arguably bought the world's most unpopular company with this acqusition. Monsanto is and was widely hated for making and distributing glyphosate, spreading genetically engineered crops in the wild and then suing farmers if one of their seeds finds its way to one of their fields. And they had a ton of pending lawsuits.\n\nEven back then, I couldn't comprehend how Bayer found it to be a good idea to buy Monsanto.",
          "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr3w55e/",
          "created": 1728489209,
          "depth": 1,
          "replies": [
            {
              "id": "lr457lh",
              "score": 18,
              "body": "> suing farmers if one of their seeds finds its way to one of their fields\n\nNo this has never happened. It’s an often repeated myth/lie propagated by Monsanto haters. The most notable cases, Schmeiser and Bowman, they were _intentionally_ isolating and replanting patented seeds.",
              "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr457lh/",
              "created": 1728492122,
              "depth": 2,
              "replies": [
                {
                  "id": "lr7evam",
                  "score": 6,
                  "body": "You are correct. Everyone ever successfully sued for this by Monsanto knew what they were doing. \n\nMany people just have a very hard time accepting that it is legal to patent a living thing and get mad when it is enforced because of how absurd it sounds.",
                  "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr7evam/",
                  "created": 1728534478,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lr35g5f",
      "score": 43,
      "body": "Sounds like buying Monsanto was a poor purchase on their part",
      "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr35g5f/",
      "created": 1728480050,
      "depth": 0,
      "replies": [
        {
          "id": "lr4f2xt",
          "score": 15,
          "body": "It is toxic and it is slowing killing them. Ironically",
          "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr4f2xt/",
          "created": 1728495252,
          "depth": 1,
          "replies": [
            {
              "id": "lr4k0i7",
              "score": 8,
              "body": "Maybe they should sue, since it seems like Monsanto got this company cancer.",
              "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr4k0i7/",
              "created": 1728496822,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lr3shn0",
      "score": 28,
      "body": "Never understood why  on earth would they buy Monsanto? what secret voodoo math were they using?\n\nTurns out winning a CEO seat is more about connections and nothing to do with merit. What an idiot.",
      "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr3shn0/",
      "created": 1728488040,
      "depth": 0,
      "replies": [
        {
          "id": "lr5brht",
          "score": 9,
          "body": "Bayer's plan with the Monsanto deal was to dominate the agrochemical industry by combining their strengths. Monsanto was big in seeds and digital farming, while Bayer had expertise in chemical crop protection. Together, they’d cover all major markets—Bayer in Europe/Asia and Monsanto in the Americas.\n\nBayer’s CEO (Werner Baumann) also hoped Bayer’s good reputation could help fix Monsanto’s bad image. The idea was to use Bayer’s brand to soften the blow of Monsanto’s negative press while becoming the top player in agriculture. But it looks like some political spheres and influential people in the U.S. did not like that kind of intrusion into their food supply chain...",
          "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr5brht/",
          "created": 1728505681,
          "depth": 1,
          "replies": [
            {
              "id": "lr5tweg",
              "score": 4,
              "body": "It definitely seemed like the Monsanto US lawsuits only heated up after the acquisition by the German company, which I always found sus",
              "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr5tweg/",
              "created": 1728511663,
              "depth": 2,
              "replies": [
                {
                  "id": "lr7t4g2",
                  "score": 3,
                  "body": "I guess because when a company has a daddy with money, you are more interested in justice as winning may actually get you money.",
                  "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr7t4g2/",
                  "created": 1728542910,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lr7blnj",
                  "score": 5,
                  "body": "Sadly common and goes both ways. The EU loves to go after US companies.",
                  "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr7blnj/",
                  "created": 1728532823,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrb823i",
                      "score": 1,
                      "body": "For real",
                      "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lrb823i/",
                      "created": 1728593597,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr9jm1n",
              "score": 2,
              "body": "Monsanto created agent orange. They have always had law suits so nothing new there.  You may know more about this, but I thought their genetically modified seed program which means you have to use other Monsanto products were not allowed in the EU.\n\nThe Cargills along with I think 4 other companies own 70% of the worlds food production, irrc OXFAM published a few papers on this.",
              "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr9jm1n/",
              "created": 1728574142,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lr44r4a",
      "score": 7,
      "body": "If the current CEO manages to turn around the company it will be the stuff for textbooks. I was just thinking about how much money was burned and for what? No research, no discoveries, just lawyers getting fat. Ugh.",
      "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr44r4a/",
      "created": 1728491976,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr46un1",
      "score": 3,
      "body": "One of the bigger examples of the last decade or so of why \"sum of the parts\" cases are far from a sure thing + turnarounds definitely don't always happen (the big household name where everyone goes \"how could it get any cheaper?\" and then craters another 50%.)",
      "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr46un1/",
      "created": 1728492641,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr3f4lv",
      "score": 32,
      "body": "Mafia practices tbh \n\nNothing happened while Monsanto was US-owned. There is also no scientific basis for claiming that glyphosate is carcinogenic when used correctly. Of course you shouldn’t bathe in it, but you shouldn’t do that with any spraying agent. What century is the USA living in that there are still jury courts?",
      "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr3f4lv/",
      "created": 1728483596,
      "depth": 0,
      "replies": [
        {
          "id": "lr3u1s4",
          "score": 12,
          "body": "Only on reddit dot com can you find someone simping for Monsanto",
          "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr3u1s4/",
          "created": 1728488542,
          "depth": 1,
          "replies": [
            {
              "id": "lr9z80b",
              "score": 2,
              "body": "Go to any biology department at your local university. It isn't simping, it is science. \n\nScience would love to point at a company and show how awful it is. Scientists are consumers, they want safe food. The data are clear that glyphosate at standard dosages is safe. Now, if you increase the dosage to the equivalent of drinking a shot of roundup each morning, guess what, thats bad! That is literally what the scientists looking for effects in mice are forced to do, to get you those \"glyphosate causes alzhiemer's\" headlines. \n\nOf course, the general public, and the journalists of similar educational background, miss these details. The headline sells. Fine print ignored. \n\nBayer assumed that science and data would prevail, because they are scientsts and engineers. Then they ran into San Francisco ultraliberal anti-gmo fanatics in their juries. I like San Francisco! I am a liberal! But jesus christ these rulings have no scientific basis.",
              "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr9z80b/",
              "created": 1728579249,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr3w190",
              "score": 2,
              "body": "Clarence Thomas, that you?",
              "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr3w190/",
              "created": 1728489175,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lr4adtw",
          "score": 6,
          "body": ">when used correctly \n\nOh, you mean when people get consistent exposure over decades instead of drawing a bath full of pesticides? \n\nThere is no scientific basis for glyphosate's safety. Why does everyone else have to prove it is safe all while it gets to remain in the market? Shouldn't the burden of proof be with Bayer/Monsanto to prove it is safe before it goes to market?",
          "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr4adtw/",
          "created": 1728493763,
          "depth": 1,
          "replies": [
            {
              "id": "lr4mx9y",
              "score": 8,
              "body": "Around 600.000 to 750.000 tons of glyphosate are used each year, you'd think there was cancer all over the place where it was used. There isn't because it is very likely not carcinogenic or very little carcinogenic. American juries don't understand the nuances of scientific research. All they see is a guy that used it and happened to develop cancer.",
              "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr4mx9y/",
              "created": 1728497778,
              "depth": 2,
              "replies": [
                {
                  "id": "lr5zgnm",
                  "score": 1,
                  "body": "Cancer risk is growing, and while the cause can't be precisely pinpointed, I'm sure that pesticides used on insects are harmful to humans. We do happen to share DNA similarities with pests after all. The cumulative effects of small amounts of many different pesticides is very difficult to study. \n\nAnd also, agencies outside of the US have come to the conclusion that glyphosate is carcinogenic. Link: https://www.iarc.who.int/featured-news/media-centre-iarc-news-glyphosate/",
                  "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr5zgnm/",
                  "created": 1728513727,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr9901w",
                      "score": 2,
                      "body": "IARC doesn’t consider dose or context.\n\nIARC declared glyphosate as Category 2A (probable carcinogen), going against all other major scientific bodies. Interestingly, IARC [edited out evidence to the contrary](https://www.reuters.com/investigates/special-report/who-iarc-glyphosate/). Furthermore, it surfaced that one of their prominent consultants was [secretly working for](https://www.judicialhellholes.org/2019/05/14/california-courts-drop-science-at-the-door) a law firm suing over glyphosate.\n\nFirst link:\n\n> One effect of the changes to the draft, reviewed by Reuters in a comparison with the published report, was the removal of multiple scientists' conclusions that their studies had found no link between glyphosate and cancer in laboratory animals.\n> \n> In one instance, a fresh statistical analysis was inserted - effectively reversing the original finding of a study being reviewed by IARC.\n> In another, a sentence in the draft referenced a pathology report ordered by experts at the U.S. Environmental Protection Agency. It noted the report “firmly” and “unanimously” agreed that the “compound” – glyphosate – had not caused abnormal growths in the mice being studied. In the final published IARC monograph, this sentence had been deleted.\n\nSecond link:\n\n> Closer scrutiny of the IARC process reveals that it was advised by an “invited specialist,” Christopher Portier, in its work on glyphosate. At the same time Mr. Portier was working for the agency, he was being paid by the Environmental Defense Fund, an anti-pesticide group. Moreover, Mr. Portier received $160,000 from law firms suing over glyphosate. When asked about this potential conflict of interest, Mr. Portier initially claimed to be advising firms on other IARC-related lawsuits and not glyphosate litigation. He later acknowledged that his statement was wrong. It is also worth noting that Mr. Portier had no experience with glyphosate prior to his work on it for IARC.\n> \n> Following Mr. Portier’s arrival at IARC, the final glyphosate study was altered in at least 10 ways to remove or reverse conclusions finding no evidence of carcinogenicity. The agency removed multiple scientists’ conclusions that studies found no link between glyphosate and cancer in lab animals and statistical analyses of studies with negative findings were turned into positive ones. The determination that glyphosate was “probably carcinogenic” was based on “limited evidence” of carcinogenicity in humans and “sufficient evidence” in experimental animals.",
                      "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr9901w/",
                      "created": 1728570582,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr4as2f",
              "score": 6,
              "body": "Bayer literally did just that. Its just not possible to make spraying agents as safe as water.",
              "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr4as2f/",
              "created": 1728493889,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr5p5ab",
              "score": 2,
              "body": "They did bud. They followed the same protocols as anyone else. But lawyers lied about the cancer, the media wanted to sell papers and politicians used it to fear monger, and from there it took a life of its own thanks to dumb people. Basically what Trump and Vance did to Haitians.\n\nAll that being said, I do think they are liable for the spread of their chemical in their air when sprayed in large quantities outside. Though it may not cause cancer, no evidence that it does, its still an irritant, and probably not good on the ecology as a whole. Insects, like them or not, are important. Wiping them out from large areas just for your own gain, must be controlled tightly. Further I dont want to breathe insect poison. Being forced to breathe it should come with a penalty no different than f\\*ing smokers who light up around people.\n\nBut I dont think they should be liable for obvious things like wearing a flipping mask when bathing in chemicals. You dont need to be told this... if farmers told workers to work without breathing masks then they should be 100% liable for it.",
              "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr5p5ab/",
              "created": 1728510061,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lr688oi",
          "score": 1,
          "body": "this lawsuit isnt about glyphosate though. its about something that the school has been warned about since the 90s, and they just ignored it.",
          "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr688oi/",
          "created": 1728517034,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr5ty7f",
      "score": 1,
      "body": "Haw Haw - Nelson",
      "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr5ty7f/",
      "created": 1728511682,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr4kgca",
      "score": 1,
      "body": "This is old news",
      "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr4kgca/",
      "created": 1728496967,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr47p2s",
      "score": -6,
      "body": "I did nazi this coming.\n\nFor anyone curious, go check out how Bayer did their early research.",
      "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr47p2s/",
      "created": 1728492907,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr34nwm",
      "score": -52,
      "body": "Bayer can F right off. \n\nBayer=Monsanto = round up=glyphosate. Poisoning Americans since day one. Bayer is a German company so they couldn’t care less what happens to us Americans as long as profits hold up.",
      "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr34nwm/",
      "created": 1728479738,
      "depth": 0,
      "replies": [
        {
          "id": "lr38110",
          "score": 28,
          "body": "Covered up stuff no doubt to get a sale to an overseas company to avoid liabilities falling on US shareholders and US government as a back stop. \nUS rapidly turning into China.",
          "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr38110/",
          "created": 1728481041,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lr392oj",
          "score": 46,
          "body": "Yeah... Except that Monsanto was an American company until 2018 and has been selling glyphosate since 1974. Health risks had been known for a long time also, but until Bayer took over Monsanto it seems that no American court cared ... I wonder who is really concerned about the health of Americans as long as the profits (for domestic companies) are right...",
          "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr392oj/",
          "created": 1728481435,
          "depth": 1,
          "replies": [
            {
              "id": "lr3xwnq",
              "score": -3,
              "body": "Round up was shown to be carcinogenic in the 1980's. This storm has been brewing for decades and Bayer thought they could avoid liability. \n\nGlyphosate has been known to cause cancers for many years.\n\nPhthalates are know and have been known for years, to cause serious issues with fetal development and greatly impact male reproductive development.  In 1970 1 in 10,000 newborns had autism in 2020 the CDC study indicated it was now 1 in 36.\n\nPVC has now been shown to also disrupt the endocrine system.\n\nConsumers are nothing but a resource to be exploited like coal.  Your only value is how much you can consume.\n\nThings have been this way since forever.  The main problem now is that the FDA, USDA, Surgeon General are all captive. The CDC is highly restricted on what it can study and publish. The EPA has been completely neutered. \n\nThe moral hazard that is created by negative externalities in capitalism is a real problem and always has been. It is just one of several structural conflicts that makes capitalism unsustainable. \n\nIt is what it is.   We're here for only the blink of an eye in the history of the human race, so we make the best of it.",
              "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr3xwnq/",
              "created": 1728489775,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lr446ud",
          "score": 10,
          "body": "Lmao get your facts straight.  Monsanto all American.  American screwed the Germans twice again, once by selling them a bag of lawsuits and two buy over pricing Monsanto.  Selling Monsanto to Bayer was very patriotic, hence now the lawsuits come out.  The lobbying and political protection left when it became foreign owned.  Facts.",
          "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr446ud/",
          "created": 1728491797,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lr3wh9j",
          "score": 3,
          "body": ">Bayer is a German company so they couldn’t care less what happens to us Americans as long as profits hold up.\n\nGlyphosate is sold in Germany as well...",
          "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr3wh9j/",
          "created": 1728489318,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lr373vk",
          "score": 7,
          "body": "Ah yes, its about the americans",
          "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr373vk/",
          "created": 1728480692,
          "depth": 1,
          "replies": [
            {
              "id": "lr37yla",
              "score": 1,
              "body": "They either make it about themselves or race",
              "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr37yla/",
              "created": 1728481016,
              "depth": 2,
              "replies": [
                {
                  "id": "lr38pvf",
                  "score": -1,
                  "body": "It is known",
                  "permalink": "/r/stocks/comments/1fzqto3/bayer_shares_drop_7_after_us_court_announces/lr38pvf/",
                  "created": 1728481301,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}