{
  "title": "Samsung issues lengthy apology after disappointing profit guidance",
  "score": 52,
  "selftext": "https://www.cnbc.com/2024/10/08/samsung-issues-lengthy-apology-after-results-read-the-statement.html\n\n> Samsung Vice Chairman, Jun Young-hyun, who is the new head of the company’s Device Solutions Division, issued a rare apology Tuesday after the company posted disappointing third-quarter profit guidance. The leading memory chip manufacturer projected that its operating profit for the quarter ending in September will be approximately 9.10 trillion won, missing LSEG expectations. Analysts polled by LSEG expected an operating profit of 11.456 trillion Korean won ($7.7 billion) for the quarter ended Sept. 30. \n\n\nThis is the apology\n\n> Dear customers, investors, and employees who have always loved Samsung Electronics. Today, the management of Samsung Electronics would like to apologize to you first. We have caused concerns about our fundamental technological competitiveness and the future of the company due to our performance falling short of the market’s expectations. Many people are talking about Samsung’s crisis. We, who are leading the business, are responsible for all of this.\n\n> Customers, investors, and employees. Samsung, however, has always turned crises into opportunities, having a history of challenge, innovation, and overcoming. We will definitely make the dire situation we are currently facing an opportunity for a leap forward. Our management will take the lead in overcoming the crisis.\n\n> Above all, we will restore our fundamental technological competitiveness. Technology and quality are our lifeblood. It is Samsung Electronics’ pride that we can never compromise on. Rather than short-term solutions, we will secure fundamental competitiveness. Furthermore, I believe that only new technologies that do not exist in the world and perfect quality competitiveness are the only ways for Samsung Electronics to make a comeback.\n\n> Second, we will prepare for the future more thoroughly. We will rekindle our unique passion to pioneer the future without fear and to cling to our goals until the end and achieve them. We will re-arm ourselves with a challenging spirit to run toward a higher goal, rather than a defensive mindset to protect what we have.\n\n> Third, we will look again at our organizational culture and working methods and immediately fix what needs to be fixed. We will rebuild our traditional organizational culture of trust and communication. If we find problems in the field, we will expose them as they are and have fierce discussions to improve them. In particular, we will actively communicate with our investors whenever we have the opportunity.\n\n> Dear customers, investors, and employees.\n\n> If we fiercely challenge ourselves, we are confident that we can turn the current crisis into a new opportunity. Please give us your support and encouragement so that Samsung Electronics can once again demonstrate its strength.\n\n> Thank you.\n\n> Samsung Electronics Vice Chairman\n\n> Head of Device Solutions Division\n\n> Jun Young-hyun",
  "link_flair_text": "Company News",
  "id": "1fzs4sd",
  "num_comments": 10,
  "created_utc": 1728482515,
  "permalink": "/r/stocks/comments/1fzs4sd/samsung_issues_lengthy_apology_after/",
  "comments": [
    {
      "id": "lr3gzd4",
      "score": 55,
      "body": "Do apologies make stock go up?",
      "permalink": "/r/stocks/comments/1fzs4sd/samsung_issues_lengthy_apology_after/lr3gzd4/",
      "created": 1728484230,
      "depth": 0,
      "replies": [
        {
          "id": "lr3ivgv",
          "score": 29,
          "body": "This seems like a Level 1 apology from Yakuza Like a Dragon. A level 3 apology would have been better.",
          "permalink": "/r/stocks/comments/1fzs4sd/samsung_issues_lengthy_apology_after/lr3ivgv/",
          "created": 1728484876,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr3h4fm",
      "score": 20,
      "body": ">The so-called “crisis” caused the company to instigate a six-day workweek for executives earlier this year",
      "permalink": "/r/stocks/comments/1fzs4sd/samsung_issues_lengthy_apology_after/lr3h4fm/",
      "created": 1728484278,
      "depth": 0,
      "replies": [
        {
          "id": "lr4ljwn",
          "score": 8,
          "body": "That's tough, they might not even be responsible",
          "permalink": "/r/stocks/comments/1fzs4sd/samsung_issues_lengthy_apology_after/lr4ljwn/",
          "created": 1728497327,
          "depth": 1,
          "replies": [
            {
              "id": "lr818mw",
              "score": 1,
              "body": "How so?",
              "permalink": "/r/stocks/comments/1fzs4sd/samsung_issues_lengthy_apology_after/lr818mw/",
              "created": 1728548657,
              "depth": 2,
              "replies": [
                {
                  "id": "lr8z9ay",
                  "score": 2,
                  "body": "I should've been more specific. Some executives might've killed it in their respective area, but since the other ones didn't they'll have to work 6 days a week. Assuming their jobs are split up by departments.",
                  "permalink": "/r/stocks/comments/1fzs4sd/samsung_issues_lengthy_apology_after/lr8z9ay/",
                  "created": 1728567073,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lr5rlre",
          "score": 5,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1fzs4sd/samsung_issues_lengthy_apology_after/lr5rlre/",
          "created": 1728510911,
          "depth": 1,
          "replies": [
            {
              "id": "lr8yji4",
              "score": 3,
              "body": "The crisis caused by growing number of green lines appearing on phones.",
              "permalink": "/r/stocks/comments/1fzs4sd/samsung_issues_lengthy_apology_after/lr8yji4/",
              "created": 1728566797,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lr695ss",
      "score": 7,
      "body": "How do I bloody invest in this stock",
      "permalink": "/r/stocks/comments/1fzs4sd/samsung_issues_lengthy_apology_after/lr695ss/",
      "created": 1728517368,
      "depth": 0,
      "replies": [
        {
          "id": "lr6hzf3",
          "score": 5,
          "body": "Buy their GDR stock $SMSN.",
          "permalink": "/r/stocks/comments/1fzs4sd/samsung_issues_lengthy_apology_after/lr6hzf3/",
          "created": 1728520672,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}