{
  "title": "Boeing withdraws contract offer after talks with union end without a deal",
  "score": 349,
  "selftext": "Boeing withdrew a contract offer for 33,000 machinists who have been on strike since mid-September, and said further negotiations \"do not make sense at this point.\"\n\nThe machinists walked off the job on Sept. 13 after overwhelmingly rejecting a tentative labor deal, halting production of most of Boeing's aircraft, which are made in the Puget Sound area. Boeing later sweetened the offer, increasing pay raises, a ratification bonus and other improvements, which the union turned down, arguing that it was not negotiated.\n\nTalks again broke down this week, meaning the strike will continue. The stoppage will cost Boeing more than $1 billion per month, S&P Global Ratings said Tuesday as it issued a negative outlook for the aerospace giant's credit ratings.\n\nStephanie Pope, CEO of Boeing's commercial aircraft unit, said the company improved contract pay during talks this week but said the union didn't consider the proposals.\n\n\"Instead, the union made non-negotiable demands far in excess of what can be accepted if we are to remain competitive as a business,\" Pope said in a staff note.\n\nThe union, the International Association of Machinists and Aerospace Workers, said Tuesday that Boeing refused to improve wages, retirement plans and vacation or sick leave.\n\nhttps://www.cnbc.com/amp/2024/10/09/boeing-withdraws-contract-offer-after-talks-with-union-end-without-a-deal.html",
  "link_flair_text": "Company News",
  "id": "1fzsj6f",
  "num_comments": 263,
  "created_utc": 1728483585,
  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/",
  "comments": [
    {
      "id": "lr3i5r2",
      "score": 340,
      "body": "Man Boeing can’t get out of their own way",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr3i5r2/",
      "created": 1728484635,
      "depth": 0,
      "replies": [
        {
          "id": "lr3swr6",
          "score": 171,
          "body": "This has been a *master class* in head-up-the-ass management and bad-faith negotiations.",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr3swr6/",
          "created": 1728488177,
          "depth": 1,
          "replies": [
            {
              "id": "lr42gv3",
              "score": 111,
              "body": "This is what happens when you take the aerospace experienced executive level and replace it with an MBA carrying executive level.",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr42gv3/",
              "created": 1728491247,
              "depth": 2,
              "replies": [
                {
                  "id": "lr7k1sj",
                  "score": 15,
                  "body": "To be fair, the master class of bad faith negotiations has extended all the way back to McNerney, it’s only now that they see the consequences.  The past CEOs have all moved to retirement with golden parachutes, but the worker has had a lifetime of embitterment",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7k1sj/",
                  "created": 1728537275,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lr646fi",
              "score": -31,
              "body": "More like a masterclass in these machinists speeding up Boeing's plans to outsource the jobs.",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr646fi/",
              "created": 1728515512,
              "depth": 2,
              "replies": [
                {
                  "id": "lr8mdft",
                  "score": 2,
                  "body": "The outsourced machinists *Need* training... Who's gonna do that?",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr8mdft/",
                  "created": 1728561679,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lr4iv9f",
          "score": 23,
          "body": "This is obviously the plan.   Gut the company.    Restart with slaves",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4iv9f/",
          "created": 1728496456,
          "depth": 1,
          "replies": [
            {
              "id": "lr4ooh3",
              "score": 42,
              "body": "If and when that happens, you know the only people applying will be severely underqualified which will just worsen all of the problems they are already dealing with",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4ooh3/",
              "created": 1728498349,
              "depth": 2,
              "replies": [
                {
                  "id": "lr50gql",
                  "score": -12,
                  "body": "It won't matter because customers will have the choice of buying a bad plane that crashes from time to time or nothing. The government has already put protectionist tarrifs on other aircraft makers to help Boeing and will go further. I wouldn't be suprised to see a jones act for domestic flights.",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr50gql/",
                  "created": 1728502113,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr6ki9r",
                      "score": 12,
                      "body": "And then airbus will crush them in the foreign market.",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6ki9r/",
                      "created": 1728521619,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr8mpw8",
                          "score": 1,
                          "body": "They also have problems,  just not in the news because they're not self inflicted",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr8mpw8/",
                          "created": 1728561842,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr6feb7",
              "score": 4,
              "body": "doesn't work like that and is not a viable strategy in a highly regulated industry. no matter how much you want this to be true because Boeing management is shitty, they're not so stupid as to attempt what you're thinking they are",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6feb7/",
              "created": 1728519707,
              "depth": 2,
              "replies": [
                {
                  "id": "lr8r477",
                  "score": 0,
                  "body": "No it appears they are not negotiating in good faith.   I don't want this or give a fuck.   Infact I would benefit from them going back to work",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr8r477/",
                  "created": 1728563806,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr8sbx0",
                      "score": 0,
                      "body": "So? Negotiating in bad faith doesn't mean they're trying to replace everyone with wage slaves. \n\nThey've been caught out by their own ineptitude; it may be true that they can't pay what the union is demanding because it'll make the company unprofitable. An unprofitable company can't operate for long. It's management's fault for not recognizing this situation sooner and for not having a mitigation plan. \n\nHowever..Unprofitable is Unprofitable. If it's true that the wage increases being asked for by the union would make the company unprofitable, something will have to give. Layoffs, sale of a division of the company, injection of funds from somewhere etc. The nuclear option is bankruptcy.",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr8sbx0/",
                      "created": 1728564320,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lr4e5ma",
      "score": 80,
      "body": "What's Boeing's plan? Move everything to a non-union state? Or just hope the union buckles soon? I just don't see where this one is going.",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4e5ma/",
      "created": 1728494960,
      "depth": 0,
      "replies": [
        {
          "id": "lr5dbz6",
          "score": 35,
          "body": "I posted this before because I am not sure how nobody sees it coming \n\nNext move is Boeing will announce they are posting every mechanics job since it can prove they negotiated in good faith to the national labor board \n\nUsually, as seen with the Heaven hill strike, that breaks the strike. Union will request that the pulled offer gets back in the table and they sign \n\nUnions are powerful. They can cause a company a lot of pain to enact change. But it’s still a game of chicken. If the union inflicts so much pain that the company calls their bluff and says “fuck it” then it’s usually the employees who lose with things like plants closing all together or jobs being replaced",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5dbz6/",
          "created": 1728506179,
          "depth": 1,
          "replies": [
            {
              "id": "lr5hu37",
              "score": 98,
              "body": "Goodluck finding 33,000 machinist ready to break a picket line. Breaking a picket line as a scab is not as easy as “just post the recs people will come”. These are highly specialized workers and they know it.",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5hu37/",
              "created": 1728507619,
              "depth": 2,
              "replies": [
                {
                  "id": "lr6xfmr",
                  "score": 28,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6xfmr/",
                  "created": 1728526638,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr9y1h3",
                      "score": 6,
                      "body": "Especially with Boeing not offering great jobs in comparison to the industry standard. The reason the company doesn’t want to negotiate is due to them wanting to stay below industry standard salary wise. Finding 33k machinists to work in their plants would be hard by itself, but doing so when they most likely earn more at their current job is insane.",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr9y1h3/",
                      "created": 1728578871,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lr7himd",
                  "score": -6,
                  "body": "You don't need 33,000. You need a few, and then the union members with bad financial management will break and apply, and that will cause a cascade. Personally, if I were Boeing management, I would just be done with the union and say we're hiring non union now. Unions aren't what they used to be and neither are people.",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7himd/",
                  "created": 1728535876,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr7uerv",
                      "score": 8,
                      "body": ">Unions aren't what they used to be and neither are people.\n\nNeither are Boeing's planes.",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7uerv/",
                      "created": 1728543770,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lr85hxh",
                      "score": 2,
                      "body": "You talk like someone with no experience in the matter",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr85hxh/",
                      "created": 1728551713,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lr5u1p0",
                  "score": -24,
                  "body": "They don’t need to fill them all. They need to fill the first couple. You get scabs to start running the factory and then you gradually start replacing the scabs with full time hires \n\nStrikes fold fast when people realize they are playing chicken with their jobs.",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5u1p0/",
                  "created": 1728511717,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr6d8bv",
                      "score": 9,
                      "body": "HA! With the amount of work that Boeing machinist must turnout every month there's no way in hell they can maintain business without an absurd number of skilled new hires. And even then every single part would be very, very, late if even completed at all. You have no clue of the process even the most insignificant parts must go through let alone the complex ones",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6d8bv/",
                      "created": 1728518890,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lr62fqv",
                      "score": 0,
                      "body": "Found the Boeing bot.",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr62fqv/",
                      "created": 1728514843,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr6i38c",
                          "score": -1,
                          "body": "lol ok. I’m just letting you know what will happen. Look at the heaven hill strike. This is playing out the exact same way. I don’t care about downvotes, this is most likely BA next move. \n\nBut I’ll happily throw a comment on here in a week when we hear that BA is making an announcement that they are posting strikers jobs",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6i38c/",
                          "created": 1728520712,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lr6juin",
                              "score": 11,
                              "body": "The heaven hill strike was a little over 400 distiller employees.  Not 33,000 highly skilled machinists you knot-head.  ",
                              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6juin/",
                              "created": 1728521367,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lr6lrqu",
                                  "score": 5,
                                  "body": "Ok, we will see what happens next. I won’t even say I told you so\n\nI’m not a BA employee nor a supporter, I just make logical conclusions based on what is actually happening. Take your emotion out of this and I think you’ll see the next step is obvious",
                                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6lrqu/",
                                  "created": 1728522100,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lr6nxi3",
                                      "score": 9,
                                      "body": "It has nothing to do with emotions.  You are making false equivocations and passing them off as some profound insight.  \n\nA small strike of 400+ brewery workers is nothing like a major strike of 33,000 highly skilled machinists who are the lynchpin in a multi billion dollar aviation company.\n\nIf you think there is a comparison here then I really don’t know if you have an honest point or are just a troll.",
                                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6nxi3/",
                                      "created": 1728522937,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lr6z5of",
                                          "score": 0,
                                          "body": "RemindMe! 14 Days",
                                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6z5of/",
                                          "created": 1728527327,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "lr75pmb",
                                      "score": 1,
                                      "body": "I don’t think you’ve ever seen a picket line. Crossing that as a scab everyday is not easy and this is not a small strike.",
                                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr75pmb/",
                                      "created": 1728530098,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "lr7md8p",
                                      "score": 1,
                                      "body": "But you are making logic mistakes comparing two events with vastly different circumstances.\n\nBoeing can't function with just a few mechanics, it would take them a very long time to even hire the first group of say 100-200, train them and start production.\n\nThese mechanics were trained for very specific jobs to be efficient at that job, with a smaller group they will have to different jobs throughout the day and it will have a big impact on efficiency.\n\nIt is a waiting game but when union is this size, they kind of know Boeing needs them if they don't want to start cancelling orders. So the big question is if Boeing can afford to slow production drastically in 2025 or not.",
                                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7md8p/",
                                      "created": 1728538626,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "lr7hsva",
                                  "score": 1,
                                  "body": "Those machinist have bills to pay too. You can find 500 of them to hire after it's been a couple months. Especially if you offer higher pay than they were making under the union, which is usually possible due to no union dues and no seniority structure.",
                                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7hsva/",
                                  "created": 1728536029,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lr75gea",
                              "score": 2,
                              "body": "What's stopping people from flooding the listings with fake applications? Union members, bears looking to short boeing, and union sympathizers alike.\n\nThey can play dirty as well.",
                              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr75gea/",
                              "created": 1728529985,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lr88n65",
                                  "score": 1,
                                  "body": "If someone is wiling to link me a boeing job posting i might unironically make a script to create fake applications, i did something similar to pollute elon musk's pac unethical data collection website",
                                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr88n65/",
                                  "created": 1728553915,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "lr7hvxc",
                                  "score": 1,
                                  "body": "Unions are regulated and they'll face an immense fine over that type of behavior, often large enough to completely destroy the union.",
                                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7hvxc/",
                                  "created": 1728536075,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lr8dsek",
                                      "score": 1,
                                      "body": "Yeah, despite this being the most pro-union administration ever and the NLB being hopelessly one sided in union favor, on paper the NLB does have to protect both an employees right to organize AND and employees right to not organize \n\nIf a union did this they would cop a big fine. Companies can sue unions as well",
                                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr8dsek/",
                                      "created": 1728557195,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "lr9p7s4",
                              "score": 1,
                              "body": "Look at UPS… threatening of a strike and they folded with 99% of demands. Got to the point where shareholders were like don’t let em strike.",
                              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr9p7s4/",
                              "created": 1728575975,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lr9yuak",
                                  "score": 1,
                                  "body": "RemindMe! 14 Days",
                                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr9yuak/",
                                  "created": 1728579127,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lr5jj1p",
                  "score": -30,
                  "body": "People need jobs and don't care about the unions they care about their own paycheck. Boeing will have no problem hiring people to take their place.",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5jj1p/",
                  "created": 1728508174,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr6bxld",
                      "score": 23,
                      "body": "I'm a union machinist (not a Boeing one) . We care about the picket lines. Even if I wasn't in a union I'd still care as well as a many of the machinist I work with. As said before, we are not walmart checkout cashiers, we are a specialized profession. We know our worth. But hey, that's just me. I dont doubt many will cross the picket lines, but anywhere close to 33,000 machinist?  Not likely",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6bxld/",
                      "created": 1728518402,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lr5onox",
                      "score": 32,
                      "body": "If it was that simple they’d have done it already. Heck, if it were that simple the strike would have never even happened because the employees would know how replaceable they were…",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5onox/",
                      "created": 1728509894,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr65zk8",
              "score": 33,
              "body": "good luck, aerospace is considered \"restricted access\" so replacing jobs is going to be hard from the get go.",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr65zk8/",
              "created": 1728516190,
              "depth": 2,
              "replies": [
                {
                  "id": "lr6ijh3",
                  "score": 29,
                  "body": "I’m just stating what will happen. This is literally exactly how the Heaven hill strike played out and for some reason everyone on this sub has surprise pikachu face \n\nFirst step negotiate. Next step make a best and final offer to employees. Then union gets pissy and refuses to take it. Company then says that they are pulling the offer and done negotiating\n\nThat’s the step we are at. Company has met the labor board requirements of negotiating in good faith. BA can now legally replace the workers. Whether they replace the workers or make an announcement that they are closing the plant, it’s about scaring workers and usually this ends the strike",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6ijh3/",
                  "created": 1728520881,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrg0e57",
                      "score": 4,
                      "body": "The heaven hill strike was 420 workers at a distillery. This is 33k mechanics at an aerospace company. I would be hesitant to draw too many comparisons here",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lrg0e57/",
                      "created": 1728668618,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lr75j4b",
                      "score": 11,
                      "body": "I think a lot of people are just pissed hearing this and just being emotional about it. I honestly see this playing out like you said Unfortunately. I hope we are both wrong.",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr75j4b/",
                      "created": 1728530019,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr7i0jy",
                          "score": 8,
                          "body": "Reddit loves unions even though in practice many are run like mobs. They don't like hearing that this union can be dissolved soon.",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7i0jy/",
                          "created": 1728536142,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lr7v9wo",
                      "score": 5,
                      "body": "While this certainly can and might happen, most strikes are resolved by other means. The employer can just return to the negotiating table with a new improved offer or clandestine negotiations can take place trying to save everyone’s face.\n\nThe problem when comparing Boeing to distillers is that replacing 30.000 plus machinists is simply impossible. These are highly trained and often specifically licensed people doing work that needs months if not years of supervised instruction. \n\nTherefore the “chicken” game - while not impossible for Boeing - is much harder to pull off. Maybe they’ll try for some of the less important, less complex jobs to split the union members…",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7v9wo/",
                      "created": 1728544366,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr8sx1a",
                          "score": 3,
                          "body": "They don't need to replace all 30k machinists to get back to operations. They can cut certain functions for a bit (R&D), and focus on production only at a reduced output with a smaller work force to hobble along. Eventually, 30k machinists will need to find another job, and some will crack and go back.",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr8sx1a/",
                          "created": 1728564564,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lr9x9h9",
                              "score": 1,
                              "body": "Even at reduced numbers (which will not be sufficient to fulfill necessary production which was lagging behind even before) you need a lot of critical positions. Building aircraft isn’t like producing easily manufactured mass products. \n\nRecruiting and training a few thousand people - and to even get a production line going and having the inspections and checks in place that will be a minimum - will cost hundreds of millions of dollars and take months if not years. \n\nWorkers with unique skills have better leverage than the company. Hence they can use said leverage.",
                              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr9x9h9/",
                              "created": 1728578620,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lrg0icw",
              "score": 3,
              "body": "The heaven hill strike was 420 workers at a distillery. This is 33k mechanics at an aerospace company. I would be hesitant to draw too many comparisons here",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lrg0icw/",
              "created": 1728668656,
              "depth": 2,
              "replies": [
                {
                  "id": "lrg0mkd",
                  "score": 1,
                  "body": "RemindMe! 14 Days",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lrg0mkd/",
                  "created": 1728668694,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lr4wuvn",
          "score": -9,
          "body": "They could very well do this.  They have significant operations in Charleston, SC, a deep republican state without any unions.",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4wuvn/",
          "created": 1728500960,
          "depth": 1,
          "replies": [
            {
              "id": "lr5yf7j",
              "score": 14,
              "body": "They have wanted to do this for a long time. The quality of the work coming out of the SC facility has made it very clear that they aren't capable of doing a full shift to the South.",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5yf7j/",
              "created": 1728513340,
              "depth": 2,
              "replies": [
                {
                  "id": "lr61jhb",
                  "score": 2,
                  "body": "They shut down the Everett 787 line and moved all of 787 production there.  If Charleston's work was that shoddy then that wouldn't have happened.  It's not like there's some shortage of space in Everett.",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr61jhb/",
                  "created": 1728514509,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr6msp3",
                      "score": 2,
                      "body": "Dunno what to tell you. I'm in Seattle, and it seems pretty clear that a lot of Boeing decisions in the last decade have been purely based on accountancy and with a view towards weakening the unions in Puget Sound. I would not take the decision to move the 787 line down there as a demonstration of quality.\n\nhttps://www.seattletimes.com/business/boeing-aerospace/boeing-finds-more-787-quality-defects-broadens-inspections/\n\nhttps://www.reuters.com/business/aerospace-defense/boeing-investigates-quality-problem-undelivered-787s-sources-say-2024-06-13/",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6msp3/",
                      "created": 1728522498,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lr7lv98",
                      "score": 0,
                      "body": "And the 787 program has been so heavily plagued by quality control and production issues that it's never made a profit. \n\nWages for machinists are a miniscule part of Boeing's costs. Most of their costs are sunk up front, and must be recovered by building planes quickly. Cutting salaries in half won't do any good if they can't build any planes.",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7lv98/",
                      "created": 1728538329,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr57oz4",
              "score": 32,
              "body": "They very much can’t do this.\n\nThat’s not a split second decision. That’s a multi billion dollar decisions dependent HEAVILY on having capitol/credit available for such a move.\n\nThey have neither.",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr57oz4/",
              "created": 1728504392,
              "depth": 2,
              "replies": [
                {
                  "id": "lr5dj0k",
                  "score": -3,
                  "body": "Do you know how multi billion dollar decisions get made quickly? \n\nStrikes that cost a billion dollars a month",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5dj0k/",
                  "created": 1728506242,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr7ei25",
                      "score": 0,
                      "body": "If you talk about a move apparently it's automatic down voting haha.  Entertaining since I was just answering someone's question. ",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7ei25/",
                      "created": 1728534286,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr7jf75",
                          "score": 0,
                          "body": "Because your response was incorrect and asinine. It’s the level of thinking you’d expect from a 4 year old.",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7jf75/",
                          "created": 1728536920,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr61cpo",
              "score": 3,
              "body": "Not that simple. It’s not like they’re moving a T-shirt company. There is an insane amount of assets that would need to be moved. You can’t just wheel an aircraft manufacturer plant to another state.\n\nWho are they going to hire when they get there?",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr61cpo/",
              "created": 1728514438,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lr3kfc5",
      "score": 151,
      "body": "At this point, a drunk gorilla in heat with access to swords would be better than the current leadership at Boeing lol",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr3kfc5/",
      "created": 1728485392,
      "depth": 0,
      "replies": [
        {
          "id": "lr4cjw3",
          "score": 26,
          "body": "Ok, I'm interested. Why swords? I would love to see a gorilla with a sword take over Boeing though",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4cjw3/",
          "created": 1728494455,
          "depth": 1,
          "replies": [
            {
              "id": "lr4fky0",
              "score": 9,
              "body": "I was always under the impression that an ape with access to weaponry would be always be difficult to handle... Though with the gorilla you know what to expect 😂😂",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4fky0/",
              "created": 1728495412,
              "depth": 2,
              "replies": [
                {
                  "id": "lr4g5ot",
                  "score": 4,
                  "body": "Netflix needs to make this happen",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4g5ot/",
                  "created": 1728495596,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr4ow2w",
                      "score": 5,
                      "body": "It'll just be cancelled after s1 :/",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4ow2w/",
                      "created": 1728498418,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lr650hx",
                      "score": 2,
                      "body": "They already made several movies about it called planet of the apes",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr650hx/",
                      "created": 1728515828,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr6t71p",
                          "score": 3,
                          "body": "Those had guns... I think \n\nWe want swords",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6t71p/",
                          "created": 1728524982,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lr8bu8k",
                              "score": 2,
                              "body": "Wukong film ✔️",
                              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr8bu8k/",
                              "created": 1728556010,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr6co9t",
              "score": 1,
              "body": "Pretty sure they  could do it with a dagger too.",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6co9t/",
              "created": 1728518682,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrcvxqy",
              "score": 1,
              "body": "Me too",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lrcvxqy/",
              "created": 1728615887,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lr4fubo",
          "score": 8,
          "body": "Why not a drunk gorilla waving a giant banana...",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4fubo/",
          "created": 1728495495,
          "depth": 1,
          "replies": [
            {
              "id": "lr54nxh",
              "score": 3,
              "body": "You could just paint the sword yellow.",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr54nxh/",
              "created": 1728503447,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr6qvpc",
              "score": 1,
              "body": "Can we leave politics out of this please?",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6qvpc/",
              "created": 1728524087,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lr5fq5t",
          "score": 1,
          "body": "i did just watch the new planet of the apes they’re not far off",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5fq5t/",
          "created": 1728506949,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lr8l4ia",
          "score": 1,
          "body": "A nutless monkey could do their job. No, seriously, a nutless monkey.",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr8l4ia/",
          "created": 1728561082,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr3kdu4",
      "score": 81,
      "body": "SEC needs to look into BA trades. They’ve slowed trading rates by 1000%",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr3kdu4/",
      "created": 1728485377,
      "depth": 0,
      "replies": [
        {
          "id": "lrbqu8f",
          "score": 1,
          "body": "I’m not quite sure what you’re insinuating but I’ve had two occasions where I was sure I bought shares and they never went thru I guess? IDK for sure but they were both at 52week lows and I have zero record of any transactions. Just the shares I was already holding…",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lrbqu8f/",
          "created": 1728600230,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr7qme0",
      "score": 6,
      "body": "Is Reddit pro union or anti union this week? Lmao",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7qme0/",
      "created": 1728541281,
      "depth": 0,
      "replies": [
        {
          "id": "lr8dp23",
          "score": 4,
          "body": "yes",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr8dp23/",
          "created": 1728557141,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr7oi2h",
      "score": 4,
      "body": "I wonder how long until they go bankrupt...",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7oi2h/",
      "created": 1728539934,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr44f8x",
      "score": 95,
      "body": "There last CEO made 32.77 million dollars in 2023 let that sink in! But sorry we can’t pay the people who actually do the work",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr44f8x/",
      "created": 1728491871,
      "depth": 0,
      "replies": [
        {
          "id": "lr4eqm2",
          "score": 69,
          "body": "This isn't a uniquely Boeing problem.",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4eqm2/",
          "created": 1728495144,
          "depth": 1,
          "replies": [
            {
              "id": "lratma5",
              "score": 1,
              "body": "i'm generally not pro-union\n\nBut in this case all of Boeing's troubles are due to execs/MBAs with short-term thinking, choosing quarterly profits over the viability of the company. Hundreds of people have died and thousands of family members have had their lives changed forever due to Boeing's willful negligence\n\nThey owe all their employees, both blue and white collar.",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lratma5/",
              "created": 1728589029,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lr7i3j1",
          "score": 8,
          "body": "Union wants way more than 30 million dollars",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7i3j1/",
          "created": 1728536187,
          "depth": 1,
          "replies": [
            {
              "id": "lra1w6c",
              "score": 1,
              "body": "Then have the suits build the planes",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lra1w6c/",
              "created": 1728580104,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lr479hy",
          "score": 26,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr479hy/",
          "created": 1728492771,
          "depth": 1,
          "replies": [
            {
              "id": "lr5y8iv",
              "score": 20,
              "body": "only half of that because the CEO got 33 in stock (vest over multiple years), it's now worth around half of the original value.",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5y8iv/",
              "created": 1728513269,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr76mp6",
              "score": 6,
              "body": "You could split the difference in other ways.\n\nTop 10% gets $1910\n\nTop 1% gets $19,100\n\nOr you could buy three CEOs at 10m a piece. Triple productivity!",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr76mp6/",
              "created": 1728530505,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr54wag",
              "score": 22,
              "body": "Everyone hated that this was right",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr54wag/",
              "created": 1728503519,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr4c8fi",
              "score": 0,
              "body": "Sounds great.",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4c8fi/",
              "created": 1728494353,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lr4am9i",
              "score": -12,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4am9i/",
              "created": 1728493838,
              "depth": 2,
              "replies": [
                {
                  "id": "lr4d3bb",
                  "score": 22,
                  "body": "$32,770,000 divided by 170,000 employees is $192.76 per employee.",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4d3bb/",
                  "created": 1728494626,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lr4vqaj",
          "score": -18,
          "body": "Unions keep shit people and yet shit people expect unlimited wage increases",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4vqaj/",
          "created": 1728500600,
          "depth": 1,
          "replies": [
            {
              "id": "lr50y33",
              "score": 12,
              "body": "Expecting wage increases that keep up with inflation isn’t unlimited",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr50y33/",
              "created": 1728502269,
              "depth": 2,
              "replies": [
                {
                  "id": "lr5160b",
                  "score": -8,
                  "body": "40 plus percent every 4 years plus yes vote bonus is bullshiat",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5160b/",
                  "created": 1728502342,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr52zoh",
                      "score": 18,
                      "body": "It’s actually 30% over 4 years, while union asked 40% over 3 years. \n\n40% over 3 years considers the inflation raises that were forgotten / inadequate during the previous contract. \n\nhttps://www.fox13seattle.com/news/boeing-strike-update-contract-offer-withdrawn.amp\n\nThe CEO’s pay in 2016 was $15 million, now the CEO’s pay is $33 million. For what bloody joy did the pay double? And 40% over 3 years is much less than that. \n\nhttps://theblogbyjavier.com/2017/07/03/boeing-vs-airbus-ceo-compensation-2016/",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr52zoh/",
                      "created": 1728502920,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lr6ddmy",
          "score": 0,
          "body": "This is exactly why they are striking. They just want their fair share.",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6ddmy/",
          "created": 1728518947,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr470q4",
      "score": 32,
      "body": "Boeing is such a shit company. they live off taxpayers and pay their executives massive bonuses to be fucking idiots. they wouldnt be in this position if they didn't royally fuck the union. as a company Boeing completely lacks any foresight.",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr470q4/",
      "created": 1728492694,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr3rnry",
      "score": 45,
      "body": ".",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr3rnry/",
      "created": 1728487770,
      "depth": 0,
      "replies": [
        {
          "id": "lr3s77k",
          "score": 43,
          "body": "They’re one of two legitimate competitors in a crucial market. They know if they fail they’re going to get a fat check to stay in business from taxpayers",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr3s77k/",
          "created": 1728487946,
          "depth": 1,
          "replies": [
            {
              "id": "lr3tio4",
              "score": 42,
              "body": ".",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr3tio4/",
              "created": 1728488372,
              "depth": 2,
              "replies": [
                {
                  "id": "lr3v6a3",
                  "score": 6,
                  "body": "Losing the incompetent managers will help Boeing.",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr3v6a3/",
                  "created": 1728488902,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr3vh9s",
                      "score": 43,
                      "body": ".",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr3vh9s/",
                      "created": 1728488999,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lr62axh",
          "score": 5,
          "body": "Sometimes the winningest strategy is to not play the game.",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr62axh/",
          "created": 1728514793,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lr4fcqj",
          "score": -11,
          "body": "Not making planes at all *for some time until the union breaks or replacement workers are hired and trained*.\n\nYou're acting like they'll never build a plane again. That's just not the case.",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4fcqj/",
          "created": 1728495339,
          "depth": 1,
          "replies": [
            {
              "id": "lr4ozgs",
              "score": 16,
              "body": "Who trains the replacement workers?  Some people are utterly delusional about the skills and EXPERIENCE required to build aircraft.",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4ozgs/",
              "created": 1728498447,
              "depth": 2,
              "replies": [
                {
                  "id": "lr4vrq0",
                  "score": -9,
                  "body": ">Who trains the replacement workers\n\nEngineers. You think that they don't have any way to train new workers except via the old workers doing so directly?",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4vrq0/",
                  "created": 1728500613,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr4xixd",
                      "score": 13,
                      "body": "😂 The same engineers come to the workers when they are drawing up processes.  They may know the process but they have no clue about the job.  Delusional to the real way these aircraft are built.  (27 years shop floor at a major aerospace company  is my position)",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4xixd/",
                      "created": 1728501172,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr4ycsi",
                          "score": -9,
                          "body": "Oh, so there are written procedures and processes? \n\nWow! Training will be impossible! No way Boeing can do that. \n\n>(27 years shop floor at a major aerospace company is my position)\n\nCool, so unbiased totally.",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4ycsi/",
                          "created": 1728501439,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lr4yxtq",
                              "score": 9,
                              "body": "I declared to be transparent.  But also to highlight I understand the process intimately.  Not at Boeing though.  \nBoeings rival have been struggling post pandemic as well, and one of the reasons is they pensioned off a lot of experience, then when the bounce back started they had to get a lot of inexperienced workers in.  They still had a majority that knew the jobs, yet have still had major delays and quality issues as a result of the new workers not knowing the jobs. You think they’ve been getting taught by engineers or existing skilled experienced workers?",
                              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4yxtq/",
                              "created": 1728501625,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr4g1c6",
              "score": 12,
              "body": ".",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4g1c6/",
              "created": 1728495557,
              "depth": 2,
              "replies": [
                {
                  "id": "lr4k5uw",
                  "score": 4,
                  "body": ">At a billion dollar operating loss every month? It’s extremely likely.\n\nHow long do you think union members can hold out? How many months of savings do you think they have?\n\nUnion labor costs are ~$5 B annually. The union is asking for 10% more than Boeing offered (30% vs 40%) and is asking for restoration of pension plans. Pension plans, according to the BLS, are about 2.6x more expensive for companies than 401k plans for union workers. Also according to the BLS, average burden rate for 401k plans is ~3.5%, so switching to a pension plan amounts to an additional compensation increase of ~5.6%. In effect, the union is asking for a raise 15.6% higher than Boeing is offering. That's about $780 million per year after the end of the current contract. So, assuming that it takes place somewhat ratably, that's ~200 million additional costs year 1, 400 mm year two, 600 mm year 3, 780 mm year 4, and then 780 mm in perpetuity. NPV is about $1.6 B for the first 4 years, then the perpetual $780 million after that is worth ~$7.9 billion. So it's worth about 9.5 months of no planes to negotiate union members from their current position to what Boeing just offered.\n\n>where Boeing pays less to its machinists than any other company\n\nMachinists at Boeing are making about 50% more than [the national average for machinists](https://www.bls.gov/ooh/production/machinists-and-tool-and-die-makers.htm), not including the value of their benefits. Where are you getting that they're paying less to machinists than any other company?",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4k5uw/",
                  "created": 1728496871,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lr6pc5t",
      "score": 3,
      "body": "If it includes a Ratification Bonus the contract must not be that good.",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6pc5t/",
      "created": 1728523483,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr504z4",
      "score": 7,
      "body": "That’s frustrating. I was ready to put money if they fixed this. Now, don’t know which way the stock will go.",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr504z4/",
      "created": 1728502007,
      "depth": 0,
      "replies": [
        {
          "id": "lr5fzue",
          "score": 22,
          "body": "Down. The stock goes down if they have a billion dollar monthly burn.",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5fzue/",
          "created": 1728507035,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr3sceg",
      "score": 36,
      "body": "Man, I thought the last offer they made was pretty good. Asking for a pension just isn't feasible these days. The 401k package they offered is a solid one. I’m curious to see what Boeing’s next move will be",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr3sceg/",
      "created": 1728487993,
      "depth": 0,
      "replies": [
        {
          "id": "lr3unsu",
          "score": 43,
          "body": "I mean if not taking any raises for a decade and giving 30% raise for 20 years is a \"solid offer\" then yes.",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr3unsu/",
          "created": 1728488738,
          "depth": 1,
          "replies": [
            {
              "id": "lr4dpl4",
              "score": 29,
              "body": ">Boeing said the new offer would boost average annual pay for machinists from $75,608 today to $111,155 in four years.\n\n[https://www.barrons.com/news/boeing-withdraws-offer-to-iam-union-suspends-strike-negotiations-statement-e4f63298](https://www.barrons.com/news/boeing-withdraws-offer-to-iam-union-suspends-strike-negotiations-statement-e4f63298)\n\n  \nThis isn't a 20 year contract.",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4dpl4/",
              "created": 1728494820,
              "depth": 2,
              "replies": [
                {
                  "id": "lr4fise",
                  "score": 15,
                  "body": "Jesus that's damn good like a 10 percent raise per year.",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4fise/",
                  "created": 1728495393,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr4j8kn",
                      "score": 6,
                      "body": "no it's not. and people lost a lot of money in the past 5 years where the raises were like 2% per year (if lucky), while the inflation was through the roof. this is about repairing the past.",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4j8kn/",
                      "created": 1728496573,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr88v8z",
                          "score": 3,
                          "body": "That’s not a Boeing problem. That’s an American one",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr88v8z/",
                          "created": 1728554065,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lr4kfbf",
                          "score": 11,
                          "body": "So what you are saying is that let's average out the cumulative 9 yrs getting a 50% raise over 9yrs isn't enough? The last 5yrs is 10% the next 4 is 40 every nine years a 50% raise is pretty good.",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4kfbf/",
                          "created": 1728496957,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lr4l8bt",
                              "score": 5,
                              "body": "it is about keeping up with inflation, which with the current offer and the past years, they aren't doing. go to the boeing subreddit and read the real stories of some employees not getting a raise at all since the pandemic started. how is only a 30% raise over the next 4 years enough?",
                              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4l8bt/",
                              "created": 1728497220,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lrh1x26",
                                  "score": 1,
                                  "body": "i mean listing a few anecdotes is cherry picking data. I'm sure there are employees who got much higher raises compared to inflation. Why not just compare the average or median worker raises? Also, total inflation since 2020 is 21%, and with inflation now around 2%, it will total exactly 31% in 4 years (1.21\\*1.02\\^4 = 1.31), so the 30% raise does in fact approximately cover inflation.",
                                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lrh1x26/",
                                  "created": 1728681157,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lr5kpwr",
                          "score": 5,
                          "body": "What if I told you giving 40% raises *is* the inflation?",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5kpwr/",
                          "created": 1728508567,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lr6ugax",
                          "score": 0,
                          "body": "The market doesn't support > $100k for the vast majority of machinist jobs. The top of the line guys who border on manufacturing engineering, sure. But the *average over the whole group*? That's really high pay for the skill level of the trade - they could hire 30,000 engineers for that pay rate and probably end up with better quality work in the long run (definitely not in the short term, obviously).",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6ugax/",
                          "created": 1728525471,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr4289u",
              "score": 7,
              "body": "The thing is, Boeing is in pretty bad shape right now, and they can’t afford to spend money they don’t have. Do you know why the Union didn’t ask for a raise in 20 years?  That seems weird to me since they renew their contract every couple of years",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4289u/",
              "created": 1728491170,
              "depth": 2,
              "replies": [
                {
                  "id": "lr4bu1a",
                  "score": 42,
                  "body": "But see when the Auto makers were in a bad shape, the UAW took concessions for its members with the promise that they would be returning them once times improved....And the execs got bonuses, and then when times improved....The execs got bonuses but crickets for the union members, and when they went on strike the company kept screaming that it can't afford to to give them the raises, but as the strike went on they eventually gave them what they asked for proving that they could....And the execs still got their bonuses.\n\nContracts may renew every couple of years but Execs are only thinking about quarterly earnings.",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4bu1a/",
                  "created": 1728494226,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr4d3oh",
                      "score": 19,
                      "body": "This is almost poem quality.\n\n\"...and the execs got bonuses\"",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4d3oh/",
                      "created": 1728494629,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lr7jqnj",
                      "score": 3,
                      "body": "I don’t know that I would say giving into the UAW demands proved they could.  Yes they physically could pay more, problem is now new vehicles are so expensive very few can afford them, thus they are stacking up on lots all over the place.  Plants/shifts are getting idled.  Workers are getting laid off.  And Stalantis workers are about to go on strike because Stalantis can’t afford to spend billions to reopen a plant in the US.  Ford and Chevy are doing marginally better.\n\nSo yes the UAW broke the automakers, unfortunately now the auto makers are in a really fucked spot.  In a recent study showed 17% of respondents said they could afford to buy a new car at today’s prices.  That being said, when 83% of your customers can no longer afford your product you are fucked long term.  The UAW won the fight but at the current rates they are going to lose the war.",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7jqnj/",
                      "created": 1728537099,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lr9gonh",
              "score": 1,
              "body": "Stop spreading misinformation",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr9gonh/",
              "created": 1728573176,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lr414f2",
          "score": 4,
          "body": "Stock offering for an influx of funds to get over this hump.",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr414f2/",
          "created": 1728490813,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lr41xmx",
          "score": 13,
          "body": "The pension issue is non negotiable. It is gone.  Union leaders need to educate their rank and file.",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr41xmx/",
          "created": 1728491074,
          "depth": 1,
          "replies": [
            {
              "id": "lr4651m",
              "score": 6,
              "body": "I’d love to see what sort of pension the CEO gets.",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4651m/",
              "created": 1728492417,
              "depth": 2,
              "replies": [
                {
                  "id": "lr4pq31",
                  "score": 25,
                  "body": "All the downvotes 😂 the last CEO will get an annual pension of $3.8 million.  Pensions aren’t gone, they are reserved for the boardroom.",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4pq31/",
                  "created": 1728498682,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lr4dsu4",
                  "score": -10,
                  "body": "CEOs generally don't get a pension.",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4dsu4/",
                  "created": 1728494848,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr4i47m",
                      "score": 20,
                      "body": "Boeings last CEO - “Separately, according to the filing, the 36-year veteran will have an annual pension of about $3.8 million.”\n\n[https://www.seattletimes.com/business/boeing-aerospace/despite-a-host-of-problems-boeing-ceo-got-23-6-million-last-year/](https://www.seattletimes.com/business/boeing-aerospace/despite-a-host-of-problems-boeing-ceo-got-23-6-million-last-year/)",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4i47m/",
                      "created": 1728496217,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr7udcx",
                          "score": 2,
                          "body": "That article doesn’t say that anywhere",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7udcx/",
                          "created": 1728543744,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lr47aa7",
          "score": 4,
          "body": "It’s obviously feasible. It’s only the bean counters that act like it isn’t.",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr47aa7/",
          "created": 1728492778,
          "depth": 1,
          "replies": [
            {
              "id": "lr4f3lp",
              "score": 14,
              "body": "It is not. I worked for a company that still had a pension and it is and was a nightmare. \n\nOr, if you want a pension, you can get one, but be prepared to be paid a shitload less money. Which I strongly doubt the union is willing to accept.",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4f3lp/",
              "created": 1728495257,
              "depth": 2,
              "replies": [
                {
                  "id": "lr4pf0g",
                  "score": 9,
                  "body": "Wild that they USED to be able to afford it.  Yet worker pay has been eroded while CEO/Boardroom pay has exploded.  They can easily afford it, they choose not to for the bottom line.  It’s about time the workers got some of the spoils.",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4pf0g/",
                  "created": 1728498584,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr56uff",
                      "score": 18,
                      "body": "They were never able to afford them. Thats why a whole load of companies went bankrupt in the 1980's from pension liabilities that were then discharged in bankruptcy court. If the union wants a pension they should setup and run one themselves and have Boeing kick in some stock and money.\n\nI think a big step towards solving the disparity in executive and worker pay is some sort of profit sharing programme. Pensions are an enormous expensive anchor around their necks. Profit sharing with the union may be more lucrative for the workers and remove major pressures during down times.",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr56uff/",
                      "created": 1728504124,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr5dnqm",
                          "score": 3,
                          "body": "Are they demanding a final salary pension?  Or just a defined contribution with employer match?  I’m not really up to speed with how US pensions work.  But the former CEO has left with a $3.8m annual pension, so there is money in the pot.\n\nIn the UK we were able to buy shares at a discounted rate, and then obviously had a share of profits, and there was also a profit share scheme. But often profits were affected by “one off charges” like paying for the fines incurred by a former CEO who oversaw bribes then walked away with a huge golden handshake.  It’s a rigged game, and workers are getting fed up.",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5dnqm/",
                          "created": 1728506283,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lr6nvz7",
                              "score": 6,
                              "body": "> a defined contribution with employer match\n\nThis is what Americans call a 401k.  A pension is something else.",
                              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6nvz7/",
                              "created": 1728522921,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lr5pnxs",
                              "score": 4,
                              "body": "A pension almost always means a defined benefit scheme. It is one thing setting aside $4mill per year for 1 person and it is quite another for hundreds of people and growing every year. \n\nI thought about dodgy accounting when I wrote the previous comment, but in the end it's one of the internal contradictions of capitalism and workers will get screwed until a better more sustainable economic system supplants it.",
                              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5pnxs/",
                              "created": 1728510239,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lr5qv22",
                                  "score": 1,
                                  "body": "As I say I’m not aware of the US situation.  Most pensions here are defined contribution now, but the employer is still expected to make contributions.  \nWorkers will get screwed until they as a Union fight to get better terms.  We didn’t get the remuneration we had without unions.  We’d still be working 7 days a week were it not for Unions.  Capitalism works, but needs checks and balances.  The ability of workers to remove their labour in protest is one of them.  Hopefully they can negotiate a settlement that works for them and Boeing, and they can get back to doing what they do best.",
                                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5qv22/",
                                  "created": 1728510655,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lr7ay1y",
                                      "score": 3,
                                      "body": ">Most pensions here are defined contribution now\n\nIn the US, those aren't called pensions. That is called 401k matching and it is very common.",
                                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7ay1y/",
                                      "created": 1728532502,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "lr7kqo8",
                                      "score": 2,
                                      "body": "That’s called a 401k here in the US.  The company gives you a march.  Usually it’s something like dollar for dollar for the first 3% then 0.50 cents on the dollar up to 5%.   So you get a “defined contribution” based on a formula on what you earn.  Others get a profit sharing plan, so the company will designate X amount of profits to go to a pool to be divided up amongst the entire the company determined by actuaries with some wonky formulas.  My company gives each.  Although they call the profit sharing plan by a different name but it’s more or less the same.  And the employer match is a little more generous.",
                                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7kqo8/",
                                      "created": 1728537668,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lr7at36",
                      "score": 3,
                      "body": "They  could afford them when lifespans were shorter.",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr7at36/",
                      "created": 1728532437,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lr4wpm2",
                      "score": 3,
                      "body": ">Wild that they USED to be able to afford it. Yet worker pay has been eroded\n\nCompetition was lower, worker pay was lower. You think people are making less today than they were in the past? \n\n>CEO/Boardroom pay has exploded.\n\nWe're talking about a line item that costs hundreds of millions per year for only the unionized workers, and you think that's even close to being offset by executive pay?\n\n>They can easily afford it\n\nBoeing has lost money each of the last 5 years. You sure they can afford it? With what money?\n\n>It’s about time the workers got some of the spoils.\n\nThe workers make above average wages for what they do. The workers have already gotten the spoils.",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4wpm2/",
                      "created": 1728500914,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr4ycm0",
                          "score": 5,
                          "body": "Remuneration has dropped relative to inflation.  CEO remuneration has exploded.  I’ve a bridge to sell you if you don’t believe that to be the case.\n\nBoeing has lost money because of the CEO.  Unable to get 777x certified, unable to get quality right, paying off the families of people killed by their incompetence (at best - probably intentional).\n\nThe workers are in a unique position of knowing how to build the aircraft.   People are delusional if they think they can be replaced.  You think Boeing has quality issues now?  I’d be amazed if anything left the factory for 4 years if they replaced the workers from scratch.",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4ycm0/",
                          "created": 1728501438,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lr4z1wu",
                              "score": 1,
                              "body": ">Remuneration has dropped relative to inflation\n\n[No it hasn't](https://fred.stlouisfed.org/series/MEHOINUSA672N).\n\n>I’ve a bridge to sell you if you don’t believe that to be the case.\n\nIt better be free, because I literally just posted data showing you're wrong above.\n\n>Boeing has lost money because of the CEO\n\nThe current CEO? \n\nAlso not sure how that's really relevant.\n\n>People are delusional if they think they can be replaced.\n\nYou think the semi-skilled workers at Boeing are literally unreplaceable, even over a decent period of time? What a miracle that Boeing was able to find this pool of specially talented workers in Seattle in the first place!",
                              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4z1wu/",
                              "created": 1728501661,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lr55hw5",
                          "score": 2,
                          "body": ">Boeing has lost money each of the last 5 years.\n\nThis is due to managements decision to kill people for money and getting the 747 Max grounded.",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr55hw5/",
                          "created": 1728503705,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lr57986",
                              "score": 6,
                              "body": "Assume you mean the 737 max, since a 747 max plane does not exist.\n\nThat may be managements fault, but it doesn't change the point. They are not making money. They cannot afford to pay workers even higher above market rates.",
                              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr57986/",
                              "created": 1728504255,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lr59ahy",
                                  "score": 0,
                                  "body": "Yes, i fat fingered a 4 instead of a 3.\n\nThey were profitable before the management decisions, they can be again, its on management to stop making bad decisions, not on the workers.",
                                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr59ahy/",
                                  "created": 1728504898,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lr5bdms",
                                      "score": 3,
                                      "body": "Again, none of this changes that they are not profitable currently, haven't been since before the pandemic, and are being asked to shoulder higher costs for labor.\n\nThe comment I originally responded to said they can afford it. That's clearly not the case.",
                                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5bdms/",
                                      "created": 1728505557,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lr5ho8i",
                                          "score": 0,
                                          "body": "They're not unprofitable because of worker costs. \n\n2019: Losses cause of crashes\n2020: Covid, crashes\n2021: Covid again\n2022: Supply Chain issues\n2023: Supply Chain issues + fees being paid for late deliveries.\n\nNone of this is unprofitablity due to paying workers.",
                                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5ho8i/",
                                          "created": 1728507568,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lr9pyal",
                  "score": 1,
                  "body": "Wild that UPS drivers make 50/hr with a great pension..",
                  "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr9pyal/",
                  "created": 1728576214,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr9r5k2",
                      "score": 1,
                      "body": "Yeah, and that's been killing UPS.",
                      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr9r5k2/",
                      "created": 1728576613,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lr9xgiy",
                          "score": 1,
                          "body": "Want to explain how so? Company is making hand over fists..",
                          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr9xgiy/",
                          "created": 1728578684,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lra0644",
                              "score": 1,
                              "body": "They're a declining business that's had to sell their freight business, outsourced their international business, have been going through layoffs, etc. They're still making money, but they're basically pulling every available level despite the cost to the future to maintain profitability, and that's in part because they're so hamstrung by the union costs. EPS declined after signing the new union deal. \n\nThey're having to raise prices by a lot to be able to continue making money, too, and eventually they're going to simply price themselves out of the market.",
                              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lra0644/",
                              "created": 1728579549,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lr4nc3w",
          "score": 2,
          "body": "Pension at public traded, yes. I’m at large/global family owned business and receive a pension on top my 401k matched 5%. Needless to say, I’m not leaving lol",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr4nc3w/",
          "created": 1728497912,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr8b3d9",
      "score": 2,
      "body": "Coming from across the pond I find this idea that 'pensions are gone' really confusing\n\n  \nHere every employer must give you a private pension, is that not the case in America? If so, that's WILD",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr8b3d9/",
      "created": 1728555532,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr8r5qx",
      "score": 2,
      "body": "Who'd have guessed paying dreadful executives excessive bonuses while shafting their actual workers would eventually come back to bite them in the arse.\n\n>  if we are to remain competitive as a business\n\nWell you certainly won't remain competitive without anyone doing work :)",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr8r5qx/",
      "created": 1728563824,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr53fvh",
      "score": 5,
      "body": "Pissing off a workforce that was already known to cut corners is going to rebound to Boeing’s safety culture when work resumes",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr53fvh/",
      "created": 1728503063,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr613rd",
      "score": 2,
      "body": "Possible reduction to Junk Bond rating!? 😟\n\n[MarketWatch article](https://www.marketwatch.com/story/boeing-on-the-hook-for-1-billion-a-month-because-of-strike-as-s-p-frets-anew-6c23d857)",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr613rd/",
      "created": 1728514346,
      "depth": 0,
      "replies": [
        {
          "id": "lr619j1",
          "score": 2,
          "body": "I’ve stopped down averaging 🤦🏻‍♂️",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr619j1/",
          "created": 1728514405,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr8m622",
      "score": 1,
      "body": "Boeing just dared the union to show how far they'll go.. \n\nI foresee local strikes to interrupt parts inventories.  And the working locations will subsidize those that are closed. \n\nIt won't prove anything good for the company.",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr8m622/",
      "created": 1728561583,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrbgbhc",
      "score": 1,
      "body": "Kinda wish I knew more about puts and other options right about now. \n\nAlso kinda thankful I don't as I wouldn't have money right now to buy any of them lol",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lrbgbhc/",
      "created": 1728596379,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrbx13q",
      "score": 1,
      "body": "This will cost the CEO his job. He does not know it yet.",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lrbx13q/",
      "created": 1728602553,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrfchkr",
      "score": 1,
      "body": "I cannot figure out why Blue Origin or SpaceX doesn't see an opportunity to buy Boeing. You get all of the IP, infrastructure, and government relationships, and you can use it as an opportunity to break it down and build it back up again.",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lrfchkr/",
      "created": 1728660864,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrlprv4",
      "score": 1,
      "body": "last week i bought 5 shares at 158 just as a stupid bet it would rise from being oversold.\n\nstupid stock dropped to 145 immediately after.\n\ndon't catch knives, folks\n\nevery time i trade boeing, whether long or short, it goes against me.",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lrlprv4/",
      "created": 1728757722,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr3spg6",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr3spg6/",
      "created": 1728488112,
      "depth": 0,
      "replies": [
        {
          "id": "lr3vsqi",
          "score": 0,
          "body": "Comac is steadily growing and partnered with Bombardier  fairly recently. As with basically every other industry, the Chinese manufacturer is coming into the market undercutting on price because their labor laws are so oppressive. Boeing isn't talking about current competition with Airbus, they're talking about 5, 10, 20 years from now as the Chinese planes continue ramping up.",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr3vsqi/",
          "created": 1728489100,
          "depth": 1,
          "replies": [
            {
              "id": "lr45ji9",
              "score": 1,
              "body": "Just the kind of airplane I want to board. It was assembled by some 8 year old kids",
              "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr45ji9/",
              "created": 1728492227,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lr810fk",
      "score": 1,
      "body": "Buy puts for the earnings call. Thank me later. Its going to be more red than a slaughterhouse floor",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr810fk/",
      "created": 1728548495,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr3wqaz",
      "score": -1,
      "body": "Maybe they can negotiate putting those skylights in the airplanes...",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr3wqaz/",
      "created": 1728489397,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lr5z483",
      "score": -1,
      "body": "What if airbus decided to cock slap Boeing by offering job to this machinist? either open a US factory or giving them an offer to relocate to EU.",
      "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr5z483/",
      "created": 1728513600,
      "depth": 0,
      "replies": [
        {
          "id": "lr6p3m3",
          "score": 6,
          "body": "Airbus has a US factory.  They don't pay as much as what IAM members get at Boeing.",
          "permalink": "/r/stocks/comments/1fzsj6f/boeing_withdraws_contract_offer_after_talks_with/lr6p3m3/",
          "created": 1728523392,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}