{
  "title": "TD Bank faces $3 billion in penalties as part of US settlement, WSJ reports",
  "score": 110,
  "selftext": "Canada's TD Bank is expected to pay about $3 billion in penalties as part of a settlement with U.S. regulators and prosecutors over charges it failed to properly monitor money laundering by drug cartels, the Wall Street Journal reported.\n\nThe bank's U.S. unit is expected to plead guilty on Thursday to the charges, the report said on Wednesday.\n\nTD Bank did not immediately respond to a Reuters' request for comment.\n\nAs part of the agreement, the bank's primary U.S. regulator, the Office of the Comptroller of the Currency (OCC), is also expected to impose an asset limit barring the Canadian lender from growing above a certain level in the country, the newspaper reported, citing people familiar with the matter.\n\nBoth the U.S. Department of Justice (DOJ) and the Treasury Department's Financial Crimes Enforcement Network (FinCEN) are planning to put independent monitors in place to watch the lender closely and ensure compliance with the pacts, the report said.\n\nThe FinCEN monitor is expected to be in place for four years, the WSJ reported, citing one person familiar with the matter.\n\nThe settlement will include the DOJ, the FinCEN, OCC and the Federal Reserve among which the Justice Department will take the biggest slice of the penalties amounting to about $1.8 billion with the FinCEN getting $1.3 billion, the report said.\n\nSpokespeople for the DOJ, the OCC and the FinCEN did not respond immediately to Reuters' requests for comment.\n\nSource: https://ca.finance.yahoo.com/news/td-bank-faces-3-billion-234809513.html",
  "link_flair_text": null,
  "id": "1g0ix56",
  "num_comments": 17,
  "created_utc": 1728567192,
  "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/",
  "comments": [
    {
      "id": "lrby1zt",
      "score": 5,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lrby1zt/",
      "created": 1728602942,
      "depth": 0,
      "replies": [
        {
          "id": "lrifoba",
          "score": 3,
          "body": "WFC has been carrying an asset cap restriction for 10 years.",
          "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lrifoba/",
          "created": 1728701252,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lr913tg",
      "score": 6,
      "body": "Buy the dip ",
      "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lr913tg/",
      "created": 1728567777,
      "depth": 0,
      "replies": [
        {
          "id": "lr9ejvd",
          "score": 3,
          "body": "I'm knee deep in the dip. Lets see if this will outperform the 500",
          "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lr9ejvd/",
          "created": 1728572459,
          "depth": 1,
          "replies": [
            {
              "id": "lr9o0sq",
              "score": 6,
              "body": "Td return over 30 years is 1544% plus 5 % dividend, the famous 500 is up 800% over the same period without dividend. Im buying this dip anytime, was hoping for 70ish dip. I average 76$. Index investors bashing time⬇️⬇️",
              "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lr9o0sq/",
              "created": 1728575588,
              "depth": 2,
              "replies": [
                {
                  "id": "lra5yat",
                  "score": 9,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lra5yat/",
                  "created": 1728581405,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrbgl38",
                      "score": 1,
                      "body": "Bns grew 3500% paying 7% dividend over the same period. Until lately bns was not invested in the US, they bought shares of key banks this year. Market is unpredictable for sure, but the lag of some canadian banks in the recent years sounds like a good buying opportunity. Population increase and rates sould help them.",
                      "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lrbgl38/",
                      "created": 1728596473,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrzlbdh",
                          "score": 0,
                          "body": "But then again we see alternative banks like wealthsimple explode in popularity because of the big 5 have been ripping off customers for so long. I switched everything to wealthsimple and would never go back to the big banks as an example.",
                          "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lrzlbdh/",
                          "created": 1728964153,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lrakwul",
                      "score": -1,
                      "body": "It is of course more of a risk than something like the 500 and no one can predict which one will do better. But I believe a 3B fine (one quarters profit) and a few years (Might be 4, this isn't confirmed yet) of non-growth in the US only but Canada will still grow steady doesn't reflect properly on the price when comparing to RBC, which they used to be neck and neck with (Feb 2022). RBC is 235B CAD vs TD at 143B CAD. Is a few years of US growth really worth near 100B valuation discrepancy? \n\nObviously TD has to execute now... and that's what I'm banking on.\n\nEdit: PUN NOT INTENDED lol",
                      "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lrakwul/",
                      "created": 1728586220,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lseo5d9",
                          "score": 2,
                          "body": "Read through several posts, wondering why the downvotes.  I picked up lots of shares of TD average 78$ I can't see it going lower, not sure why people are pushing this stock down.",
                          "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lseo5d9/",
                          "created": 1729191340,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lsf6law",
                              "score": 1,
                              "body": "Tbh I’ve usually done a lot better when I get downvoted!\n\nRe reading that post I didnt even mention that US business is only 30 percent of their engine and only the retail side is affected. Plus they were commended for complying. \n\nWild prediction is were hovering around 82-84 after earnings Dec 5th\n\nEdit: I will keep adding every $2 leg down as I see a V shaped recovery once the fog of DoJ clears",
                              "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lsf6law/",
                              "created": 1729197203,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lr9u2a5",
                  "score": 5,
                  "body": "Right obviously we dont know what the future holds. But after a 2 year SP bullrun, I will take this beat up stock that has always rebounded. My average is probably around 79 I think (moved things around so I dont have the exact number)\n\nHuge position... wishing us luck :)",
                  "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lr9u2a5/",
                  "created": 1728577573,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrapncf",
                  "score": -1,
                  "body": "I hold almost 1000 shares at $74 average!",
                  "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lrapncf/",
                  "created": 1728587750,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lri3lq0",
          "score": 1,
          "body": "Uh nah",
          "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lri3lq0/",
          "created": 1728696054,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrepe42",
      "score": 1,
      "body": "I read a couple articles and the quotes from the regulatory report are Hilarious…. I am definitely buying that dip",
      "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lrepe42/",
      "created": 1728652840,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrepg53",
      "score": 1,
      "body": "The penalties TD Bank is facing for compliance failures are pretty alarming, especially given the level of regulation in place. It got me thinking about how banks in less scrutinized markets are handling similar challenges.\n\nI’ve been following Halyk Bank, one of the largest in Kazakhstan. They’re trading at what seems like a pretty low valuation for their size, but there’s not much coverage or transparency compared to Western banks. I wonder if banks in emerging markets like this might face similar risks, or if they’re flying under the radar because of less stringent oversight. Anyone have thoughts on how compliance concerns could impact these kinds of banks long-term?",
      "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lrepg53/",
      "created": 1728652861,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrm44r6",
      "score": 1,
      "body": "seems like the other thread got deleted (probably for FUD). \n\nHowever, that OP isn't wrong. The penalties and restrictions will cause TD to lose market share to the other banks. Other banks already got a boost because of TD.\n\nWhat happened to Well Fargos will no doubt yield the same result for TD.  TD will likely be re-priced at asset value. It's unclear if TD will be able to maintain the current dividend payout, chances are they won't if their largest investors already dumped.\n\nThey aren't going bankrupt or insolvent so the worst case right now is simply no growth for years until the restrictions are lifted.",
      "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lrm44r6/",
      "created": 1728762568,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrmkbwi",
      "score": 1,
      "body": "Did you guys know you can get filthy rich from money laundering as long as you set the fees higher than 3B?!",
      "permalink": "/r/stocks/comments/1g0ix56/td_bank_faces_3_billion_in_penalties_as_part_of/lrmkbwi/",
      "created": 1728768267,
      "depth": 0,
      "replies": []
    }
  ]
}