{
  "title": "Will you get in on China, HK or Japan Stocks?",
  "score": 47,
  "selftext": "Why and why not?\n\nIf you are already in, which stocks are you holding and why?\n\nI have been, sort of, burnt by China stocks twice. In the long run, I'm not sure if China stocks/unit trust is the way to go, would love to hear your thoughts. Pass stocks I've owned included Baba and NIO. What about you?",
  "link_flair_text": null,
  "id": "1g15c2z",
  "num_comments": 145,
  "created_utc": 1728636674,
  "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/",
  "comments": [
    {
      "id": "lrdvd2o",
      "score": 1,
      "body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdvd2o/",
      "created": 1728636675,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrdy74j",
      "score": 26,
      "body": "\"Why and why not?\"\n\nI think my concern with China is that the last 5 years or so have seemed like a cycle of: 1) new regulation/crackdown (largely on tech, which is where I'd be primarily interested), 2) stocks go down, 3) China walks back regulation/offers stimulus, 4) \"China stocks are so back\" and after enough of a bounce the cycle goes back to 1.\n\nAnd while these names have had a good run lately, looking longer term Tencent is now almost back to the 2018 peak. When I think about names in China that I'd most like to own long-term that's certainly at or near the top of the list, but it's also clear that the government does not like the sector - and they can do what they want but there's other places to invest. \n\nI'm looking for at least medium and preferrably long-term holdings, optimally; Tencent is a good, well-run company but I feel like investing in China is - and maybe things will change at some point? - trying to time the #3 part of the cycle above and sell before #4 is over and the cycle starts again. If say gaming is going to be something that's going to continually encounter regulations in China, I'd rather look at a TTWO still around the level where it announced the GTAVI trailer and which is above 2018 highs. \n\nI'm not against China and great to anyone who did well with the recent move (although some of the BABA discussion in particular feels like a fair amount of this, given how many times people have tried to call the bottom in recent years: https://pbs.twimg.com/media/FQrex8kVIAE4N3w?format=jpg&name=large - even after the recent move it's still down 36% over the last 5 years while AMZN +115%.) \n\nSo, I'm not \"super bearish\" simply because I'm not super bullish - just disinterested and looking elsewhere.\n\nJapan actually has a fair amount of great tech companies, but is little discussed.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdy74j/",
      "created": 1728638717,
      "depth": 0,
      "replies": [
        {
          "id": "lrebmfx",
          "score": 3,
          "body": "Thank you for sharing. The sentiments is, if, putting the politics aside, China stocks like Baba and Tencent and Baidu has tremendous growth opportunity. But they are tied down by geo political reasons and as such, is a no for me.\n\nWhen the China market started to go up recently, I did think of reentering since the price is low now, but twice beaten, and the reason is always politics. 😅",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrebmfx/",
          "created": 1728646897,
          "depth": 1,
          "replies": [
            {
              "id": "lrepcqe",
              "score": 5,
              "body": "> The sentiments is, if, putting the politics aside, China stocks like Baba and Tencent and Baidu has tremendous growth opportunity. \n\nI think it has *potentially* tremendous opportunity long-term but 1) it feels like there's regulatory risk in the last 5 years in a way that there wasn't before - hopefully that changes? and 2) I think there's too much view of the potential growth opportunity and not enough attention paid to the risks even if the stocks seem \"cheap\"; there are some companies that over the last 10 years really put a lot of weight behind the \"China growth story\" and there's a lot of complexity and risk there - just because there is a potentially tremendous growth opportunity doesn't necessarily mean it will be realized/realized to that degree/not go through difficult periods. I mean look at Starbucks China comps last quarter down 14%.  There's also the VIE risk with China stocks which has always been a risk and remains a risk but I think because there hasn't been an issue over a long enough time people have gotten kind of complacent about it. \n\nI'm open to the idea of investing in China at some point - I like having the largest possible universe of investment ideas to consider so it's not \"I'm never investing in China again\" - but in the meantime there's no shortage of other things to focus on.",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrepcqe/",
              "created": 1728652825,
              "depth": 2,
              "replies": [
                {
                  "id": "lres68b",
                  "score": 1,
                  "body": "I guess we are all open to investing in China, but as what you've said... There's no shortage of other companies to focus on. I appreciate your thoughts and replies, thanks!\n\nMind if I ask, what other companies are you focus on these days then?",
                  "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lres68b/",
                  "created": 1728653902,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrex6qo",
                      "score": 2,
                      "body": "> Mind if I ask, what other companies are you focus on these days then?\n\nA good deal of biotech (which I don't really talk about on here because of the nature/risk of biotech investing), some health care, a fair amount of water services (data center demand + I can see demand for drainage projects and other such things in areas that face an increasing amount of storms; other project demand from places that are facing increasing temps and perhaps eventually trying to get water from further away in some instances), infrastructure/energy/utilities (ai/data center demand), tech (largely semis), some homebuilding/distributor names (highly cyclical sector and volatile stocks, but I think the case can be made that homes have been underbuilt post 2008) and other odds/ends (including tiny positions in things like a private jet hangar owner that, depending on how it goes, may be added to over time.)\n\nThere's a lot of various names, but it's largely a handful of various themes (electrification/grid improvement + power demand, ai - both in terms of tech and elements of building data centers; a lot of various healthcare, a few others.) There's not a lot that I'd want to add to at this point but enjoy building investments around medium/long-term themes.",
                      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrex6qo/",
                      "created": 1728655707,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrfck3o",
                          "score": 1,
                          "body": "At first I was like wow, no tech, no ai? You have a good portfolio and thank you for sharing.",
                          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrfck3o/",
                          "created": 1728660887,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lrprqma",
                  "score": 1,
                  "body": "Every time a company gets to big the CCP seizes control. Prime example is Jack Mae and Alibaba",
                  "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrprqma/",
                  "created": 1728825761,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrpri7m",
              "score": 2,
              "body": "Given Chinas government manipulation of markets you can’t be sure about any companies true balance sheets. When/where a company or particularly will fail or somhow seized in one form or another",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrpri7m/",
              "created": 1728825664,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrf6ncw",
              "score": 2,
              "body": "China is fundamentally weakening. They’re injecting artificial growth into their economy and it’ll work in the short term as its supposed to do. But, if you’re a long term investor china is not where you want to be.",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrf6ncw/",
              "created": 1728658932,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrpr12p",
          "score": 1,
          "body": "Japan has a shrinking market and decades of stagflation. It is a very tough market to navigate.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrpr12p/",
          "created": 1728825462,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrdx9t8",
      "score": 43,
      "body": "I trade all of them. Trading should not involve emotions. But so far US stocks made most money.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdx9t8/",
      "created": 1728638049,
      "depth": 0,
      "replies": [
        {
          "id": "lrevh9b",
          "score": 1,
          "body": ">But so far US stocks made most money.\n\nI could have told you that and saved you a bunch of money. Why waste time with shitty foreign trades?",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrevh9b/",
          "created": 1728655100,
          "depth": 1,
          "replies": [
            {
              "id": "lrezfkk",
              "score": 1,
              "body": "Currently, U.S. stocks are trading at high levels. As a result, we're seeing some capital outflow from the market. This movement of funds in and out is a typical market cycle. For risk management concern, I will decrease the weighting of U.S. stocks in my portfolio.",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrezfkk/",
              "created": 1728656491,
              "depth": 2,
              "replies": [
                {
                  "id": "lrf4ore",
                  "score": 5,
                  "body": "Those higher levels are 100% justified. Countries are not equal. The fact is American companies have the highest quality which is why they have the highest valuations.",
                  "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrf4ore/",
                  "created": 1728658281,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrf687x",
                      "score": 4,
                      "body": "People like to compare this high valuation period to the dot com bubble bc of AI but fail to realize that the difference between the two are that tech valuations are ACTUALLY keeping up with earnings.",
                      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrf687x/",
                      "created": 1728658790,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrf6l70",
                          "score": 1,
                          "body": "Earnings between now and Dot-Com are totally different. Most of the big tech stocks are sitting on $100B in cash. Each!",
                          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrf6l70/",
                          "created": 1728658912,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrf7r5e",
                              "score": 1,
                              "body": "That is true but even the startups and growth companies are brining in incredible amounts of revenue. OpenAI and a company I’ve loved since before its IPO late last year, ARM, are prime examples. Its not just the Mag 7.",
                              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrf7r5e/",
                              "created": 1728659301,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lrfx630",
                  "score": -1,
                  "body": "Have fun losing money",
                  "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrfx630/",
                  "created": 1728667568,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lrdxh0s",
      "score": 40,
      "body": "Japan stocks are no no for me, their workforce is rapidly shrinking, their population droped like 900k last year and it will get worse every year. For me right now India is what china was 25 years ago. I'm seriously considering buying some Indian ETF but dont have any yet.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdxh0s/",
      "created": 1728638193,
      "depth": 0,
      "replies": [
        {
          "id": "lrdy31o",
          "score": 11,
          "body": "It took Japan etfs quite some time to turn green and they are still looking good now. India is a portfolio I'm keen but not familiar with. It's also like walking on egg shells to me.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdy31o/",
          "created": 1728638632,
          "depth": 1,
          "replies": [
            {
              "id": "lrdyknb",
              "score": 15,
              "body": "Idk man India etfs looks to good to me, there must me some catch. India gdp grows like 6-7% every year with 1.4bilion people so demand for products will only grow with this big and wealthier consumer base.",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdyknb/",
              "created": 1728638985,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lre4vc6",
          "score": 9,
          "body": "These risks can be mitigated through thorough company selection. Sumitomo has so many foreign investments and subsidiaries that you're not exposed to many of Japans domestic issues. \n\n\nThe same can be said for most of the Sogo Shosha. \n\nIf you're investing in tech or entertainment, the workforce issue won't hut you.\n\nI would avoid domestic service providers, agriculture, large chain retailers, Healthcare providers and those types of companies if a decreasing workforce worries you.\n\nAlso, avoid Japanese tracking ETFs.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre4vc6/",
          "created": 1728643185,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lre1pk1",
          "score": 9,
          "body": "I bought an Indian ETF (exclusively because I like India) and it has grown by around 54% in 17 months, which is pretty good if you ask me.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre1pk1/",
          "created": 1728641162,
          "depth": 1,
          "replies": [
            {
              "id": "lre84x8",
              "score": 1,
              "body": "Which ETF?",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre84x8/",
              "created": 1728645069,
              "depth": 2,
              "replies": [
                {
                  "id": "lrea7mc",
                  "score": 4,
                  "body": "It's European (I'm European) IE00BZCQB185",
                  "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrea7mc/",
                  "created": 1728646173,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lre3r5y",
          "score": 2,
          "body": "Great!!! I am from India. I am investing in US stock market(small portion of total investment) currently through a Nasdaq 100 index fund.\n\nYou can check Vested app, I think it allows you toinveat in India.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre3r5y/",
          "created": 1728642490,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lre3f86",
          "score": 1,
          "body": "Well I am an Indian who is investing in indian stocks. If u want to ask something about Indian ETFs then u can ask. We are witnessing tremendous bull run here. Large caps like Tata motors etc. get 15 times from their price at the time of COVID. In the terms of PE ratio, Nifty is overvalued. But SIP boom is going on here. Even a person who is earning ₹8000/month ($100) is investing a very small chunk of his income in stock market. FII are withdrawing huge amount of money from the market (shifting towards china due to stimulus inserted by Chinese gov.) but DII are countering that by investing in market.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre3f86/",
          "created": 1728642276,
          "depth": 1,
          "replies": [
            {
              "id": "lre74pk",
              "score": 2,
              "body": "which Indian etfs would you invest in right now?",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre74pk/",
              "created": 1728644508,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lre3v0b",
              "score": 1,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre3v0b/",
              "created": 1728642558,
              "depth": 2,
              "replies": [
                {
                  "id": "lre4pfk",
                  "score": 1,
                  "body": "That bank is a sleeping giant but it is sleeping like anything. Even a Fixed deposit with the rate of mere 5% has given more return than HDFC. While the profit of the bank has doubled in the last 3 years, the price is almost the same. HDFC is testing the patience of every investor here. On business terms, HDFC is doing very well. It is filing a new IPO (HDB Financial services). People are hoping HDFC may repeat the story of ITC (same story. Good revenue but poor share growth in the initial phase of bull run. Then it doubled the money in last 2 years).",
                  "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre4pfk/",
                  "created": 1728643086,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lre6zqx",
          "score": 1,
          "body": "Which India etfs are you buying",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre6zqx/",
          "created": 1728644430,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lre81b4",
          "score": 1,
          "body": "What makes you think the market is not taking these facts fully into account?",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre81b4/",
          "created": 1728645013,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrficvh",
          "score": 1,
          "body": "They're allowed to do business outside of Japan though, of course. If you're talking about some supermarket that only operates in Japan itself, then that could be a problem. But think of an obvious example like Nintendo. Obviously, Nintendo does plenty of business outside Japan.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrficvh/",
          "created": 1728662767,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lriu5nq",
          "score": 1,
          "body": "By that logic you shouldn't invest in [China ](https://www.populationpyramid.net/china/2040/)either. \n\nTheir population is shrinking fast and ageing much faster than Japan. Between now and 2050 their working age population is forecast to drop 240million and the median age will rise from 39 to 51.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lriu5nq/",
          "created": 1728708524,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrmcnvj",
          "score": 1,
          "body": "If you don’t mind my asking, which ETFs are you looking at?",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrmcnvj/",
          "created": 1728765530,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lre4e9y",
          "score": 1,
          "body": "Bought some india etf last year when i red some news about world bank saying india will overtake china as 2nd largest economy sometime im future. Currently i have 30% gain. Ndia was the ticker. \n\n\nHowever im not so sure about entering into india market now",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre4e9y/",
          "created": 1728642894,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lre6d58",
      "score": 14,
      "body": "No point in it when there's all kinds of cash to be made in US equities.. It's just not worth the risk",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre6d58/",
      "created": 1728644070,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrdy2o6",
      "score": 4,
      "body": "I've been invested in Japanese stocks for a while. While holding equities the risks of a falling YEN won't hurt as much depending on your selection. (When I refer to investing in Japan I mean direct investing using YEN, not using ADR's or US exchange based ETF's)\n\nLike a Japanese utility company will have far more YEN on their books/revenues than a Japanese multinational (IE: Softbank, Toyota, Panasonic, Et&.) Multinationals moved a ton of their currency into USD to hold US bonds when interest rates were high. \n\nSo the companies YEN price grew as the YEN fell. The opposite will happen when the YEN rises, but they may move their assets back to YEN shortly. \n\nChina & HK I'm not investing in since I don't know the market, the companies, or their financial system. \n\nI see China as risky, because of my ignorance of the country. I don't the rights of a Chinese shareholder, the only thing I know of the Chinese central bank is what I've read in news headlines, I could go on about what I don't know.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdy2o6/",
      "created": 1728638624,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrerlkc",
      "score": 6,
      "body": "I will take Japan any day before the other two.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrerlkc/",
      "created": 1728653684,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lre1uy6",
      "score": 4,
      "body": "Not going to because my strategy is to not invest in things I don’t understand",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre1uy6/",
      "created": 1728641261,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrfqifn",
      "score": 5,
      "body": "There's such a large lack of transparency, it's impossible for me to even entertain it as an option (China, HK).\n\nAs for Japan, it's two things, it's not an easily accessible market, and I'm not familiar with their market.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrfqifn/",
      "created": 1728665426,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrdzu1y",
      "score": 11,
      "body": "None of them. \n\nI am positive to ETFs covering India and other emerging markets in East and South East Asia, though.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdzu1y/",
      "created": 1728639891,
      "depth": 0,
      "replies": [
        {
          "id": "lre44n1",
          "score": 1,
          "body": "Would you mind sharing the etfs examples? Also why not China or Japan though?",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre44n1/",
          "created": 1728642726,
          "depth": 1,
          "replies": [
            {
              "id": "lre9bgo",
              "score": 5,
              "body": "Not China, due to political unrest, an unfriendly corporate environment, and the fact that, according to CCP regulations, foreigners can’t actually own stocks in Chinese companies directly. This leads to workarounds through unfavorable (for you) corporate structures in various countries.\n\nNot Japan either, because of a decade-long economic slowdown and a historically weak currency. I get the impression they’re more focused on fixing their issues than riding the momentum that countries like India and other Southeast Asian nations are experiencing. More and more companies are pulling out of China and channeling their investments into places like India, Vietnam, and Thailand. \n\nI dont have any position in asia yet — cant recommend any, but im sure there are good analysis on this topic available",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre9bgo/",
              "created": 1728645704,
              "depth": 2,
              "replies": [
                {
                  "id": "lreaikz",
                  "score": 2,
                  "body": "Honestly, this sums up about right for my thoughts on China and Japan, esp for China. The regulations doesn't work in favor of investors and there's too many rules that are in accordance to CCP. As much as I think Tencent is huge, it's just tough to get in on the coin because, the future of Chinese stocks is unknown. One new regulation could cause the market to swing down... Like how it had been for the past few years (until now).",
                  "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lreaikz/",
                  "created": 1728646335,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lre0vy3",
      "score": 3,
      "body": "I'm holding only FAANG stocks",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre0vy3/",
      "created": 1728640609,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lre94pc",
      "score": 3,
      "body": "Warren B has some Japanese stocks doesn’t he?",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre94pc/",
      "created": 1728645605,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrdwpkm",
      "score": 8,
      "body": "Risk and reward my friend",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdwpkm/",
      "created": 1728637643,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrdwame",
      "score": 15,
      "body": "never into china market. im chinese",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdwame/",
      "created": 1728637346,
      "depth": 0,
      "replies": [
        {
          "id": "lrdwfjb",
          "score": 11,
          "body": "Here, the government dominates the market, while there are pigs",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdwfjb/",
          "created": 1728637444,
          "depth": 1,
          "replies": [
            {
              "id": "lrdxa0f",
              "score": 3,
              "body": "OK I'm invested if you can share more. And that was the reason I got burnt in the first place.",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdxa0f/",
              "created": 1728638053,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lre0k25",
      "score": 10,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre0k25/",
      "created": 1728640389,
      "depth": 0,
      "replies": [
        {
          "id": "lre4c5z",
          "score": 7,
          "body": "All the blue chips you mention are good stocks. Just that China market sometimes doesn't work as straight forward as it is.\n\nAlso, why with the life savings though!",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre4c5z/",
          "created": 1728642857,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrfdpqu",
          "score": 3,
          "body": "You would have had similar returns with US stocks. Actually the S&P has outperformed the Shanghai since Jan.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrfdpqu/",
          "created": 1728661262,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lre7vlk",
      "score": 5,
      "body": "China is not investable, so no.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre7vlk/",
      "created": 1728644926,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lre2p5y",
      "score": 2,
      "body": "Hitatchi has been great this year. But I'm quite aware Japan is economically fucked in the long run.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre2p5y/",
      "created": 1728641817,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrmaskz",
      "score": 2,
      "body": "Studied 2015 housing market Crash, this feels like it, stimulus then another stimulus then crashed.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrmaskz/",
      "created": 1728764878,
      "depth": 0,
      "replies": [
        {
          "id": "lrovkig",
          "score": 1,
          "body": "So, ending is still a crash yes?",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrovkig/",
          "created": 1728806612,
          "depth": 1,
          "replies": [
            {
              "id": "lrq3oc3",
              "score": 2,
              "body": "Seems like it, would be a keen to China 2008 financial crisis, it was an insane inflation Bonanza, predatory lending in the form of subprime mortgages targeting low-income homebuyers, excessive risk-taking by global financial institutions, a continuous buildup of toxic assets within banks, and the bursting of the United States housing bubble culminated in a \"perfect storm\", which led to the Great Recession.\n\nThen China survives, Inflation is an easy problem to face when your country's main cash cow is manufacturing. Right now they're facing deflation, which made a lot of countries drop to their knees. \n\nI think the only country that survives insane deflation  is Switzerland, it did not push them to recession that time.",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrq3oc3/",
              "created": 1728830309,
              "depth": 2,
              "replies": [
                {
                  "id": "lrqnm80",
                  "score": 1,
                  "body": "Ahh 2008 Lehman Brother collapse, 2020 covid 19 crisis, seems so far away but the wound remains.",
                  "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrqnm80/",
                  "created": 1728836983,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lrmbckq",
      "score": 2,
      "body": "I’m presently holding BIDU and 1237.TW (Hon Hai/Foxconn).\n\nEDIT: and last, but not least, TSM",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrmbckq/",
      "created": 1728765071,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrdwfbi",
      "score": 7,
      "body": "I am holding baba bidu and tencent. The valuation is very attractive compared to US stocks in the same industry.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdwfbi/",
      "created": 1728637440,
      "depth": 0,
      "replies": [
        {
          "id": "lrdx31r",
          "score": 9,
          "body": "Holding bags on baba, valuation is atractive beacause there is high risk in Xi Jinping politics towards west.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdx31r/",
          "created": 1728637912,
          "depth": 1,
          "replies": [
            {
              "id": "lrdxegg",
              "score": 7,
              "body": "Bags, that was what I was holding... For a longggg time. Opportunity cost and time is Key I guess.",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdxegg/",
              "created": 1728638142,
              "depth": 2,
              "replies": [
                {
                  "id": "lreu2hb",
                  "score": 1,
                  "body": "Which CN stocks did you buy and when/what price did you enter?  If you don't mind my asking.",
                  "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lreu2hb/",
                  "created": 1728654596,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrfc144",
                      "score": 1,
                      "body": "Definitely wrong time lol. 9988 (Baba HK stock), NIO and BILI. All bought before the pandemic.",
                      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrfc144/",
                      "created": 1728660714,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lre0b3i",
              "score": 3,
              "body": "More like west politics towards Xi Jinping no?\n\nChina has been pretty mild in recent years, even the response to western sanctions seemed to be the bare minimum to me.\n\nNo Taiwan invasion either despite the constant dog whistling last year which seemed to disappear after the war in the middle east broke out.",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre0b3i/",
              "created": 1728640221,
              "depth": 2,
              "replies": [
                {
                  "id": "lredvx4",
                  "score": 5,
                  "body": "Mild on the west because China's economy is wild atm. It can't solve its own problem even with someone who won 2x nobel economy prize.",
                  "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lredvx4/",
                  "created": 1728647991,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lrdx1fq",
          "score": 1,
          "body": "If Baba pulls back under 100 USD, then I'll add some more portfolio. The biggest gains I've made so far this year are from Chinese stocks. Meanwhile, the stocks I bought recommended by this sub haven't performed nearly as well.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdx1fq/",
          "created": 1728637880,
          "depth": 1,
          "replies": [
            {
              "id": "lrdxyd5",
              "score": 2,
              "body": "Examples of the stock gains besides Baba please?",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdxyd5/",
              "created": 1728638536,
              "depth": 2,
              "replies": [
                {
                  "id": "lrdzk9w",
                  "score": 0,
                  "body": "Currently Baba 51%,  BYD 73%, JD, 82%. At its peak, it was BABA 65%, BYD 82%, and JD 97%. I bought into Chinese stocks when everybody said it was uninvestable back in mid Feb this year. \n\nI expect the pullback to continue for a bit as people continue to take profit. That or slow earnings in the short term. It is impossible to time the bottom or top. I would just slowly DCA in if I were you.\n\nI already have a substantial part of my portfolio in Chinese stocks. So, me \"slowly buying\" BABA if it goes under 100 USD is based on my current portfolio allocation, and it only \"makes sense\" for me to increase my allocation if it goes under that target. Otherwise, I'm content with my current allocation.",
                  "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdzk9w/",
                  "created": 1728639698,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lre428o",
                      "score": 2,
                      "body": "The key info here is Feb this year. Congrats bud! 🥂",
                      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre428o/",
                      "created": 1728642684,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lre9t3y",
                          "score": 0,
                          "body": "Thanks! I am pretty happy with my returns so far. I wish I accumulated more during May, but that is just life. \n\nI'm going to keep it for some years to see how it plays out. People always assume things are always going to stay the same. I like to do those turnaround bets, looking for stocks that very few are looking at instead of jumping on the hype train. \n\nI also look for stocks that are asymmetrical in risk-reward ratio. Like with Chinese stocks, they were already so much beaten down that everybody who wanted to sell already sold. This means it max had a 10-15% downside when I bought it, but the upside for a potential turnaround was 5-8x.",
                          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre9t3y/",
                          "created": 1728645964,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrear7e",
                              "score": 1,
                              "body": "Not sure but RemindMe! 3 years",
                              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrear7e/",
                              "created": 1728646458,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lreatzd",
                                  "score": 0,
                                  "body": "I will be messaging you in 3 years on [**2027-10-11 11:34:18 UTC**](http://www.wolframalpha.com/input/?i=2027-10-11%2011:34:18%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrear7e/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1g15c2z%2Fwill_you_get_in_on_china_hk_or_japan_stocks%2Flrear7e%2F%5D%0A%0ARemindMe%21%202027-10-11%2011%3A34%3A18%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201g15c2z)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                  "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lreatzd/",
                                  "created": 1728646498,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lrdxbj7",
          "score": 0,
          "body": "Yeah baba and tencent.  Cheap as chips - be crazy not to",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdxbj7/",
          "created": 1728638084,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lre710f",
      "score": 4,
      "body": "I avoid Chinese stocks for a few reasons. First of all, you don’t actually own the stock, foreign investors aren’t allowed to own Chinese stocks. What you’re buying is an ADR run by a Cayman Islands based shell corp. They can close this loophole for any sector (such as online education) at their whim and you’re left holding nothing. Secondly, you can’t trust Chinese balance sheets, their regulation isn’t anything close to a first world nation. Finally, if you don’t understand Guanxi business culture, you have no idea what you’re getting into as a foreign investor.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre710f/",
      "created": 1728644450,
      "depth": 0,
      "replies": [
        {
          "id": "lrea192",
          "score": 3,
          "body": "This sums up about everything I guess...",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrea192/",
          "created": 1728646080,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrdwa81",
      "score": 3,
      "body": "DXJ has done well for me",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdwa81/",
      "created": 1728637337,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lre1x28",
      "score": 2,
      "body": "Never China. I don’t trust communists and business.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre1x28/",
      "created": 1728641301,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lre2i0w",
      "score": 4,
      "body": "No. The only exotic stock that seems trustable to me is the India Nifty 50. India is the new China. Have a look at the long term development of the Nifty 50.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre2i0w/",
      "created": 1728641687,
      "depth": 0,
      "replies": [
        {
          "id": "lrfif8r",
          "score": 0,
          "body": "New China? When did the China market ever perform? Their markets have under-performed the last 30 years. And every few years someone repeats the same crap, that they are going to be the best investment. Its not going to happen and its because of their laws. Meanwhile, India markets have run circles around them.\n\nSo in other words, when it comes to business and financial markets, China wishes it was the new India. Not the other way around. \n\nDont fall for the BS rhetoric. Remember China is not free speech and they tightly control their media so that no can say anything negative about them over there. China is like those pretentious douches who have no money but drive expensive cars to show off. They are fakes. India is the polar opposite. THey are the rich guy who drives a Prius so no one knows he is rich.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrfif8r/",
          "created": 1728662789,
          "depth": 1,
          "replies": [
            {
              "id": "lrfsmrk",
              "score": 1,
              "body": "You got that wrong. I have spoken of India as the new China, with reference to its reliable economic growth in the coming years. China has long delivered high growth in GDP. From this perspective, India is now the new China.",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrfsmrk/",
              "created": 1728666102,
              "depth": 2,
              "replies": [
                {
                  "id": "lrgmd3x",
                  "score": 2,
                  "body": "LoL who do you suppose reports growth in China? Do you think its an independent source that verifies information? No chief. GDP growth in China is reported you by your friendly CCP representative and has always been highly questionable.\n\nIn other words, no matter how bad we know a year was in China, if Xi says its 5% GDP growth, do you suppose that there is an auditor anywhere in China who will stand up and say no? Without \"disappearing\" the next day?\n\nThis is exactly the problem with their businesses auditing as well. Do you think any auditor has the courage to report something bad about a CCP sponsored business without putting their family or themselves at risk? China is a NOT a free speech nation. There is no way to verify. When it comes to anything the CCP manages, they control the financial reports and can make them anything they want. This is sort of like their COVID mortality numbers which the world knows was also fake.",
                  "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrgmd3x/",
                  "created": 1728675893,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrjks8w",
                      "score": 1,
                      "body": "Watch films about China in the 1950s and watch films today, e.g. about the new Silk Road. The change from an agricultural to a high-tech society is obviously linked to growth. You don't have to trust official Chinese sources. Trust your eyes, you can look at Chinese products and touch them. They are real. But the Chinese stock market remains an adventure due to unreasonable state intervention in the economy.",
                      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrjks8w/",
                      "created": 1728726427,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrjrpby",
                          "score": 1,
                          "body": "China underwent a huge shift under Mao. This is well known. But in the last 30 years, every big mouth analyst and their mother has been saying to invest in China saying insane things like their economy will zoom ahead of the USA by 2020 and so on. Of course that date keeps getting pushed forward and in reality, they fell behind the USA since 2000. The mania was real and it keeps coming back every few years only to thud again. \n\nThe stuff you are seeing on their street today is tech creep. Creep has been rather brisk the last 30 years. It wasnt China specific. Pics of high growth USA cities over the last 30 years are stark but if you want to see something like China, check out Panama, Thailand, Singapore, Qatar, Dubai, Brazil, Malasia, and im sure we can find many more if we try. All of them had huge leaps forward thanks to tech advancement and creep. That in itself, if not remarkable. Its the history of human civilization.",
                          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrjrpby/",
                          "created": 1728731064,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lre46ms",
          "score": 0,
          "body": "You have good idea to invest in India. I am from India, and we here too, look to diversify our investment by investing a proportion of our investment in US.\n\nI am investing in US through a Nasdaq 100 index fund offered by an Indian AMC.\n\nOn China, I am still not confident to put my money, still thinking.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre46ms/",
          "created": 1728642761,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrdyr29",
      "score": 1,
      "body": "HSI and Alibaba (9988) have done well for me. I'd add more to my position if HSI gets to 20,000 again.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdyr29/",
      "created": 1728639116,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lre61pv",
      "score": 1,
      "body": "If I wasn't greedy and respected the stop loss I set, I would've made a good profit on HK stock market last week..",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre61pv/",
      "created": 1728643885,
      "depth": 0,
      "replies": [
        {
          "id": "lreeb27",
          "score": 1,
          "body": "You can still short it with YANG.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lreeb27/",
          "created": 1728648189,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lre6m1d",
      "score": 1,
      "body": "I bought NIO. It has a unique advantage with the battery swapping technology with \\~ 2500 stations out of 3500 stations existing. \n\nThere are 100k gas stations in China, so they have a lot more room to build even internally. \n\nThe problem is scaling production and so much money was already thrown into them, while payouts from utilization are yet to bear fruit. I think cash flow will dramatically increase in coming years and give the company room to grow.\n\nThe negative scenario is that competition is very tough inside China and tariffs will impact somewhat the chane to sell to Europe and USA. I still believe that selling to MENA, Latam, Russia, UK, Norway, etc. is sufficient to bring global numbers up. The deal they made with Dubai will give them more exposure to the Islamic part of the world which has the cash to afford their more premium vehicles.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre6m1d/",
      "created": 1728644213,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lre6tmt",
      "score": 1,
      "body": "Yeah, i own ETFs for Japan (A1T8FU), China (DBX0M2) and Developed Asia ex Japan (A1T8FT) which includes hong kong.\n\nI think it's a good choice to be geographically diversified when investing passively. I understand not applying the same logic when stock picking though, because then there is more importance placed on the individual stock rather than some property shared by the stocks (like the region).",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre6tmt/",
      "created": 1728644333,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lre8bmz",
      "score": 1,
      "body": "No",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre8bmz/",
      "created": 1728645171,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrecna6",
      "score": 1,
      "body": "Only in ex us etfs. I have very little confidence in any of their economies in the long run so individual stocks are a no go for me.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrecna6/",
      "created": 1728647396,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lredjuu",
      "score": 1,
      "body": "I YANG China",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lredjuu/",
      "created": 1728647831,
      "depth": 0,
      "replies": [
        {
          "id": "lrejusn",
          "score": 1,
          "body": "youre basically transferring your money to me",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrejusn/",
          "created": 1728650640,
          "depth": 1,
          "replies": [
            {
              "id": "lrek1vc",
              "score": 1,
              "body": "Let's see by Monday.",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrek1vc/",
              "created": 1728650721,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrefhm3",
      "score": 1,
      "body": "Chinese stocks have had a lot of power and the best place to find gold is near a gold mine. If they set up, maybe a small position in FXI.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrefhm3/",
      "created": 1728648735,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrefv8o",
      "score": 1,
      "body": "China is leading in the majority of crucial technologies according to an Australian study. China is definitely the way to go and they will, within the next 2-3 decades, probably be the technological hub of the future.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrefv8o/",
      "created": 1728648907,
      "depth": 0,
      "replies": [
        {
          "id": "lreqydq",
          "score": 1,
          "body": "Yes their technology is the leader, but their leader is hard to understand sometimes...",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lreqydq/",
          "created": 1728653438,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrejop1",
      "score": 1,
      "body": "There should already be some in VT.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrejop1/",
      "created": 1728650568,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrekere",
      "score": 1,
      "body": "Im still holding Alibaba; its a trusted medium for EV sales, & China is going to continue to rock that market outside of the U.S.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrekere/",
      "created": 1728650867,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lreoqty",
      "score": 1,
      "body": "Its in the spread. But I won't go more than FTSE ETFs are weighting them. China market is waay to instable and basically in a 1920s phase where all private people think they can become rich playing casino on SE. And Japan is basically a contracting nation. It will have 10% less people in 2050, which would be bad for my pension investment.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lreoqty/",
      "created": 1728652591,
      "depth": 0,
      "replies": [
        {
          "id": "lrercla",
          "score": 1,
          "body": "Thank you for summing it all up, esp Japan.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrercla/",
          "created": 1728653588,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lreozaf",
      "score": 1,
      "body": "I have a JPN ETF which is pretty much flat for me but I am seriously considering selling it, marking my losses <1% because I can’t see any trigger to kick it upwards… I only see the BOJ doing more monetary policy to put pressure on pricing…\n\nAnyone have any thoughts?",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lreozaf/",
      "created": 1728652682,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lreukg3",
      "score": 1,
      "body": "Been in JP stocks before and during the big dip recently.  \n\nIndustrials and teck over there will fare well in a soft landing environment.  Technically the index is strong.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lreukg3/",
      "created": 1728654775,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lreytmc",
      "score": 1,
      "body": "Yes it’s called VXUS",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lreytmc/",
      "created": 1728656280,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrf08i3",
      "score": 1,
      "body": "Nah",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrf08i3/",
      "created": 1728656771,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrf5k9b",
      "score": 1,
      "body": "VXUS is as foreign as I get ",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrf5k9b/",
      "created": 1728658571,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrflyf0",
      "score": 1,
      "body": "only US makes money",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrflyf0/",
      "created": 1728663950,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrfnl46",
      "score": 1,
      "body": "Sit on the sideline till EOY 🇺🇸 stock market that is after the massive crash then get in. Reap the benefits",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrfnl46/",
      "created": 1728664484,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrfzr3x",
      "score": 1,
      "body": "Nope. I called PDD and a few others before they pumped, still didn't buy.\n\n\nRather go to a Casino. Both can lose me money but at least one of them is fun. ",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrfzr3x/",
      "created": 1728668411,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrgu4rd",
      "score": 1,
      "body": "> which stocks are you holding and why?\n\nI don't know enough about China to pick winners. So I go with $KWEB. I also like that KWEB is holding the shares on the Hong Kong stock exchange. I got in when Chinese economy was doing terrible.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrgu4rd/",
      "created": 1728678493,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrgwd1b",
      "score": 1,
      "body": " Bought NIO back, holding a little bag but just a smidge",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrgwd1b/",
      "created": 1728679240,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrgxe3f",
      "score": 1,
      "body": "No, yes, no.\n\n\nChina isn't free - long-term planning is literally trusting the supreme leader. Japan is too developed to be investible as a lump, and I am not familiar enough with individual Japanese stocks. Korea is a very interesting market that is closed to most of us (without ETFs), but we know that 2023-2024 was amazing for Korean heavy machinery and defence companies (noting that past performance doesn't mean much). ",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrgxe3f/",
      "created": 1728679586,
      "depth": 0,
      "replies": [
        {
          "id": "lrgxvsd",
          "score": 2,
          "body": "Beyond the pumpendumpen nature of China \"stock market\", always remember what happened to those that investing in Moscow Exchange. It's always a risk to literally have your investment reduced to 0 (zero).",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrgxvsd/",
          "created": 1728679753,
          "depth": 1,
          "replies": [
            {
              "id": "lrimftm",
              "score": 1,
              "body": "I quite like the comparison to that of Moscow Exchange. Also, you're quite right about the Supreme Leader...",
              "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrimftm/",
              "created": 1728704445,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrhbvx8",
      "score": 1,
      "body": "Japan maybe. CHINA … never",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrhbvx8/",
      "created": 1728684796,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lricmlh",
      "score": 1,
      "body": "I bet on China companies with global presence PDD, HTHT etc. but with small positions. Largely on Japanese, since Yen with capacity to increase value?",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lricmlh/",
      "created": 1728699943,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrj12hu",
      "score": 1,
      "body": "Too much monies in Us, not interested in the inevitable communist rag pull… admittedly I made a quick buck on Yinn and got out tho.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrj12hu/",
      "created": 1728712622,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrj31cs",
      "score": 1,
      "body": "xiaomi and SMIC show promise and growth",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrj31cs/",
      "created": 1728713893,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrn70o0",
      "score": 1,
      "body": "Little late to the party",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrn70o0/",
      "created": 1728776933,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lro4p6l",
      "score": 1,
      "body": "Will invest a small stake in Chinese funds when the Shanghai Index falls back to the 2750s.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lro4p6l/",
      "created": 1728790834,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lroal1w",
      "score": 1,
      "body": "stay away from China.  its economy is collapsing and its human population is going to collapse.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lroal1w/",
      "created": 1728793682,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrqyxwr",
      "score": 1,
      "body": "Depends. If Trump wins, then no.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrqyxwr/",
      "created": 1728840658,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrxw5ml",
      "score": 1,
      "body": "I have Sony and toyota\n\nI plan on getting a playstation and have a toyota car",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrxw5ml/",
      "created": 1728941100,
      "depth": 0,
      "replies": [
        {
          "id": "ls1ghie",
          "score": 1,
          "body": "And they're down",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/ls1ghie/",
          "created": 1729001156,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrdywqg",
      "score": 1,
      "body": "Investing in countries with a declining population makes little sense except for undervalued stocks which globalise. Add that to the silly economic policies of China/Hong Kong (they are interchangeable now) and you get a recipe for disaster. I'd say the most promising markets in Asia are India and Singapore.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrdywqg/",
      "created": 1728639232,
      "depth": 0,
      "replies": [
        {
          "id": "lreb9cw",
          "score": 1,
          "body": "Sadly, I kinda agree though.",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lreb9cw/",
          "created": 1728646716,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lre1dno",
      "score": 1,
      "body": "No - there is plenty of opportunity elsewhere.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre1dno/",
      "created": 1728640941,
      "depth": 0,
      "replies": [
        {
          "id": "lre4dgu",
          "score": 1,
          "body": "OK... Such as?",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre4dgu/",
          "created": 1728642880,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lre68mr",
      "score": 1,
      "body": "Taiwan is the only correct answer",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre68mr/",
      "created": 1728643997,
      "depth": 0,
      "replies": [
        {
          "id": "lre9sl3",
          "score": 2,
          "body": "Right, what stocks from TWN though? TSM?",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre9sl3/",
          "created": 1728645955,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrevds4",
      "score": 1,
      "body": "None of the above. Never, ever.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrevds4/",
      "created": 1728655066,
      "depth": 0,
      "replies": [
        {
          "id": "lrfc4fd",
          "score": 1,
          "body": "Like ever? 😂",
          "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrfc4fd/",
          "created": 1728660744,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lre2fyh",
      "score": 0,
      "body": "No",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre2fyh/",
      "created": 1728641648,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrey80l",
      "score": 0,
      "body": "I hold Nintendo and a GBP hedged Nikkei 225.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lrey80l/",
      "created": 1728656070,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lre039m",
      "score": -1,
      "body": "Hahaha....no.",
      "permalink": "/r/stocks/comments/1g15c2z/will_you_get_in_on_china_hk_or_japan_stocks/lre039m/",
      "created": 1728640069,
      "depth": 0,
      "replies": []
    }
  ]
}