{
  "title": "\nTesla shares drop 6% in premarket after Cybercab robotaxi reveal fails to impress",
  "score": 1706,
  "selftext": "Shares of electric vehicle maker Tesla tumbled Friday after the company’s long-awaited robotaxi event — where CEO Elon Musk unveiled the firm’s Cybercab self-driving concept car — failed to impress investors.\n\nTesla stock was down 5.8% as of 6:33 a.m. ET in premarket trading on Friday.\n\nMusk revealed Tesla’s Cybercab concept vehicle — a low, silver two-seater, has no steering wheels or pedals — on Thursday night. The plan is for the car to be capable of driving itself autonomously when it launches.\n\nThe Tesla boss said the company hopes to be producing the Cybercab before 2027, but offered no details on where the cars will be manufactured. He said consumers would be able to buy a Tesla Cybercab for a price tag under $30,000.\n\nHe also said he expects Tesla to have “unsupervised FSD” up and running in Texas and California next year in the company’s Model 3 and Model Y electric vehicles. FSD, which stands for Full Self-Driving, is Tesla’s premium driver assistance system, available today in a “supervised” version for Tesla electric vehicles.\n\nThe technology still requires a human driver at the wheel, ready to steer or brake at any time.\n\nIn reaction to the Thursday event, analysts at Barclays said that the revelations had failed to highlight any near-term opportunities for Tesla, instead prioritizing Musk’s vision for a fully autonomous driving future.\n\n“As expected, like prior Tesla product unveils, the event was light on the details, and instead emphasized the vision underpinning Tesla’s growth endeavors in AI/AV \\[autonomous vehicles\\],” Barclays’ U.S. autos & mobility team wrote in the note early on Friday.\n\n“Yet there were no updates indicating near-term opportunities. Tesla didn’t show its low-cost model planned for 1H′25 production,” they added. “We also didn’t get any near-term updates on FSD progress, or data reflecting improvement in the system.”\n\nPiper Sandler analysts said in a separate Friday note that “most trading-oriented firms will be underwhelmed by the robo-taxi unveiling.”\n\n“We wouldn’t be surprised if the stock sells off in the coming weeks, as pre-event momentum fizzles,” the investment bank’s analysts said in the note.\n\nMorgan Stanley, meanwhile, suggested that Musk failed to make the case that Tesla is an AI company during the event. The bank’s analysts noted that Musk didn’t mention any details on improvements to Tesla’s FSD system, nor did the billionaire go into detail regarding rumored plans of a tie-up between Tesla and xAI, Musk’s AI company. Musk has previously denied such reports.\n\nThe event “overall disappointed expectations on a number of areas: a lack of data regarding rate-of-change on FSD/tech, ride-share economics and go-to-market strategy,” Morgan Stanley’s analysts wrote in a note Friday.\n\n“We were overall disappointed with the substance and detail of the presentation. As such, we anticipate TSLA to be under pressure following the event,” they added.\n\nIt is expected to take some years still before self-driving cars become a mainstream reality on public roads, with regulators concerned over the safety features embedded into such vehicles.\n\nAmong the few companies that have successfully launched self-driving cars on public roads is Google’s Waymo, which has offered its robotaxi service to the general public since June.",
  "link_flair_text": "Company News",
  "id": "1g18fon",
  "num_comments": 566,
  "created_utc": 1728649167,
  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/",
  "comments": [
    {
      "id": "lrejvhc",
      "score": 1040,
      "body": "Ah, good reminder to update my timeline.\n\n~~One million robotaxis on the road in 2020.~~  \n~~One million robotaxis on the road in 2021.~~  \n~~One million robotaxis on the road in 2022.~~  \n~~One million robotaxis on the road in 2023.~~  \n~~One million robotaxis on the road in 2024, but in China.~~  \n~~One million robotaxis on the road in 2025.~~  \nOne million robotaxis on the road in 2026. <-- you are here  \nOne million robotaxis on the road before 2027.  \nOne million robotaxis on the road in 2027.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrejvhc/",
      "created": 1728650648,
      "depth": 0,
      "replies": [
        {
          "id": "lremwpe",
          "score": 169,
          "body": "Looks like a Simpsons intro",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lremwpe/",
          "created": 1728651874,
          "depth": 1,
          "replies": [
            {
              "id": "lrfg483",
              "score": 24,
              "body": "God dammit",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfg483/",
              "created": 1728662038,
              "depth": 2,
              "replies": [
                {
                  "id": "lrgbl1p",
                  "score": 11,
                  "body": "Surely you must mean \"d'oh\", yes?",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgbl1p/",
                  "created": 1728672275,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lrek8p7",
          "score": 262,
          "body": "Tesla: Coming Next Year Since 2016",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrek8p7/",
          "created": 1728650798,
          "depth": 1,
          "replies": [
            {
              "id": "lrf61sr",
              "score": 40,
              "body": "Tesla: One of the world's foremost AI companies that gave all the orders of high-demand Nvidia GPUs that it reserved to an entirely different company because they ostensibly didn't realize that you need a building to run one of the world's largest supercomputing clusters, as they don't work lying in a Texas field. Who knew?",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf61sr/",
              "created": 1728658731,
              "depth": 2,
              "replies": [
                {
                  "id": "lrf7u0o",
                  "score": 50,
                  "body": "I'm still shocked he wasn't sued for that by shareholders.\n\nImagine if Starbucks CEO was found to have given high-demand orders of coffee beans to Dunkin Donuts because he's also the CEO there, too. And tries to say it's a good thing for Starbucks to license coffee orders from Dunkin.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf7u0o/",
                  "created": 1728659327,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrenw5y",
              "score": 37,
              "body": "Sometimes he was saying later THIS year (in previous years).",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrenw5y/",
              "created": 1728652261,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lreo29y",
          "score": 97,
          "body": "“We’ll introduce an alternative healthcare plan in two weeks”. Rinse and repeat.\n\nNo wonder Trump and Musk get along so well.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreo29y/",
          "created": 1728652326,
          "depth": 1,
          "replies": [
            {
              "id": "lrf8ruu",
              "score": 36,
              "body": "he has the concepts of a plan",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf8ruu/",
              "created": 1728659639,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrku20u",
              "score": 2,
              "body": "#dumptesla",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrku20u/",
              "created": 1728747142,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lres9wc",
          "score": 28,
          "body": "Worth every penny of that $50B. No one else could  have pulled that off.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lres9wc/",
          "created": 1728653939,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrfjrqv",
          "score": 13,
          "body": "Elon Musk: “I know I tend to be optimistic on timelines..”\n\nAudience: _*Laughs in agreement_",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfjrqv/",
          "created": 1728663228,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrfqsfx",
          "score": 11,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfqsfx/",
          "created": 1728665514,
          "depth": 1,
          "replies": [
            {
              "id": "lrg8e9s",
              "score": 8,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrg8e9s/",
              "created": 1728671223,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lreoyfh",
          "score": 8,
          "body": "The arrow is very helpful!",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreoyfh/",
          "created": 1728652672,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lro5ggw",
          "score": 2,
          "body": "Apply the same criticism to most expectations coming out of Elon’s mouth; the only viable thing about Tesla are their SEXY lineup and sale projections aren’t good. Stock is overpriced.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lro5ggw/",
          "created": 1728791191,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrej1rb",
      "score": 562,
      "body": "It’s a concept of a plan!",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrej1rb/",
      "created": 1728650301,
      "depth": 0,
      "replies": [
        {
          "id": "lrep0gs",
          "score": 164,
          "body": "It is also a concept of car design failure.  They need to fire all the designers.  Cyber truck looks stupid, and now, two cars that can’t even go over a speed bump or pot holes.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrep0gs/",
          "created": 1728652694,
          "depth": 1,
          "replies": [
            {
              "id": "lretc9b",
              "score": 116,
              "body": "2 seater makes little sense too. You remove the constraints of a driver should be easy to make it seat 4 or even 6 comfortably",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lretc9b/",
              "created": 1728654330,
              "depth": 2,
              "replies": [
                {
                  "id": "lrewkh8",
                  "score": 75,
                  "body": "He reinvented a Pontiac fiero and a city bus that looks like a toaster.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrewkh8/",
                  "created": 1728655487,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrfl7za",
                      "score": 6,
                      "body": "Dammit! I had completely forgotten Pontiac Fieros! \n\nHow manner jokes did Click and Clack make about them?",
                      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfl7za/",
                      "created": 1728663708,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lrf7qpo",
                  "score": 27,
                  "body": "Yep.  Who is a two seater for?  If the business model is replace or sell these to Uber/Lyft, then they're kneecapping themselves immediately.  Plus, the relatively empty space for 2 more seats doesn't add that much to the build costs or lifetime costs.  Maybe more frequent charges, but I can't imagine it's more than 15% more frequent just based on weight.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf7qpo/",
                  "created": 1728659297,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrgpfv8",
                      "score": 14,
                      "body": "For a man who sure loves people having kids he didn’t think of family convenience with the 2 seater option.  Supposed to rent a whole suv that fits a sports team for my kid to have his own seat with two parents 😂 yeah right",
                      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgpfv8/",
                      "created": 1728676917,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrh2vz9",
                          "score": 9,
                          "body": "Because, like his own child rearing method, he believes people should have the kids, but forgets about the part where you are supposed to raise them.",
                          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrh2vz9/",
                          "created": 1728681495,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lrg9cup",
                      "score": 2,
                      "body": "Being generous to them, I think their idea is sell autonomous cars as a \"luxury\" option instead of the cheap option. The hope being that by making it feel luxury, people will actually want it over a car driven by a human being.\n\nThat might work in other fields (branding a wine as luxury could help margins even in the face of cheaper and perhaps even outright superior competition), but I question whether that would be beneficial in the taxi space. While there might be a niche of business clients that would gravitate to what's perceived as the luxury option, I think the vast majority of people using an app like Uber/Lyft just go for whatever's cheapest. Especially with the safety of autonomous cars still in question and the whole concept making some uncomfortable, I imagine the only way autonomous cars catch on in the mainstream is for them to be the more affordable, practical option compared to cars with a driver.\n\nIf autonomous cars are simply another option, but not a cheaper one, then I don't believe the majority of people would choose it at this time (perhaps that's an error on my part, though).",
                      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrg9cup/",
                      "created": 1728671542,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrgdkcb",
                          "score": 3,
                          "body": "I can't find an easily sourced breakdown for Uber of what % of rides are Uber Black, so it's hard to say what the luxury market is there, but my feeling is it's pretty minimal.  People generally, especially for short drives, want the cheapest point a to b option.  And short drives are where these cars make the most sense.  So yeah, I agree with you that I don't see the use case for these vehicles as designed.  Plus, the thought of these operating in nighttime pickups, where drunk people are congregrating and acting like idiots in the streets and cars seems like a test of Tesla FSD it is not going to pass.",
                          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgdkcb/",
                          "created": 1728672929,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lreq702",
              "score": 31,
              "body": "I don't think that's an engineer's decision.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreq702/",
              "created": 1728653147,
              "depth": 2,
              "replies": [
                {
                  "id": "lrezkfh",
                  "score": 35,
                  "body": "Can almost guarantee a designer made something that looked great, and Musk would tell them to make it “more futuristic” over and over until we get these shitty designs.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrezkfh/",
                  "created": 1728656537,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrht46y",
                      "score": 3,
                      "body": "I believe that's exactly what happened. At least at some point in the development phase...",
                      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrht46y/",
                      "created": 1728691679,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lricabj",
                          "score": 2,
                          "body": "Yea IIRC Musk had made design choices for one of the tesla models that conflicted with functionality. It definitely wouldnt be the first time his final say managed to screw with the process.",
                          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lricabj/",
                          "created": 1728699794,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrjeymn",
                              "score": 2,
                              "body": "Let me guess...the cybertruck😂",
                              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrjeymn/",
                              "created": 1728722217,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lrevbpm",
              "score": 12,
              "body": "My understanding - which I’d love to be corrected if wrong - is that Elon really pushed for the Blade Runner design",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrevbpm/",
              "created": 1728655046,
              "depth": 2,
              "replies": [
                {
                  "id": "lrfmlus",
                  "score": 11,
                  "body": "Also my understanding. No way a team of designers came up with the cybertruck. It looks exactly like something an edgelord shitposting middle schooler would design.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfmlus/",
                  "created": 1728664164,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrjrjo9",
                      "score": 2,
                      "body": "It would have been fine as a one-of-a-kind art project. Insisting on putting the monstrosity on the road is where it becomes inappropriately stupid.",
                      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrjrjo9/",
                      "created": 1728730970,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lrft26p",
                  "score": 3,
                  "body": "\"No no no!  No! I told you! Make it look like a can of shaving cream!\"",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrft26p/",
                  "created": 1728666243,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrf3jae",
              "score": 4,
              "body": "Dont forget the cyber van or whatever that thing is. Im still not sure if it looked like a toaster or a stapler.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf3jae/",
              "created": 1728657894,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrg8bdo",
              "score": 2,
              "body": "> They need to fire all the designers. \n\nElon Musk is probably the one picking/directing the design. Firing the designers won't help if this is what Musk wants them to design.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrg8bdo/",
              "created": 1728671196,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrh1xrk",
              "score": 2,
              "body": "They need to fire Elon. \n\nHe's the one who's green-lighting and promoting all of these stupid projects (Robotaxi, Cybervan, Cybertruck, CyberATV, Next-Gen Tesla Roadster, Tesla Semi, etc..)",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrh1xrk/",
              "created": 1728681164,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrlz2b9",
          "score": 3,
          "body": "I’m Donald Trump and I approve this message.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrlz2b9/",
          "created": 1728760807,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lreim5m",
      "score": 384,
      "body": "Meme stock, meme CEO, meme products",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreim5m/",
      "created": 1728650116,
      "depth": 0,
      "replies": [
        {
          "id": "lrejqyk",
          "score": 123,
          "body": "Meme prices too. ",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrejqyk/",
          "created": 1728650595,
          "depth": 1,
          "replies": [
            {
              "id": "lreluyb",
              "score": 60,
              "body": "Même customers",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreluyb/",
              "created": 1728651456,
              "depth": 2,
              "replies": [
                {
                  "id": "lrfba4f",
                  "score": 13,
                  "body": "Même merde, jour différent",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfba4f/",
                  "created": 1728660470,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrhr98b",
                      "score": 4,
                      "body": "Oui, c'est la verite",
                      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrhr98b/",
                      "created": 1728690910,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lreqpuj",
                  "score": 7,
                  "body": "Oui",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreqpuj/",
                  "created": 1728653347,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lreuqff",
          "score": 33,
          "body": "At some point, and I think we've passed that point, this is not a meme stock anymore, it's a scam.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreuqff/",
          "created": 1728654835,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lreyskz",
          "score": 18,
          "body": "I have a mild feeling, TSLA may go below 170 once investors realize Elon musk magic is kinda getting boring and old. Fundamentally speaking Tesla isn’t even worth $100. Only bag holders left with be memevestors",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreyskz/",
          "created": 1728656270,
          "depth": 1,
          "replies": [
            {
              "id": "lrf5f47",
              "score": 6,
              "body": "I have Jan 120 puts so let's hope!",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf5f47/",
              "created": 1728658523,
              "depth": 2,
              "replies": [
                {
                  "id": "lrg2xth",
                  "score": 3,
                  "body": "Date?",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrg2xth/",
                  "created": 1728669436,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrgy5v3",
                  "score": 2,
                  "body": "i wish you all the fortunes",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgy5v3/",
                  "created": 1728679850,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lrehpye",
      "score": 354,
      "body": "The event was just a \"nothing burger\" as this event was his pure fantasy and not possible to go public in the near future. Even other traditional carmakers could have arranged such events.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrehpye/",
      "created": 1728649728,
      "depth": 0,
      "replies": [
        {
          "id": "lres1wb",
          "score": 106,
          "body": "Dont tell the Fanbois that. \n\nThey were basically cumming when they saw the Airport shuttle come out.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lres1wb/",
          "created": 1728653857,
          "depth": 1,
          "replies": [
            {
              "id": "lret0zk",
              "score": 41,
              "body": "it makes no sense. there's no use case for a 20 seater.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lret0zk/",
              "created": 1728654217,
              "depth": 2,
              "replies": [
                {
                  "id": "lrevv6l",
                  "score": 85,
                  "body": "Wdym?\n\nI'm personally glad that Tesla was able to invent the bus.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrevv6l/",
                  "created": 1728655239,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrft5kt",
                      "score": 24,
                      "body": "It’s a cyberbus, it’s totally different than a bus!",
                      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrft5kt/",
                      "created": 1728666274,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lrfq413",
                      "score": 15,
                      "body": "A vehicle that will perform best when it has to drive along an extremely narrow set of guidelines on the road and make periodic stops at predetermined locations (because we sure as hell can't let it drive itself on regular traffic roads since FSD is a pipe dream).. it's almost like a train 🤔 but for the road. What do we call this new invention 🤔🤔.",
                      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfq413/",
                      "created": 1728665298,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrgxo82",
                          "score": 15,
                          "body": "monorail!\n\nMONORAIL!\n\n**MONORAIL!**\n\n#MONORAIL!",
                          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgxo82/",
                          "created": 1728679682,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrh4sbx",
                              "score": 7,
                              "body": "Hype Simpsons episode.",
                              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrh4sbx/",
                              "created": 1728682172,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lrgd90s",
                          "score": 2,
                          "body": "A driverless carriage?",
                          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgd90s/",
                          "created": 1728672825,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lrf5s0s",
                  "score": 28,
                  "body": "Elon has 12 kids with three women.. You try driving them all around at once in a mini van. He has clearly identified a need",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf5s0s/",
                  "created": 1728658642,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrhougp",
                      "score": 6,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrhougp/",
                      "created": 1728689920,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lretpjm",
                  "score": 6,
                  "body": "I mean there is, but airports already have trains/monorail/people mover systems.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lretpjm/",
                  "created": 1728654464,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrgwhym",
                      "score": 5,
                      "body": "You'd be surprised at how many airports/airplanes still offload you on the tarmac and have you get on a bus to the airport/gate/plane. Usually they're \"accordion\" buses, with more than 20 seats.. but i can see the Tesla taxi-bus doing good in that sort of environment. Preset pickup and drop of locations. Short distances, infrastructure (power available) pretty much ready to install chargers. Just \"chain\" multiple busses according to people demand...",
                      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgwhym/",
                      "created": 1728679286,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lrf67ui",
                  "score": 6,
                  "body": "Come on, of course there is! The libertarian wet dream of privatizing public transport is exactly the use case. A bus with no poors allowed! The future! ",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf67ui/",
                  "created": 1728658787,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrfpvab",
                  "score": 2,
                  "body": "It’s a bus without poor people on. \n\nBut also a total waste of time unless you have 19 friends.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfpvab/",
                  "created": 1728665220,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lrekk31",
          "score": 139,
          "body": "I'm shocked no one has mentioned the Tesla cab appears to have no additional sensors.\n\n\nThis is beyond dead on arrival.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrekk31/",
          "created": 1728650928,
          "depth": 1,
          "replies": [
            {
              "id": "lrekxrb",
              "score": 32,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrekxrb/",
              "created": 1728651085,
              "depth": 2,
              "replies": [
                {
                  "id": "lrevxs6",
                  "score": 10,
                  "body": "Texas maybe for sure not in CA. The whole event is way off from robotaxi expectations. I don’t think for the current FSD iteration, the on road robotaxi is possible.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrevxs6/",
                  "created": 1728655264,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrfioc0",
                  "score": 6,
                  "body": "The playbook is probably make it seems like regulator is blocking his failed robotaxi because of political reasons. Then he can claim that it’s ready, just blocked by regulator. ",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfioc0/",
                  "created": 1728662872,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrfhn54",
              "score": 5,
              "body": "well, it sort of doesn't matter, because it doesn't exist.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfhn54/",
              "created": 1728662531,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrh4ja1",
              "score": 2,
              "body": "They’ve been saying they’re going vision only for years, nobody expected extra sensors. Elon has been pretty clear about that",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrh4ja1/",
              "created": 1728682081,
              "depth": 2,
              "replies": [
                {
                  "id": "lrh5yzv",
                  "score": 2,
                  "body": "Except they 100% need extra sensors and they know it.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrh5yzv/",
                  "created": 1728682600,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lrejjsy",
          "score": 21,
          "body": "The event started with a massive disclaimer the stream. I never paid attention but they might have done it on other streams too.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrejjsy/",
          "created": 1728650512,
          "depth": 1,
          "replies": [
            {
              "id": "lrelcym",
              "score": 43,
              "body": "It didn’t help that the event started at midnight on the east coast.  But it does seem like investors are wising up.  It’s just wild how much trust has been burned up by Elon.  You can’t trust that these taxis will come out when they do.  You can’t trust that these taxis that he’s demoing aren’t actually driving themselves.  You can’t trust that the robots are automated.  You can’t trust his comments about FSD.  \n\nYes, Elon won the race for a fully EV fleet but it’s been 4 years since the explosion of Tesla stock and they have been struggling since.\n\nIn Teslas defense, I don’t think it’s fully just a Tesla thing.  Facebook and Apple coming out with these “smart” glasses is just more shit from tech companies that no body wants and it’s just a waste of investor resources honestly.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrelcym/",
              "created": 1728651255,
              "depth": 2,
              "replies": [
                {
                  "id": "lrepifg",
                  "score": 17,
                  "body": "It’s everybody’s obsession with this AI bubble. Even apples ads for “apple intelligence” are a down right scam. I bought the iPhone 16 and now realize we are months to a year+ away from actually using what was advertised to me…",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrepifg/",
                  "created": 1728652885,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrevup7",
                  "score": 9,
                  "body": "> It didn’t help that the event started at midnight on the east coast.\n\nNo, that actually did help the event. It was so terrible it is actually a plus that less people saw it.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrevup7/",
                  "created": 1728655234,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrenem1",
                  "score": 9,
                  "body": "🙋 I want smart glasses",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrenem1/",
                  "created": 1728652072,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lri7t2e",
                  "score": 2,
                  "body": "Buddy of mine had the FB Goggles 🥽 but it still made him dizzy 😵. VR can be fun but it's really 1/2 hour immersion and that's it. The Apple version is priced like a contractor quote when they don't want the job. Probably someone at Apple was smart enough to see that this won't get much traction and so they left it at the advanced stage prototype without sinking billions like the guy who names his company after the Metaverse did.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lri7t2e/",
                  "created": 1728697862,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lrfw7tm",
          "score": 5,
          "body": "I found it funny they literally did it on the Warner Bros lot and the van looks straight out of their 90’s animated Batman series. Played out more like a kitschy live theme park show than a genuine tech presentation.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfw7tm/",
          "created": 1728667264,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lremvok",
          "score": 27,
          "body": "Other traditional car makers would have done a far better job.  \n\nTesla \"Full Self Driving\" is SAE Level 2 or partially automated driving.  \n\nWaymo and Mercedes have up to Level 4 highly automated.  Which means that human interference in the driving is hardly needed.  Tesla did a demonstration of a Tesla cab in San Fransisco a few months ago.  With an employee behind the wheel.  Who was continually having to correct the \"Autopilot\", otherwise it was just simply going to crash.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lremvok/",
          "created": 1728651862,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lreqbak",
          "score": 6,
          "body": "well what I saw was that Tesla may have given up on the lower cost traditional vehicle market which is big if true. they also admitted FSD 3 equipped cars will not have FSD.  Oh, the hopes people had for a work van were completely dashed.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreqbak/",
          "created": 1728653192,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrgatxj",
          "score": 3,
          "body": "> not possible to go public in the near future\n\nWhich is wild because Waymo already exists. Even if Tesla announced that their self-driving cars were being released tomorrow, they wouldn't be first to market.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgatxj/",
          "created": 1728672027,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lreiucs",
      "score": 118,
      "body": "There is no way in hell that he will gets approval for FSD in 2025 in TX and CA.   He still has issues with NTSB and he will need to show accident rates will decrease to below humans.  The big stumble blocks will be what happens when AI and or cameras go down.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreiucs/",
      "created": 1728650213,
      "depth": 0,
      "replies": [
        {
          "id": "lrel89b",
          "score": 54,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrel89b/",
          "created": 1728651203,
          "depth": 1,
          "replies": [
            {
              "id": "lrepybs",
              "score": 15,
              "body": "At that point FSD should actually get deactivated. FSD should not be available unless all sensors/cameras are functional. It could limp to failure if one of them fail.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrepybs/",
              "created": 1728653055,
              "depth": 2,
              "replies": [
                {
                  "id": "lrf417v",
                  "score": 23,
                  "body": "Now imagine you're in a robotaxi, in a bad area, and folks setup traps... and FSD shuts down... yay!",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf417v/",
                  "created": 1728658060,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrfgtbq",
                      "score": 14,
                      "body": "Demolition man!",
                      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfgtbq/",
                      "created": 1728662262,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lrfhf3q",
                      "score": 10,
                      "body": "That's already happening to Waymo (who actually has redundancy in sensors). There's been multiple videos of people forcing the cars to stop to harass the passengers or vandalize the cars. It's a problem for sure.",
                      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfhf3q/",
                      "created": 1728662457,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrfm2tq",
                          "score": 5,
                          "body": "Well if it's causing issues for Waymo, just imagine the Tesla implementation, it would probably hand the attackers firearms from a concealed compartment on the side.",
                          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfm2tq/",
                          "created": 1728663991,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrgkehz",
                              "score": 3,
                              "body": "why not the Boring Flamethrower",
                              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgkehz/",
                              "created": 1728675227,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lrgre9w",
                  "score": 2,
                  "body": "That's exactly what my BMW does. Comes up with a big _\"[assistive system] is not available\"_ warning when the sensors are obscured from dirt/heavy rain/ice. Obviously the difference being I'm driving regardless, but it doesn't try and fake it in the meantime.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgre9w/",
                  "created": 1728677574,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lrel7n5",
          "score": 39,
          "body": "He may get it in Texas but not in Cali.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrel7n5/",
          "created": 1728651196,
          "depth": 1,
          "replies": [
            {
              "id": "lremzpi",
              "score": 14,
              "body": "God I hate my state’s leaders",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lremzpi/",
              "created": 1728651906,
              "depth": 2,
              "replies": [
                {
                  "id": "lrfbgy4",
                  "score": 4,
                  "body": "Don’t worry, Ted Cruz is almost certainly about to be re-elected",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfbgy4/",
                  "created": 1728660531,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lrf01vq",
          "score": 14,
          "body": "> There is no way in hell that he will gets approval for FSD in 2025 in TX\n\nHe will get approval for whatever the hell he wants in Texas. He has gone all in on the kind of right-wing politics that runs that state and promised to move all of his businesses there. They will give him anything he wants.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf01vq/",
          "created": 1728656707,
          "depth": 1,
          "replies": [
            {
              "id": "lrf3rf4",
              "score": 7,
              "body": "He needs NTSB approval first and that is not happening.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf3rf4/",
              "created": 1728657968,
              "depth": 2,
              "replies": [
                {
                  "id": "lrf4s0x",
                  "score": 6,
                  "body": "Why do you think he's [spending $45 million a month to elect Donald Trump as President](https://www.wsj.com/politics/elections/elon-musk-has-said-he-is-committing-around-45-million-a-month-to-a-new-pro-trump-super-pac-dda53823)?",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf4s0x/",
                  "created": 1728658311,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lreng8t",
          "score": 8,
          "body": "I'd be more interested in who is responsible for accident/insurance if un-supervised FSD got into accident on its own.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreng8t/",
          "created": 1728652089,
          "depth": 1,
          "replies": [
            {
              "id": "lrfi1va",
              "score": 4,
              "body": "It has to be the manufacturer or it's not unsupervised (Level 4+). Although I suspect there would be some nuance there if it was caused due to some neglect by the owner of the car.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfi1va/",
              "created": 1728662666,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrf5lh4",
              "score": 4,
              "body": "The owner, same deal as if you let someone else drive your car.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf5lh4/",
              "created": 1728658581,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrekcqb",
      "score": 212,
      "body": "That Robovan was so embarrasing. Why are they so against making a regular ass electric bus. A bus is better in every way than that thing. Bigger, can have a bathroom, you don’t have to fucking face someone else during your ride, it has more than 1 inch of ground clearance, etc. \n\nHe started talking about moving sports teams around and I almost laughed out loud in my living room. Buses have been moving sports teams for a century and they’re not getting replaced. It’s like Tesla is the child in Babadook. Why can’t you just be NORMAL?\n\nNot only that, he didn’t really list any useful things for Optimus to do.\n\nLaundry? Dishes? Cleaning? Not mentioned.\n\nPlaying… games? Being your “friend”? Yeah he talked about that, because people are going to pay $30k for a robot to play rock paper scissors with and listen to their problems. He’s too out of touch to be doing this anymore.\n\nAll you need to know about this clown is in 2019 he gave it 1-1.5 years to have, quote: “a million robotaxis on the road”. 5 years later and we still only have a concept of a plan.\n\nThis guy has been cooked ever since he sabotaged high speed rail in California for his failed Hyperloop venture, which was ridiculous from the start. Yeah, it’s totally feasible to maintain hundreds of miles of tubes at a complete vacuum in one of the most Earthquake centric zones on the planet. Fucking idiot.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrekcqb/",
      "created": 1728650844,
      "depth": 0,
      "replies": [
        {
          "id": "lremsvc",
          "score": 79,
          "body": "The idiocy is that people have kept believing despite all the BS, while he's made himself insanely rich.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lremsvc/",
          "created": 1728651832,
          "depth": 1,
          "replies": [
            {
              "id": "lrev4fr",
              "score": 35,
              "body": "Spot on. Yes, he's an idiot and a scam artist. But the people believing his crap are the real idiots here.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrev4fr/",
              "created": 1728654972,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lreu0ez",
              "score": 7,
              "body": ">made himself insanely rich.\n\nPretty sure his grifting will ruin him eventually, just will take some time.  The downfall is going to be glorious",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreu0ez/",
              "created": 1728654575,
              "depth": 2,
              "replies": [
                {
                  "id": "lrjo5yk",
                  "score": 3,
                  "body": "It's practically impossible for someone with that wealth to be ruined.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrjo5yk/",
                  "created": 1728728783,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lrevqjp",
          "score": 32,
          "body": "Boring tunnel and robo van. \n\nTech bros keep finding ways to reinvent existing mass transit.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrevqjp/",
          "created": 1728655192,
          "depth": 1,
          "replies": [
            {
              "id": "lrf0ke4",
              "score": 17,
              "body": "Mass transit is dirty europoor stuff, American exceptionalism can't think of that as desirable.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf0ke4/",
              "created": 1728656884,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrjbce5",
              "score": 3,
              "body": "I actually laughed out loud when he called autonomously cars “individualised mass transit”. Like no, even an autonomous car still gets stuck in traffic. And he just glances of the fact that during rush hour, where are you gonna get your robot taxi, when everybody else needs it too?",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrjbce5/",
              "created": 1728719624,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrfuzw4",
          "score": 12,
          "body": ">Why can’t you just be NORMAL?\n\nBecause normal companies making normal cars or busses exist. And they're valued at a fair price considering their current product portfolio and financial performance. \n\nMusk and Tesla need to keep the scam going that at some point in the future they will reinvent transportation, because otherwise even the fanboys will start comparing them to VW, Toyota or Ford and notice a slight discrepancy in valuation.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfuzw4/",
          "created": 1728666871,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrfbbze",
          "score": 6,
          "body": "\"Why are they so against making a regular\" same reason Twitter is now X(not really tho) because the guy somehow needs to be somewhat unique and quirky in spite of everything that is sane.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfbbze/",
          "created": 1728660486,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lreqm0x",
          "score": 2,
          "body": "Oh, I could see it being used to move some teams in some events around.  Musk would be paying them to let him do it though.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreqm0x/",
          "created": 1728653306,
          "depth": 1,
          "replies": [
            {
              "id": "lrhpy3d",
              "score": 5,
              "body": "This short bus won't hold most teams, especially with coaches and support staff.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrhpy3d/",
              "created": 1728690372,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrethgf",
          "score": 2,
          "body": "hey, if that robot gets girlfriend functionality, i'm day 1",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrethgf/",
          "created": 1728654382,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrkrlro",
          "score": 2,
          "body": "Can’t sell buses to potential brainwashed consumers but a van you can. You can convince the “entrepreneur” that the van they will buy will operate automatically and charge customers like a ride share. You will make money on the purchase just after 6 months!!!",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrkrlro/",
          "created": 1728746304,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrejm53",
      "score": 59,
      "body": "Lmao well deserved. And it’s gonna be a double whammy with earnings in late October. I see this going below 200 again",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrejm53/",
      "created": 1728650539,
      "depth": 0,
      "replies": [
        {
          "id": "lrevmqx",
          "score": 14,
          "body": "I shorted the stock last week, and will hold until after earnings. It really doesn't take a crystal ball to know that this company is beyond overpriced for the scammy hype that it is. This should be below 150, period.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrevmqx/",
          "created": 1728655155,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrekgth",
          "score": 18,
          "body": "Below 200? It would surprise me if Tesla stock is over 150 in November.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrekgth/",
          "created": 1728650891,
          "depth": 1,
          "replies": [
            {
              "id": "lrekk56",
              "score": 15,
              "body": "I really like your prediction. But I think it’s gonna take a lot to get down there",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrekk56/",
              "created": 1728650928,
              "depth": 2,
              "replies": [
                {
                  "id": "lrekzss",
                  "score": 4,
                  "body": "A cocktail of bad auto sales, margin compression and less short-term fantasy could lead to significant triple multiple compression in the near term. But we'll see; I won't be a buyer unless it gets around 100 dollars.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrekzss/",
                  "created": 1728651107,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrk0su5",
              "score": 2,
              "body": "RemindMe! 40 days",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrk0su5/",
              "created": 1728735858,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrejren",
      "score": 38,
      "body": "Get your ass to Mars",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrejren/",
      "created": 1728650601,
      "depth": 0,
      "replies": [
        {
          "id": "lrfmgol",
          "score": 6,
          "body": "ELON, you son of a bitch",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfmgol/",
          "created": 1728664117,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrejqi4",
      "score": 98,
      "body": "What a turd of an event. \n\nI'm expecting a 20% drop in the stock. \n\nThey used literal smoke and mirrors to try to disguise the fact that all they did was push the timelines back a couple of years. \n\nThey havent put any effort into thinking through the operational reality of running a robotaxi network, waymo are years ahead. \n\nAnd the bot is kind of a cool gimmick and saying \"oh it'll look after your kids\" just shows a frankly childish level of delusion and unwillingness to actually think about what it could uselessly do. \n\nPathetic.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrejqi4/",
      "created": 1728650590,
      "depth": 0,
      "replies": [
        {
          "id": "lrelmc4",
          "score": 37,
          "body": "Not sure how they expected any hype out of this when nearly everything they’re advertising as ‘the future’ Waymo is already doing in Arizona.\n\nAlso I genuinely could not believe he didn’t mention more useful chores for Optimus to do. He mentioned playing games and being your friend. \n\nThe FIRST thing someone is going to want a robot to do is the boring stuff. He needs to hammer the words laundry, dishes, vacuuming, cleaning, etc. in his head if he wants anyone to be excited about this, but unfortunately he’s far too out of touch to be considering those peasant activities.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrelmc4/",
          "created": 1728651359,
          "depth": 1,
          "replies": [
            {
              "id": "lrevap5",
              "score": 20,
              "body": "He doesn't know what those tasks are 😂",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrevap5/",
              "created": 1728655036,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrf707o",
              "score": 9,
              "body": "Hell waymo is doing it here in LA I see one almost every day now. They appear to be extremely close.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf707o/",
              "created": 1728659051,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrf73ux",
              "score": 5,
              "body": "Why would a robot do that when his servants are cheaper?",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf73ux/",
              "created": 1728659085,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrfhhnc",
              "score": 5,
              "body": "We’ve been able to do the friend thing since Asimo, but robots are amazingly bad at any cleaning/tidying job at the moment. They’re tricky (involve picking up random objects and folding fabric) and they have very bad failure outcomes (your favourite shirt gets ripped and plates go everywhere.) so they won’t advertise it until they’ve managed to solve it (which is a long way off imo)",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfhhnc/",
              "created": 1728662481,
              "depth": 2,
              "replies": [
                {
                  "id": "lrftsr6",
                  "score": 5,
                  "body": "Those are exactly the things I would have assumed they were going to demonstrate they have begun to solve during this event. Instead we got rock paper scissors and dancing.\n\nMake it pick up a dish in the sink, wipe the grime off, and put it in the dishwasher. Make it carry a hamper full of laundry down a flight of stairs and then load it into the machine and press a few buttons. Make it grab the vacuum out of the closet, unwind the cord, plug it in, and use it, then put it all away. Make it be able to check how full the vacuum container is and empty it if necessary. Make it be able to meet you at your car and carry the groceries in.\n\nObviously this is incredibly, incredibly difficult. Nearly insurmountable. But this is why you have a huge company pouring billions into it. Especially with the leaps and bounds being made with AI, it seems more possible than ever.\n\nThese are the things that will make this the future. Figure it out, mass produce it, improve the quality of life of EVERYONE. Millions of human hours per year are wasted on chores. Fill that space with productivity and creativity and who knows what comes of it.\n\nSomehow, it doesn’t seem like they’re trying to convey this message or purpose with Optimus at all. We get dancing and rock paper scissors.",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrftsr6/",
                  "created": 1728666483,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lreozok",
          "score": 28,
          "body": "The robotics thing just showcases the lack of vision. Marching out a robot that does nothing but one day promises to do everything is way less impressive than showing a robot that has a single use case that people can immediately and intuitively understand.\n\nWatching a giant arm attached to wheels stack heavy boxes, I can see the future. Watching a humanoid wobble onto a stage and do nothing is just a vision of a very rich nerdy sci-fi fan.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreozok/",
          "created": 1728652686,
          "depth": 1,
          "replies": [
            {
              "id": "lreqkyw",
              "score": 7,
              "body": "that's the beauty of it, it doesn't *do* anything",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreqkyw/",
              "created": 1728653295,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrfcddj",
          "score": 3,
          "body": "> “oh it’ll look after your kids”\n\n“Alright, mom and I are going out for the evening. We’re leaving you with a faceless mechanical humanoid who doesn’t care about you or even understand you, but don’t worry: the faceless part is a guaranteed phobia in children, and also we can’t trust it to guarantee your physical safety\n\nAnyway, my $30k ford probe wannabe is overheating from idling in the driveway so we gotta go”",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfcddj/",
          "created": 1728660826,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrehaku",
      "score": 53,
      "body": "Please quote the source:\n\n[https://www.cnbc.com/2024/10/11/tesla-tsla-stock-drops-in-premarket-after-cybercab-robotaxi-reveal.html](https://www.cnbc.com/2024/10/11/tesla-tsla-stock-drops-in-premarket-after-cybercab-robotaxi-reveal.html)",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrehaku/",
      "created": 1728649540,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrewkcb",
      "score": 10,
      "body": "Some good news for $RIVN 🤪",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrewkcb/",
      "created": 1728655486,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lreokp2",
      "score": 17,
      "body": "No steering wheel or pedals, so there is no way to take over when the system glitches or bricks, or there is an internet connectivity outage, or road/weather conditions are so bad that the system cannot handle it. Great.\n\nWhy is this stock priced ridiculously higher than the other car companies again? It's just hot air and empty promises of \"Someday Trust Me Bro\"",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreokp2/",
      "created": 1728652525,
      "depth": 0,
      "replies": [
        {
          "id": "lrf2m8w",
          "score": 5,
          "body": "Tesla is hardly the only one to do that. GM/Cruise and Waymo have both done it, and so have countless others trying to make self driving vehicles.\n\nIMO it should illegal under Federal law for them to make vehicles without a steering wheel/etc. until it's been proven and certified by the government to be safe driving anywhere in the US without any human intervention. You're just asking a whole heap of trouble otherwise. The government should be protecting people from such dangerous experimentation on public roads with no emergency override safety measures. And I'm saying this as someone who fully believes that they'll eventually solve self driving.\n\nIt'd be like an airplane company working on anti-gravity boots to replace the parachute deciding that even though their anti-gravity boots don't work yet, they don't need to put parachutes in their planes anymore since the boots kind of work when you're dozens of feet off the ground.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf2m8w/",
          "created": 1728657587,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrnl0lp",
          "score": 2,
          "body": "I think there’s a MadCatz controller ala Titan in the glovebox. Oh oops, the glovebox got deleted by Leon.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrnl0lp/",
          "created": 1728782497,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrg0zrt",
      "score": 7,
      "body": "It was so nice of Elon to build short buses just for his followers",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrg0zrt/",
      "created": 1728668812,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lreloux",
      "score": 34,
      "body": "Another hyped up, underwhelming Musk product.  Not surprised.  Can Elon just fade into oblivion now?  I know that will never happen, but fuck that guy a million times over.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreloux/",
      "created": 1728651387,
      "depth": 0,
      "replies": [
        {
          "id": "lreri2t",
          "score": 13,
          "body": "His presentation was EMBARRASSING. Dude presented like an unprepared middle schooler",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreri2t/",
          "created": 1728653646,
          "depth": 1,
          "replies": [
            {
              "id": "lrf37yk",
              "score": 7,
              "body": "Does he think that he's Steve Jobs or something? If he's that bad at presenting why doesn't get get  a pro to do it?",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf37yk/",
              "created": 1728657790,
              "depth": 2,
              "replies": [
                {
                  "id": "lrfbk6w",
                  "score": 7,
                  "body": "He definitely got the narcism of Steve Job's nailed down",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfbk6w/",
                  "created": 1728660560,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrfboln",
                  "score": 3,
                  "body": "Ego. He truly thinks he’s a genius",
                  "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfboln/",
                  "created": 1728660600,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrfmnxx",
              "score": 7,
              "body": "Dude is a little busy shitposting on X, while trying to be CEO of multiple companies. Even if he wanted to, he is obviously spreading himself thin. Though less Elon might actually be desirable, depending on who you ask.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfmnxx/",
              "created": 1728664183,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrfodjt",
      "score": 5,
      "body": "they don't have the hype to do these fake vapourware events anymore",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfodjt/",
      "created": 1728664741,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrel2v3",
      "score": 15,
      "body": "The 30k price point tells us something. He is lumping the robotaxi and sub 30k cheap ev car into one project. Not sure if it’s good or bad.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrel2v3/",
      "created": 1728651142,
      "depth": 0,
      "replies": [
        {
          "id": "lrff6fh",
          "score": 12,
          "body": "Idk what the point of the taxi is. Two seats is really impractical, especially for a pure people mover. It has all the practicality of a Miata and none of the fun.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrff6fh/",
          "created": 1728661734,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrevyy0",
          "score": 7,
          "body": "bad for sure 😭",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrevyy0/",
          "created": 1728655275,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lreq5g4",
      "score": 14,
      "body": "I look at it this way.  \n  \nGiven that nothing in this presentation is supposed to be available before 2026 and all products were shown are not capable of being driven and as such it pretty much tells many that Tesla has no intention of expanding their offering in replacing traditional vehicles. There is no smaller model Y that many hoped for and two seat vehicles have some of the lowest numbers among traditional cars.\n  \nHowever the real issue is that they made it clear only current HW4 vehicle will have true FSD and that all previous generations will not.  Elon actually deflected that very question.  This can possibly open them up to being sued by customers and stock holders.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreq5g4/",
      "created": 1728653131,
      "depth": 0,
      "replies": [
        {
          "id": "lrevovf",
          "score": 13,
          "body": "It is time for Elon to pay the piper and he knows it. It’s why he aligned himself with trump and it is why many prominent figures have left the company recently",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrevovf/",
          "created": 1728655176,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrerdjy",
      "score": 10,
      "body": "Jfc \n\nI have an idea. Maybe give the CEO another $50 billion so he can buy another social media company",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrerdjy/",
      "created": 1728653598,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrev8am",
      "score": 5,
      "body": "Even ChatGPT is not impressed:  \n  \n\"Looks like the Cybercab's promise of self-driving independence hit a speed bump! Investors were expecting autopilot, not a bumper sticker of aspirations. Maybe next time, Elon should include a ‘steering wheel’ option for confidence—at least it’ll give shareholders something to hold onto while waiting for that *real* ride-sharing revolution! 🚗💨 #Tesla #Robotaxi\"",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrev8am/",
      "created": 1728655011,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrey8q7",
      "score": 5,
      "body": "Musk: our newly announced*insert model name* will be available next year.\n\n\nSaid Elon Musk since 2019.....while missing deadline every year. 🤣",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrey8q7/",
      "created": 1728656077,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrewipf",
      "score": 10,
      "body": "how has elon made it as far as he has with such abysmal public speaking skills? i watched a short recap of the event and it was just awful to try to listen to him talk.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrewipf/",
      "created": 1728655470,
      "depth": 0,
      "replies": [
        {
          "id": "lrii4fg",
          "score": 3,
          "body": "Elon’s made it where he is because of his connections he made from PayPal honestly",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrii4fg/",
          "created": 1728702369,
          "depth": 1,
          "replies": [
            {
              "id": "lrjjd2q",
              "score": 2,
              "body": "But he’s had to convince some big early investors and whatnot. How could anyone take what he’s saying seriously.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrjjd2q/",
              "created": 1728725404,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrgca86",
          "score": 2,
          "body": "He takes after his role model.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgca86/",
          "created": 1728672506,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrehitf",
      "score": 18,
      "body": "Robo Taxi event but the Robo Taxi was the worst part of the event?",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrehitf/",
      "created": 1728649640,
      "depth": 0,
      "replies": [
        {
          "id": "lreldv0",
          "score": 10,
          "body": "The robovan was the worst part. At least the taxis looked like they could be functional. That van goes over a pebble and it gets stuck, and looks like it can transport less than half the people of one (1) regular bus.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreldv0/",
          "created": 1728651265,
          "depth": 1,
          "replies": [
            {
              "id": "lrelgxd",
              "score": 11,
              "body": "Agree I’m a NYC guy. It would never survive a single road in Brooklyn",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrelgxd/",
              "created": 1728651299,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrgx50d",
              "score": 2,
              "body": "I liked the enclosed front wheels. That was a design feature of the first Saab in the 40s. It makes the car very aerodynamic .. until it snows and the snow gets packed in the wheel well and you try to stear around rhe next corner and nothing happens.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgx50d/",
              "created": 1728679501,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrei74f",
          "score": 15,
          "body": "There hasn't been any real progress. It's fine, but it's clearly not that much closer to being real. It would have been a GREAT opportunity to show data demonstrating improvements in FSD, or progress in getting FSD approved in cali and Arizona, but there wasn't because there isn't any. Like....look at how much of the farm is being bet on robotaxis, yet if they were fully ready TODAY....it would be illegal to use them",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrei74f/",
          "created": 1728649934,
          "depth": 1,
          "replies": [
            {
              "id": "lreiw8r",
              "score": 21,
              "body": "There's more to it than that. He announced, on Elon Time, a Robotaxi release for 2027. He is already 2 years behind his competitors who are already on the streets across the world. How much more competition will there be in another 3-7 years? Just like the Robot. He unveiled a Robot that Boston Dynamics has already well passed many years ago...not including the already mass competition in that market.\n\n-Edit- And the van...he literally showcased the  futuristic version of the trolley. This mans future vision is the written past.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreiw8r/",
              "created": 1728650236,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrgv67a",
          "score": 2,
          "body": "Should’ve named it Johnny Cab",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgv67a/",
          "created": 1728678842,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrezf0t",
      "score": 3,
      "body": "\"People, nobody likes them, not even people.\" -Gregory Corso\n\nIt will work.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrezf0t/",
      "created": 1728656485,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrejv5p",
      "score": 19,
      "body": "Tesla should be down 90% by this point",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrejv5p/",
      "created": 1728650644,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrer8a9",
      "score": 3,
      "body": "Why I sold my stake with a small profit and never looking back. Sick of TSLA and it's bipolar prices",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrer8a9/",
      "created": 1728653542,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrew30f",
      "score": 3,
      "body": "Tesla stock always responds to events like this because it’s heavily traded on rumors and news.\n\nInvestors take time to digest the information. We’ll know in a week if there is enthusiasm for these plans or not.\n\nPersonally I wasn’t impressed with the timeline or the vehicles. The company was once an innovator but is now just trying to replicate a dystopian Pail Verhoven  future.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrew30f/",
      "created": 1728655315,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrexoyi",
      "score": 3,
      "body": "Should’ve known it would’ve been shit. From cyber to this",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrexoyi/",
      "created": 1728655886,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrf2x2n",
      "score": 3,
      "body": "He's the most unserious CEO of a major company",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf2x2n/",
      "created": 1728657688,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrfs18c",
      "score": 3,
      "body": "Still 10X overvalued",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrfs18c/",
      "created": 1728665910,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lreoxz5",
      "score": 7,
      "body": "Hope it goes to zero the guy is a massive IDIOT.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreoxz5/",
      "created": 1728652668,
      "depth": 0,
      "replies": [
        {
          "id": "lrf1l0u",
          "score": 7,
          "body": "Not going to happen, the rest of the business is still quite viable and profitable.",
          "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf1l0u/",
          "created": 1728657234,
          "depth": 1,
          "replies": [
            {
              "id": "lrh5lp0",
              "score": 3,
              "body": "Car brands go to zero all the time",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrh5lp0/",
              "created": 1728682466,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lricgmk",
              "score": 2,
              "body": "The way it's going, the rest of business is not going to be too viable for too long.",
              "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lricgmk/",
              "created": 1728699871,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lremtdi",
      "score": 5,
      "body": "Damn now it's at a price where it was...1 month ago",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lremtdi/",
      "created": 1728651837,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lresx3o",
      "score": 3,
      "body": "Should have named it Johnny Cab",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lresx3o/",
      "created": 1728654176,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrelzkw",
      "score": 4,
      "body": "Lol. The guy is useless. What a joke.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrelzkw/",
      "created": 1728651508,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lremylr",
      "score": 6,
      "body": "A two-seat car that is supposed to be a mass transit vehicle. Make is make sense to me.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lremylr/",
      "created": 1728651895,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrejyrj",
      "score": 8,
      "body": "Elmo being sapped by maga virus.  130 eoy",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrejyrj/",
      "created": 1728650685,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrenont",
      "score": 2,
      "body": "Did you copy the CNBC news story on this topic?",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrenont/",
      "created": 1728652180,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lreuvfk",
      "score": 2,
      "body": "Bullshit",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreuvfk/",
      "created": 1728654884,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrevmsk",
      "score": 2,
      "body": "Primary message conveyed by the event: Nobody at Tesla can tell Musk no.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrevmsk/",
      "created": 1728655155,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrf0071",
      "score": 2,
      "body": "Showed to my wife. Not impressed.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf0071/",
      "created": 1728656691,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrf8m5j",
      "score": 2,
      "body": "2 seats. Why does it have 2 seats!?!?\n\nSurely the first model would be made to support the most use cases",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf8m5j/",
      "created": 1728659586,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrf93e2",
      "score": 2,
      "body": "My Pillow of cars. Trump follower trying to pump stock.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrf93e2/",
      "created": 1728659745,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrg2uep",
      "score": 2,
      "body": "FUCK YOU ELON",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrg2uep/",
      "created": 1728669405,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrgc5qx",
      "score": 2,
      "body": "The tech might not have wowed the market as much as people hoped, and the reaction seems to reflect some skepticism about its immediate potential. It’s a reminder that even big reveals from companies like Tesla aren’t guaranteed to impress everyone. Curious to see how they bounce back from this.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgc5qx/",
      "created": 1728672465,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrgfdod",
      "score": 2,
      "body": "hahahaaa musk the magat",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgfdod/",
      "created": 1728673530,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrgfhbo",
      "score": 2,
      "body": "So the current fsd isn't safe enough for robotaxis but is ok for every day normal people to be driving around with. Good plan, can't see any holes in it",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgfhbo/",
      "created": 1728673564,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrgim6r",
      "score": 2,
      "body": "No one wants one and it doesn’t actually exist.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgim6r/",
      "created": 1728674617,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrgje0h",
      "score": 2,
      "body": "I watched the video of musk getting in a car. What even was that. Everyome was clapping like he was being a good trained monkey. But nothing impressive happened?",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrgje0h/",
      "created": 1728674882,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrh03g2",
      "score": 2,
      "body": "Fuck Elon and his bs bat gadgets",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrh03g2/",
      "created": 1728680517,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrjmo5o",
      "score": 2,
      "body": "I guess shareholders also weren't impressed with the humanoid robots being remotely controlled and interacting with the crowd using voice actors.",
      "permalink": "/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lrjmo5o/",
      "created": 1728727751,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "Tesla shares drop 6% in premarket after Cybercab robotaxi reveal fails to impress.",
    "companies": [
      "Tesla",
      "Barclays",
      "Piper Sandler",
      "Morgan Stanley",
      "xAI",
      "Google",
      "Waymo"
    ],
    "tickers": [
      "TSLA"
    ],
    "main_ticker": [
      "TSLA"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Tesla's recent Cybercab robotaxi reveal event failed to impress investors, resulting in a 6% drop in premarket trading.",
    "stock_recommendations": "The user is indirectly implying to sell TSLA stock.",
    "is_recommending_stock_buying_or_selling": true,
    "buy_or_sell": "sell",
    "sentiment_summary": "There is negative sentiment due to the disappointment expressed by analysts over the lack of details in Tesla's presentation and their expectation of additional stock pressure as a result.",
    "sentiment": "negative"
  }
}