{
  "title": "TESLA CYBERCAB VS WAYMO : AN ANALYSIS ",
  "score": 92,
  "selftext": "For all the regards who don't know, Waymo is the market leader in true autonomous vehicles right now. They have been operating a fleet of robo taxis (fully autonomous cars) in multiple cities for a while now. \n\nSo I did a short comparison and analysis. \n\n\n\nKEY POINTS FROM \"WE, ROBOT\" EVENT:\n\n\n\n1. The robotaxi is a purpose-built autonomous vehicle, lacking a steering wheel or pedals, meaning it will need approval from regulators before going into production.\n\n.\n.\n\n2. Tesla plans to launch fully autonomous driving in Texas and California next year, with the Cybercab production by 2026 — although he said it could be as late as 2027. \n\n.\n.\n\n3. Tesla is developing the Optimus robot, which could be available for $20,000-$30,000, and is capable of performing various tasks.\n\n\n.\n.\n\n4. Cybercab was revealed the prototype robotaxi at Tesla's \"We, Robot” event held at the Warner Bros. film lot in Burbank, California, with a lot of non-public roads for the demonstration. \n\n\n.\n.\n\n5. Tesla has reportedly been mapping the area in advance of the demonstration, even though the company says it doesn't rely on high-definition maps to power its Full Self-Driving (FSD) driver-assist feature\n\n\n.\n.\n.\n\n\nTESLA VS WAYMO : KEY DIFFERENCES IN TECHNOLOGY AND APPROACH \n\n\n\n.\n.\n\n1. Sensing the World:\n\n -  - Waymo's Multi-Sensor Fusion:  Waymo uses a suite of sensors that work together. This is like having multiple senses.\n\n\nI. Lidar:  Acts like super-precise radar, creating a 3D \"point cloud\" of the surroundings. This excels in low-light and complex environments.\n\nII. Radar: Detects objects and their speed, even in rain or fog.\n   \n\nIII. Cameras: Provide visual information for recognizing objects like traffic lights and pedestrians.\n\n\n\n\n- - Tesla's Vision-Only System: Tesla relies heavily on cameras, believing that they can provide enough data for AI to understand the world like humans do.\n\n\nI. Neural Networks:  Tesla uses powerful AI to process the visual data from cameras.\n\n\nII. No Lidar:  Tesla famously excludes lidar, arguing it's expensive and unnecessary.\n\n\n- Why this matters:  Lidar provides highly accurate depth and distance data, which is crucial for navigating complex situations. Tesla's vision-only approach is more ambitious but may struggle in conditions where cameras are less effective (e.g., heavy rain, fog).\n\n\n\n.\n.\n\n\n2. Understanding the Environment:\n\nI. Waymo's HD Maps: Waymo creates incredibly detailed 3D maps of the areas where its vehicles operate. These maps include road geometry, lane markings, traffic signs, and even the positions of trees and buildings.\n\n\nII.  Localization: This allows Waymo's cars to precisely locate themselves within the map, even in challenging conditions.\n\n\nIII. Predictability:  Maps help anticipate what's coming and plan routes accordingly.\n\n\nIV.  Tesla's Real-Time Learning: Tesla relies less on pre-mapped environments. Its AI learns to interpret the world in real-time, based on the data it gathers from its cameras.\n\n\nV. Generalization: The goal is to create a system that can drive anywhere, not just in pre-mapped areas.\n\n\nVI. Adaptability: Tesla's system can potentially adapt to new environments and situations more quickly.\n\n\n\n- - Why this matters: Waymo's HD maps provide a high level of certainty in known areas, but mapping is expensive and time-consuming. Tesla's approach is more scalable but relies heavily on the AI's ability to correctly interpret complex scenes.\n\n\n\n.\n.\n.\n\n3. Deployment Strategies:\n\nI. Waymo's Gradual Rollout: Waymo has focused on deploying its robotaxi service in specific cities, starting with Phoenix. This allows for careful testing and refinement in controlled environments.\n\n\nII.  Safety First:  Waymo prioritizes safety and has a strong track record.\n\nIII.  Controlled Expansion:  They expand their service area gradually as they gain confidence in their technology.\n\n\n\n IV.  Tesla's Beta Testing: Tesla has released its Full Self-Driving (FSD) beta software to a wider group of drivers. This allows them to gather vast amounts of real-world driving data.\n\n\nV.  Rapid Iteration:  Tesla can quickly improve its system through frequent software updates.\n\n\n VI. Driver Responsibility:  FSD is still a driver-assist system, and drivers are expected to remain vigilant and take over when necessary.\n\n\n- -  Why this matters: Waymo's approach is more cautious, prioritizing safety and controlled testing. Tesla's approach is faster and more agile, but it also carries more risk, as evidenced by accidents involving FSD.\n\n\n\nThese are some of the core differences between Waymo and Tesla's approach to self-driving. Both companies are pushing the boundaries of technology, but their philosophies and strategies are quite distinct. It will be fascinating to see how these approaches evolve in the years to come.\n\n\n\n. . . . . .  . \n\n\nEDIT:  THE MUSK PARADOX \n\n\nThe entire Tesla brand is highly dependent on Elon. Essentially Elon is Tesla. A lot of the Tesla Brand value is tied up with Elon Musk the human.\n\nThis wasn't a problem in the past when Elon seemed like a nerd who just loved tech and posted memes.\n\nFast forward to 2024, the guy is full blow republican (not saying it's bad or good). He is actively involved with politics.\n\nIMO, He's too busy \"owning the libs\" and fighting cultural wars (\"woke virus\"). \n\nNow combine this with his other behavioral problems like self administration of ketamine and using other drugs, and we have a recipe for disaster.\n\n\nFYI, I'm not an Elon Hater. I used to admire him and it's sad to watch his downfall.\n\n\n. . . . .\n\n\n. . . . .\n\nTLDR;\n\n\nIMO, the event was Very Disappointing. \n\nElon announced (NOT ACTUALLY LAUNCHED) basically what he has been promising for years (TRUE AUTONOMY AKA FSD).\n\nIt was no different than the previous announcements of FSD and Cybertruk.\n\nI expect delays (regulatory approvals and the actual tech being ready).\n\n\n. . . . .\n\n\n\n. . . . . \n\n\nUPDATE :\n\n. . . . . \n\nFor all the regards who don't understand what WAYMO actually is, I just did another post analyzing Google (the owner of Waymo) and why they're the number 1 player in AI, robotics and self driving.\n\n. . .\n\nhttps://www.reddit.com/r/wallstreetbets/s/d3tSIKLRIJ",
  "link_flair_text": "Discussion",
  "id": "1g188s3",
  "num_comments": 150,
  "created_utc": 1728648554,
  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/",
  "comments": [
    {
      "id": "lref3tb",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 420 | **Previous Best DD** | \n**Account Age** | 4 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lref3tb/",
      "created": 1728648560,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lreh457",
      "score": 59,
      "body": "I like the TLDR part!",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lreh457/",
      "created": 1728649462,
      "depth": 0,
      "replies": [
        {
          "id": "lrfkris",
          "score": 46,
          "body": "Elon announced concepts of a plan",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfkris/",
          "created": 1728663557,
          "depth": 1,
          "replies": [
            {
              "id": "lrjv9wc",
              "score": 1,
              "body": "Following his mentor to the letter",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrjv9wc/",
              "created": 1728733091,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrg71yg",
          "score": 12,
          "body": "Here’s my TLDR of OP as someone in Phoenix who almost exclusively takes Waymo \n\nWaymo - I’ve taken over 100+ waymo trips, I call it and it’s there 5 minutes later. I don’t have to make annoying small talk, the car is always clean, I don’t have to listen to whatever bullshit the driver is playing, I get to relax and just enjoy the vibes. It feels like getting a first class seat/ride every time. \n\nTesla - I’ll let you know in 2026 (lmao we all know 2030)",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrg71yg/",
          "created": 1728670783,
          "depth": 1,
          "replies": [
            {
              "id": "lrgj192",
              "score": 21,
              "body": "Sounds like you have waymo experience than most people",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrgj192/",
              "created": 1728674761,
              "depth": 2,
              "replies": [
                {
                  "id": "lrgrinz",
                  "score": 1,
                  "body": "God Damit you got me",
                  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrgrinz/",
                  "created": 1728677616,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrgr4u1",
              "score": 1,
              "body": "My last Uber ride the driver talked for 30 minutes straight",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrgr4u1/",
              "created": 1728677486,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrjiw79",
              "score": 1,
              "body": "100+ eh. How many times was it a jaguar?",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrjiw79/",
              "created": 1728725065,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrehtj3",
          "score": 12,
          "body": "![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrehtj3/",
          "created": 1728649771,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrf50vp",
      "score": 19,
      "body": "If you want to know, how badly Tesla needs FSD, just ask yourself, why Musk drove up the share price with \"mysterious\" FSD hype, just to announce, that he hasn´t got it.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf50vp/",
      "created": 1728658393,
      "depth": 0,
      "replies": [
        {
          "id": "lrf5bu9",
          "score": 4,
          "body": "Agree.",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf5bu9/",
          "created": 1728658494,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lremgrg",
      "score": 107,
      "body": "Here's my analysis. One is currently doing 100,000 fares on a regular basis and the other is a bunch of smoke and mirrors and cringe \"robots\".",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lremgrg/",
      "created": 1728651698,
      "depth": 0,
      "replies": [
        {
          "id": "lreqpje",
          "score": 24,
          "body": "Yeah it seems like a lot of Tesla investors are not different than other MOASS/MEME stock investors.",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lreqpje/",
          "created": 1728653344,
          "depth": 1,
          "replies": [
            {
              "id": "lrf4qs8",
              "score": 7,
              "body": "I tried to convince my friends that now TSLA has become a meme stock (more like a snake oil business). But they tried to counteract my facts (given with legitimate sources) with their facts (their sources : said didn't have the sources now because they read it few months ago = facts were pulled out of their ass). They only accepted (not sure whether temporarily) after the price drop after this event.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf4qs8/",
              "created": 1728658299,
              "depth": 2,
              "replies": [
                {
                  "id": "lrf5hoy",
                  "score": 6,
                  "body": "Sound  like Elon fanboys on Twitter lmao ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)",
                  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf5hoy/",
                  "created": 1728658546,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrfhvq3",
                  "score": 0,
                  "body": "As soon as it climbs back up, (let's be real, it will, sooner or later) their confidence will come back and you'll be back to square one.",
                  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfhvq3/",
                  "created": 1728662609,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrfisf9",
                      "score": 0,
                      "body": "It will probably be back at $240 before earnings",
                      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfisf9/",
                      "created": 1728662909,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lrevo8q",
              "score": 0,
              "body": "Been that way for a long while",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrevo8q/",
              "created": 1728655170,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrfuun4",
          "score": 3,
          "body": "Yeah honestly it tells you everything you need to know that one was unveiled on the WB lot in Hollywood like the show that it is, and one has been grinding and actively driving in Silicon Valley for years, perfecting its tech product",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfuun4/",
          "created": 1728666824,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lreqihy",
      "score": 9,
      "body": "Do you think Tesla's Cybercabs will have input from the Tesla's that are currently being driven? The omission of LIDAR is an interesting decision considering there is no way for a rider to take control in an emergency. With Tesla's real-time learning, if the taxi's have access to all the Tesla data they could potentially reduce risk especially during limited-visibility operations. I do not  fully understand Tesla's FSD capabilities but I feel that if Tesla has the ability to make a network of cars, they would have something not no other automaker has.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lreqihy/",
      "created": 1728653269,
      "depth": 0,
      "replies": [
        {
          "id": "lres9bp",
          "score": 12,
          "body": "Yes they will have the Data from current Teslas however I don't agree with Elon's approach here!  He isn't just promising Full Autonomy, but he is promising Intelligent Machines that are eventually more intelligent than humans. This is why various of his companies are codependent on each other. \n\nIf he can't build the actual AI (Machine as or more intelligent than humans), he will fall behind. He knows this but he is basically using the hype to fund his ultra ambitious projects. \n\n\nWhile I admire his ambition and everything he has achieved, he also has a long history of lying, over promising and being an attention whore.",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lres9bp/",
          "created": 1728653933,
          "depth": 1,
          "replies": [
            {
              "id": "lreu0lu",
              "score": 3,
              "body": "The Musk timeline is 100% a thing. Thank you for the clarification.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lreu0lu/",
              "created": 1728654577,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrfvsra",
      "score": 9,
      "body": "Basically if you buy GOOG instead of TSLA, you will get WAYMO return to your investment",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfvsra/",
      "created": 1728667130,
      "depth": 0,
      "replies": [
        {
          "id": "lrfvwvw",
          "score": 1,
          "body": "![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfvwvw/",
          "created": 1728667167,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrel17m",
      "score": 15,
      "body": "Is investing in Google the best way to invest in Waymo or do we expect it to go public?",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrel17m/",
      "created": 1728651124,
      "depth": 0,
      "replies": [
        {
          "id": "lreqgf2",
          "score": 7,
          "body": "Idk how waymo would go public considering google owns them lol. If they would ever to spin off you would get shares if you own google shares but their are no signs of this happening.",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lreqgf2/",
          "created": 1728653247,
          "depth": 1,
          "replies": [
            {
              "id": "lreqjf8",
              "score": 2,
              "body": "Thanks for the info!",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lreqjf8/",
              "created": 1728653279,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrer96m",
          "score": 5,
          "body": "Yes, unless they spin off a separate company and that goes public. I don't see it happening.",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrer96m/",
          "created": 1728653552,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrg1q4t",
          "score": 3,
          "body": "There is no way cars with 250k worth of sensors and hardware and their maintenance and potential failure points will ever be a viable alternative to POIDs (plain old immigrant drivers). Google will run Waymo for a couple years, see the cost writing on the wall and shit can it. Elon will still be promising FSD “next year”.",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrg1q4t/",
          "created": 1728669045,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrg0yra",
          "score": 2,
          "body": "Isn’t Google risky right now with the government looking to break up their search monopoly?",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrg0yra/",
          "created": 1728668803,
          "depth": 1,
          "replies": [
            {
              "id": "lrikc3v",
              "score": 2,
              "body": "They have other revenue stream not just search engine though",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrikc3v/",
              "created": 1728703422,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrik9cm",
          "score": 0,
          "body": "Yeah you would have to just invest in google but they have two tickers remember google a and c which they both have the same price but usually I think c was the research and development portion but I would still just invest in YouTube sector",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrik9cm/",
          "created": 1728703385,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrf4mst",
      "score": 15,
      "body": "The only thing I need to know is that Waymo actually has self-driving cars out in the streets right now, and Elon still can't manage more than a glorified Universal Studios Tour (that I am 75% sure are just remote controlled cars).\n\nPretty sure Boston Dynamics built a whole robot in the time it took Elon to make exactly zero improvements on his RC cringe-bots. I've seen more convincing performances at Chuck-E-Cheese.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf4mst/",
      "created": 1728658263,
      "depth": 0,
      "replies": [
        {
          "id": "lrf5pge",
          "score": 7,
          "body": "There are like half a dozen Chinese companies with robots that are years ahead of Musk, and yet his fanboys claim he invented it lmao",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf5pge/",
          "created": 1728658618,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrfkck0",
      "score": 10,
      "body": "bro, you cant compare something that does not exists with something that does.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfkck0/",
      "created": 1728663419,
      "depth": 0,
      "replies": [
        {
          "id": "lrfkfnc",
          "score": 10,
          "body": "Tell that to Elon dick riders here lmao ![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfkfnc/",
          "created": 1728663448,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrej1u3",
      "score": 41,
      "body": "100% waymo, it’s not even close.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrej1u3/",
      "created": 1728650302,
      "depth": 0,
      "replies": [
        {
          "id": "lrejlsh",
          "score": 4,
          "body": "Absolutely!",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrejlsh/",
          "created": 1728650534,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrgfzbn",
          "score": -2,
          "body": "Depends I guess. I think OP did a good job mapping out the differences.\nFor me it boils down to this:\n\nTesla has so much more data from all the cars they operate already capturing the world and learning (even if you don’t use the data for driving, they learn). Compare those numbers vs any other car maker and then vs how much Waymo is driving and collecting. Now to the interesting part: can Tesla capitalize on this? If you have question marks here, I understand. But from pure data and miles driven stand point, it’s Tesla by a mile.\n\nAnd here is where I understand skepticism: Tesla under delivered before (:",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrgfzbn/",
          "created": 1728673732,
          "depth": 1,
          "replies": [
            {
              "id": "lrgrwqr",
              "score": 2,
              "body": "At this point there is diminishing returns for data, you need smarter agents, not another 10 mln petabytes of standing in traffic jams.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrgrwqr/",
              "created": 1728677747,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrgtm6u",
              "score": 2,
              "body": "He had more than 8 years to create something. At this point, it seems like he doesn’t know how to or unwilling to use the right technology.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrgtm6u/",
              "created": 1728678321,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrgsp9a",
              "score": 1,
              "body": "One way to capitalize is insurance",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrgsp9a/",
              "created": 1728678011,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrldv5j",
              "score": 1,
              "body": "The quality of data that Waymo utilises is far above Tesla .\n\nLIDAR and Radar are critical to making autonomous driving work in difficult conditions. These technologies will continue to get cheaper and cheaper. \n\nThey will one day be able to digitally map all the surroundings in real time as well, and pass this back to a central system. \n\nThat they are using it now means they will be much further ahead than tesla when the technology costs come down and it can be rolled out much more cost effectively across a greater number of vehicles.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrldv5j/",
              "created": 1728753813,
              "depth": 2,
              "replies": [
                {
                  "id": "lrnne6i",
                  "score": 1,
                  "body": "I mean I get you and I am with you on the quality part - in a way. Like OP put nicely the pro and cons of both. I would argue with you that it is actually harder to map all of the world rather than training a system that is self oriented in various environments. With that being said, Tesla could enhance their system with LiDAR. I don’t buy it that it’s only cost that drove them to this decision.",
                  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrnne6i/",
                  "created": 1728783468,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lrfews3",
      "score": 11,
      "body": "I just rode in a waymo yesterday. It was flawless. That is all I have to say. Long Google short Tesla.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfews3/",
      "created": 1728661651,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrej04k",
      "score": 30,
      "body": "One is real \n\n\nOne isn't ",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrej04k/",
      "created": 1728650281,
      "depth": 0,
      "replies": [
        {
          "id": "lrejk0j",
          "score": 10,
          "body": "Always has been. ![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrejk0j/",
          "created": 1728650514,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrekm3e",
      "score": 16,
      "body": "I would also argue that Waymo can retro fit existing vehicles which can keep overhead down.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrekm3e/",
      "created": 1728650951,
      "depth": 0,
      "replies": [
        {
          "id": "lrenzqa",
          "score": -10,
          "body": "But do you think they can scale quickly? It seems cumbersome to have to map everything. Like sure they can map some cities but what about the entire country? All of Europe? All of China? Then you have to maintain those maps if something changes right? I will admit I am not as intelligent as you guys so can someone help me understand how they will scale?",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrenzqa/",
          "created": 1728652299,
          "depth": 1,
          "replies": [
            {
              "id": "lreyuox",
              "score": 28,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lreyuox/",
              "created": 1728656290,
              "depth": 2,
              "replies": [
                {
                  "id": "lrfy11b",
                  "score": 4,
                  "body": "Sounds like they should lease Apple Maps data for some intel",
                  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfy11b/",
                  "created": 1728667848,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrezjlk",
              "score": 9,
              "body": "Lmao, open Google Street View. They took photos of 10+ million miles of road and offered it for free - mapping the cities for Waymo is a bit more complicated but Elon's fanboys act like it's some grand insurmountable challenge.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrezjlk/",
              "created": 1728656530,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrep7dj",
              "score": 23,
              "body": "You only need taxis in major cities. Who cares about mapping bum f nowhere.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrep7dj/",
              "created": 1728652767,
              "depth": 2,
              "replies": [
                {
                  "id": "lreuhbs",
                  "score": -13,
                  "body": "I respectfully disagree.",
                  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lreuhbs/",
                  "created": 1728654743,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrf90fk",
                      "score": 4,
                      "body": "And i disagree with you. But I'll do better than you and explain why, because I'm not a cultcuck. \n\nPopulation density. \n\nEventually rural areas will be mapped but to start the scaling into profitability it's common sense to perfect the service in places with highest demand first. \n\nWhy map 1000sq miles of cornfields with 100k population when you can map 100sq miles with 10million people.",
                      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf90fk/",
                      "created": 1728659718,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrg0090",
                          "score": -5,
                          "body": "lol right",
                          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrg0090/",
                          "created": 1728668493,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lrepdly",
              "score": 3,
              "body": "Not all states allow FSD. They have time to scale with regulations and adoption:",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrepdly/",
              "created": 1728652834,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrf742a",
              "score": 3,
              "body": "Allow me to introduce Waymo’s good friend, Google Maps Street View camera car.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf742a/",
              "created": 1728659087,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrfbek6",
              "score": 3,
              "body": "Man.. if only waymo had a parent company that has been the leader of mapping the world.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfbek6/",
              "created": 1728660509,
              "depth": 2,
              "replies": [
                {
                  "id": "lrfzp5u",
                  "score": -7,
                  "body": "I don’t think you understand",
                  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfzp5u/",
                  "created": 1728668394,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrer3fv",
              "score": 5,
              "body": "Scaling is secondary to solving the autonomy first and Waymo is way ahead of Tesla in doing that. There's a reason Waymo is already operating a fleet of autonomous vehicles and Tesla doesn't even have the regulatory approval.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrer3fv/",
              "created": 1728653492,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrfpcyi",
              "score": 2,
              "body": "Waymo is owned by google. Ever heard of google maps? They regularly update that shit all the fucking time.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfpcyi/",
              "created": 1728665058,
              "depth": 2,
              "replies": [
                {
                  "id": "lrfzmtj",
                  "score": 1,
                  "body": "Bruh what?",
                  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfzmtj/",
                  "created": 1728668373,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrf18wj",
              "score": 1,
              "body": "Do you think they haven't done this with Google maps on the kabillion users of Android out there tooling around with location data turned on?",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf18wj/",
              "created": 1728657118,
              "depth": 2,
              "replies": [
                {
                  "id": "lrg0hrw",
                  "score": 1,
                  "body": "I don’t think that’s how it works",
                  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrg0hrw/",
                  "created": 1728668651,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrf6erp",
              "score": 1,
              "body": "Other countries have these things called trains.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf6erp/",
              "created": 1728658851,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrf25th",
              "score": 1,
              "body": "Umm….ever heard of google maps? ",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf25th/",
              "created": 1728657433,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrg0u3v",
      "score": 4,
      "body": "A) people only spend a tiny fraction of their income on taxis. Manned or otherwise.\n\nB) One stupid robotaxi accident will be far worse than 100 cab drivers crashing or raping their passengers, publicity-wise.\n\nC) I don't have aspergers, so I'm not obsessed with removing human-human interaction like these AI fanboys.\n\nD) Cab drivers will foil their ability to operate, one way or another. Probably by hailing one, then smearing silicone grease (which has no known solvent) on the camera lenses. Thus turning it into a traffic-stopping brick with no stearing wheel.\n\nE) I'm not a republican, so I will never buy a tesla or use their robotaxi on principle. Nobody tricked Musk into partisan politics:- its simply bad for business.\n\nApart from that, good idea. Badly executed.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrg0u3v/",
      "created": 1728668761,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lritws6",
      "score": 3,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lritws6/",
      "created": 1728708388,
      "depth": 0,
      "replies": [
        {
          "id": "lrk0ofx",
          "score": 2,
          "body": "While I agree with you if you view this in isolation (Waymo only). If you look at the bigger picture (Google already operating Autonomous Vehicles and collecting data) it's a net positive for Google.",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrk0ofx/",
          "created": 1728735800,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrgitp9",
      "score": 2,
      "body": "“Various tasks”",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrgitp9/",
      "created": 1728674689,
      "depth": 0,
      "replies": [
        {
          "id": "lrgn51p",
          "score": 3,
          "body": "Didn't want to write \"it's pretty much useless.\"",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrgn51p/",
          "created": 1728676152,
          "depth": 1,
          "replies": [
            {
              "id": "lrgrwwo",
              "score": 2,
              "body": "Yeah I guess that’s where I’m lost in the purpose of it",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrgrwwo/",
              "created": 1728677749,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrhjt2z",
      "score": 2,
      "body": "So I used to work at alphabet and made it a long to talk to a bunch of waymo engineers. This is actually really good analysis. I do think there's room to be even more critical of the Tesla event tho than op already is",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrhjt2z/",
      "created": 1728687894,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrjitap",
      "score": 2,
      "body": "Some bullshit post we all know Tesla only need camera to operate. 🙄 \n\n/s",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrjitap/",
      "created": 1728725007,
      "depth": 0,
      "replies": [
        {
          "id": "lrk0abb",
          "score": 1,
          "body": "Check out other posts here on Teslas event. Regards here on WSB are saying that because Elon didn't showcase anything meaningful, it's bullish ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrk0abb/",
          "created": 1728735616,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrka5ny",
      "score": 2,
      "body": "I take Waymos all the time in SF and have been so comfortable I've fallen asleep in them. The future is here already. Waymos kick ass. \n\nRegulations do not allow them on the freeway yet, at least not with passengers. I am curious how they will do at higher speeds.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrka5ny/",
      "created": 1728739901,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrkgz7c",
      "score": 2,
      "body": "Good analysis. The little I know about development of systems following Functional Safety ISO26262 tells me that Tesla vision only + AI design will never be able to proof level 5 (autonomy).\n\n It is escalable true, but never safe enough to be approved on the roads.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrkgz7c/",
      "created": 1728742550,
      "depth": 0,
      "replies": [
        {
          "id": "lrkh2o2",
          "score": 1,
          "body": "Agree!",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrkh2o2/",
          "created": 1728742583,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrf1o7w",
      "score": 3,
      "body": "Some minor details in need of correction/clarification.\n\nRadar and lidar are also capable of detecting and classifying pedestrians either by themselves or as part of a multimodal sensor suite. In fact they can be better than cameras in some circumstances, low light as you mentioned.\n\nSome lidars also give Doppler(relative speed) not sure if Waymos does but I know AURs does. \n\nVideo processing is necessarily a much more resource intensive task than processing lidar or radar data. Now everyone I know that has radar and lidar also has cameras, so that may not be important but there are probably some optimizations that having multiple sensors allows a reduction in the amount of video that needs to be processed.\n\nRapid iteration is not a differentiator, everyone doing self driving Waymo included can push updates whenever they want. Most also use Continuous integration pipelines.\n\nRegulatory hurdles are mostly propaganda/fake news auto companies self certify for safety, other than FMVSS rules which are testable requirements NHTSA can verify. FMVSS rules are very easy to comply with and say nothing about autonomy. There are some FMVSS changes required to remove steering wheel pedals and other things but those changes have been in process for years and should be done soon if it hasn’t already happened, not familiar with the latest status. The easy work around is to simply not delete these until the rules change, there’s also a waiver process that some companies I believe have successfully completed to delete these components. The real “regulatory hurdle” is liability, and needing to pay out millions in damages when a court determines your product killed someone and the manufacturer is liable. In other words the only real barrier is tech readiness. Regulatory hurdles are just an excuse that wallstreet types tend to buy.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf1o7w/",
      "created": 1728657265,
      "depth": 0,
      "replies": [
        {
          "id": "lrf2888",
          "score": 3,
          "body": "You're right on the Lidar.\n\nNot sure if I agree with the regulatory part, but I'll look into it. Thank you for the feedback.",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf2888/",
          "created": 1728657455,
          "depth": 1,
          "replies": [
            {
              "id": "lrf485w",
              "score": 4,
              "body": "If you look at this investor presentation from AUR it has a map of where driverless is permitted, a few states have passed restrictions but the vast majority have not. Granted that’s trucking not ride hailing so it’s a little different but there’s much more regulation on big trucks than there is passenger cars.\n\nhttps://ir.aurora.tech/_assets/_4f718de342f1c96df9b961d99a3395dd/aurora/db/856/7972/pdf/Investor+Presentation-+July+2024.pdf",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf485w/",
              "created": 1728658127,
              "depth": 2,
              "replies": [
                {
                  "id": "lrf4cgc",
                  "score": 2,
                  "body": "I will check it out. Thank you!",
                  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf4cgc/",
                  "created": 1728658167,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrf5289",
                      "score": 2,
                      "body": "For completeness I should add ride hailing does have more regulation than personal ownership, if Tesla puts vehicles on Lyft or Uber that should help avoid needing to deal with a bunch of local regulations as those companies will have already. If they roll their own there could be significant hurdles to wide scale deployment. One of the reasons Elon not explaining the business strategy is a problem for investors.",
                      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf5289/",
                      "created": 1728658406,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrf58ul",
                          "score": 2,
                          "body": "Elon doesn't explain the strategy because he doesn't have one.",
                          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf58ul/",
                          "created": 1728658466,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrfauqs",
                              "score": 3,
                              "body": "Yea I agree",
                              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfauqs/",
                              "created": 1728660328,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lril0wq",
                  "score": 1,
                  "body": "Well if Tesla ever got out a transportation truck in the road",
                  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lril0wq/",
                  "created": 1728703751,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrk4g1k",
                      "score": 1,
                      "body": "Yea I was focusing on the robotaxi use case since that’s what he was presenting at the event, but yea if they ever did want to do autonomous semi this would be the regulatory landscape",
                      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrk4g1k/",
                      "created": 1728737509,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lril8tw",
          "score": 1,
          "body": "Well Lidar isn’t just the solution I thought the best model usually comes from a mixture of different sensor. Also lidar still expensive so if they can reduce the cost in those sensor then we have a contender",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lril8tw/",
          "created": 1728703857,
          "depth": 1,
          "replies": [
            {
              "id": "lrk5yfb",
              "score": 1,
              "body": "I wasnt trying to advocate for lidar only, just clarifying tech capabilities of lidar systems, there’s pretty much no way to do things like traffic lights without camera. I agree multimodal is the way to go.\n\nI do think lidar will be part of the first wave of systems that actually are able to operate without a drive like Waymo is doing. It just doesn’t make sense to leave it out. The costs are coming down significantly while these things cost 10k 10 years ago I think there are things in the market now for under 1k and costs will continue to fall with scale. There’s been some chatter that Tesla will add lidar now that it’s more economical. \n\nTesla’s kinda stuck on camera only because adding lidar fundamentally breaks the business case Elon has been making for a decade, that existing vehicles will get real self driving when it’s ready.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrk5yfb/",
              "created": 1728738161,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lreyzx0",
      "score": 5,
      "body": "I feel like a lot of Tesla’s issues would be solved with LiDAR.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lreyzx0/",
      "created": 1728656340,
      "depth": 0,
      "replies": [
        {
          "id": "lrf7alf",
          "score": 10,
          "body": "Or a new CEO",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf7alf/",
          "created": 1728659147,
          "depth": 1,
          "replies": [
            {
              "id": "lrf7eej",
              "score": 8,
              "body": "Replace him with LiDAR",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf7eej/",
              "created": 1728659183,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrei7sk",
      "score": 1,
      "body": "Bro, no need to torture ChatGPT for this long ass text to get to that TlDr …",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrei7sk/",
      "created": 1728649943,
      "depth": 0,
      "replies": [
        {
          "id": "lrejgqc",
          "score": 2,
          "body": "It's not from ChatGPT. Feel free to DM if you want to debate or discuss the topic.\n\n![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrejgqc/",
          "created": 1728650476,
          "depth": 1,
          "replies": [
            {
              "id": "lrejmoj",
              "score": 0,
              "body": "I’m holding Tesla with a distinct feeling of selling them later when market opens, so I don’t think I disagree",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrejmoj/",
              "created": 1728650545,
              "depth": 2,
              "replies": [
                {
                  "id": "lreqd96",
                  "score": 3,
                  "body": "To be clear, this isn't to say that Tesla is a bad investment. I'm just pointing out the fact that Tesla is not the market leader in autonomous vehicles, and Elon has a long history of over promising and sometimes straight up lying.",
                  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lreqd96/",
                  "created": 1728653214,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lreqhia",
                      "score": 2,
                      "body": "So this is NOT FINANCIAL ADVISE?!? \n\nI JUST BET MY HOUSE ON YOUR ANALYSIS",
                      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lreqhia/",
                      "created": 1728653259,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lresco6",
                          "score": 2,
                          "body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)",
                          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lresco6/",
                          "created": 1728653969,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lret10f",
      "score": 2,
      "body": "Waymo is like a decade ahead of anything Tesla. It’s really just pathetic.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lret10f/",
      "created": 1728654217,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrfcli5",
      "score": 1,
      "body": "Okay. Everyone agrees it sucks. But what will happen to the stock is the real question",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfcli5/",
      "created": 1728660900,
      "depth": 0,
      "replies": [
        {
          "id": "lrfcqah",
          "score": 1,
          "body": "Tesla? It's gonna get a correction. Google will move up!",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfcqah/",
          "created": 1728660943,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrfwzx6",
      "score": 1,
      "body": "TLDR - Waymo is real, actually working and people using it. \n\nTesla - who the fuck knows when, could be 3 years, could be 6.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfwzx6/",
      "created": 1728667514,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhnsy2",
      "score": 1,
      "body": "I have said this millions of times over the past few years and I will repeat again.\n\nTesla will NOT have a full autonomous vehicle UNLESS they ditch their design and go with LIDAR like WAYMO.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrhnsy2/",
      "created": 1728689492,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrfllkm",
      "score": 1,
      "body": "It’s all about how strict the lvl4 & lvl 5 (requirement for operating) certification from NHTSA bro.\n\nIf Elon can certified his toys with NHTSA stamps on it then people will go for aesthetic like Tesla vs a weird fidget spinner’s Waymo cars.\n\nLike how iPhone still have people buying them even though their hardware is inferior vs Samsung but ease of use is what make people buy it. Same with Croc meme shoes",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfllkm/",
      "created": 1728663832,
      "depth": 0,
      "replies": [
        {
          "id": "lrikpfv",
          "score": 1,
          "body": "I don’t fuck with crocs have you seen their market cap.",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrikpfv/",
          "created": 1728703597,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrfm18k",
      "score": 1,
      "body": "Waymo is brilliant. Tesla is ass.\n\n\nWaymo has a whole functioning business. Tesla doesn't even know what they're in business for. Cars? Robots? AI? Are they going to roll out a Uber competitor, or just sell their shit taxis to...who now? I don't know.\n\n\nI don't think we need analysis to figure this out.\n\n\nYou seem to have forgotten to tell us what this means for the stocks, though. All the Waymo goodness in the world guarantees fuck-all for google shares...",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfm18k/",
      "created": 1728663976,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrfqy8h",
      "score": 1,
      "body": "Tesla & Musk is 15 years late to the robotaxi game. Waymo came out 15 years ago and that's a whole lotta data and tech improvements that Tesla will need to \"catch up\" on.\n\nThis is analogous with Windows and Ballmer infamously saying smartphones were a fad and realizing his fuck up trying to cobble up a Windows smartphone 5 years AFTER the debut of the first iPhone and MSFT failed massively on the smartphone front.\n\nNOW the only way I can see Musk making a dent in either Waymo, UBER or LYFT's marketshare is quite frankly offering FREE rides for the first 2 years.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfqy8h/",
      "created": 1728665565,
      "depth": 0,
      "replies": [
        {
          "id": "lrfs2dw",
          "score": 2,
          "body": "He's too busy \"owning the libs\" and fighting cultural wars because his kid changed her gender and hurt his ultra fragile ego LMAO.\n\nWhile I admire him for what he has achieved in the past, he's a certified clown right now and he has strayed from his old ways that actually contributed to most of his achievements.",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfs2dw/",
          "created": 1728665920,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrg8xf2",
      "score": 1,
      "body": "One point you failed to mention was that Waymo used 29 cameras to see its environment versus only 8 cameras for Tesla.  The problem with Tesla’s current setup is that if just one of those cameras fail, the system cannot work properly.  Waymo, on the other hand, can have a few cameras fail and still work.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrg8xf2/",
      "created": 1728671400,
      "depth": 0,
      "replies": [
        {
          "id": "lrgb5d1",
          "score": 1,
          "body": "Good point. I typed it on my phone and I'm sure I left out a few things (unintentionally).",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrgb5d1/",
          "created": 1728672130,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lremsmc",
      "score": 0,
      "body": "I read cybercrap",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lremsmc/",
      "created": 1728651829,
      "depth": 0,
      "replies": [
        {
          "id": "lreqg4r",
          "score": 0,
          "body": "![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lreqg4r/",
          "created": 1728653244,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrfgs1l",
      "score": 0,
      "body": "Lidar doesn't work in fog or rain. So it's useless and expensive. See this all the time, and it's an easy Google. They are both equally inoperable.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfgs1l/",
      "created": 1728662250,
      "depth": 0,
      "replies": [
        {
          "id": "lrgzizs",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrgzizs/",
          "created": 1728680322,
          "depth": 1,
          "replies": [
            {
              "id": "lrh003s",
              "score": 1,
              "body": "Yeah, and what's your point? The cameras are doing the work, or regular radar. Not lidar. The light used on camera sensors and laser sensors gets messed up when there's fog. Again, this is a quick Google search away. Plus, you can look up open source youtube engineers who use these 100 dollar sensors on all sorts of robotic projects. You can't just say, 'lidar' and expect it to be any better than Musk saying, 'Cameras'. The physics and reality of our world still dictate what's actually possible.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrh003s/",
              "created": 1728680484,
              "depth": 2,
              "replies": [
                {
                  "id": "lrh0k9v",
                  "score": 1,
                  "body": "[deleted]",
                  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrh0k9v/",
                  "created": 1728680682,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrh1a75",
                      "score": 1,
                      "body": "You're talking to someone who knows all this and still knows you're wrong. 'HD Maps' LOL. You want to explain what that means? The benefit of a Tesla over a Waymo is that is isn't reliant on static, unchanging maps. It also isn't dependent on external servers beyond its updates. They are totally different approaches. Waymo will always have a problem scaling. It is inflexible and unable to adapt. You're listing handicaps, not features. 'Redundancy' isn't a hardware technology. So you have Lidar + Cameras (both nerfed by fog), and an unchanging map... Nice.",
                      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrh1a75/",
                      "created": 1728680934,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrh3bs9",
                          "score": 0,
                          "body": "[deleted]",
                          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrh3bs9/",
                          "created": 1728681649,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrh6fd4",
                              "score": 2,
                              "body": "You need to read less about this stuff and actually sit in one. Current models of S3XY all outperform Waymo, both of which I've ridden in. You may want to read up on how Waymo is more or less dependent on steady internet to even operate legally... Becuase they aren't unsupervised. It's remotely supervised. Another hurdle Tesla doesn't have to worry about. At least, for now. Robotaxi may be built different. Too soon to tell.",
                              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrh6fd4/",
                              "created": 1728682764,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lrjred4",
          "score": 0,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrjred4/",
          "created": 1728730875,
          "depth": 1,
          "replies": [
            {
              "id": "lrk61rk",
              "score": 1,
              "body": "How do you interpret, \"Waymo has teams of humans remotely monitoring the cars and assist the AI when it encounters a problem. \"\n\nDo they 'assist' the car by tell it motivational speeches? How nice of them!\n\nThis is that stupid semi-rolling down the hill all over again. . . .\n\nhttps://youtu.be/-Rxvl3INKSg\n\nWowzers!! This level 4 driving sure does look better than the functional level 2 driving I was using not even a week ago! All it did was stop at the wrong spot and ignore green lights. Sounds like a winner to me :)",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrk61rk/",
              "created": 1728738198,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrfk16u",
      "score": 0,
      "body": "Never mind cost/money, that doesn’t matter, right? I mean, it’s only about $150k/car. So, 1000 cars will only cost them $150MM, small potatoes really. Also, I’m sure they’ll map the entire drivable world by sometime next year, right? And then hire tens of thousands of operators? Super realistic. \n\nI can’t believe you took the time to type this. They’re basically trains that carry a few people and require a fraction of a driver instead of a whole driver (they require a minimum number of tele operators per car). They can’t go anywhere that’s not completely mapped.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfk16u/",
      "created": 1728663316,
      "depth": 0,
      "replies": [
        {
          "id": "lrfrcgw",
          "score": 0,
          "body": "\"Your cars are limited to the road whereas my horse can go anywhere.\"",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfrcgw/",
          "created": 1728665691,
          "depth": 1,
          "replies": [
            {
              "id": "lrfuo20",
              "score": 0,
              "body": "Yeah, that totally makes sense here. You got me.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfuo20/",
              "created": 1728666764,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrfkcbv",
          "score": -2,
          "body": "What the fuck did I just read? What are you even talking about? Tesla? Waymo?",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfkcbv/",
          "created": 1728663417,
          "depth": 1,
          "replies": [
            {
              "id": "lrfkvid",
              "score": 1,
              "body": "I wouldn’t address my points either, if I were you. I can’t believe you drew attention to my comment. Your post is drivel for the tech illiterate.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfkvid/",
              "created": 1728663594,
              "depth": 2,
              "replies": [
                {
                  "id": "lrfll9l",
                  "score": 0,
                  "body": "Or maybe you could get off Elon's dick, and make an actual argument?",
                  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfll9l/",
                  "created": 1728663829,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrfnclp",
                      "score": 1,
                      "body": "I hate the guy, personally. But I’m also objective and understand the underlying tech; your post implies honest ignorance, dishonesty, or both.\n\nI don’t care what you think about me or what insults you type on here. I’m just here to make sure people don’t take this post as serious dd and get screwed over.",
                      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfnclp/",
                      "created": 1728664408,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrfqcsg",
                          "score": 0,
                          "body": "I wasn't throwing insults at you. You literally did not mention what exactly you were talking about. Yes you mentioned costs, but in what context, related to what I wrote? \n\nWhat exactly do you understand about the underlying tech? - again, you didn't specify anything! \n\nMy whole point was that I am disappointed from yesterday's announcement as Elon didn't unveil any new tech or the actual FSD. He announced \"New Hardware\" but that doesn't solve the problem.  \n\n\nIf you really understand the underlying tech needed for Fully Autonomous Vehicles, you would know that Tesla needs the actual FSD, not the scam they have been selling for years.\n\n\nAlso, how is this announcement different from the original Cybertruck announcement and the original FSD announcement which was supposed to run on HW3 and be backwards compatible?\n\n\n- P.S. seems like the market agrees with my points.",
                          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfqcsg/",
                          "created": 1728665376,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lrejah2",
      "score": -4,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrejah2/",
      "created": 1728650402,
      "depth": 0,
      "replies": [
        {
          "id": "lrelyor",
          "score": 6,
          "body": "Waymo is amazing, I have 62 rides in it and it’s just straight up better than uber. The only time I don’t use it is somewhere where Waymo isn’t allowed",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrelyor/",
          "created": 1728651497,
          "depth": 1,
          "replies": [
            {
              "id": "lren19d",
              "score": -15,
              "body": "Waymo is garbage and not practical. Elon's trying to change that with robotaxi...he may or may not be successful but to say Waymo is amazing is stupid.",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lren19d/",
              "created": 1728651924,
              "depth": 2,
              "replies": [
                {
                  "id": "lrexis2",
                  "score": 3,
                  "body": "Stop talking out of your ass lmao",
                  "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrexis2/",
                  "created": 1728655825,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrfl6sq",
                      "score": 2,
                      "body": "Holy shit, you interacted with a real life elon fanbois",
                      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrfl6sq/",
                      "created": 1728663697,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lrf6agd",
                      "score": -1,
                      "body": "Stop pretending Waymo is great lol",
                      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf6agd/",
                      "created": 1728658811,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrf6mod",
                          "score": 1,
                          "body": "I'm not pretending anything, but enlighten me why is it not?",
                          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrf6mod/",
                          "created": 1728658926,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lrgdfuf",
      "score": 0,
      "body": "you obviously dont drive a tesla. camera only absolutely craps out driving into sun glare. no way tesla can be full autonomous camera only just from that.",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrgdfuf/",
      "created": 1728672888,
      "depth": 0,
      "replies": [
        {
          "id": "lrggfno",
          "score": 1,
          "body": "Did you even read? \n\nThis is exactly the point. Tesla isn't going to be self driving anytime soon.",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrggfno/",
          "created": 1728673885,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrh6wro",
      "score": 0,
      "body": "To me this announcement seems like an outlook announcement more then a true plan. Very vague and hollow. Sell off seems over reaction and look and a rebound in the coming days. Might be a good opportunity for calls next week",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrh6wro/",
      "created": 1728682940,
      "depth": 0,
      "replies": [
        {
          "id": "lrhf7xw",
          "score": 0,
          "body": "This announcement was a disappointment because of Elon, and his usual habit of over promising and under delivering. \n\nThis wasn't an over reaction. Watch it fall more next week. $200 is coming IMO. Not investment advice. Don't bet your house!",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrhf7xw/",
          "created": 1728686089,
          "depth": 1,
          "replies": [
            {
              "id": "lrhp1xs",
              "score": 0,
              "body": "Is this something new regarding elon? Yet tesla has printed year after year. This is what elon does/is. This drop in price was an definite overeaction imo. Will it drop more? Ya possibly to $200. But thats just a better buying opportunity. I dont see the bottom gfalling out from under tesla. Teslas not going anywhere",
              "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrhp1xs/",
              "created": 1728690006,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lriku15",
      "score": 0,
      "body": "I watched a Waymo run a red light in San Fran last week",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lriku15/",
      "created": 1728703659,
      "depth": 0,
      "replies": [
        {
          "id": "lrimkgm",
          "score": 1,
          "body": "Congratulations ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrimkgm/",
          "created": 1728704509,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrei5ma",
      "score": -11,
      "body": "Am I the only one that thinks Waymos look goofy with the bloated sensor suite on all their cars. They just look so archaic. Do yall think Waymo is correct that they need all those sensors on every car?",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrei5ma/",
      "created": 1728649916,
      "depth": 0,
      "replies": [
        {
          "id": "lrekart",
          "score": 8,
          "body": "Who cares when you’re hammered trying to get home from the bar.",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrekart/",
          "created": 1728650822,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrejk5k",
          "score": 6,
          "body": "It stars off looking ugly but once it works perfect, they’ll start to design it better. Example, airplanes.",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lrejk5k/",
          "created": 1728650516,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lreipwu",
          "score": 1,
          "body": "If you can't get millions of cars in drivers hands to get the amount of data needed to solve cameras, it's the next best bet.\n\n\nIt is not known which can achieve 90% road coverage first.",
          "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lreipwu/",
          "created": 1728650161,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lreqzy1",
      "score": -2,
      "body": "Tesla ass",
      "permalink": "/r/wallstreetbets/comments/1g188s3/tesla_cybercab_vs_waymo_an_analysis/lreqzy1/",
      "created": 1728653454,
      "depth": 0,
      "replies": []
    }
  ]
}