{
  "title": "Overstock.com (BYON) - DD - Bath Towels Are Back In Stock",
  "score": 39,
  "selftext": "\\*\\*ATTENTION MODS AND HONOURABLE REPORT POLICE OF NEW: This DD and the company it covers is in no way related to the bankrupt legacy towel stock (RIP bagholders). This company was [Overstock.com](http://Overstock.com) and has rebranded itself. Bath towels are back, and they're better than ever before.\n\nAlright, listen up, you’re only going to hear this once, and you’re only going to hear it from me, as no one else seems to be paying attention. I’ve been watching this company for YEARS waiting for the perfect moment to get in, and that moment is right now. Actually, it was last week on the day the last vestiges of peace Jared Kushner bestowed upon the Middle East finally evaporated. While simultaneously, the dock workers decided they were going to try to strongarm JPow into spinning up his money printer exclusively for their use --to fund their righteous battle against our future robot overlords. That day the stock hit a low of $8.91. The bottom is in.\n\nAbout the Company:\n\n[Overstock.com](http://Overstock.com) has been around a very long time, since 1999, but basically all you need to know about that is that they started out doing the thing their name suggests. Then they switched it up and started selling a more standard lineup of home goods. Their name just didn't reflect what they did anymore.\n\nIn 2023, the former crowd favorite’s bath towel retailer went tits up, and the CEO of Overstock at the time saw a golden opportunity. They snapped up the IP of ye old towel stock, along with the name, customer data, etc.. They rebranded the company to Beyond Inc., switched their website UI’s color scheme from red to blue, and slapped the old towel company’s name on it. (From here on I’ll refer to the forbidden name as triple-B, or 3B for short.)\n\nBut somehow it wasn't an instant success... Overstock's original customers were left out in the cold, and the returning bath towel customers didn't like their product lineup. Things kept on declining.\n\nEnter Marcus Lemonis:\n\n\n\nhttps://preview.redd.it/yi3ayo0yw4ud1.png?width=508&format=png&auto=webp&s=6a79453f4375c3d023bbe6b615fea95091281919\n\nHe currently serves as the chairman and CEO of Camping World, a multi-billion dollar giant. He’s an activist investor specializing in turning around struggling businesses, and was key in building Camping World into what it is today. In Late 2023 he purchased a stake in Beyond and joined the board. He laid out plans to turn the business around, bring back [Overstock.com](http://Overstock.com), and promised results by the end of 2024. Well...things took longer than expected, including the relaunch of the [Overstock.com](http://Overstock.com) website.\n\nSo this is what happened:\n\n  \n\n\nhttps://preview.redd.it/k29wwhq1x4ud1.png?width=1407&format=png&auto=webp&s=c6f07b394c5fae9a6100f0485d99947b5ca5fa0f\n\nNow the stock is in the gutter, but the vision Lemonis has for the company is finally starting to come together.\n\nIf you only care about earnings reports and staring at charts you might look at those and say to me:\n\n“Mr. Jimbles, you’re *highly* regarded. The revenue, EPS, and every other metric is worse YoY. The stock has been red every month for the past 6. This stock is going back to all-time lows, and likely, to zero.”\n\nAnd to which I will respond:\n\n“Why yes, thank you. I am highly regarded. You have an incredible talent for numbers and analysis. Slap an F rating on the stock, and go apply for a job at Motley Fool. They’d love to have you. You’ll fit right in there.”\n\nBut this what has happened very recently:\n\n* In July 2024 the [Overstock.com](http://Overstock.com) website relaunched to exist alongside the new 3B website, specializing again in liquidating surplus inventory. \n* The Zulily IP, customer data, etc. was purchased in March of this year. If you haven’t heard of Zulily, they were another successful online retailer that went under after suffering from poor management, losing focus, and poor customer service, but the website had a cult following for its unique and exclusive selection of fashion goods.\n* Beyond Inc. hired some of Zulily’s former team, and are bringing back your mom’s favorite fashion brands. They just soft-launched the new website a few weeks ago, but haven’t made any official announcement yet. [Zulily.com](http://zulily.com)\n* Three new strategic partnerships have been teased that will restore a physical retail presence to the 3B brand. Now you might be thinking to yourself that this is a bad move, but having a physical store makes a lot of sense for home goods. Last I checked, you can’t download a credenza, and some people like to make sure the drapes match the carpet in person. One of these partnerships will deal with the Overstock arm of the business and will give them access to increased inventory and infrastructure to move what they already have.\n* They just announced a new global licensing program to expand business internationally.\n* They sold off their company HQ offices for $55m. Their balance sheet is good. Almost zero debt and plenty of cash for their upcoming moves.\n\nBut that isn’t it by a long-shot. Lemonis has a vision for the Beyond umbrella to expand and include a whole slew of home related products and services including mortgages, home insurance, HELOCs, consumer credit cards, etc.. They plan to leverage the customer data gained from the retail businesses to onboard their existing customers for these other products in a frictionless, low cost way.\n\nAnd even though this pivot is finally taking shape now, none of it has been priced in. It may have been last fall based solely on hype when Lemonis joined the board, when the stock hit almost $40, but it definitely isn’t as of right now. Lucky me.\n\nMaybe some other charts and light TA will convince you though.\n\n\n\nhttps://preview.redd.it/e14afd63x4ud1.png?width=1440&format=png&auto=webp&s=2a10afa53ba0956584ce72106fd4fae5a8fdb9b3\n\nWhat we have right here is RSI divergence on the weekly chart. The stock price is marching down, making lower lows, while RSI is trending up, making higher lows. Titillating, I know.\n\nYou like Bollinger Bands??? Well here you go:\n\n  \n\n\nhttps://preview.redd.it/rrf6twx4x4ud1.png?width=1440&format=png&auto=webp&s=3919615e3efb1dfb2c607e2ceda81efa27f7b49c\n\nOn the daily, it’s consolidated, and the bands are tight enough to turn your wife’s boyfriend into a two pump chump. You can see it bounced hard off the bottom band in the past few days.\n\nLook at what happened last Friday when the dock workers settled for an insulting 62% raise and a guarantee that efficiency would not get in the way of union boss salaries:\n\n  \n\n\nhttps://preview.redd.it/4kzlw1r5x4ud1.png?width=1445&format=png&auto=webp&s=14f6bbd1ebff4210af79e2eef6995167c886a1f5\n\nSo what makes me sooooo smart and special? Nothing. I just happen to be in the right place at the right time. Like I said, I’ve been watching this stock/company for years as a matter of personal interest. This is the inflection point. No one cares about this stock and most people still think the 3B brand no longer exists at all. Analysts are asleep at the wheel, relying on ChatGPT to do their work for them, and GPT doesn’t know how to spoof an email and listen to a webcast yet.\n\nHere’s the webcast featuring Lemonis that took place on Sept. 10:\n\n[https://investors.beyond.com/news-events/events-and-presentations/events/event-details/2024/Piper-Sandler-Growth-Frontiers-Conference/default.aspx](https://investors.beyond.com/news-events/events-and-presentations/events/event-details/2024/Piper-Sandler-Growth-Frontiers-Conference/default.aspx) \n\nListen to it…or don’t. I don’t care. Lemonis goes into much more detail about the upcoming partnerships that will be announced at the investor conference happening on the day of earnings, as well as his vision for the company going forward. And he explains it all much better than some random regard on reddit ever could. He also takes ownership for the past mistakes that got us to where we are now.\n\nIf you still aren’t convinced, cool. Go buy calls into NVIDIA earnings and enjoy crying in your wife’s boyfriend’s arms for a few days just like last time. Or buy the top on that incredible space stock after it’s up 20x in less than 6 months, get rug-pulled with a $400m share offering, and get rekt by the news drought. Or go do what Nana would want --buying deep ITMs in her meme stock... at least *she* might be proud of you.\n\nSo what do I expect with the BYON stock?\n\nShort/medium term: Up.  \nLong term: Really up.\n\nIt looks good long term as everything spins up and the company transitions over the course of the next year. I don’t think analysts have accounted for the $177m run rate the newly relaunched Overstock website has hit since it went live at the beginning of Q3, or the fact that Zulily has been online for weeks already. Earnings will likely hit or exceed expectations, and even if it doesn’t, the partnerships being unveiled at the investor meeting and forward guidance will be impressive. There will likely be a runup even before earnings. When this stock moves, it MOVES.\n\nHere are my current positions as of writing this, but I'm not done buying yet...not even close. A YOLO update will follow after I've finished.\n\nPositions:\n\nhttps://preview.redd.it/ikdcrnv7x4ud1.png?width=1097&format=png&auto=webp&s=cc49f739ee9e7bf277bac88bd08ed12d3e52abcb\n\nShotgun approach. Who knows when this thing will make its biggest moves.\n\nThe random smattering of strikes may make you think I'm even more regarded than before, but liquidity is extremely thin and there were hot deals on different strikes at different times.\n\n\\*\\*Tips if you feel this is a play you want to make and realize that if you just buy shares you're throwing your future gains in the trash:\n\nLiquidity on most option strikes/expiries is THIN, especially on the OTMs. Wait. wait. *wait.* You're thinking you'll just avoid all this by buying ITM/NTM? On a stock this undervalued?? Go back to where you belong. You know...that special sub where their best and only advice is DCA'ing into SPY.\n\nI recommend doing limits or 1 lot market orders b/c you might even get a few better fills that way. If you do big market orders you’re gonna get cucked on the way in and on the way out… if you make it that far. If you don’t know what the word slippage means...good luck. \\*\\*Hint\\*\\* It doesn't have anything to do with what happens to your wife while watching you unbutton her boyfriend's sport-coat.\n\nSee y'all in a bit.\n\n-Jimbles\n\n\\*\\*Disclaimer: All information contained in this post is factually correct to the best of my knowledge. However, I provide no guarantees, and will not be held liable for any errors that may be contained within. Check the facts and do your own research. None of this content is financial advice.",
  "link_flair_text": "DD",
  "id": "1g19wop",
  "num_comments": 43,
  "created_utc": 1728653629,
  "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/",
  "comments": [
    {
      "id": "lrergvm",
      "score": 1,
      "body": "Positions or Ban. Please reply to this comment with your position\n\n^I ^am ^an ^LLM-powered ^bot. ^Please ^contact ^the ^moderators ^with ^concerns.",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrergvm/",
      "created": 1728653633,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lreyjif",
      "score": 25,
      "body": "We all use towels. Your logic is bulletproof. Sign me the fuck up.",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lreyjif/",
      "created": 1728656182,
      "depth": 0,
      "replies": [
        {
          "id": "ltmfxz1",
          "score": 3,
          "body": "Rip",
          "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/ltmfxz1/",
          "created": 1729824384,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrqzjc3",
          "score": 2,
          "body": "Right? I used a towel just last week when I showered.",
          "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrqzjc3/",
          "created": 1728840843,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrf5fg6",
      "score": 11,
      "body": "Had me for a bit until you claimed this retail website is going to “seamlessly” turn into a bank and an insurance company?  \n\nSo are we betting on an Amazon competitor?  A website transitioning to a bank?  When does you’re Wendy’s shift start?",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrf5fg6/",
      "created": 1728658526,
      "depth": 0,
      "replies": [
        {
          "id": "lrr26tl",
          "score": 2,
          "body": "At least for the time being they are just partnering with banks and other companies to provide these services, getting a cut for the customer acquisition. I don't know if this is part of the plan as it stands, but in the future they could definitely substitute their own products and services as they roll them out.\n\nIf I end up behind a Wendy's dumpster I'll let you know when and where my first shift will be :)",
          "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrr26tl/",
          "created": 1728841664,
          "depth": 1,
          "replies": [
            {
              "id": "ls0d0l9",
              "score": 2,
              "body": "Marcus Lemonis -through Camping World- has vast experience with consumer financing i’d imagine… It really is odd that a guy like Lemonis would step into this unless he has a clear plan for rehabilitation… Very interesting",
              "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/ls0d0l9/",
              "created": 1728981106,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrey1fv",
      "score": 10,
      "body": "I appreciate how truly regarded your positions are. Time to hop on the train",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrey1fv/",
      "created": 1728656006,
      "depth": 0,
      "replies": [
        {
          "id": "lrf52ug",
          "score": 4,
          "body": "What did you buy, nerd?",
          "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrf52ug/",
          "created": 1728658411,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrf06ls",
      "score": 12,
      "body": "Bed Bath and Beyond is taking mah house because I defaulted on my HELOC.\n\nHoly fuck this is going to create even sadder bag holders.",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrf06ls/",
      "created": 1728656752,
      "depth": 0,
      "replies": [
        {
          "id": "lrqzprh",
          "score": 1,
          "body": "We'll need a pic of the foreclosure sign as part of the loss porn lol",
          "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrqzprh/",
          "created": 1728840897,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrgeqoz",
      "score": 5,
      "body": "I have like 1k shares and have been selling CC's because the IV is juiced. Sideways is fine with me but up would be nice.",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrgeqoz/",
      "created": 1728673317,
      "depth": 0,
      "replies": [
        {
          "id": "lrgfgpt",
          "score": 1,
          "body": "IV juiced for earnings? What CC's are you selling?",
          "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrgfgpt/",
          "created": 1728673558,
          "depth": 1,
          "replies": [
            {
              "id": "lrgg7qq",
              "score": 2,
              "body": "Not even for earnings, the IV on options has been high the whole year. I'm getting a 3% return on weekly options $1 OTM. $BYON is at $10.25 and I'm selling $11 calls one week out for .35.",
              "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrgg7qq/",
              "created": 1728673810,
              "depth": 2,
              "replies": [
                {
                  "id": "lrggojy",
                  "score": 1,
                  "body": "Been doing really well on the options then, if not the actual shares. That chart for the past 6 months looks brutal.",
                  "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrggojy/",
                  "created": 1728673968,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrgkw0e",
                      "score": 1,
                      "body": "Yeah my average share cost is like $12.80 so I'm down there but more than made it up selling CC's the past few months.",
                      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrgkw0e/",
                      "created": 1728675395,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrr048y",
                          "score": 1,
                          "body": "Nice! You probably made out way better than most people invested in this. If my DD unfolds as I think it will though...you're gonna want to buy back any calls you have out pretty soon lol",
                          "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrr048y/",
                          "created": 1728841023,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ltidmrx",
      "score": 6,
      "body": "Rip",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/ltidmrx/",
      "created": 1729777000,
      "depth": 0,
      "replies": [
        {
          "id": "ltl0f8c",
          "score": 1,
          "body": "fucking guh.",
          "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/ltl0f8c/",
          "created": 1729805859,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lreyneo",
      "score": 7,
      "body": "fuck it im in",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lreyneo/",
      "created": 1728656220,
      "depth": 0,
      "replies": [
        {
          "id": "lrqzrrb",
          "score": 1,
          "body": "I wanna see the yolo post :)",
          "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrqzrrb/",
          "created": 1728840914,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltmg1js",
          "score": 1,
          "body": "Rip",
          "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/ltmg1js/",
          "created": 1729824422,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrfu8gh",
      "score": 5,
      "body": "exact same bot replies the last time this was posted. dont fall for it.",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrfu8gh/",
      "created": 1728666625,
      "depth": 0,
      "replies": [
        {
          "id": "lrr08kw",
          "score": 2,
          "body": "Meep moop meep... buy buy stonk",
          "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrr08kw/",
          "created": 1728841062,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrgllk2",
      "score": 2,
      "body": "You make a convincing argument for such a bad looking chart and fundamentals.  EPS won't even be positive until 2027.  I might check in on it in a year or so.  Best of luck",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrgllk2/",
      "created": 1728675636,
      "depth": 0,
      "replies": [
        {
          "id": "lrr0de2",
          "score": 1,
          "body": "Thanks! Hopefully there will still be some headroom for the stock to go up by then :D",
          "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrr0de2/",
          "created": 1728841104,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrncltd",
      "score": 2,
      "body": "They may not have any debt but they only have enough cash to cover the next 9 months of losses. Not to say they’re going to go bankrupt but the clock is ticking here.",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrncltd/",
      "created": 1728779129,
      "depth": 0,
      "replies": [
        {
          "id": "lrr1kvi",
          "score": 2,
          "body": "Yeah, definitely not a bad call out, but I think as it is with most value plays, you have to look at things that aren't going to be in earnings reports (or at least account for the lag time).\n\nThey've been cutting costs, sold their HQ for \\~$50m which hasn't shown on a Quarterly report yet. That will also reduce spend in the future. This will also be the first quarter in which the added revenue from the Overstock dot com relaunch will be included.\n\nYou're right, they definitely aren't out of the woods yet. A lot of work to do. But from how it looks to me, not even the potential for a turnaround is priced in as of now. Their EPS is negative so P/E is null, but the price to sales ratio is like 0.3 now. Market cap is not much higher than a single quarter's revenue.",
          "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrr1kvi/",
          "created": 1728841478,
          "depth": 1,
          "replies": [
            {
              "id": "lrr87e9",
              "score": 3,
              "body": "Yeah it’s certainly priced for bankruptcy. If you think they can turn it around before then it makes sense to buy today.",
              "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrr87e9/",
              "created": 1728843545,
              "depth": 2,
              "replies": [
                {
                  "id": "lrraqck",
                  "score": 2,
                  "body": "\"Priced for bankruptcy\" is a perfect way to put it. If they can turn it around, especially if they convince the market that they CAN turn it around soon (preferably by earnings), then I'll end up with retire early + lambo money.",
                  "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrraqck/",
                  "created": 1728844336,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ltip33h",
      "score": 2,
      "body": "Boy, this escalated pretty quickly...",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/ltip33h/",
      "created": 1729780793,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltkhx8o",
      "score": 2,
      "body": "Too regarded for me",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/ltkhx8o/",
      "created": 1729800191,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrergjy",
      "score": 3,
      "body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrergjy/",
      "created": 1728653629,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhhiyd",
      "score": 2,
      "body": "this is just as regarded as blood bath and beyond. I’m in",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrhhiyd/",
      "created": 1728686988,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltj7mvf",
      "score": 1,
      "body": "What do we do now? I lost so much money should we double down",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/ltj7mvf/",
      "created": 1729786418,
      "depth": 0,
      "replies": [
        {
          "id": "ltl8je4",
          "score": 2,
          "body": "*definitely* not financial advice, but I'm holding what I currently have for a bit. The last two earnings were very volatile and it bounced/recovered the next day or week (which could be used as an exit) even though they weren't received well initially.  \n  \nIf there's an off-ramp then I'll probably look to roll out to next march/june/and maybe some Jan 2026. The quick reversal for the stock was obviously a bad call...but I still think they can turn the company around barring horrible macro events.",
          "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/ltl8je4/",
          "created": 1729808606,
          "depth": 1,
          "replies": [
            {
              "id": "ltl8jff",
              "score": 1,
              "body": "PUT YOUR HANDS UP -Jimbles!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
              "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/ltl8jff/",
              "created": 1729808606,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lutebev",
      "score": 1,
      "body": "Ouch this didn’t age well. Down another 50%. Will check out latest earnings report but dang the financials are horrible. Burning cash, decreasing revenue. Net loss last 8 quarters. Decreasing gross margin. 😬 this is not looking good.",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lutebev/",
      "created": 1730439251,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvk77zw",
      "score": 1,
      "body": "you fucked me😭😭😭",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lvk77zw/",
      "created": 1730830266,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrfztol",
      "score": 1,
      "body": "I cant read all that.  downvote for no TLDR.  What do you mean RIP to towel stock holders?  We are still here holding rug pull ryan's head in the toilet asking \"where's the shares rug pull Ryan?\"",
      "permalink": "/r/wallstreetbets/comments/1g19wop/overstockcom_byon_dd_bath_towels_are_back_in_stock/lrfztol/",
      "created": 1728668434,
      "depth": 0,
      "replies": []
    }
  ]
}