{
  "title": "Tesla is Completely out of Touch with Needs of Taxi Services. ",
  "score": 776,
  "selftext": "Seeing a lot of focus on the Temu Boston Dynamics bot, but not a lot of discussion on the robo taxi. \n\nHow this thing is built tells me how out of touch and unprepared Tesla is to seriously compete in ride servicing. \n\nFirst off this thing has two seats, that alone is such a dumb design decision. It had to be Elon that said to keep it as two seats so it looks futuristic and aesthetic. What if I want to travel with a small group of people? I’m not using the LAX shuttle van at that point, I’m immediately turning to a competitor. Haven’t really seen anyone comment on how out of touch and unnecessary that was. \n\nOne other concern I have is how Tesla primarily uses cameras. What if there are sirens and a fire truck, ambulance, or police car is blowing through an intersection. Other autonomous vehicles incorporate sound, I’m not too sure Tesla does. If not it sounds like a lawsuit waiting to happen. \n\nBeyond this there’s the ridiculous price tag he put on it which it’ll probably be nowhere close to. \n\nWhat are other people’s thoughts on this, did anything with this Robotaxi actually look like a feasible product to you? It looks like an aesthetic toy, but not an actual product that can compete in the space. Based on my understanding of a typical car design cycle, redesigning this to add four instead of just 2 seats would take probably another 2-4 years at least. To me it seems like they really just showed they lost on their biggest bet in the near future. \n\n\nEdit: Alright read through the comments, and still think the 2 seat no steering wheel design is stupid. People are saying this is meant to also be a personal commuter car. So my choices are to buy a 30K Robotaxi (knowing Tesla’s history this WILL be priced higher) and then ALSO get a model 3 or model Y to drive around my family for ANOTHER 40K when I can just get ONE model 3 or any other self driving car, no Robotaxi and do everything I need? How is that budget friendly at all, and if there’s a nicer car with a steering wheel that self drives why would I buy something without the option of a steering wheel? \nStill a toy.\n \nAlso, if it’s for personal use, how does this know where to park at my office or how to get past a security gate to private property? If I live in a condo building with a garage how does it know how to get out of the parking garage and where my parking space is? It makes no sense as a personal car for a LOT of people.\n\nAnd even if the majority of taxi rides are 1-2 people, why not just use a model 3 that’s 10K more, already exists, and can service that additional 15-20% of your taxi market (given the Robotaxi is definitely not gonna cost 30K and over the life of the car the extra seats pay for themselves). You also save on all the costs that it took to make a stupid 2 seater when it came to expanding production lines/capacity, testing, and designing the pointless thing. \n\nMy opinion doesn’t change this thing shouldn’t exist, and it’s out of touch with what most people need. Total waste of time when they could’ve focused on actually competing with growing competition in the normal car space where they’re losing their competitive advantage. There’s a reason why Uber and the ex-Waymo CEO were not impressed.",
  "link_flair_text": "Company Discussion",
  "id": "1g1e9q0",
  "num_comments": 436,
  "created_utc": 1728665139,
  "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/",
  "comments": [
    {
      "id": "lrftvx6",
      "score": 306,
      "body": "To me the real challenges are both legal and operational. So for fun, let's assume all Elon's claims come true. 20-30k in 2026 with FSD without lidar (just for the sake of argument).\n\nNobody has clearance to run fully autonomous cars on the road. There are some companies who have some clearance to run some cars and they are reporting back good data. But that's all based on lidar systems, not just camera based. The roll out will have to take this in consideration and this is not a technological step but a governance one. This will take considerable time.\n\nBeyond that, these cars will need charging, which might be inductive sure but that still needs infrastructure which needs to be built out. Since there is no single station built anywhere.\n\nThen you have to think about the hygiene within the car, both in terms of actual hygiene, but also gravity and misuse by the public. This will need operational staff too. \n\nThis is where the waymo roll out is a lot more sensible, especially the partnership with a company like Uber who does have infrastructure and operational staff in most mayor cities or the capacity to scale.\n\nAnd even if you were to fix all of those issues you'd also be activating a lot of latent demand for mobility, there is a reason you need a license to run a taxi in NYC otherwise it would be even more gridlocked than it is today. Now add into that mix every subway rider who now wants to take a cybertaxi. Walking would be faster at that rate. And that is just existing ridership, latent demand is real and will affect cities. This future increases call for regulation.\n\nThe vision is clear and yes long term this will be how mobility will be operated. Along side many other options like autonomous busses, streetcars, trains and subways. Who knows if you are looking long term maybe even drones with more energy density from advanced solid state batteries. But for now they should focus on proving the concept and setting themselves up to scale, this course will only cause dissatisfaction with shareholders over unmet goals.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrftvx6/",
      "created": 1728666512,
      "depth": 0,
      "replies": [
        {
          "id": "lrg4vbz",
          "score": 186,
          "body": ">The vision is clear and yes long term this will be how mobility will be operated.\n\nI can tell by your comment that you're deeply familiar with the space. But the part I quoted makes me think you're an engineer. Robotaxis have always been a solution looking for a problem. In reality, people in densely populated areas need better public transportation infrastructure (subways, railcars, regional trains, etc). Self-driving cars & buses will serve a purpose, but more so where infrastructure spending doesn't make sense for the population numbers.\n\nWe've built this entire country for cars & so it's all most have ever known. It's far from the most efficient way of facilitating mobility.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrg4vbz/",
          "created": 1728670061,
          "depth": 1,
          "replies": [
            {
              "id": "lrgbs8t",
              "score": 62,
              "body": "Not the person you're responding to but this: \n\n>people in densely populated areas need better public transportation infrastructure (subways, railcars, regional trains, etc).\n\nMakes total sense. But what matters is whether cities will actually invest in it. Robotaxis for the most part will be private entities exploiting that lack of investment in public transit, as well as the fact that the US is built for cars first.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgbs8t/",
              "created": 1728672341,
              "depth": 2,
              "replies": [
                {
                  "id": "lrgwzem",
                  "score": 22,
                  "body": "Some cities won't invest, but others most likely will. Every minute somebody spends in traffic jams, is essentially lost work/free time where they could be making/using money. In turn, lost tax money.",
                  "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgwzem/",
                  "created": 1728679450,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrh5xaf",
                      "score": 10,
                      "body": "Absolutely, it's not a binary answer... But most cities will chronically under-invest IMO. There are other tail winds for robotaxis, but my 2c.",
                      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrh5xaf/",
                      "created": 1728682582,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lrhkoda",
              "score": 13,
              "body": "Interesting, actually I work in public transport not as an engineer but I am deeply familiar with mobility (non US). Thank you tho for the massive compliment! (Engineers are freaking awesome!)\n\nAnd I do fully agree with you that the us in particular is lacking adequate infrastructure for its mobility needs, which leads to the just one more lane mentally we see in places like LA or Austin.\n\nThe challenge is infrastructure doesn't get built overnight, it takes decades to make a dent and this takes vision and commitment, which is not something most politicians can afford, it's just the nature of the way we distributed power. This applies widely even beyond the US. It truly baffles me to hear people say that public transport needs to turn a profit or that it's bad that it subsidized. We don't have that requirement for roads and per mile most public transport is cheaper, more efficient, less polluting and most of all safer too. (Yes I am a massive not just bikes fan.)\n\nNow I will admit traveling by car is more comfortable, often faster and there are places, especially urban where public transport makes a lot less sense. But compare the public transport network of any major us city besides NYC to other metropolitan areas in the world like Paris, London or Tokio and it becomes laughable.\n\nBut to come back to the valid point you are making, when I talk about robotaxis I see them as public transport, I think it's Ludacris to have a 2 seater robotaxi. Autonomous busses and people movers can create networks which the us is in dire need of for a reduced cost, potentially to the point that in  more urban areas there is an opportunity for profit. This could then open up doors for private investment into better infrastructure or maybe a collaboration between public and private. Both from a real estate pov and a mobility one.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhkoda/",
              "created": 1728688240,
              "depth": 2,
              "replies": [
                {
                  "id": "lrhsfnh",
                  "score": 2,
                  "body": "So, autonomous ten-seater, navigating neighbourhoods by constantly optimizing pick-up and drop off stops, providing fast and cheap (public transportation fare) service metro station to end point destination. Remote monitoring for safety by live operators... Giving the amount of people I see using Uber/Lyft this will be a good solution. Don't see Tesla taking a stake. Rivian has more chances to do it in the US.",
                  "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhsfnh/",
                  "created": 1728691394,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrhkdxc",
              "score": 3,
              "body": "Yeah but for me and a lot of other people driving a car affords a different level of optionality that we understandably demand vs the alternatives u mention",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhkdxc/",
              "created": 1728688124,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrgbr7l",
              "score": 13,
              "body": "This is way too black and white. Cities like London, Beijing and Tokyo have some of the best public transit infrastructure in the world, yet still are absolutely massive taxi markets. Touch grass and you'll see both are needed.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgbr7l/",
              "created": 1728672332,
              "depth": 2,
              "replies": [
                {
                  "id": "lrgp4f4",
                  "score": 9,
                  "body": "Yup. Bus/train solutions are fantastic, but that doesn’t mean the stops are particularly close to where you’re going. There will always need to be a final mile solution.",
                  "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgp4f4/",
                  "created": 1728676810,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrgwbrs",
              "score": 7,
              "body": "Nobody is going to build any local rail, tram or bus lines anywhere any time soon. You want to go someplace get a car.\nI know, but that's the American reality. That's why a robo taxi will work. Nobody wants to go anywhere with other strangers. Most Americans don't so this will work well.\nNeed a bigger robo taxi get a model Y one. Get 2 if you need to. It will work in a couple of years.\n\nShould we spend more on infrastructure, sure. Who's got ten years or twenty years to wait.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgwbrs/",
              "created": 1728679228,
              "depth": 2,
              "replies": [
                {
                  "id": "lrhqs4r",
                  "score": 3,
                  "body": "Agreed. If they made a 5 seater RT that would compete with the Model 3 or Y. This way they have a car that anyone can buy, it will have some limitations compared to the model 3, like less range, slower charging, no controls, but it will also cost $10k less. Just because this car exists doesn’t make the model 3 or Y any worse as a autonomous taxi",
                  "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhqs4r/",
                  "created": 1728690714,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrh71hl",
              "score": 6,
              "body": "> robotaxis have always been a solution looking for a problem. \n\nThat is categorically false and you go on the disprove yourself.  You just think that a different solution is better.  The same problem exists, people need to go from point a to point b.  The economics of significantly improving mass transit don’t make sense for a company to take on by itself.  That’s what our government is supposed to do, and has a failed, which is either a reflection of the voting base itself and/or lobbyist.  \n\n\nI would love to have better mass transit. I live in San Francisco, a city that has waymos, Bart (subway) and Muni.  The cost it would take to improve our public transit to compete with European cities would be tens of billions.  I was blown away by the Copenhagen public transit system.  SF is relatively denser than most of America, in order for mass transit to work efficiently we would have to build even denser housing. \n\nTo say it’s a solution to a problem that doesn’t exist is a red herring.  Transportation is a problem.  Autonomous vehicles help solve that problem, and since they are electric aren’t as bad on the environment.  And autonomous vehicles could be a viable option to reduce car ownership, which in turn would reduce the need to plan around cars, opening up denser housing and maybe we as voters would vote for mass transit? \n\nIt’s entirely feasible that in the next decade or two that waymos could operate on the vast majority of roads in America. Imagine a world where instead of paying $300-$500 a month on a car, you subscribe to an autonomous network for $300, that gives you set a number of miles…like the old phone plans.   This is more feasible than a human driver doing this all the time because AVs  don’t need to sleep.  They don’t get tired on the road. They don’t get road rage. \n\nThis would be significantly better for us because we don’t have to worry about to parking the cars or maintaining them.  \n\nYou’re looking at it as we need mass transit to reduce car reliance.  The other side of the coin is if we reduce car ownership, can that lead to mass transit?",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrh71hl/",
              "created": 1728682987,
              "depth": 2,
              "replies": [
                {
                  "id": "lrkrli0",
                  "score": 7,
                  "body": ">That is categorically false and you go on the disprove yourself. \n\n> Imagine a world where instead of paying $300-$500 a month on a car, you subscribe to an autonomous network for $300, that gives you set a number of miles…like the old phone plans. \n\nPeople are just not interested in giving up their personal cars.  It's not a price thing.  My friends could easily afford taking a taxi everywhere - there is Uber and a local taxi company, but they have two cars?  Why? Because they prefer using their own vehicles.",
                  "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrkrli0/",
                  "created": 1728746302,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lrfwngj",
          "score": 15,
          "body": "Mobility will more likely be operated by things like the van they showed - small programmable public transport that goes door to door while being automated.\n\nHowever other companies have working models of this. We had a test version of one … five years ago. It already is operating at a lot of industrial sites.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfwngj/",
          "created": 1728667404,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrgwn8y",
          "score": 5,
          "body": "What about those fully autonomous ones in san Fran. Visited there and saw them and it was really cool. Not sure what company owns them tho",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgwn8y/",
          "created": 1728679337,
          "depth": 1,
          "replies": [
            {
              "id": "lrhinjt",
              "score": 6,
              "body": "Alphabet.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhinjt/",
              "created": 1728687435,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrh9t9d",
          "score": 3,
          "body": "When he said wireless charging for the car I raised my eyebrows",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrh9t9d/",
          "created": 1728684009,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrg3ofn",
          "score": 9,
          "body": "I like how you try to use good faith arguments about when Elon says. He just made that up. Like everything else. There's no roadmap to that many, just a nice sounding number that could be realistic.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrg3ofn/",
          "created": 1728669675,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrg0p0w",
          "score": 11,
          "body": "The legal argument could explain, why he supports Trump. If he wins, Musk could get the clearance no matter how bad the tech is",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrg0p0w/",
          "created": 1728668715,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrh2l1d",
          "score": 5,
          "body": "You wrote a lot of stuff.  Why does tesla need to sell cars if the technology worked?  Just provide the service.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrh2l1d/",
          "created": 1728681388,
          "depth": 1,
          "replies": [
            {
              "id": "lrh5g93",
              "score": 12,
              "body": "The whole selling them thing makes it all sound just outright preposterous to me. Who are the mysterious entities buying these by 2026? Just random people? That's how he makes it sound. 30K and you too can have a car run a cab company for you! How are you going to get approval for random people to run unlicensed autonomous cab companies?",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrh5g93/",
              "created": 1728682412,
              "depth": 2,
              "replies": [
                {
                  "id": "lrj8xmh",
                  "score": 7,
                  "body": "Yeah not to mention what was presented cannot be charged at home, at a supercharger or literally anywhere right now because it apparently won't have a charging port.\n\nLike it's more ridiculous the more I think about it. Inductive charging is slow and inefficient, there's no infrastructure for it anywhere. Allowing a vehicle to support it is great - removing the charging port completely is idiotic and would make any personal vehicle dead on arrival.\n\nAlso it has scissor doors, which require more space than any other door design. Good one dickheads.",
                  "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrj8xmh/",
                  "created": 1728717920,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrhmrql",
              "score": 3,
              "body": "I mean there are probably gonna be people who won't wanna share a robotaxi. If you don't have to provide the operational side of things thats gonna save a lot of hassle. But boy would that still be inefficient. Parking tons of vehicles, empty cars driving all the time. In reality it will probably be a mix of shared robocars and owned ones for those who need the convience or have the money to afford it.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhmrql/",
              "created": 1728689076,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrio2l9",
          "score": 2,
          "body": "Maybe this is why Elon is buddying up with Trump. He helps Trump win the election using his X platform and his cult follower votes. Then Trump helps push through approvals.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrio2l9/",
          "created": 1728705258,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrja1ep",
          "score": 1,
          "body": "Yeah, Musk's comment on these being \"personal mass transit\" is insane. London and NYC are brutal to drive through at rush hour. Adding 100,000 of these would make it much worse (and therefore neither city would allow it).",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrja1ep/",
          "created": 1728718700,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrjwslj",
          "score": 1,
          "body": "I can see autonomous taxis being a thing with drivers still in the seat, or some sort of attendant/security",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrjwslj/",
          "created": 1728733901,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrk1mq0",
          "score": 1,
          "body": "The point is it has to be cheap. A cab driver doesn't cost that much money so a robotaxi can't be a hundred grand you would not make that back.  You still need people supporting them ( cleaning repairing digging them out after they failed or someone vomited into them) after all just less. \n\nRegulations are fixable if you are powerful enough. \n\nThe real question is if they work which is still highly doubtful. If you let them free everywhere like a normal cab I don't think they work or will in 2027. They need to work 24/7 under unexpected circumstances after all. And if you only use them for point to point connections there is no way they beat a shuttle bus in capacity and money.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrk1mq0/",
          "created": 1728736249,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrpdpd2",
          "score": 1,
          "body": "China,SK, and Japan all have clearance for SD cards",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrpdpd2/",
          "created": 1728818907,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrgnunx",
      "score": 18,
      "body": "No.  The real out of touch issue is that if Robotaxi is this valuable then it will not individual owners making use of one and instead the same investment firms buying up homes will buy fleets of Robotaxi and offer trips at rates private owners cannot compete with.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgnunx/",
      "created": 1728676387,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrfvcin",
      "score": 87,
      "body": "I could make a flying autonomous taxi for $50,000 if the FAA didn't exist and I wouldn't have to pay for insurance on the inevitable fatalities. But that's not the real world.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfvcin/",
      "created": 1728666985,
      "depth": 0,
      "replies": [
        {
          "id": "lrguze6",
          "score": 12,
          "body": "I wonder if a random country would consider this. It's not like you have to be the guinea pig if you live there. Create a fatality fund and if you die you get a payout from it.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrguze6/",
          "created": 1728678778,
          "depth": 1,
          "replies": [
            {
              "id": "lrhm7f0",
              "score": 6,
              "body": "That sounds like Elmo making the Chinese public the crash test dummies for FSD",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhm7f0/",
              "created": 1728688848,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrghd50",
          "score": 5,
          "body": "Need to add more zeroes unless all you want to make is a robotaxi for small rodents.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrghd50/",
          "created": 1728674197,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrfswyu",
      "score": 124,
      "body": "Look at all these bag holders who are salty they just got stiffed by an 8% drop lmfao",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfswyu/",
      "created": 1728666196,
      "depth": 0,
      "replies": [
        {
          "id": "lrfv2x1",
          "score": 47,
          "body": "...so far",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfv2x1/",
          "created": 1728666898,
          "depth": 1,
          "replies": [
            {
              "id": "lrgzqnc",
              "score": 18,
              "body": "We haven't even seen the fiscal year losses from CyberTrucks yet.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgzqnc/",
              "created": 1728680394,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrhml34",
          "score": 12,
          "body": "I got in TSLA when it was around \\~140 last year, and r/stocks was saying TSLA will go bankrupt anytime soon.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhml34/",
          "created": 1728689000,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrfys0w",
          "score": 11,
          "body": "I'm not salty, I'm used to pain.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfys0w/",
          "created": 1728668093,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrgputu",
          "score": 4,
          "body": "Idk… I feel like the majority of people who are long Tesla have been feeling pretty good about the investment for a long while now. Maybe not if you’ve bought sometime after 2022. But everyone before that is almost certainly feeling good.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgputu/",
          "created": 1728677056,
          "depth": 1,
          "replies": [
            {
              "id": "lrhq3u5",
              "score": 4,
              "body": "I think the majority of people who are long Tesla are losing on the investment, and fall into one of two camps:\n\n1. Those who bought in too late, chasing hype (post-2021) - their cost basis is in the $250 to $400 range.\n2. Those who originally bought in \"early\" (pre-2021), but then averaged up and raised their cost basis - they are still up on their pre-2021 buy-in, but then they kept buying more shares in the $250 to $400 range, and now they are overall losing on their Tesla long.\n\nAnd even after the recent dip to $218, Tesla still has an excessively high valuation that defies rationality.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhq3u5/",
              "created": 1728690438,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrpdvm7",
          "score": 1,
          "body": "House of cards mate Tesla is a really poor stock built on elons fake genius. The Chinese companies blow Tesla out the water in evreything",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrpdvm7/",
          "created": 1728819008,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrg7yfm",
      "score": 67,
      "body": "I’ll never understand this company’s valuation. They really have nothing to offer but hype (which they’ve consistently failed on anyways). I’m looking forward to them falling back down to earth one day.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrg7yfm/",
      "created": 1728671079,
      "depth": 0,
      "replies": [
        {
          "id": "lrgmhtk",
          "score": 0,
          "body": "Most auto manufacturers are bending the knee and switching to NACS style charging to take advantage of Tesla's infrastructure.  Supercharger compatibility is becoming a mandatory feature for other companies now, because their customers demand it.\n\nThe writing is on the wall, but not everyone will see it yet.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgmhtk/",
          "created": 1728675937,
          "depth": 1,
          "replies": [
            {
              "id": "lrgve0f",
              "score": 53,
              "body": "So what you’re telling me is this company is worth half a trillion for *checks notes* car chargers?",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgve0f/",
              "created": 1728678915,
              "depth": 2,
              "replies": [
                {
                  "id": "lrhakfr",
                  "score": 5,
                  "body": "Look at it this way. It'd be like in the early days of gas cars, Ford sold all the cars AND owned all the gas stations. The charging network is a big deal.",
                  "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhakfr/",
                  "created": 1728684292,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrhw9vz",
                      "score": 21,
                      "body": "Then old mate fired all of the people working for that, though?",
                      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhw9vz/",
                      "created": 1728692983,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lri9n96",
                          "score": 12,
                          "body": "Yeah he kinda fucked up there.",
                          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lri9n96/",
                          "created": 1728698649,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lri0i03",
              "score": 12,
              "body": "How big are the gross profit margins on a charging network where you don’t actually generate the electricity that is being sold. EV chargers will be in everyone’s garage so there won’t be much of a need for public charging except for road trips.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lri0i03/",
              "created": 1728694728,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrgsb7i",
              "score": 7,
              "body": "While chargers are fine and their network is big the cars themselves suck and Elon is a complete idiot.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgsb7i/",
              "created": 1728677881,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrg9g0k",
      "score": 27,
      "body": "I think you've misunderstood something here.\n\nThe Cybercab, the new car unveiled, is just another car.\n\nThe robotaxi service will apply to the whole Tesla fleet. If you need more seats, you will be picked up by a Model 3 or Y.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrg9g0k/",
      "created": 1728671572,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrfv73w",
      "score": 43,
      "body": "You are right that Tesla is miles behind Waymo on this. I don't see how Tesla robotaxi can actually go to market.\n\n\nI think what Elon is hoping for is some Republican states (or a Republican presidency) being more friendly to him and cut him some corners. I really don't think a state like California will give Elon more leeway compared to Cruise. If your business depends on who wins an election it's not a good business.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfv73w/",
      "created": 1728666937,
      "depth": 0,
      "replies": [
        {
          "id": "lrgyg10",
          "score": 8,
          "body": "If that's the model, they are just a handful of really awful car crashes away from being sued into oblivion. It's not a sustainable business model at all. This, coupled with the disaster that is Cybertruck and the strong competition from China... it will be the end of Tesla.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgyg10/",
          "created": 1728679948,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrl8la5",
          "score": 1,
          "body": "Waymo doesn’t make their cars and Jaguar doesn’t make the software. Google has no manufacturing set up to scale.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrl8la5/",
          "created": 1728752086,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrg1htb",
      "score": 39,
      "body": "\"has two seats, that alone is such a dumb design decision.\"\n\n\n\n\nYou'd think someone with kids would know 2 is not enough ",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrg1htb/",
      "created": 1728668973,
      "depth": 0,
      "replies": [
        {
          "id": "lrganh4",
          "score": 56,
          "body": "I mean, it is enough for him, seeing as his kids don't want to be near him.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrganh4/",
          "created": 1728671968,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrgvegz",
          "score": 12,
          "body": "By that logic he should have designed a train. /s",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgvegz/",
          "created": 1728678919,
          "depth": 1,
          "replies": [
            {
              "id": "lrgvo4t",
              "score": 3,
              "body": "lol yeah but not everyone has 12 kids. I guess the average family will be 4-5",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgvo4t/",
              "created": 1728679009,
              "depth": 2,
              "replies": [
                {
                  "id": "lrgzxub",
                  "score": 3,
                  "body": "Even still, if you're hanging out with any group bigger than 2 people, they are useless.",
                  "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgzxub/",
                  "created": 1728680462,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lrg7ke3",
          "score": 4,
          "body": "Username checks out",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrg7ke3/",
          "created": 1728670952,
          "depth": 1,
          "replies": [
            {
              "id": "lrgirts",
              "score": 4,
              "body": "sadly, I can't post in any of the Tesla subs or my account gets banned permanently.\n\nElmo has his minions well trained to defend him.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgirts/",
              "created": 1728674672,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrh0eb7",
          "score": 13,
          "body": "What’s the majority of car rides or uber/Lyft bookings? Single person or a couple. They want to make this small so they can get their costs down and scale faster. \n\nAnyone who needs a larger vehicle will just book a Model 3, Y, CT etc. \n\nThis factor is a none issue.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrh0eb7/",
          "created": 1728680624,
          "depth": 1,
          "replies": [
            {
              "id": "lrkdhd9",
              "score": 5,
              "body": "They said at event themselves that 90% of the rides are currently 1 or 2 people. There can be separate vehicles for the 10%, but the idea about 2 seater is the compounding gains from reduced weight in terms of how much electric powered cars can go. Reduced weight => reduced electric usage => reduced requirements for battery size => even further reduced electric usage.\n\n\nIdeal would be a mix with larger proportion of 2 seaters and some larger seaters mixed in there.\n\n\nBack of the napkin calculations would come to cost savings of around 25% - 30%, putting together production costs and energy cost.\n\n\nSo a ride that with 4 seater would cost otherwise $10, it would cost $7 - $7.50 with 2 seater if there's 2 or fewer people.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrkdhd9/",
              "created": 1728741222,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrhjfmx",
          "score": 4,
          "body": "How many times do you see a family on a taxi? Almost never. It is over 90% of the time just one person. This taxi has too many seats and is heavier and larger than it needs to be. Stop pushing waste. ",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhjfmx/",
          "created": 1728687746,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrh3wc2",
      "score": 21,
      "body": "Lot of people in here judging the 2 seats like there’s no logic to it. I’m in enough marketing meetings to think what’s likely going on \n- two or less riders is the largest demographic\n- business travelers or upper class are ideal demo\n\n\nThis isn’t supposed to be for everyone, just an “MVP” launch that’s likely to capture the largest initial audience. Don’t be blinded by Musk to think there isn’t a shit load of research that goes into these decisions by people that are not Musk.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrh3wc2/",
      "created": 1728681852,
      "depth": 0,
      "replies": [
        {
          "id": "lrkr0ct",
          "score": 3,
          "body": "Ever see the express lane? It’s always empty because the vast majority of commuting happens with 1-2 people. Op thinks his party bus to the airport is elons primary target audience",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrkr0ct/",
          "created": 1728746097,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrhp3uz",
      "score": 15,
      "body": "I used to drive Uber and completed 10k+ trips, let me tell you 98% of the time it's only 1 or 2 passengers. Model Y & other models will also be available for more seats.\n\nFSD already works with Sirens and cameras are 360 degree, it can see them in any direction.\n\nAverage car price is $48k in US, under 30k is alright.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhp3uz/",
      "created": 1728690028,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrft1fo",
      "score": 46,
      "body": "I don’t see a market for this at the moment.  It seems like something that’s still in the concept phase.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrft1fo/",
      "created": 1728666236,
      "depth": 0,
      "replies": [
        {
          "id": "lrfvm6d",
          "score": 47,
          "body": "Except there are robotaxi services out there with paying customers today.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfvm6d/",
          "created": 1728667071,
          "depth": 1,
          "replies": [
            {
              "id": "lrfxy5t",
              "score": 42,
              "body": "Yeah, waymo is pretty legit actually. I just don't see why anyone would choose the Tesla cab over a waymo though",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfxy5t/",
              "created": 1728667822,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrg2z6q",
              "score": 4,
              "body": "Stupid question how does insurance work with the waymo taxis?  Is Google self insuring?",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrg2z6q/",
              "created": 1728669448,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrg5rry",
              "score": 1,
              "body": "And how profitable are those companies?",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrg5rry/",
              "created": 1728670357,
              "depth": 2,
              "replies": [
                {
                  "id": "lrgbzpl",
                  "score": 7,
                  "body": "About as profitable as Uber was a decade ago.",
                  "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgbzpl/",
                  "created": 1728672409,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lrfu28m",
          "score": 4,
          "body": "You mean autonomous transportation in general or Tesla robot taxi?",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfu28m/",
          "created": 1728666569,
          "depth": 1,
          "replies": [
            {
              "id": "lrfw0tq",
              "score": 3,
              "body": "I think in general. And I think he is right. Or to be precise: there is a market, but right now it’s small and limited. Eg transfer from and to hubs or something.\n\nI don’t see how this, yet, will revolutionalize / disrupt transportation as a whole in dense cities. \n\n5-10 years from now the pain might be big enough to drive change. But answer me this: if not owning a car would be such a huge market already, why would people not use Uber and taxis all over already? \n\nThis would bring us to the price point: at a certain price level, it would be better and smarter to rely on services vs cars. And Tesla would need to be cheaper than taxis and Ubers to get this market. \n\nNow you could argue, it will not replace a self owned car for 100%. But then the market (think in drives per week you are doing on your own vs service) gets tremendously lower. So yes, market but small.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfw0tq/",
              "created": 1728667202,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrl8vas",
          "score": 1,
          "body": "It is in the concept phase, I’ll agree with you there. But if people want private transport, why wouldn’t you want to maximize profit by developing self driving cars? It won’t be perfect at first, but the testing has to happen at some point.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrl8vas/",
          "created": 1728752179,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrfzscc",
      "score": 17,
      "body": "I don't see a two seater as an issue.  You don't need to service the entire market.  As a taxi, I agree with other comments that there are huge infrastructure issues not being dealt with.  I could see this as a personally owned senior citizen taxi for those who are no longer comfortable to drive.  I myself, would walk before I let that thing drive me anywhere.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfzscc/",
      "created": 1728668423,
      "depth": 0,
      "replies": [
        {
          "id": "lrgqugg",
          "score": 1,
          "body": "yea of all the complaints, the two seater seems like a non-issue, there's plenty of market for them. You can always point at any product and say what market they wouldn't serve. Their biggest challenge is how they would be able to put any vehicles on the road safely with just cam alone. It's just a pipe dream right now",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgqugg/",
          "created": 1728677388,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrgrgwh",
          "score": 1,
          "body": "how many Ubers and taxis only use the back seats? I reckon a very large percentage of rides. if you have 4+ family to transport, you already have to think of alternative options throughout your trip",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgrgwh/",
          "created": 1728677599,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrhl787",
          "score": 1,
          "body": "I ride Waymo three times a week in phoenix az. I see them all the time, I hardly ever see one filled with more than two people",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhl787/",
          "created": 1728688450,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrjb26a",
      "score": 3,
      "body": "The taxi wasn’t even automated, you could see two dudes on the sides controlling what it was doing",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrjb26a/",
      "created": 1728719422,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrjv73v",
      "score": 3,
      "body": "Here’s a thought. What happens when someone blocks the cameras bc they hate the product or owner or autonomous vehicles. One burst of spray paint walking down the street and the car will be stranded",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrjv73v/",
      "created": 1728733050,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrfvmph",
      "score": 15,
      "body": "He literally said that if Trump doesn’t win he’s F’ed. But if he does, then Elon can continue to run the con game without fear. \n\nFree from prosecution, and a public more and more willing to accept untruths unpunished as the norm.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfvmph/",
      "created": 1728667076,
      "depth": 0,
      "replies": [
        {
          "id": "lrg1gcl",
          "score": 14,
          "body": "That's a bit short sighted by Elon.  Trump has turned on some of his closest \"friends\" overnight.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrg1gcl/",
          "created": 1728668960,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrhl1e3",
          "score": 2,
          "body": "if you watched the context of that coversation and not a sound byte, you'd know he was joking.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhl1e3/",
          "created": 1728688386,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrgisdx",
      "score": 4,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgisdx/",
      "created": 1728674677,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrfxvax",
      "score": 6,
      "body": "Still waiting for Tesla to release a car that uses LIDAR. They'll finally admit that they can't do further autonomous functionality without it and admit all previous cars will never achieve it. Didn't they change some terms on their pages about that promise recently?",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfxvax/",
      "created": 1728667796,
      "depth": 0,
      "replies": [
        {
          "id": "lrl9149",
          "score": 1,
          "body": "I wouldn’t say never. Just not yet.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrl9149/",
          "created": 1728752233,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrfzjzs",
      "score": 5,
      "body": "It looked like a marketing gig more than anything else. I'm willing to bet that the Robo taxi will not be ready, feasible, operational and fully legal by 2026 at a price tag of 30k.\n\nMaking it just a two-seater is just a poor business decision. Even if you assume that most customers will be singles and couples and you want to be efficient, can you imagine the level of availability you'd need to appeal to groups of people and for them to say \"Yeah, we're just gonna split up and take the next 3 Robo Taxis to get to our destination\"?\n\nI wouldn't be surprised at all if the Robo Taxi didn't become reality until the 2030s. I wouldn't be surprised if the price tag turned out to be a multiple of the communicated 30k either, at least at launch.\n\nAnd at the end of the day it's not just about the vehicles but about the entirety of the infrastructure needed for this business model. And I absolutely don't see that being ready on a significant scale within 2 years time.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfzjzs/",
      "created": 1728668348,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrh2tos",
      "score": 2,
      "body": "It's not taxi service. It's car as a service.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrh2tos/",
      "created": 1728681473,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrj0xoh",
      "score": 2,
      "body": "Elon musk is out of touch, no shock his business is too",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrj0xoh/",
      "created": 1728712536,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrj8f8p",
      "score": 2,
      "body": "I got downvoted for saying it should have four seats. They claimed taxis usually only have one or two for a trip. Which doesn’t make sense to me because taxis only have two seats in the back so of course most fares will be one or two people.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrj8f8p/",
      "created": 1728717559,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrjuo69",
      "score": 2,
      "body": "It won't get approved without a steering wheel or some kind of emergency takeover option anyways, if they persist on that design - just think about that ground clearance - they will loose the race",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrjuo69/",
      "created": 1728732762,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrk33wt",
      "score": 2,
      "body": "For every long term projection, without exception, Musk has over-promised, missed deadlines and has been  more expensive than initially stated.\n\nRobo-taxis will be the same. The only question is how far off will he be?\n\nWill it be 10 years late with only partial funcionality like full self driving? Will it be twice the price like the Cybertruck? Will it be poor quality? \n\nI'm guessing all of the above for something as complex as robo-taxis.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrk33wt/",
      "created": 1728736928,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrg3j9f",
      "score": 4,
      "body": "Your whole thesis here is that the thing has one seat, and you outrage bait yourself by inventing a narrative that Elon wanted it this way to look cool.  Current yellow cabs have one seat so what's the problem?  I am sure Tesla has lots of reasons for choosing to make it one seat.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrg3j9f/",
      "created": 1728669629,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrgerko",
      "score": 4,
      "body": "The price is likely right, it is a small 2-seat vehicle and it does not need high range. The Model 3 is $42k and Tesla is producing a lower cost vehicle early next year and the robocab would be cheaper then that one.\n\nThe robocab is for 1-2 people as majority of the time that is all that is in a car, for more then 2 people you will use S3XY or cybertruck. All of Tesla vehicles will be used as robotaxi, just the robocab will cost the least. \n\nIt is hard to miss seeing emergency vehicles with their lights on. That is a non-problem. \n\nTo me, Tesla has shown a strong vision on the future and it will be exciting when Tesla start rolling out robotaxi next year in Texas and California.\n\nIf the cybercab is cheap and gets you to where you are going, it is a feasible product.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgerko/",
      "created": 1728673325,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrgekoo",
      "score": 5,
      "body": "\"One other concern I have is how Tesla primarily uses cameras. What if there are sirens and a fire truck, ambulance, or police car is blowing through an intersection. Other autonomous vehicles incorporate sound, I’m not too sure Tesla does. If not it sounds like a lawsuit waiting to happen.\"\n\n  \nThere is footage of said scenario with FSD... it wasnt a problem.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgekoo/",
      "created": 1728673262,
      "depth": 0,
      "replies": [
        {
          "id": "lrgr8wv",
          "score": 3,
          "body": "Lidar will always be superior. Tesla can’t detect stop traffic around a corner in a tunnel with just cameras. Sure it performs well in visibility but if the camera system is blind you may as well be riding around in a coffin.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgr8wv/",
          "created": 1728677524,
          "depth": 1,
          "replies": [
            {
              "id": "lrh9042",
              "score": 5,
              "body": "Lidar is also effective in  California Smoke,  or West Texas Sandstorms.    Some places have fog.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrh9042/",
              "created": 1728683707,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrgxyuz",
              "score": 3,
              "body": "To be fair- neither can humans.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgxyuz/",
              "created": 1728679783,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrgw3hp",
      "score": 3,
      "body": "I thought the two seat approach was brilliant. Look around at other drivers while you’re on the road. Mostly just one person in a car. Lugging around 6000 pounds of extra weight to transport one person is terribly inefficient. In time, I’m sure they would release family transport options.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgw3hp/",
      "created": 1728679151,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrftsa3",
      "score": 1,
      "body": "It’s not that they are out of touch. It’s Elon musk needs to grasp on something to bump the stock one last time. And he apparently has failed",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrftsa3/",
      "created": 1728666479,
      "depth": 0,
      "replies": [
        {
          "id": "lrfxp19",
          "score": 3,
          "body": "I’m afraid he’ll get to pump it many more times, because of the irrational cult that he has going.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfxp19/",
          "created": 1728667740,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrgfcbx",
      "score": 3,
      "body": "Robotaxi is something you're supposed to call for your daily commute and all the other stuff you usually would own a car for (shopping, errands, ...) . This does not compete, primarily, with traditional taxi rides.\n\nMost of your day to day drives are with one or at most two people in the car. Two seats will cover that. \n\nYes, Tesla has microphones.\n\nMy thoughts? You didn't think very hard before going on a rant. Do I think Robotaxi will work? Don't really care. I would, however, buy such a car (with a steering wheel) for myself at that price point).",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgfcbx/",
      "created": 1728673518,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrfyhzl",
      "score": 3,
      "body": "Am I an outlier? Almost always when I take a cab I am alone, just with the driver. Very occasionally its with my wife. The two seater would work for 95% of my needs. Going to a wedding with 8 people can still be served by private vehicle van hire with driver.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfyhzl/",
      "created": 1728668002,
      "depth": 0,
      "replies": [
        {
          "id": "lrg416e",
          "score": 2,
          "body": "This sub talks in emotions m, vast majority of rides are 1 or 2",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrg416e/",
          "created": 1728669790,
          "depth": 1,
          "replies": [
            {
              "id": "lrg8agq",
              "score": 2,
              "body": "Yeah plus if it is a viable commuter vehicle that can then be released to work as a robotaxi while you work. Most people commute alone too sadly. Of course there exists plentiful public transport options but some people will always choose or need to use private vehicle to get to work.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrg8agq/",
              "created": 1728671188,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrfqll8",
      "score": 5,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfqll8/",
      "created": 1728665454,
      "depth": 0,
      "replies": [
        {
          "id": "lrfs3as",
          "score": 13,
          "body": "Ok, but it's not like they made the car much smaller so where are the savings here vs just doing a back seat? I would get this argument if he was churning out smart car size robotaxis.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfs3as/",
          "created": 1728665928,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrfti29",
          "score": 5,
          "body": "Where's the source of this stat? I have looked everywhere and can't find a single percentage of number of passengers per ride, you are just making up numbers at this point",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfti29/",
          "created": 1728666387,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrfqz7y",
          "score": 2,
          "body": "That’s a very misleading statistic you’re just throwing out there with no context whatsoever. This depends largely on where and when you’d be driving. Not to mention for situations where multiple people may be passengers it could over-index on trips where there is surge pricing, meaning more revenue for the same trip. \n\nEven if you were to just throw out that statistic and take it for what it is you’re still implying you just threw away close to 20% of your TAM for a design decision that was completely unnecessary. \n\nGuessing you have some shares.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfqz7y/",
          "created": 1728665574,
          "depth": 1,
          "replies": [
            {
              "id": "lrfs8nk",
              "score": 4,
              "body": "I don't have any shares, but I see his point.  It is entirely possible to me that the marginal cost of building larger taxis is not made up by the additional 15% of riders.  As well, it may make more sense to have larger vehicles for such passengers and charge them commensurately higher rates.  \n\nUber already sort of does this with their XL rides.",
              "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfs8nk/",
              "created": 1728665976,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrfuu1f",
          "score": 2,
          "body": "73% of all statistics shared on social media are made up.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfuu1f/",
          "created": 1728666819,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrfs2v0",
          "score": 0,
          "body": "How much of Uber's auxiliary services are included in your \"statistic\"? \n\nUber Eats alone would skew that data heavily considering there is 0 passengers more than 99% of the time.",
          "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfs2v0/",
          "created": 1728665924,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrfvo1i",
      "score": 1,
      "body": "100% of my cab rides i did om my own.  I see these as people movers going up and down any major city center.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfvo1i/",
      "created": 1728667088,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrft89p",
      "score": 2,
      "body": "You can take a Model 3 or Y if you have more people. He said all of those cars are going to be self-driving taxi compatible too. The Robotaxi is just the cheapest version",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrft89p/",
      "created": 1728666298,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrfux3w",
      "score": 2,
      "body": "Model 3, X, and Y will all have the same taxi capabilities. There will always be Tesla options for larger group sizes. This car in theory is their solution to fleets of cheap vehicles that can service the majority of taxi service. No different than Uber having standard pickup vs Uber XL pickup. The VAST majority of ride shares are done with 2 or less passengers, so from a cost and efficiency perspective the vast majority of your fleet only needs to be capable of holding 2 people.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrfux3w/",
      "created": 1728666846,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrg68ri",
      "score": 3,
      "body": "You think there isn’t a microphone to detect sound like ambulances or police sirens? Yet there is enough tech to make the car AUTONOMOUSLY drive?\n\nLike where do you get these assumptions. I would assume there is at least 2 or more mics(prob one in the cabin just kus Elon wanted it) minimum.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrg68ri/",
      "created": 1728670513,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhczcj",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhczcj/",
      "created": 1728685221,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrg147r",
      "score": 1,
      "body": "Isn't it a two seater because they repurposed Model 2s into robotaxis to save on costs?",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrg147r/",
      "created": 1728668851,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrgqo70",
      "score": 1,
      "body": "We will likely need to redo our roads, standardize them, and integrate the technology needed into them before any self driving car is viable.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgqo70/",
      "created": 1728677330,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrgwlc7",
      "score": 1,
      "body": "r/cyberstuck",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrgwlc7/",
      "created": 1728679318,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrh157z",
      "score": 1,
      "body": "If you can comfortably and discreetly fuck in it then it will be a massive success.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrh157z/",
      "created": 1728680887,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrh1ndc",
      "score": 1,
      "body": "There’s a reason Apple abandoned the idea of FSD. It’s ridiculously difficult to scale and will likely be legislated right out of existence if it ever comes on line. Mostly though, people don’t fucking want it. Here in San Francisco we’ve had these things on our streets for a couple years now. We’re a town that will give anything new a shot but there’s no love and in fact a lot of hate from what I have seen. How about high speed trains for fucks sake? Focus on that! Sheesh. ",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrh1ndc/",
      "created": 1728681063,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrh2gaa",
      "score": 1,
      "body": "You use the word “aesthetic” incorrectly.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrh2gaa/",
      "created": 1728681343,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrh2pct",
      "score": 1,
      "body": "They have models s, 3, x and y for more passengers.\n\n The 2-seater addresses the vast majority of rides that are 1 or 2 ppl. Even though I have a nuclear family I tend to drive alone or with 1 other person most of the time.\n\nThe rare occasion you need a 3-7 seater the other tesla models can easily accommodate.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrh2pct/",
      "created": 1728681430,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrh5jk2",
      "score": 1,
      "body": "No. They also had the Model Y 5 seater doing driverless demos at the event.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrh5jk2/",
      "created": 1728682445,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrh92qj",
      "score": 1,
      "body": "Camera issues, if humans can drive without hearing, robotaxi can do too. \n\n2 seaters, I think most people who take Uber take it alone or couple. It's true there is a need for more seats, cybervan has many seats. \n\nThere might be other reasons for them not to succeed, but your reasons were not it.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrh92qj/",
      "created": 1728683735,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhah1a",
      "score": 1,
      "body": "I sometimes just wander around in my car, looking at changes to neighborhoods,  or new restaurants,  or old haunts.  Can FSD do this, or do you absolutely have to have a destination and it will take you the most direct way ?",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhah1a/",
      "created": 1728684256,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhcpu3",
      "score": 1,
      "body": "Wow some misconceptions and mistruths in here. You really think it's not a 4-5 seater? Yes, vision AI is far better than trying Lidar map everything, repeatedly, and far far cheaper, and exponentially improving on variable conditions, rather than linearly. And it's practically guaranteed it'll have rear seats. Don't be silly.\n\nAlso the business model is people/companies buy them and run them as a car share, and Tesla app becomes the Uber app, to avoid all the taxi regulation crap, just like Uber/Lyft, and of course, those private owners maintain and run the vehicles. Tesla making money as their cut, and by the sale of the car.\n\nWhat else are people misunderstanding to think it's bad? Oh right, can Tesla scale making these cars and Waymo is way ahead. How many cars can Waymo/Google make? They're slow and buggy. Tesla is a global manufacturing powerhouse, get real.\n\nElon may have gone off the right side rocker, but this remains a solid business plan and implementation, with FSD looking more and more solid every week, backed by a vehicle manufacturing juggernaut that has out-vehicled literally the world in just a decade. Waymo, etc. doesn't stand a chance.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhcpu3/",
      "created": 1728685119,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhdrpx",
      "score": 1,
      "body": "The biggest issue is this;\n\nIf all currently produced SEXY cars can do unsupervised FSD in the future they are all essentially cybertaxis. There are technically millions of these cyber taxes in owners hands right now.\n\nThis event was just a cringe FSD event. FSD is old , broken and a promise of 2016.\n\nThis product is gimped and redundant ( robo taxi )\n\nEven if it comes out tomorrow, at 30k, and works 100% as they promised it's STILL useless.\n\nWhy would I just not buy a 3 or Y? It does THE SAME THING but not gimped by 2 seats and zero control.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhdrpx/",
      "created": 1728685523,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrher5o",
      "score": 1,
      "body": "It just looks like another Tesla model. Somebody, obviously not the rapidly ageing Elon, will start with a London Cab body, or something equally vastly more efficient and all ready off the shelf and convert it to electric self-driving and win this war.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrher5o/",
      "created": 1728685906,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhfjhx",
      "score": 1,
      "body": "The way bigger problem is that Tesla’s self driving tech isn’t good enough. The capacity of the vehicles doesn’t matter.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhfjhx/",
      "created": 1728686215,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhhbwu",
      "score": 1,
      "body": "I have some basic questions:\n- The cybercab door opens too wide. It could easily hit some thing next to it. Why not just have it open vertically like some of the mclarens.\n- The RoboVan (elons pronunciation made it Robo1) is fit for bumpy roads? Or even speed breakers?\n\nedit: I’ve worked for a ride hailing company before and I’m not even going to touch the legislative and legal parts ☠️",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhhbwu/",
      "created": 1728686911,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhi9gs",
      "score": 1,
      "body": "Counterpoint:\n\n1) Close to 90% if taxi use is two or fewer passengers. In many cities, taxis are required to put the passengers in the rear seats and not the front. 2 seats is pretty normal in the industry. \n\n2) Most cars use a transponder system to detect emergency vehicles. My Toyota pickup tells me there’s a an emergency vehicle approaching over a mile out. It has no autonomous driving capabilities, but it knows the direction, lane and arrival time of the police/fire/ambulance.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhi9gs/",
      "created": 1728687279,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhis6t",
      "score": 1,
      "body": "The seats should not be a problem I think because if I remember he said the other models of tesla from current owners will also be used as taxis I guess those will be assigned to people who need room for more than 2. \n\nBut good point I didnt even think about that when I saw the taxi",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhis6t/",
      "created": 1728687485,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhiv68",
      "score": 1,
      "body": "The future is childfree it seems",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhiv68/",
      "created": 1728687519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhmmho",
      "score": 1,
      "body": "This whole thing feels driven by Elon's personal hatred for commuter rail than any realistic financial outlook.\n\nThe concept is being sold on its ability to reduce traffic, which only works if someone finds taking a taxi cheaper than owning a car, which is unlikely, and being better than trains because there are less people around you, an \"advantage\" which directly inflames traffic. They have no solution to actually getting you to your destination faster\n\n\"You think trains are full of stinky homeless people and you want your personal space. We can alleviate the tedium of travel by, uhhhhhh, letting you read a book while you sit in LA traffic for 3 hours\"",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhmmho/",
      "created": 1728689016,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhn7t6",
      "score": 1,
      "body": "The average car occupancy is below 2 so just from a statistical standpoint it makes sense to have a two seater.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhn7t6/",
      "created": 1728689257,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhneuo",
      "score": 1,
      "body": "Really? Because I'm using it",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhneuo/",
      "created": 1728689335,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhp08q",
      "score": 1,
      "body": "It’s not shipping by 2027 with fsd.  That’s just fantasy land.  Mr Musk has never shipped a Tesla product in anywhere approaching the timeframes promised.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhp08q/",
      "created": 1728689987,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhq22x",
      "score": 1,
      "body": "I was not impressed at all. Seemed like a thought thrown together without working the angles. I don’t see it competing in the market. Much like his robots, it’s a ridiculously rich-man concept. Only two seats? Hire 2 cars, 3 cars, more cars… I don’t see any cab or taxi service taking the business or insurance risk on this robo-taxi when Tesla’s autonomous driving couldn’t stay on the market.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhq22x/",
      "created": 1728690418,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhrfkt",
      "score": 1,
      "body": "They are using the model Y body as a 4/5 seater robotaxi",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhrfkt/",
      "created": 1728690982,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhsqax",
      "score": 1,
      "body": "There was also the robovan or w.e it's called, same idea as robotaxi (2 seater) except it's like a 20 seater... so... ",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhsqax/",
      "created": 1728691517,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrhth0t",
      "score": 1,
      "body": "1) Most taxi rides are 1-2 people.  So the CyberCab will be perfect.  If you are a group of 4 you just enter that in the app and they'll send a Model 3 or Model Y, which there will also be plenty of those.  This isn't rocket science.\n\n\n2) You don't need to hear sirens when you have cameras facing 360°.  We only have sirens because humans don't have eyes in the back of their heads.  But yes, whether vision-only will work is an unknown.  But trust me, it has nothing to do with sirens.  \n\n\n3) What's the issue with cost?  Estimated to cost between 20-50 cents per mile to operate.  Compare that to Ubers $1.00 per mile cost.  And let's not even get into Waymos cost.  They won't even discuss that, but the cars cost about $150k (vs. $30k for CyberCab) and Waymo has to pay the salaries of all the remote operators.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrhth0t/",
      "created": 1728691826,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lri001y",
      "score": 1,
      "body": "The thing I could see being adopted fairly quickly out of everything they showed was the bus/van. I don't think these will take over as city bus options in the near future. But I could see private entities purchasing and using them. For instance, I could see airports getting rid of their shuttle busses that just drive the same exact route over and over again and replacing them with these. Or possibly later on, bars that run shuttles to games or end of night drop off service incorporated into the whole going out experience allowing the bar to make money on you coming, staying, and leaving.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lri001y/",
      "created": 1728694519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lri2fpx",
      "score": 1,
      "body": "You realize all their cars will be autonomous right? You’ll be able to haul the taxi design, say, to get to a business meeting. Or you’ll be able to hail a Y to pick you and all your shit up from the airport. This post misses the mark…",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lri2fpx/",
      "created": 1728695555,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lri49un",
      "score": 1,
      "body": "Can people sit in the front seats too if there is no driver? \n\nThat would be 3 to 4 seats per car.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lri49un/",
      "created": 1728696342,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lri4qcf",
      "score": 1,
      "body": "More than 80% of taxi trips are 2 people or less.  Seems like a great way to target a market.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lri4qcf/",
      "created": 1728696538,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lri6cvq",
      "score": 1,
      "body": "Most rides just need two seats. You can get more rides for more people too. Remember, today the driver uses one seat out of the four.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lri6cvq/",
      "created": 1728697243,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lria6c6",
      "score": 1,
      "body": "A crappy solution in search of a problem. ",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lria6c6/",
      "created": 1728698882,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lriadvi",
      "score": 1,
      "body": "Just from a little bit of googling around it seems like ride share drivers estimate a majority of their fairs are single people, from 70-90% depending on time of day.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lriadvi/",
      "created": 1728698974,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrik9dn",
      "score": 1,
      "body": "What’s wrong with 2 seats? 80% of taxi rides are for 2 passengers or less. \n\nThey probably ran the economics and figured the cost of doubling the number of seats for 20% of rides wasn’t worth it. \n\nOther than that, agree with you that it was underwhelming.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrik9dn/",
      "created": 1728703385,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrikbr5",
      "score": 1,
      "body": "I’m buying the party bus for going to work.  Gonna be so drunk.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrikbr5/",
      "created": 1728703417,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrin5zu",
      "score": 1,
      "body": "You do get that they already have multiple 5 seater vehicles capable of being taxis, right?",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrin5zu/",
      "created": 1728704803,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrio5cj",
      "score": 1,
      "body": "Dude by the time this comes out it could have 4 seats and look different with the way they operate.\nOne thing I know is autonomy is coming for everything and Tesla is in the fight for it, stellantis and others not so much.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrio5cj/",
      "created": 1728705298,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrir7o7",
      "score": 1,
      "body": "I drove a yellow cab in LA for a few years, a two seater cab doesn’t make any sense. It was quite common to pick up groups of three or four people, or for two people to have more luggage and would fit in the large trunk of a Gen 2 hatchback Prius. This todo seater not be suited for airport jobs. \n\nCleanliness is also going to be an issue. I had to look in the back of the cab after every job because people are gross. It was quite common for people to leave garbage back there, and more than a few puked or peed in the car over the years. \n\nRange is also an issue. When people sat down in my cab, they might be going 2 miles or 200 miles and they didn’t expect me to have to stop for gas. Customers are not going to be happy if they have to wait for an available taxi that has enough charge to get them where they’re going. \n\nTesla vehicles rely on cameras and those cameras don’t work well on country roads let alone dirt or gravel roads. Many times a job took me down a primitive road and something tells me full self driving isn’t going to do well when there’s no lane lines, reflectors, or guard rails. ",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrir7o7/",
      "created": 1728706906,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrivh4w",
      "score": 1,
      "body": "Okay I've been annoyed with Tesla for some time but come on....\n\nI am sure someone ran the numbers on your average taxi ride being less than 2 people. If the price is low enough....just order 2. If you need 3 switch to the van. This is clearly more efficient then support 3-4 people with every vehicle they put out when most rides are 2 people or less. Also don't forget the model 3 and y still exist. \n\nSecondly I am not a fan of camera only but they can easily pick up on sirens and have been doing so for 2 years.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrivh4w/",
      "created": 1728709262,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrj3e33",
      "score": 1,
      "body": "You know you could order a second cab lol",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrj3e33/",
      "created": 1728714124,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrj54y7",
      "score": 1,
      "body": "if cars were all automated, how would the police pull anybody over under fake pretenses to catch criminals (and \"criminals\")? What would happen to the traffic infractions!?\n\nI'm not saying I agree with it WHATSOEVER, but automated transport would remove a significant revenue source for city governments, and unless Americans get real cool about a lot of taxes real fast, I shudder to think how the gap would be filled\n\nI personally think Tesla's implementation specifically is gonna end up collecting dust in a tunnel under Vegas somewhere, but a sea change of some kind may be on the horizon and I'm concerned it will take us \\*further\\* from our transportation dreams (the foundation of a true utopia)",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrj54y7/",
      "created": 1728715293,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrjdors",
      "score": 1,
      "body": "first, he said multiple times that in this cab service there will be Robocab as well as Model 3/Ys and this minibus.  \n  \nThey already make great 4-seater, why make another one, when 95% of rides are 1-2 people? When you actually need more, you’ll pick Model Y to come to get you and pay slightly more.  \n  \nSo I don’t see why would they like to have another four seater in their lineup when they already have five different models. Two seater is to make those 95% of rides cheaper.  \n  \nAs far as sound goes, that is ridiculously easy to add, even including software. That’s like students project for few days.  \n  \nWhat is ridiculous is the lack of plan to go from 100 miles between interventions to 10 million miles between interventions.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrjdors/",
      "created": 1728721299,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrjnsod",
      "score": 1,
      "body": "I get where you’re coming from about only two seats, but consider that a conventional taxi has only two passenger seats. Ride share you might have three if the driver is comfortable with having a passenger drive shotgun.\n\nTwo seems like enough, they’ve got the big one for a group",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrjnsod/",
      "created": 1728728528,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrju8i9",
      "score": 1,
      "body": "The US road system simply was never suited for this in the first place, robotaxis is trying to build something on top of something that doesn't work in the first place. Normal drivers and cars are already stuck in traffic thanks to the awful and inconsistent road designs.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrju8i9/",
      "created": 1728732519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrkmbpz",
      "score": 1,
      "body": "Most urban rides are 1 or 2 passengers - 70% according to this study\n\nhttps://cms.uitp.org/wp/wp-content/uploads/2020/11/Statistics-Brief-TAxi-Benchmarking_NOV2020-web.pdf",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrkmbpz/",
      "created": 1728744465,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrkrg9f",
      "score": 1,
      "body": "What if some vagrant shits into the car??? \n\nLook all installations in the public (subways, benches,...) - they all have to be designed like the toilets of a maximum security prison because they have to match the behaviour of their most anti-social userbase.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrkrg9f/",
      "created": 1728746250,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrl8k9l",
      "score": 1,
      "body": "Some people want private transportation and that’s why they take taxis or Ubers. There is still a demand for that even if public transport gets better.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrl8k9l/",
      "created": 1728752077,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrlagxk",
      "score": 1,
      "body": "Such a massive rant to basically say you hate Musk and Tesla. Go another direction then. Millions of people have decided that they enjoy all their innovations. Plenty of happy Model Y owners, Model 3 owners, starlink users, Tesla charger users, space x / Tesla employees, etc.\n\nDon’t like it? Don’t buy it. The market will once again answer.\n\nJumping on a hateful bandwagon makes you look naive and plain stupid.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrlagxk/",
      "created": 1728752705,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrm5pdq",
      "score": 1,
      "body": "The car design set aside, the unions and regulations alone will make it a nearly impossible for this to succeed in the near future. \n\nMaybe the next generation can pull this off, but right now the current establishment  is going to totally be against this",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrm5pdq/",
      "created": 1728763111,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrmhv27",
      "score": 1,
      "body": "I to agree with yours “First off this thing has two seats, that alone is such a dumb design decision.” But coming from Mr. Musk most of the things he says and does are nothing but dumb things. The issue in my mind is;  why is he still revered as a genius?  That it is beyond my comprehension.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrmhv27/",
      "created": 1728767367,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrmn5ej",
      "score": 1,
      "body": "So without diving too deep into matters where really none of us are experts, I think people are forgetting just how insanely successful Tesla has been historically.\n\nTesla sped up the normalization of electric cars by an order of magnitude, and back when Tesla was the first there were plenty of people saying that it was ridiculous and they’d never deliver anything worthwhile. \n\nPeople on Reddit seem to really hate Musk, but it’s undeniable that his companies all sit on the cutting edge. SpaceX for example is pretty clearly the frontrunner in all things space related globally, and Tesla is still by far the largest electric car manufacturer. \n\nMusk’s willingness to push boundaries has paid off in the past, and will continue to do so. Remember that people claimed Tesla was overvalued back in 2020 when it was at $90 a share.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrmn5ej/",
      "created": 1728769297,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrmov3r",
      "score": 1,
      "body": "Turns out a bunch of rich assholes just try to design cities and vehicles for other assholes while really not understanding what the common folk can afford or need.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrmov3r/",
      "created": 1728769933,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrn6ztg",
      "score": 1,
      "body": "Almost all taxi trips are less than 3 people.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrn6ztg/",
      "created": 1728776925,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrni9az",
      "score": 1,
      "body": "First off this thing has two seats  \nseats can be added easily, it is not a valid point",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrni9az/",
      "created": 1728781373,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrnk7ac",
      "score": 1,
      "body": "1) two seats means less weight and less of a mess and quicker to clean up. This will have revenue capabilities for the owner.\n\nMy favorite thing from Tesla is not the cars. It is the cybertruck's windshield wiper. That thing is huge.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrnk7ac/",
      "created": 1728782166,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrnttgt",
      "score": 1,
      "body": "They sold FSD software for ~ 15k at one point and now saying there will be fully autonomous car for $30k 🤔",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrnttgt/",
      "created": 1728786121,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrom0qv",
      "score": 1,
      "body": "You sound like you are incapable of understanding the worlds wants and needs beyond your own.\n\nAlso too many assumptions.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrom0qv/",
      "created": 1728800196,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lropux8",
      "score": 1,
      "body": "This is likely to get downvoted heavily.\n\nBut I actually do not think Tesla is serious about a robot taxi service.   I have not seen any investment specifically for such a service beyond the event.\n\nThe cars are really for selling at some point in the future like they now have the S, X, 3, Y and Cybertruck.\n\nIf they were serious about a robot taxi service they would be investing into getting permits, starting a trial, etc.\n\nAll we have so far is them driving around in a very controlled environment without a driver.   Everywhere else they have a driver as is required with FSD.\n\nGoogle also did a show like what Tesla did.  But the difference is that Google did it just coming up on 10 years ago.  It was done in early 2015.   So basically a decade earlier.\n\nBut also Google did their actually on public roads.  Not a movie set.  So a much more impressive demo.\n\nThe problem for Tesla is that actually rolling out a robot taxi service would take massive investment.   You need all kinds of infrastructure to support.\n\nSo if there was not Waymo then that would probably not be a difficult decision.\n\nBut there is Waymo.  Who has now implemented successfully in three cities and are adding 2 more, Austin and Atlanta.    \n\nIt will be very difficult for Tesla to now compete.    It would even be if Tesla was ready to start trials today.\n\nBut we are now talking years away for them to do the car.   There is so much going against the second mover in this space.\n\nThere is a significant and natural regulatory capture aspect.   Whoever comes after Waymo is going to have a very difficult time not getting into hot water with the permit granters.\n\nBecause you are constantly going to get compared to Waymo who has just run a very clean operation.\n\nAnyone new is going to have some trouble and when compared to Waymo they are not going to fare well.  Pun intended.\n\nThe other aspect is that Waymo will have all kinds of loyalty programs already in place.\n\nSo things like you get the Diamond status level and you go to the front of the line when waiting for cars and you get the better cars.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lropux8/",
      "created": 1728802696,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrpy7uf",
      "score": 1,
      "body": "What youre not taking into consideration which is becoming a growing problem in california and perhaps the united states is insurance and taxes as added cost to vehicle ownership. Insuring an 17 year old is like 6000-8000 a year. On top of that buying a car and maintenance.. at that point most families would rather just have their child uber/cyber cab. \n\nI personally pay 400 dollars for insuring 2 cars. Its getting ridiculous out here.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrpy7uf/",
      "created": 1728828336,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrq8j6s",
      "score": 1,
      "body": "What people  think of this is clear - the stock was down 7% after the event. And likely has more to go.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrq8j6s/",
      "created": 1728831976,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrqdwn7",
      "score": 1,
      "body": "Not to mention older people who can’t drive and need a ride .  No fn way is my mom with a bad hip is  getting  into this little rat-hole .  Along with most of the us population who’s so obese they can’t squat or squeeze into a seat like that .  It might work in Japan or China , not here .",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrqdwn7/",
      "created": 1728833803,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrqj6n8",
      "score": 1,
      "body": "A lot of overthinking. People need cheap transportation. That's it. Tesla needs to get the cost down as much as possible, hence the design they went with. Does it serve everyone? No. But for someone that needs to get to work it will do just fine. They showed a van prototype so they are working on a solution for more passengers.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrqj6n8/",
      "created": 1728835509,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrrxfas",
      "score": 1,
      "body": "What if this is a production sled for the roadster to get volume up and shake out the worms for the halo product",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrrxfas/",
      "created": 1728851655,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrspf9f",
      "score": 1,
      "body": "Statistically the average number of people taking a taxi is 1.5 so 2 seats does make sense for the majority of journeys.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrspf9f/",
      "created": 1728861502,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrzyem2",
      "score": 1,
      "body": "Without seeing the demo, I assumed that it would be smoke and mirrors with little substance. Am I right? In my area, one Tesla drove into a white semi trailer, killing the driver. Several years later an elderly couple drove under a parked tractor trailer from the rear as they got off I-75 and enterer a rest area. The crash stuffed the car under the trailer killing the couple. Rapid unscheduled disassembly of the car and occupants, apparently. Since Musk and X have been promoting many GOP related campaign lies, I just can't take the man seriously enough to be interested in using his products. So, gee whiz, I guess I won't be going to Mars any time soon, or smashing any Tesla pickup truck windows or taking a Tesla cab ride either.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/lrzyem2/",
      "created": 1728971221,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls0t8t3",
      "score": 1,
      "body": "OP has keen observations & makes some interesting points about market viability. My concerns are personal. I've made a lot of money on TSLA stock but now moved my portion of portfolio from to other investments. I just cannot accept riding with Elon as he supports such a bad businessman for the W.H.",
      "permalink": "/r/stocks/comments/1g1e9q0/tesla_is_completely_out_of_touch_with_needs_of/ls0t8t3/",
      "created": 1728991461,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The post criticizes Tesla's two-seater Robotaxi for being impractical for ride service needs.",
    "companies": [
      "Tesla",
      "Uber",
      "Waymo"
    ],
    "tickers": [
      "TSLA",
      "UBER",
      "GOOGL"
    ],
    "main_ticker": [
      "TSLA"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Criticism of Tesla's new two-seater robo taxi, questioning its practicality and market fit.",
    "stock_recommendations": "The post does not contain any buy or sell recommendations for Tesla stock.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "There is a negative sentiment as the author criticizes Tesla's robo taxi concept and questions its market viability.",
    "sentiment": "negative"
  }
}