{
  "title": "$STLA is literally sinking...until new CEO",
  "score": 264,
  "selftext": "TLDR: Stellantis -60% in one year, dividend at risk, failing to meet 2025 targets, Tavares on the verge of being fired/early retirement, the stock could be a good buy until  the CEO changes.\n\nAfter the merger of Peugeot and FCA, Stellantis positioned itself as one of the leading European automotive companies.\n\nThe current European automotive market is characterized by complex dynamics, particularly due to the transition to electric vehicles (EVs) and the stringent European Union regulations on emissions. European policy sets ambitious targets for reducing CO2 emissions, with a shift to low- or zero-emission vehicles by 2035. This has led to a rapid expansion of electric vehicle production, but sales are not growing as fast, due to high prices and a lack of charging infrastructure.\n\nStellantis, under the leadership of Carlos Tavares (current CEO), has tried to adapt to these challenges, while remaining one of the leading companies in the European market with a share of about 18%. However, the group's dealers have expressed concern about the inability to meet European targets on time, as electric vehicle sales are not taking off as expected, even recording significant declines in 2024. The internal tension between corporate leadership and the sales network has led to disagreements, with dealers requesting a postponement of the targets to 2027 (reducing CO2 emissions of new vehicles to below 95g/km), while Tavares remains firmly opposed to any extension, emphasizing that Stellantis is ready to meet the regulations.\n\nOn the financial side, Stellantis' stock has experienced fluctuations, partly influenced by uncertainties in the EV market and the underwhelming financial results of 2024. Net profit in the first half of the year dropped by 48%, reflecting challenges posed by stagnant demand and a competitive market.\n\nThe stock currently trades at around €11 (Euronext Paris), but it is also listed on the NYSE. We are nearly -60% since the start of the year.\n\nAll of this has led to unfortunate statements from the CEO, who hints at a probable early retirement. The company is already searching for a new CEO—he mentions 2026, but rumors suggest he could leave much sooner, due to the poor results during his tenure. Additionally, there is talk of a \"dividend issue,\" introduced post-merger but now at risk.\n\nMeanwhile, the Chinese company BYD is doing everything it can to expand in Europe, with extremely competitive costs (though there are still infrastructure shortages for charging).\n\nToday, a complaint was filed in the Italian parliament against Stellantis, to which Tavares responded. The core issue is the incentives from the Italian government for the purchase of electric cars (which cost 40% more than those of competitors) that Tavares is demanding, while the Italian government demands that Stellantis honor the agreement that included the construction of a gigafactory in Termoli. It’s a catch-22, where each party wants the other to put something on the table, but neither is willing to budge.\n\nFor me, it could become an attractive buy around €6/7. Thoughts?\n\nDisclaimer: I have 2 put contracts at 11$ strike expiring in December. Planning to buy shares as soon as the get very low and before new CEO announcement.",
  "link_flair_text": "DD",
  "id": "1g1y8mh",
  "num_comments": 223,
  "created_utc": 1728733207,
  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/",
  "comments": [
    {
      "id": "lrjvicp",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 7 months ago\n**Total Comments** | 30 | **Previous Best DD** | \n**Account Age** | 7 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrjvicp/",
      "created": 1728733222,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrk35uj",
      "score": 258,
      "body": "Stellantis is a terrible, terrible company, and its problems run much deeper than just the CEO. Their issue isn't that they aren't on path to meet EV targets, it's that they fundamentally cannot design a good product anymore, from any of their sub-brands. If you think a new CEO can turn the whole ship around, then I guess buy the dip. I'm not convinced and won't be touching this one.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk35uj/",
      "created": 1728736951,
      "depth": 0,
      "replies": [
        {
          "id": "lrkdcxi",
          "score": 75,
          "body": "Spot on. Absolute dumpster fire company with dumpster fire products.",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkdcxi/",
          "created": 1728741174,
          "depth": 1,
          "replies": [
            {
              "id": "lrl3hp4",
              "score": 44,
              "body": "Ram, Jeep, and Dodge seemed to be doing just fine until they got carried away with their pricing and then cut production of the Charger, Challenger, and soon to be Durango. If they can just cut free of all the European mess, they should be fine.",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl3hp4/",
              "created": 1728750378,
              "depth": 2,
              "replies": [
                {
                  "id": "lrl75ec",
                  "score": 56,
                  "body": "no joke, a new dodge jeep dealership opened by me,\n\na shit jeep starts at 100k, who pays that for a mid level jeep?",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl75ec/",
                  "created": 1728751611,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrle69m",
                      "score": 17,
                      "body": "Jesus christ, where are you that they're $100k? Place down the street from me has finally gotten some sense and started marking shit down. I see four door Wrangler Sports for $45k now that they've knocked 10k off",
                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrle69m/",
                      "created": 1728753913,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrlel2a",
                          "score": 21,
                          "body": "the grand wagoner is “$118k” msrp,\n\ni see the charokee for $50k, who buys these at that price?",
                          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlel2a/",
                          "created": 1728754045,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrlmndo",
                              "score": 8,
                              "body": "the shitoneer is a puzzle \n\nwe should interview the few owners",
                              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlmndo/",
                              "created": 1728756684,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lrm344l",
                              "score": 9,
                              "body": "At my former job, my boss was obsessed with buying Grand Cherokees for company cars and they were giant pieces of shit. The first one we bought broke down within like 10 months requiring a full transmission rebuild, and he loved it so much even after breaking down he decided to buy another one, which then also broke in like 6 months lol. Before I left he was contemplating a third one.\n\nThis was pre-pandemic so I don't know if they were quite $50k like they are today, but still. And yeah every New jeep-brand buyer seems regarded as hell.",
                              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrm344l/",
                              "created": 1728762209,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lro96sn",
                                  "score": 9,
                                  "body": "I remember my uncle had a brand new Cherokee in the 90s. He picked my dad and I up to take us for a ride. Turned on the air conditioner and the glove box caught fire.",
                                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lro96sn/",
                                  "created": 1728792980,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lro9w0z",
                                      "score": 4,
                                      "body": "lmfao. That must be the exotic thrilling #jeeplife *you just don't get it, it's a jeep thing!* that Jeep buyers seek",
                                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lro9w0z/",
                                      "created": 1728793327,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lrt029x",
                                          "score": 3,
                                          "body": "My auto shop teacher in HS said if you love working on cars you’re gonna love your jeep",
                                          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrt029x/",
                                          "created": 1728865659,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "lrua1ng",
                                      "score": 1,
                                      "body": "This is actually effen hilarious lol",
                                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrua1ng/",
                                      "created": 1728887854,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lrlpcry",
                  "score": 12,
                  "body": "The fact that those 3 nameplates from Dodge are still all we have to talk about is a problem itself.",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlpcry/",
                  "created": 1728757583,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrlq2r0",
                      "score": 9,
                      "body": "It is. Once they took Ram and split it off, the budget for Dodge was decimated. Right now, they should be in a Ford position and be focusing on trucks and Suvs while keeping one rwd car platform around. \n\nBut nah, we got a Hornet. Dodge folks won't buy it because it's an Alfa Romeo, and people won't buy the Alfa version because it's just a Dodge.",
                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlq2r0/",
                      "created": 1728757823,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lrms9s4",
                      "score": 2,
                      "body": "Realistically they are long overdue to consolidate brands.  It's sort of weird that Jeep / Dodge / Chrysler / Ram are all different companies under the same parent company.  I know Ram was spun off from Dodge a while ago, and I still don't know what the purpose of that was.  They all individually have such limited vehicle line ups, but together have a comprehensive line up with minor redundancy.  Some combination of the four are generally together at dealers in the US anyway.\n\nThe only thing keeping them separate does is maintain brand recognition.  It is dumb to have the Dodge Hornet, the Chrysler Airflow, and the Jeep Compass, or the new Charger platform and the Chrysler 300.\n\nWhy have four separate subsidiaries when you have:\n\nDodge: the economy and performance offerings\n\nChrysler: the luxury and family offerings\n\nJeep: the off road and adventure offerings\n\nRam: the commercial vehicle and utility offerings\n\nThere's a full vehicle line up for the American market there that can rival GM, Honda, and Toyota and surpasses Ford.  Why wouldn't they go for it?",
                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrms9s4/",
                      "created": 1728771236,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lrlmqfx",
                  "score": 4,
                  "body": "I sort of agree... It was a stupid decision spinning off Ram as its own brand in the first place, and their sales have been lackluster for the past several years - always bested by Ford and GM in the pickup segment. And then Dodge just doesn't have that much going for it - the challenger/charger were slowing in sales, so I don't disagree with scrapping them. But now they effectively have no product (nothing anyone really wants anyway). \n\nThen Jeep has its own issues, namely reliability. The electrified platforms are even worse, and I can't imagine they're moving them off lots. But Jeep is still their best brand, and probably the only one that would survive a major collapse.\n\nAnd you (rightly) forgot to mention Chrysler. They have exactly ONE 2024-year model (Pacifica). Pathetic. They need to put the brand out of its misery. \n\nI went to a Dodge/Ram/Chrysler dealership a few months ago to pick up a car (not from a Stelantis brand), and on a Saturday afternoon - in a major metro area, not on a holiday, etc - it was a ghost town.",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlmqfx/",
                  "created": 1728756712,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrm04d4",
              "score": 2,
              "body": "Just look at the hornet who the hell thought it was good idea to sell over engineered Alfa Romeo as a dodge and have it priced more than RAV4, Traverse or CRV while being lot smaller ",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrm04d4/",
              "created": 1728761160,
              "depth": 2,
              "replies": [
                {
                  "id": "lrn0odd",
                  "score": 1,
                  "body": "Pretty sure the Jeep Compass, Dodge Hornet, and Chrysler Airflow are the same chassis.  They need to just pull Jeep, Dodge, Chrysler, and Ram under one structure.  Jeep compass seems like a decent little crossover/small suv.",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrn0odd/",
                  "created": 1728774471,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrqzs40",
              "score": 1,
              "body": "They don't even know how to make a engine ![img](emote|t5_2th52|8883)",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrqzs40/",
              "created": 1728840917,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrl0p7c",
          "score": 14,
          "body": "Can you please describe what makes their car not good? I keep reading generic comments like yours that don't say *why* their products are bad...",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl0p7c/",
          "created": 1728749417,
          "depth": 1,
          "replies": [
            {
              "id": "lrl7go7",
              "score": 9,
              "body": "Because they don’t actually critically understand if their products are bad or not.\n\nMost Stellantis brands known for being total dog shit reliability wise have largely improved, i.e Jeep and Alfa Romeo. As a side note, this isn’t particular to Stellantis, really all US facing car brands have increased reliability across the board. \n\nThis is absolutely something that new leadership can fix. Leadership is everything in the corporate world including perceived market value.",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl7go7/",
              "created": 1728751713,
              "depth": 2,
              "replies": [
                {
                  "id": "lrnrq0g",
                  "score": 6,
                  "body": "It's funny, because typical Chrysler (now Stellantis) buys components that are one generation behind of premium european brands (Mercedes, BMW, Audi, etc). They get cheaper R&D expenditure and the parts come with some reliability data and potential fixes.\n\nThe problem is that their integration is terrible. A lot of bad engineers. About 4-5 years ago they were promoting some sort of engineering rotation, so people that were working on steering wheels moved to driver assistance systems or infotainment systems. A bunch of clueless people - it was a disaster to work with.\n\nOn the contrary, we were selling them an analog rear view camera for 12+ years and they did not ask for any discounts. Our sales people were clapping hands when the same old part was still ordered with 50-60% profits, because Chrysler purchasing people were lazy and just carried-over same numbers without negotiating new contracts.",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrnrq0g/",
                  "created": 1728785261,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrscy85",
                  "score": 1,
                  "body": "Alfa kicks ass",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrscy85/",
                  "created": 1728856911,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrl3feb",
              "score": 16,
              "body": "Poor reliability plagues many of their brands",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl3feb/",
              "created": 1728750356,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrlpnms",
              "score": 2,
              "body": "Outdated, low quality parts and interiors, and poor reliability. It’s like buying a brand new car from the 90’s with an LCD screen grafted onto the console.",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlpnms/",
              "created": 1728757683,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrmepi7",
              "score": 2,
              "body": "Puretech engine breaks after 40k kilometers. It's on all the lower models",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrmepi7/",
              "created": 1728766249,
              "depth": 2,
              "replies": [
                {
                  "id": "lrotc6s",
                  "score": 1,
                  "body": "Mine is 100k and is still good 👍 \n\nSo… it depends.",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrotc6s/",
                  "created": 1728805056,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrp7plp",
                      "score": 2,
                      "body": "Sir, this engine is a casino",
                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrp7plp/",
                      "created": 1728815052,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ls53c7j",
              "score": 1,
              "body": "They continued to install the Hemi 5.7 for years with a known cam/lifter/lubricating issue. 2013 RAM 105,000 my engine went out due to it. 12K to fix. The thing is, it was a known issue for a few years. Not sure why there was not a recall. I will never buy another vehicle from them nor the asshole Lithia dealerships that think it is a good thing because they can make even more money. I have a friend that works at Lithia and he said their service department laughs about it.",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/ls53c7j/",
              "created": 1729045434,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrlmokl",
              "score": 1,
              "body": "Go watch a review on the Hornet and then watch a review on the EV6. \n\nNow, 15 years ago Kia was putting out stuff like the Boreggo and still had no idea how to operate within the North American market. Fast forward to today and it seems like Kia has totally stolen “cheap speed” from Dodge and completed an almost complete 180 from where they were 15 years ago. The EV6 GT would blow the doors off anything made by Chrysler, Jeep, or Dodge and its overall fit and finish is better than anything within the lineup of any of those brands. \n\nContrast this with Dodge, who was still using Mercedes assemblies and tech on their Charger and Challenger lineup up until cancellation. Mercedes hasn’t been a part of Dodge since like 2008! Seems like they are big on cost savings and a “if it ain’t broke don’t fix” mentality. I would rather invest in an automaker who is willing to push some boundaries and innovate. \n\nThey employ cost cutting like almost no other automaker and honestly I don’t feel like that cost cutting gets passed down to the end consumer very well. Dodge customers seem to get a large displacement engine packaged in the absolute minimum plastic casing required to pass safety legislation in North America. If you don’t give a shit about longevity or cost of ownership and all you care about is the biweekly payment then it’s the perfect place to look for a new car I suppose.",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlmokl/",
              "created": 1728756695,
              "depth": 2,
              "replies": [
                {
                  "id": "lrlpg0g",
                  "score": 3,
                  "body": "Mercedes being part of dodge is an insult. Mercedes boughr chrysler. Biggest mistake ever.",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlpg0g/",
                  "created": 1728757613,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrlw7m6",
                      "score": 2,
                      "body": "Post 2020 Mercedes build quality, including fit and finish? May be on an even lower level than Stellanis cars. Mercedes has in my opinion some of the worst build quality out there and charges insane premiums for their cars.",
                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlw7m6/",
                      "created": 1728759855,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrp5fdz",
                          "score": 1,
                          "body": "Perhaps although the last cars I sat in were perfectly fine and had great design. People love to complain about Mercedes built quality because it had this immaculate image. And well now it's not that. Hard to keep that with 2 million cars either. I think the reason Americans don't buy Mercedes is more because they don't really care about what the car really still does well. A great design and great tech. And Americans are a bit more like Chinese people in that they prefer size price and options. Also a big problem of German cars US reliability is absolutely shit local mechanics. They just don't have the economies of scale to support a large number of good technicians like the Japanese manufacturers have. Worldwide Mercedes does well. \n\nNow that being said the new electric high end lineup was an absolute disaster. You should never make a dude with consultant hair ceo. I miss zetsche he was an engineer. But we have been there before. Schremp was even worse.",
                          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrp5fdz/",
                          "created": 1728813472,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lrlznng",
          "score": 9,
          "body": "They tried to pivot Jeep into luxury brand like Land Rover (atleast they got quality part down) and in mean time tried to sell overpriced over engineered Alfa Romeo suv as Dodge hornet. Which cost more than a RAV4 while being lot smaller and lot lot less reliable 🤦‍♂️.\n\nThe genius who is behind all these decisions was CEO who is still not fired.\n\nFun fact he has never driven a Fiat or Chrysler product car in his life and drives around a Benz… ",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlznng/",
          "created": 1728761006,
          "depth": 1,
          "replies": [
            {
              "id": "lro604l",
              "score": 1,
              "body": "Isn't over engineered a good thing?",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lro604l/",
              "created": 1728791449,
              "depth": 2,
              "replies": [
                {
                  "id": "lrpgkr1",
                  "score": 2,
                  "body": "Not necessarily if you're quality sucks. In this case it's complicated hybrid system doesn't give much of a performance or mpg boost but causes a slew of issues (hornet is worst vehicle in terms of reliability) and adds to the cost. ",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrpgkr1/",
                  "created": 1728820505,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lroh02x",
          "score": 4,
          "body": "Especially in Europe where firing people is near impossible, so it’s not just turning the company around but turning the company around while keeping all the employees that have been fucking it up for the last decade or two",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lroh02x/",
          "created": 1728797155,
          "depth": 1,
          "replies": [
            {
              "id": "lroq3je",
              "score": 2,
              "body": "If all employees fuck up it is because upper management makes them. Time pressure, incorrect priorities, lack of focus on quality are not something employees like, but get forced upon.",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lroq3je/",
              "created": 1728802854,
              "depth": 2,
              "replies": [
                {
                  "id": "lrp69dl",
                  "score": 2,
                  "body": "You know that the probably 10k or so middle and senior managers are also employees - right?",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrp69dl/",
                  "created": 1728814053,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lrki0v8",
          "score": 10,
          "body": "A singular CEO cannot turn around a car company that makes shit cars. There’s nothing they can do except say “hey guys, make better cars”. If it was a strategy problem, or financial problem, pricing problem, etc a CEO can help. When the problem is your product is actually shit, a CEO has zero impact on that.",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrki0v8/",
          "created": 1728742927,
          "depth": 1,
          "replies": [
            {
              "id": "lrl3m7k",
              "score": 7,
              "body": "What? lol he can hire different engineers and designers that’s also part of his job",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl3m7k/",
              "created": 1728750422,
              "depth": 2,
              "replies": [
                {
                  "id": "lrl4pp1",
                  "score": 2,
                  "body": "Hire different engineers and then tell the different engineers to make a car that’s not shit. Same thing he’d do with the current engineers. It’s ultimately not in his control whether the engineering team makes shit products or not. Completely dependent on that org.",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl4pp1/",
                  "created": 1728750796,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrl6yp2",
                      "score": 2,
                      "body": "That’s true of all companies/products though it’s still the CEO’s job…like that’s literally the job to take responsibility for everything going on and to delegate to people who can solve those problems",
                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl6yp2/",
                      "created": 1728751548,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lrnfcxf",
              "score": 2,
              "body": "A singular CEO who wants more than his bonus can definitely do that. The downside is that he might get in trouble with the board if his vision doesn't play out, because change is difficult and expensive. So when a product is shit is because the strategy is either bad or it's only written on the wall but nobody cares about it.",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrnfcxf/",
              "created": 1728780204,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrl7s40",
              "score": 1,
              "body": "You don’t think a new CEO could bring in new lieutenants?\n\nWhat do you think a CEO does, exactly?",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl7s40/",
              "created": 1728751818,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrkvu7b",
          "score": 4,
          "body": "Maybe they won't need a CEO after 2026?",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkvu7b/",
          "created": 1728747754,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrjwlt7",
      "score": 268,
      "body": "Cursed letters in any configuration ",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrjwlt7/",
      "created": 1728733804,
      "depth": 0,
      "replies": [
        {
          "id": "lrkc65h",
          "score": 32,
          "body": "$LAST is going to be the last one to follow this trend",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkc65h/",
          "created": 1728740707,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrkndxo",
          "score": 33,
          "body": "At first I thought there was a typo in the ticker",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkndxo/",
          "created": 1728744835,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrl0cec",
          "score": 24,
          "body": "Lol true, read it as Tesla and that it needs a new CEO which is probably true as well.",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl0cec/",
          "created": 1728749295,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrk9sda",
          "score": 24,
          "body": "TSLA sinking too",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk9sda/",
          "created": 1728739751,
          "depth": 1,
          "replies": [
            {
              "id": "lrlappj",
              "score": 15,
              "body": "I'm not going to lie, I legit thought that it was a short Tesla strategy fund at first glance",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlappj/",
              "created": 1728752785,
              "depth": 2,
              "replies": [
                {
                  "id": "lrliqpz",
                  "score": 11,
                  "body": "I read the title thinking it says TSLA and I thought it makes prefect sense",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrliqpz/",
                  "created": 1728755389,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrlj7mi",
                      "score": 4,
                      "body": "I did the same thing. ",
                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlj7mi/",
                      "created": 1728755545,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lrmfd5j",
              "score": 2,
              "body": "also needs new CEO",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrmfd5j/",
              "created": 1728766480,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrk0p7b",
      "score": 122,
      "body": "Car companies are running out of Europeans who aren't clued into \"buy Asian or German\". Everyone who owned a basic European car and bought a Toyota never went back. I look at this stuff and it's no cheaper than a Toyota, and it doesn't score so high for reliability or build quality than a Toyota, so why am I buying it?\n\nIf you just want a good, solid car to get you around, how does any Stellantis car beat a Suzuki, Hyundai, Toyota or Kia? If you want a more luxurious car, what do they have that beats a Mercedes or BMW? They have a few niche vehicles like the Fiat 500 is cute, Alfa Romeos can be beautiful, that little Citroen electric vehicle serves a niche, but what else?",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk0p7b/",
      "created": 1728735809,
      "depth": 0,
      "replies": [
        {
          "id": "lrkanhm",
          "score": 31,
          "body": "Stellantis tried to go up market and found success during the shortages of the pandemic.\n\nThey pushed their average car price above most other sellers, using things like Dodge Rams, Challengers, and Jeep Grand Cherokees to do it.\n\nThe issue is that market is drying up and their dealers are drowning in inventory. They don't have any compelling budget options that move quickly. There is no Rav-4 or  Model Y in their inventory that will sell well against their competitors. \n\nBasically they tried to go premium with a badge that screams low class.",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkanhm/",
          "created": 1728740101,
          "depth": 1,
          "replies": [
            {
              "id": "lrkivk4",
              "score": 28,
              "body": "CNBC did an expose on this. Fucken $130k for a god damn jeep. Thats BMW M and Benz AMG territory. Add to the fact that they are still pricing like its 2021 during the height of covid. The funny thing is theres a new jeep dealership being built in my city too. Its a small farm city in the midwest with only about 50k people, and farmers arent spending $100k on jeeps.",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkivk4/",
              "created": 1728743235,
              "depth": 2,
              "replies": [
                {
                  "id": "lrktyhz",
                  "score": 7,
                  "body": "At least Jeep will always have a model that sells. Too bad their new \"luxury\" 3 row is an unreliable piece of shit. \n\nNo fucking idea what they tried to do with Chrysler.",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrktyhz/",
                  "created": 1728747108,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrl4qg8",
                      "score": 5,
                      "body": "Will it sell though? I loved my 4dr Wrangler, but I bought it for $27k new. I would not pay $55k for one of them. For $55k I'm not willing to make the compromises that a Wrangler demands (uncomfortable for long trips, rough ride, cheap interiors)",
                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl4qg8/",
                      "created": 1728750803,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lrm1lfz",
                      "score": 3,
                      "body": "Wagoneer looks so horrible on the side, how the fuck did they mess it up that badly? Feel like they cheaped out and tried to stretch Grand Cherokee without tweaking the wheel wells or side pillars",
                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrm1lfz/",
                      "created": 1728761682,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lrl4cja",
                      "score": 2,
                      "body": "The Pacifica actually isn’t bad they just need to make it cheaper if they want to compete with sienna/odyssey",
                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl4cja/",
                      "created": 1728750670,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lrnygy3",
                  "score": 2,
                  "body": "I watched it too. Tim Kunescis(sorry if I spelled it wrong) was CEO of Dodge I think and even saw him talking to Jay Leno. He left now. The only thing which can save Dodge is putting a hellcat engine in Pacifica.....",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrnygy3/",
                  "created": 1728788077,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrn3e93",
              "score": 2,
              "body": "The Jeep Compass would be comparable to the RAV4.  And a Cherokee 4xe would be comparable to a Model Y I think.",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrn3e93/",
              "created": 1728775528,
              "depth": 2,
              "replies": [
                {
                  "id": "lrna4te",
                  "score": 1,
                  "body": "Yeah, but how well are they selling?\n\nThey're not a compelling option.",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrna4te/",
                  "created": 1728778154,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrncswy",
                      "score": 2,
                      "body": "Part of Stellantis's problem I think is that their US subsidiaries are all disconnected.  Entry level Compass is cheaper than a RAV4 or a Hornet, but no one is going to think to look to Jeep for a run of the mill crossover.  The company is fighting its self and it's stupid.",
                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrncswy/",
                      "created": 1728779206,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lrk28ov",
          "score": 23,
          "body": "Good point. Seems they are really the uncomfortable average. \n\nAlso alfa romeoes spend more time getting fixed than on the road",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk28ov/",
          "created": 1728736530,
          "depth": 1,
          "replies": [
            {
              "id": "lrk61gr",
              "score": 13,
              "body": "My dad collects alfas, but working on them was his weekend (and now semi retired) passion. He would never let me buy one.\n\n\nThey definitely have a niche market tho, and are fun to drive. When working.",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk61gr/",
              "created": 1728738195,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrk5bx5",
              "score": 16,
              "body": "Alfas are actually much better now. They're about as well built as anything else.",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk5bx5/",
              "created": 1728737893,
              "depth": 2,
              "replies": [
                {
                  "id": "lrkd2tu",
                  "score": 10,
                  "body": "True, but this is the long term reputation they need to deal with that is taking time to budge.",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkd2tu/",
                  "created": 1728741064,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrkdy52",
                      "score": 4,
                      "body": "Yes and a thing with car brands is that reputations take a long time to shift.",
                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkdy52/",
                      "created": 1728741402,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrl4j1t",
                          "score": 3,
                          "body": "And one issue can destroy progress …Hyundai and Kia were making headway but the whole Kia boys phenomenon definitely hurt them",
                          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl4j1t/",
                          "created": 1728750732,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lrkdygw",
                  "score": 2,
                  "body": "Happy to hear because I really like how most of them look. But regarding the market - just as the other reply to your comment says",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkdygw/",
                  "created": 1728741406,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrke8rf",
                      "score": 3,
                      "body": "The Quadrifoglio is an absolute monster of a car.",
                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrke8rf/",
                      "created": 1728741515,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lrk3ucb",
          "score": 15,
          "body": "Also Europeans will drive a car forever. They don't care about having a new car the easy Americans do",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk3ucb/",
          "created": 1728737247,
          "depth": 1,
          "replies": [
            {
              "id": "lrka869",
              "score": 22,
              "body": "Turns out paying 3 car payments ain't ideal if you have good public transport",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrka869/",
              "created": 1728739930,
              "depth": 2,
              "replies": [
                {
                  "id": "lrke27a",
                  "score": 8,
                  "body": "Many Europeans have 0 car payments. My wife's family lives in the Paris suburbs and have old paid off cars.",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrke27a/",
                  "created": 1728741446,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrkvkdw",
                      "score": 11,
                      "body": "From Statista:  \nAverage age of registered car in Europe: 12 years.    \nAverage age of registered car in USA: 12.5 years.\n\nThere are also many Americans with no car payments.\n\nMaybe we're more alike than we think?",
                      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkvkdw/",
                      "created": 1728747658,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrl4nv6",
                          "score": 4,
                          "body": "Euros are just like us but more effeminate",
                          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl4nv6/",
                          "created": 1728750778,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lrlhsu2",
                          "score": 1,
                          "body": "Well shit guess I'm wrong. Probably just my own anecdotal biases I see lots of people with cars they can't afford and houses they can't afford complaining about COL",
                          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlhsu2/",
                          "created": 1728755084,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lrn65w1",
                          "score": 1,
                          "body": "20 years ago the stat was every 4 years for the US I think.  Shifted to every 8 a bit after the Great Recession and marched steadily upward since.  People who think Americans don't own cars for a long time or are wasteful about them don't understand America.",
                          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrn65w1/",
                          "created": 1728776613,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrnadbh",
                              "score": 1,
                              "body": "I don't think the change is quite as dramatic as that.  According to [this website](https://hedgescompany.com/blog/2024/02/average-age-of-cars-trucks/),\n\n>Going back to 1995, the farthest the Bureau of Transportation Statistics (BTS) data goes, the average age was just 8.4 years old.\n\nI think maybe the difference in the statistics we are quoting is because \\*new car buyers\\* are only a subset of the population at large.  It could be true that new car buyers were buying a car every 4 years in 2004 ... but used car buyers kept that car on the road for another 6 years or more.  I.E., it's two different sets of data that are easy to mix up.",
                              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrnadbh/",
                              "created": 1728778248,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lrkibjk",
          "score": 2,
          "body": "TBF, the German cars are shit tier quality. But the people who buy them tend not to care because they aren't keeping the car for more than 5 years.",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkibjk/",
          "created": 1728743036,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrktnvj",
          "score": 1,
          "body": "Alfa Romeo is now dodge.  It was trash before and now it's American trash.",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrktnvj/",
          "created": 1728747007,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrm8207",
          "score": 1,
          "body": "Fiat 500 is full of problems",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrm8207/",
          "created": 1728763929,
          "depth": 1,
          "replies": [
            {
              "id": "lrm9wpp",
              "score": 1,
              "body": "Is it? I don't know that much. But I do know that young women really like them, because they're cute looking, in the same way that Minis are.",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrm9wpp/",
              "created": 1728764571,
              "depth": 2,
              "replies": [
                {
                  "id": "lrmdiv8",
                  "score": 1,
                  "body": "It is full of shit man , search for fiat 500 problems (in french or italian and you will see), don’t Don’t be fooled by appearances . Run away from Peugeot and Fiat and Citroen . These Mf had been manufacturing an engine named Puretech 1.2 L which is found in all their sub brands since 2016 . , especially in Peugeot and Citroen and Fiat. It appears that this motor got a big issue and engine breaks around 40k kilometers with some people at 25k kilometers. It over consume oil and more other defaults. The problem is not that the engine is a nightmare , but that Stellantis kept ignoring the complaints since years and kept selling it . Today that everyone become aware of it thanks to social media , they sell it under new name , but same architecture and few tweaks claiming that they fixed the problem but they did not fix anything and problems still appear and the used car market is flooded with Peugeot in France having this engine. . They deserve it because they didn’t respect their clients and privileged money gain .",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrmdiv8/",
                  "created": 1728765830,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lrkifq6",
          "score": 1,
          "body": ">if you want a more luxurious car, what do they have that beats a Mercedes or BMW? \n\nMaserati and high end alfa romeo. Old school Maserati is anything mercedes and bmw are trying to be, just better.  \nHowever, stellantis bought the brand and, obsessed with margins, started skimping on quality and now its even less reliable than a BMW, but maintenance costs 2x more. But they can turn it around eventually, the brand is there, because the obsession for mercedes and bmw to portrait themself as luxury brands is equally a failure, imho, so its not like they are gonna go anywhere in the meantime.\n\n>If you just want a good, solid car to get you around, how does any Stellantis car beat a Suzuki, Hyundai, Toyota or Kia?\n\nSwagger. They used to have the swagger, some of these brands. Toyota has always been the most solid and reliable brand of the world, but their lineup is just hideous, and they are boring as fuck. People preferred a slightly less reliable car but prettier like peugeot or opel, or funnier to drive like abarth. But now these brands are hugely less reliable than toyota and also have a considerably bigger price, so thats a no brainer to buy a toyota.\n\nThe good? 1. they are heavily subsized by the italian government: tensions are heavy between the two, but doesnt look like the government can do much cause they employ a sizeable part of the population that just cannot be put out of job, and the government has a lot of interest in stellantis turning it around so they can stop having to throw money at them. 2. They have a huge cash flow and cash reserve, they are trading close to book value, and some weeks ago when rumors surfaced that tavares was gonna get fired it jumped like 7%, so the market is reactive on it and understands the stock is undervalued. Basically they can do whatever the fuck they want to turn this ship, they just need guidance from a competent board, and protection from chinese takeovers of the market (which the eu is already doing).\n\nI think overall its a good buy. but i dunno if its gonna drill further. Its an instant buy at 9 euros, but even this price might be ok.\n\nNot investment advice.",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkifq6/",
          "created": 1728743076,
          "depth": 1,
          "replies": [
            {
              "id": "lrku93f",
              "score": 8,
              "body": "Former Maserati Owner.  Those things drop faster than the account of a new 0DTE WSB trader.  Maserati's sound cool and they're reasonable to drive but $600 oil changes and the always pending $20k fix is enough to say no thanks.  Now that the Ghibli isn't even the Ferrari powerplant those are worse than ever.  I'm seeing my dealer with new 2023s and they're about half off for new cars.",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrku93f/",
              "created": 1728747209,
              "depth": 2,
              "replies": [
                {
                  "id": "lrkuwuu",
                  "score": 2,
                  "body": "yes, thats why they dont sell. But it wasnt this way some years ago, where maserati was the only affordable true luxury brand (ghibli used to have a ferrari engine + interns, and mrsp’ed at only 75k!! like in 2015 or so you could get a new ghibly for 50k euros, you barely get a mid mercedes for that price now). \n\nThere are LOADS of older maserati in italy and in europe, i see one pretty much everyday. Not many new ones tho.",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkuwuu/",
                  "created": 1728747435,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrkpmwy",
              "score": 1,
              "body": "Thanks. Some good points there.\n\nYou're right that they probably could make Alfa and Maserati bigger successes. The cars are lovely. But I see like zero marketing around them.\n\nAlso the swagger point. I guess that's what I'm saying about the Fiat 500. It has personality. A lot of young women buy them (or Minis) because they care about some style. I like the Citroen Ami because if you just want a car for short journeys (like say, retired people) it's a great offer at £8K and almost no running costs.",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkpmwy/",
              "created": 1728745620,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrjxppf",
      "score": 17,
      "body": "Just short it",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrjxppf/",
      "created": 1728734370,
      "depth": 0,
      "replies": [
        {
          "id": "lrjxppt",
          "score": 33,
          "body": "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrjxppt/",
          "created": 1728734370,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrjwanm",
      "score": 62,
      "body": "Their product sucks and the stock follows.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrjwanm/",
      "created": 1728733643,
      "depth": 0,
      "replies": [
        {
          "id": "lrm9omb",
          "score": 1,
          "body": "They had been manufacturing an engine named Puretech 1.2 L which is found in all their sub brands since 2016 . , especially in Peugeot and Citroen and Fiat. It appears that this motor got a big issue and engine breaks around 40k kilometers with some people at 25k kilometers. It over consume oil and more other defaults. The problem is not that the engine is a nightmare , but that Stellantis kept ignoring the complaints since years and kept selling it . Today that everyone become aware of it thanks to social media , they sell it under new name , but same architecture and few tweaks claiming that they fixed the problem but they did not fix anything and problems still appear and the used car market is flooded with Peugeot in France having this engine. . They deserve it because they didn’t respect their clients and privileged money gain .",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrm9omb/",
          "created": 1728764493,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrkcygd",
      "score": 13,
      "body": "As a business that needs vehicles for service techs, the RAM Promaster city van was incredible, and they got rid of it because the margins were too small to upcharge like a mofo. They got rid of V8s in ram 1500s so for work basic pickups and personals you move to ford F150s. They neutered the dodge charger and got rid of the challenger. They nuked Chrysler. They got rid of a lot of cheaper jeep options and now jeep wranglers are 30% more than what they were a few years ago with no improvements. Its like they hate consumers. While every car manufacturer has gotten more expensive, their vehicles have gouged harder than everyone else by like 10% (cnbc has a video about it on their youtube channel). Every move that they make is both a slap to the face of businesses that are forced to move to ford and nissan, and to retail as their most coveted options are being nerfed, nuked, and price gouged out the wazoo. Im kinda salty about it ngl",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkcygd/",
      "created": 1728741017,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrk4jmo",
      "score": 56,
      "body": "This is getting upvoted by dyslexic Elon haters. See you at the top!",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk4jmo/",
      "created": 1728737554,
      "depth": 0,
      "replies": [
        {
          "id": "lrkpxpc",
          "score": 3,
          "body": "Lol",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkpxpc/",
          "created": 1728745723,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrkjf4h",
      "score": 7,
      "body": "Stellantis in general and Jeep specifically has been cranking out unreliable garbage for a while. Consumer Reports, for example, put Jeep dead last when compared against 33 other brands. Stellantis brands in general didn't do well. https://www.consumerreports.org/cars/cars-driving/which-car-brands-make-the-best-vehicles-a6159221985/\nIt's gonna take a minute for the new CEO to turn things around for Stellantis. They're going to have to get new leadership in each othe constiuent company brands as well as fixing things within Stellantis proper before those ratings come up, and there's no guarantee that brands like Honda are going to lose ground despite changes the new Stellantis CEO makes.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkjf4h/",
      "created": 1728743431,
      "depth": 0,
      "replies": [
        {
          "id": "lrotrzo",
          "score": 2,
          "body": "I am an amateur mechanic and I recently had the displeasure of working on a Chrysler 200. That car and many others feature the dumbest thing I've ever seen a car .. the TIPM. It's basically all the most important relays that turn the most important things on/off soldered onto one big old circuit board. Fuel pump, horn, starter, signals, everything. When it goes bad your horn might start randomly honking, your car may not start, etc. If it breaks you then need to replace and reprogram the whole thing. from a dealer that can be $1500. \n\n\nThere is an entire cottage industry of TIPM repair shops that refurbish these pieces of shit. They take them and desolder and replace the bad chips and then send them back out. \n\n\nEvery other car I've ever worked on just has regular removable relays. And when they break, you can just replace them for $5-10. \n\n\nI'm not sure if newer stellantis cars are still using them, but if they are, I'd never buy one.",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrotrzo/",
          "created": 1728805361,
          "depth": 1,
          "replies": [
            {
              "id": "lrq8frr",
              "score": 1,
              "body": "Sounds like a manufacturer cost saving move. It costs them a little more to have individual relays so they make one monostrosity and figure replacing it is easier if it is just one module. Nevermind the cost is outrageous for the consumer, but hey they get to save a couple bucks. That was a decision by some asshole MBA that's never spent 5 minutes under the hood of a car. I just had to replace the starter relay. It was $20. If it were $1500, I'd be shopping for a different car.",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrq8frr/",
              "created": 1728831944,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrll3jg",
      "score": 4,
      "body": "Sir, this is a casino.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrll3jg/",
      "created": 1728756171,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrk6jbk",
      "score": 4,
      "body": "Anything Chrysler touches is doomed to failure. Not touching that unless it’s free.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk6jbk/",
      "created": 1728738405,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrk7w1v",
      "score": 4,
      "body": "I was attracted to the div and held this turd for about a year…..there’s no way the dividend % will hold up…..impossible to justify while inventory is stagnant and cars just sit on the lot.   Tavares has been a train wreck for American dealerships.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk7w1v/",
      "created": 1728738972,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrk3sqi",
      "score": 9,
      "body": "This thread has brought out all the dyslexic degenerates on WSB.\n\nAnd I'm loving it.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk3sqi/",
      "created": 1728737229,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrkphg8",
      "score": 3,
      "body": "Lol the amount of ppl commenting without even reading\n..\n\nIt's stla (Stellantis) not tsla",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkphg8/",
      "created": 1728745567,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrke41s",
      "score": 4,
      "body": "when i think dodge or chrysler, words that immediately come to mind: poor quality and terrible reliability.  Even the brand itself triggers a “smelly poo” sensation in my brain. bad product = bad stock. And USA is already saturated in Rams and Jeeps. i dont care who is CEO, this looks like a bankruptcy candidate IMO. I stay away.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrke41s/",
      "created": 1728741465,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrk7ti4",
      "score": 6,
      "body": "Stellantis' latest launches in Europe are ugly, boring and not particularly good value.\n\nIn the good old days, Peugeots were stylish, comfortable and drove well. Today they are ugly, not particularly comfy, and not fun at all. Alfa Romeo has an amazing history and pedigree, and yet thet create frumpy, boring small SUVs, which have none of the appeal that made Alfas sexy and desirable. The Citröens are getting weirder and uglier by the day.\n\nIt will get worse for Stellantis before it gets better.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk7ti4/",
      "created": 1728738943,
      "depth": 0,
      "replies": [
        {
          "id": "lrkdfgf",
          "score": 1,
          "body": "Chrysler will be dead in 5 years. Cybertrucks are rare but has anyone ever seen a dodge hornet? Theyve got three vehicles to kill. The 1500 ram, the Pacifica and the Jeep Wrangler. The new charger is an abomination.",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkdfgf/",
          "created": 1728741201,
          "depth": 1,
          "replies": [
            {
              "id": "lrou06a",
              "score": 1,
              "body": "My buddy rented a car and ended up with a dodge hornet. I had never even heard of it before. ",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrou06a/",
              "created": 1728805518,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrou0oc",
              "score": 1,
              "body": "My buddy rented a car and ended up with a dodge hornet. I had never even heard of it before. ",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrou0oc/",
              "created": 1728805528,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrk69jh",
      "score": 2,
      "body": "So buy calls?",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk69jh/",
      "created": 1728738292,
      "depth": 0,
      "replies": [
        {
          "id": "lrkqzpk",
          "score": 1,
          "body": "Honestly I'm shorting it.\nBut I plan to buy shares because it's one of the main EV maker in Europe and it has also a big market share in the US. Calls are too much of a total luck on this since there is no ETA on something good to happen in near future",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkqzpk/",
          "created": 1728746090,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrkw576",
          "score": 1,
          "body": "I swear every time I see “trash company”, “terrible company”, on Reddit I make 6-10% swinging it long in just a few days.",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkw576/",
          "created": 1728747858,
          "depth": 1,
          "replies": [
            {
              "id": "lrl6in4",
              "score": 1,
              "body": "So whats your play on this",
              "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl6in4/",
              "created": 1728751400,
              "depth": 2,
              "replies": [
                {
                  "id": "lrlxa4n",
                  "score": 2,
                  "body": "Just short term, I bought yesterday 12.80-12.91, average 12.83. I'll check pre-market early and if we look to have a decent open I'll add until my average is 12.91 and set a stop loss at break even and take profits for half at 13.09, the rest at 13.17, let the last 10% ride and move S/L to 13.10. If we open down I just close and take small profit, or small loss.",
                  "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlxa4n/",
                  "created": 1728760209,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lrk94gz",
      "score": 2,
      "body": "That's sad, because their new EVs all look awesome. New Renault 5 and Twingo EV versions look really cool.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk94gz/",
      "created": 1728739482,
      "depth": 0,
      "replies": [
        {
          "id": "lrmooak",
          "score": 3,
          "body": "Stellantis has Peugeot / Citroen, not Renault.",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrmooak/",
          "created": 1728769862,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrn7gws",
          "score": 1,
          "body": "Charger EV is beautiful too.  There's just a bunch of people who think electric motors and internal combustion engines are at war or something and are upset now.",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrn7gws/",
          "created": 1728777110,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrjwyfa",
      "score": 5,
      "body": "Germany managed to kill French and Italian car industries, with Von Der Leyen pushing the EV kill switch.\nNow what's left? Gothenburg, Munich, and ?",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrjwyfa/",
      "created": 1728733989,
      "depth": 0,
      "replies": [
        {
          "id": "lrn3ocd",
          "score": 3,
          "body": "Germany kill theirs as well. Neither Volkswagen group or Mercedes/BMW will do good against Chinese EVs.\n\nCheaper, easier to produce, no know-how difference between china to germany",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrn3ocd/",
          "created": 1728775639,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrk8213",
      "score": 4,
      "body": "I personally think Stellantis quality is not as good as other car makers. On top of that, they are a mix match of brands, which creates inefficiencies. They need a ton of capital to transition/expand into hybrid and EV. Finally, all of their profitable vehicles are per ICE at that moment. They have a major uphill hill to climb to remain competitive.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk8213/",
      "created": 1728739042,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrk8lpb",
      "score": 2,
      "body": "Shitty cars like Peugot and Citroen have no place in the market now that you can buy equivalent cars from China cheaper, unlike reliable cars from Japan, Korea. Only the fancy car market will stay afloat in the EU.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk8lpb/",
      "created": 1728739267,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrkp7u5",
      "score": 2,
      "body": "People said that shit when it was below $150 earlier this year. This stock is a roller coaster.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkp7u5/",
      "created": 1728745476,
      "depth": 0,
      "replies": [
        {
          "id": "lrrxytm",
          "score": 1,
          "body": "I doubt jeep is going to zero lol.",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrrxytm/",
          "created": 1728851830,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrjylxi",
      "score": 1,
      "body": "r/literally",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrjylxi/",
      "created": 1728734813,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrk5z4w",
      "score": 1,
      "body": "So CALLS",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk5z4w/",
      "created": 1728738169,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrk6lnk",
      "score": 1,
      "body": "Target entry would be based on there being a floor but upside surprise after a new ceo takes a while. Before they start showing results they often say there will be a few quarters of pivot like Nike just did. That eventual upside takes a while to get priced into the market so there’s no need to rush entry. Very different than say Nvidia whose upside potential “next” quarter is way closer to neutral. Stelantis isn’t going to have a meaningful upside surprise anytime soon. Way better things to own before stelantis is the “best risk reward available.”",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk6lnk/",
      "created": 1728738433,
      "depth": 0,
      "replies": [
        {
          "id": "lrk6loq",
          "score": 2,
          "body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk6loq/",
          "created": 1728738433,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrk6zxp",
          "score": 2,
          "body": "Delta is a similar target in that their ceo needs to go, but I’m not worried about missing that flight, so I’ll just wait for the market to tell the board through the share price. Why buy here if I can get it 20-40% cheaper while they bicker about exit packages?",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk6zxp/",
          "created": 1728738601,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrkb176",
      "score": 1,
      "body": "Is this dyslexic TSLA?",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkb176/",
      "created": 1728740255,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrkpky7",
      "score": 1,
      "body": "Germany doesn’t have nearly enough charging stations. This problem exists for years already. They halted the EV production years ago already, because they had EV cars and no charging stations. And they still don’t have nearly enough charging stations. And as much as German are “green thinking” they still prefer gas. They don’t trust the EV industry. It’s a different way of thinking over there than in US. In the US, everything NEW people just jump on it without asking questions. In Germany it has to make sense in all places and gain trust, then people come in and buy.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkpky7/",
      "created": 1728745601,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrkq4i1",
      "score": 1,
      "body": "My dyslexia came here to agree getting rid of Elon would be great.. But stallantis sucks too.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkq4i1/",
      "created": 1728745789,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrkqs01",
      "score": 1,
      "body": "Not TSLA? GOT IT",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkqs01/",
      "created": 1728746016,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrkr754",
      "score": 1,
      "body": "I thought this was a post about TSLA when I clicked on it",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkr754/",
      "created": 1728746162,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrkuycx",
      "score": 1,
      "body": "Buy calls got it",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkuycx/",
      "created": 1728747449,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrkvbbw",
      "score": 1,
      "body": "I read TSLA, didn't even notice because it applies to TSLA aswell.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkvbbw/",
      "created": 1728747572,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrkwt93",
      "score": 1,
      "body": "Thought this was a derpy tsla post",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkwt93/",
      "created": 1728748085,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrl0w17",
      "score": 1,
      "body": "I read TSLA in the  title. Got very disappointed",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl0w17/",
      "created": 1728749482,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrl1p05",
      "score": 1,
      "body": "So, according to the number one rule to make money (reverse the hell out of anything you read here), it's time to go all in long.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl1p05/",
      "created": 1728749764,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrl5xi4",
      "score": 1,
      "body": "When you misspell TSLA when filling the order, and still end up losing the same.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl5xi4/",
      "created": 1728751206,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrl98js",
      "score": 1,
      "body": "Wait until you find out how VW has been run into the ground.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrl98js/",
      "created": 1728752299,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrlagpp",
      "score": 1,
      "body": "European cars and their toxic relationship with CEOs named 'Carlos'.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlagpp/",
      "created": 1728752703,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrld7ex",
      "score": 1,
      "body": "Stock is at a peak at market close… why?",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrld7ex/",
      "created": 1728753598,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrlgl28",
      "score": 1,
      "body": "The people who but their products do NOT want EV pushed down their throats.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlgl28/",
      "created": 1728754692,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrlmnu4",
      "score": 1,
      "body": "I own TSLA since many years now... So, I have my salted opinion on how many brands deserve their faith.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlmnu4/",
      "created": 1728756688,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrlozef",
      "score": 1,
      "body": "Just realized I have a bit of dyslexia",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlozef/",
      "created": 1728757459,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrls4ts",
      "score": 1,
      "body": "Misread the ticker as $TESLA and found myself nodding along before I got confused lmao",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrls4ts/",
      "created": 1728758500,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrlzijk",
      "score": 1,
      "body": "Literally watched a video yesterday about their decline, this is becoming very well known.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrlzijk/",
      "created": 1728760957,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrm2uep",
      "score": 1,
      "body": "Counterpoint: I see an ungodly amount of Jeeps and Broncos in the South",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrm2uep/",
      "created": 1728762116,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrm45zd",
      "score": 1,
      "body": "It's shit but that doesn't mean it's not tradeable - buy calls that are cheap for as far out as you can",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrm45zd/",
      "created": 1728762580,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrm9n8v",
      "score": 1,
      "body": "dyslexia thought he meant tesla",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrm9n8v/",
      "created": 1728764480,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrme7zs",
      "score": 1,
      "body": "Im going to sell mine. They , Elon whoever screwed it up this time im\nWaiting til earnings report up or down I leaving Tesla",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrme7zs/",
      "created": 1728766078,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrmifdg",
      "score": 1,
      "body": "Not going to lie.. read $TSLA. Sinking and new CEO check out.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrmifdg/",
      "created": 1728767568,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrmn5ad",
      "score": 1,
      "body": "I thought that said Tesla at first and it fit 😂",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrmn5ad/",
      "created": 1728769295,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrn7par",
      "score": 1,
      "body": "My son really wanted a Jeep wrangler.  The dealer desperate gf me.  To get a model with all the safety features you had to go up 3 trims to a 65k fn jeep.  Bought him a telluride instead with better safety, better tech, better ride, better warranty from a dealer that gave me an upfront OTD price they was 20k less… yeh product problem not CEO.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrn7par/",
      "created": 1728777201,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrnegwu",
      "score": 1,
      "body": "Anyone who says Stellantis is a buy, deffinetly didn't set foot in one of their cars released in the past two years. They are usually good looking, but everything that has to do with interior quality and driving experience is a bad expensive joke.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrnegwu/",
      "created": 1728779859,
      "depth": 0,
      "replies": [
        {
          "id": "lro63af",
          "score": 1,
          "body": "Because they have a nice spot in the global market:\n\nlist of the main market shares of car manufacturers in 2023:\n\nToyota: 10.3 million vehicles sold (~10% of the global market).\n\nVolkswagen Group: 9.2 million vehicles sold (~9% of the market).\n\nHyundai-Kia: 7.3 million vehicles sold (~7% of the market).\n\nStellantis: 6.4 million vehicles sold (~6% of the market).\n\nGeneral Motors: 6.2 million vehicles sold (~6% of the market).\n\nFord: 4.4 million vehicles sold (~5.7% of the market).\n\nHonda: 4.2 million vehicles sold (~5% of the market).\n\nBMW: 2.6 million vehicles sold (~5.6% of the market).\n\nMercedes-Benz: 2\n\n\nRn Stellantis is having an extreme rough time, without any hope in near term. This creates a buy opportunity (maybe not right now, because I think there is room for more downward action). Definitely something to watch closely",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lro63af/",
          "created": 1728791490,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrnjb72",
      "score": 1,
      "body": "Why has $GM outperformed $STLA by so much?",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrnjb72/",
      "created": 1728781802,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrnls6f",
      "score": 1,
      "body": "My dyslexic ass kept reading TSLA",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrnls6f/",
      "created": 1728782812,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrnr86f",
      "score": 1,
      "body": "Will Bug Auto push them out of the market ?",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrnr86f/",
      "created": 1728785060,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrnyuxc",
      "score": 1,
      "body": "How many regards read that post thinking he was talking about Tesla?",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrnyuxc/",
      "created": 1728788245,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrnzmo4",
      "score": 1,
      "body": "I'm sure it has nothing to do with dropping V8 Chargers and Challengers and turning them into glorified golf carts.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrnzmo4/",
      "created": 1728788560,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lro0260",
      "score": 1,
      "body": "Buy ford stocks ",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lro0260/",
      "created": 1728788740,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lron1b8",
      "score": 1,
      "body": "No one has that time on here, we're the 0dte crowd, all day, every day",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lron1b8/",
      "created": 1728800845,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lroqwoc",
      "score": 1,
      "body": "So much debt. Terrible balance sheet?",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lroqwoc/",
      "created": 1728803395,
      "depth": 0,
      "replies": [
        {
          "id": "lrorsnp",
          "score": 1,
          "body": "They invested a lot in EVs but they still have no competitive prices. Basically even the shittiest EV costs around 40/45k in dollars. In Italy prices are little lower because there are some incentives",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrorsnp/",
          "created": 1728803990,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrp6cyz",
      "score": 1,
      "body": "Why anyone would invest into car companies at this stage of the industry is so far beyond me I can’t even make any sense of it",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrp6cyz/",
      "created": 1728814123,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrqxpog",
      "score": 1,
      "body": "So we're grabbing calls correct?",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrqxpog/",
      "created": 1728840273,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrrvi7p",
      "score": 1,
      "body": "I bought in at $13, I know Jeep people are like cultists, with their little hand signals. Long term not worried",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrrvi7p/",
      "created": 1728851034,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrk403u",
      "score": 1,
      "body": "The amount of people who only read a title (kind of since they reconfigured the letters in their brain) and come out swinging is astonishing.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk403u/",
      "created": 1728737317,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrn7ved",
      "score": 1,
      "body": "Just buy TSLA. Problem solved",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrn7ved/",
      "created": 1728777268,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrk20zb",
      "score": -2,
      "body": "Robot AI post with fake dd and mismatch title and a bunch of bot supporting comments.",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk20zb/",
      "created": 1728736432,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrjysg1",
      "score": 0,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrjysg1/",
      "created": 1728734901,
      "depth": 0,
      "replies": [
        {
          "id": "lrk1037",
          "score": 2,
          "body": "Not anyone, anyone hauling commercially. Grandpa hauling his camper recreationally doesn’t need a CDL. Ford has done the same thing raising the F250 GVWR to over 11,000 pounds on most models unless you pay to have your truck derated from the manufacturer. Due to this change now if you drive an F-250 from job site to job site or in a business use role the truck needs a dot number even if it’s not hauling a trailer.",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk1037/",
          "created": 1728735951,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrk5kxc",
      "score": 0,
      "body": "European automakers are getting hit by Chinese tariffs in mainland because of anti competitive practices in the EU. You protect your own industry by destroying it - expect Europeans automakers to drop in general because of their huge exposure to China",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrk5kxc/",
      "created": 1728738000,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrkkceg",
      "score": 0,
      "body": "wait, the will announce self driving next year ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkkceg/",
      "created": 1728743765,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrkwiie",
      "score": 0,
      "body": "You spelled TSLA wrong",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkwiie/",
      "created": 1728747983,
      "depth": 0,
      "replies": [
        {
          "id": "lrrxikk",
          "score": 1,
          "body": "Op isnt talking about tesla its Stellantis (STLA)",
          "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrrxikk/",
          "created": 1728851684,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrkxk98",
      "score": 0,
      "body": "You spelled TSLA wrong",
      "permalink": "/r/wallstreetbets/comments/1g1y8mh/stla_is_literally_sinkinguntil_new_ceo/lrkxk98/",
      "created": 1728748342,
      "depth": 0,
      "replies": []
    }
  ]
}