{
  "title": "The Federal Reserve may have pretty much just hit its 2% inflation target",
  "score": 450,
  "selftext": "In case inflation is no longer an issue, The Fed will deal with its another mandate (i.e. labour market) through cutting interest rates going forward ...\n\nLooks good for the sentiment in the stock market \\~\n\n&#x200B;\n\n**The Federal Reserve may have pretty much just hit its 2% inflation target**\n\n[https://www.cnbc.com/2024/10/11/the-federal-reserve-may-have-pretty-much-just-hit-its-2percent-inflation-target.html](https://www.cnbc.com/2024/10/11/the-federal-reserve-may-have-pretty-much-just-hit-its-2percent-inflation-target.html)\n\n*Key Points*\n\n* *This week’s inflation data provided more evidence that the Federal Reserve is nearing its 2% objective, a mark that Goldman Sachs thinks the central bank may have already hit.*\n* *From a policy standpoint, lower inflation opens the door for the Fed to keep cutting interest rates.*\n\n&#x200B;\n\n*This week’s inflation data provided more evidence that the Federal Reserve is nearing its objective, fresh on the heels of the central bank’s dramatic interest rate cut just a few weeks ago.*\n\n*Consumer and producer price indexes for September both came in around expectations, showing that inflation is drifting down to the central bank’s 2% target.*\n\n*In fact, economists at Goldman Sachs think the Fed may already be there.*\n\n*The Wall Street investment bank Friday projected that the Commerce Department’s personal consumption expenditures price index for September will show a 12-month inflation rate of 2.04% when it is released later this month.*\n\n*If Goldman is correct, that number would get rounded down to 2% and be right in line with the Fed’s long-held objective, a little over two years after inflation spiked to a 40-year high and unleashed an aggressive round of interest rate hikes. The Fed prefers the PCE as its inflation gauge though it uses a variety of inputs to make decisions.*\n\n*“The overall trend over 12, 18 months is clearly that inflation has come down a lot, and the job market has cooled to a level which is around where we think full employment is,” Chicago Fed President Austan Goolsbee said in a CNBC interview Thursday after the latest consumer price data was released. “We’d like to get both of them to stay in the space where they are right now.”*\n\n&#x200B;\n\n*Some obstacles ahead*\n\n&#x200B;\n\n*While keeping inflation at bay may not be an easy task, the latest data indicates that though prices are not receding from their troublesome heights of a few years ago, the rate at which they are increasing is pulling back.*\n\n*The 12-month rate for the all-items consumer price index was at 2.4% in September, while the producer price index, a proxy for wholesale inflation and a leading gauge for pipeline pressures, showed an annual rate of 1.8%.*\n\n*Goldman’s projection that the PCE index is heading to 2% is also about in line with tracking from the Cleveland Fed.*\n\n*The central bank district’s “inflation nowcasting” dashboard pegs the 12-month headline PCE rate at 2.06% for September, which would get rounded up to 2.1%. However, on an annualized pace, inflation for the entire third quarter is running at just a 1.4% rate — well below the Fed’s 2% goal.*\n\n*To be sure, there are some caveats to show that policymakers still have some work to do.*\n\n*Core inflation, which excludes food and energy and is a metric that the Fed considers a better measure of longer-term trends, is expected to run at a 2.6% annual rate for the PCE in September, according to Goldman. Using just the consumer price index, core inflation was even worse in September, at 3.3%.*\n\n*Fed officials, though, see the unexpectedly high shelter inflation numbers as a major driver of the core measure, which they figure will ease as a lower trend in rents works its way through the data.*\n\n*Fed Chair Jerome Powell on Sept. 30, addressing the rent situation, said he expects housing inflation to continue to recede while “broader economic conditions also set the table for further disinflation.”*\n\n*From a policy standpoint, lower inflation opens the door for the Fed to keep cutting rates, particularly as it turns its attention to the labor market, though there’s some trepidation about how quickly it should move.*\n\n*September’s half percentage point reduction to a fed funds range of 4.75% to 5% was unprecedented for an economy in expansion, and the Fed at the very least is expected to return to its normal quarter-point pace. Atlanta Fed President Raphael Bostic even said Thursday he’d be open to skipping a move altogether at the November meeting.*\n\n*“Aggressive easing would risk spiking consumer demand just as it is settling into a sustainable pace,” PNC senior economist Kurt Rankin said in a post-PPI analysis. “This result would in turn put pressure on businesses to meet that demand, re-igniting gains in those businesses’ own costs as they jockey for the necessary resources to do so.”*\n\n*Futures traders are betting on a near certainty that the Fed cuts rates by a quarter point at both the November and December meetings.*",
  "link_flair_text": "FOMC",
  "id": "1g2lc41",
  "num_comments": 200,
  "created_utc": 1728809095,
  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/",
  "comments": [
    {
      "id": "lroz636",
      "score": 1,
      "body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lroz636/",
      "created": 1728809096,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrpeaog",
      "score": 206,
      "body": "\"May have pretty much\" lol",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpeaog/",
      "created": 1728819249,
      "depth": 0,
      "replies": [
        {
          "id": "lrqe18a",
          "score": 39,
          "body": "Yeah, a better choice would be “definitively”.\n\nhttps://fred.stlouisfed.org/series/CPIAUCSL\n\nCPI Index April 2024: 313.207\n\nCPI Index Sept 2024: 314.686\n\n+0.47% over the last 6-months. The cuts will continue.",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqe18a/",
          "created": 1728833846,
          "depth": 1,
          "replies": [
            {
              "id": "lrr5h1l",
              "score": 15,
              "body": "If you look at harmonized CPI or PCE it's been clear even longer that inflation fight has been definitively won.\n\n> The cuts will continue.\n\nYup and those that do not understand this will be left behind.",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr5h1l/",
              "created": 1728842688,
              "depth": 2,
              "replies": [
                {
                  "id": "lrsf8yx",
                  "score": 3,
                  "body": "That's what was said ... repeatedly .... in the 70s.  \n\nMy notes  say KILLING inflation is much harder than you expect,  takes much longer, and If it got out of control (1978,  16%)  you need to bludgeon it to win. \n\nWe're not *quite* finished,  but a Volker moment seems out of the picture this time. \n\nNow,   what would happen with 20% tariffs?  That (to me) would be like napalm on inflation... Seriously stupid.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsf8yx/",
                  "created": 1728857757,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrvyhqs",
                      "score": 3,
                      "body": "[removed]",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrvyhqs/",
                      "created": 1728919181,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lruxkbg",
          "score": 3,
          "body": "English teachers everywhere punching the air reading that title",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lruxkbg/",
          "created": 1728904418,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrpfutc",
      "score": 95,
      "body": "Pump time. Pump pump pump",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpfutc/",
      "created": 1728820118,
      "depth": 0,
      "replies": [
        {
          "id": "lrr8k0u",
          "score": 7,
          "body": "What about TLT?",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr8k0u/",
          "created": 1728843653,
          "depth": 1,
          "replies": [
            {
              "id": "lrsfcai",
              "score": 5,
              "body": "Bond speculators are betting on inflation rising with strong jobs data but give them time to the short long bond positions will get wiped out. It’s just the same thing as when the market fought the fed on rate rises it’s just happening in reverse now. Bond bears are fighting the fed on the rate cuts.",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsfcai/",
              "created": 1728857790,
              "depth": 2,
              "replies": [
                {
                  "id": "lrsrlve",
                  "score": 3,
                  "body": "So TLT should eventually go up in price?",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsrlve/",
                  "created": 1728862344,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrukg5h",
                      "score": 2,
                      "body": "Long bonds are way more complicated than just Fed cuts > long bonds up.",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrukg5h/",
                      "created": 1728895770,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ls4ly4b",
                          "score": 1,
                          "body": "What do you project TLT to do EOY?",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/ls4ly4b/",
                          "created": 1729038802,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lrp03sn",
      "score": 178,
      "body": "Feds hit their mark right before election time. Economy is booming. Everyone is happy. Nice! 👍🏻",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp03sn/",
      "created": 1728809728,
      "depth": 0,
      "replies": [
        {
          "id": "lrp3ksq",
          "score": 91,
          "body": "Right on target. Everybody feels good. Mission accomplished. Hand the bag to the next person to deal with",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp3ksq/",
          "created": 1728812177,
          "depth": 1,
          "replies": [
            {
              "id": "lrpbeed",
              "score": 86,
              "body": "I know you’re being facetious but…problem is consumers still don’t feel good, despite the data. It’s kind of hard to believe. But I guess after a few years of high inflation it’s hard to forget. https://www.cnbc.com/amp/2024/09/24/september-consumer-confidence-falls-the-most-in-three-years.html",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpbeed/",
              "created": 1728817512,
              "depth": 2,
              "replies": [
                {
                  "id": "lrshkmm",
                  "score": 26,
                  "body": "Half the country thinks inflation pushes prices too far.... And defeating inflation brings prices back down.  \n\nWrong. \n\nDefeating inflation slows the speed of rising prices",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrshkmm/",
                  "created": 1728858595,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrq44l0",
                  "score": 53,
                  "body": "Half the country also thinks that Trump is a business genius and he says, without evidence, that everything is terrible and only he can \"fix\" it. There's a reason people say that inflation can be a self-fulfilling prophecy. And *despite all of that*, numbers are coming down, hard.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrq44l0/",
                  "created": 1728830469,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrqbsbk",
                      "score": 15,
                      "body": "Yup. Lots of dumb/brainwashed people out there",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqbsbk/",
                      "created": 1728833085,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrqeaoq",
                          "score": 9,
                          "body": "Idiot has a TV show and claims to be a genius businessman. Because he’s on TV, people believe whatever he says.",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqeaoq/",
                          "created": 1728833932,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrsi1i1",
                              "score": 1,
                              "body": "Person,  man,  woman,  camera, TV",
                              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsi1i1/",
                              "created": 1728858768,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lrpesfz",
                  "score": 23,
                  "body": "I wonder who it was that demanded the fed drop rates to 0%. I wonder if 0% rates would cause inflation.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpesfz/",
                  "created": 1728819531,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrq7647",
                      "score": -22,
                      "body": "I wonder who passed the highest spending bill\n in American history that economists agree was a major contributor to the rampant inflation we have seen since. This was after the economy had already opened up and everyone had access to vaccines. Wonder who that was.",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrq7647/",
                      "created": 1728831513,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrq98m1",
                          "score": 28,
                          "body": "Who has a budget plan that proposes the largest deficit in history that is also running for president in 2024.",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrq98m1/",
                          "created": 1728832218,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrszz9n",
                              "score": 2,
                              "body": "\\*Concept of a plan.",
                              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrszz9n/",
                              "created": 1728865625,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lrr4003",
                          "score": 8,
                          "body": "Ask economists whether they think Biden and Congress's spending bill was a major factor in price inflation, or whether global supply chain disruptions during the pandemic and near-zero interest rates and other expansionary monetary policies were.\n\nYou might also want to ask them their opinion on tariff hikes and their impacts.",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr4003/",
                          "created": 1728842227,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrre2jt",
                              "score": -6,
                              "body": "Not arguing Biden caused inflation. I said he poured gasoline on an already lit fire. He injected way too much money into an already recovering economy. Every economist agrees that Biden and congress’s spending bills contributed to inflation. Larry Summers, the former treasury secretary warned everyone that Biden’s stimulus bill would fuel inflation. \n\nhttps://www.politico.com/news/2021/07/13/larry-summers-biden-inflation-499502\n\nTrump’s stimulus was necessary during the peak of the pandemic but all of Biden’s spending bills were passed after the economy was already recovering and we had vaccines. They were completely unnecessary.",
                              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrre2jt/",
                              "created": 1728845415,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lrsh5g5",
                                  "score": 3,
                                  "body": "I'm not sure why anyone would care would Larry Summers says at this point.",
                                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsh5g5/",
                                  "created": 1728858442,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lrqdxce",
                          "score": 16,
                          "body": "Excuse me but EVERY economist said that the way out of the pandemic market was to SPEND",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqdxce/",
                          "created": 1728833810,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrqhr4s",
                              "score": 20,
                              "body": "Seriously, look at how we’re doing vs most of the world. The inflation sucks, but I will gladly take this, considering the economic catastrophe we were looking at in 2020",
                              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqhr4s/",
                              "created": 1728835038,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lrqhom1",
                              "score": -2,
                              "body": "Not when we already had a vaccine and the economy had opened back up. Those spending bills were like pouring gasoline on an already lit fire. Completely unnecessary.",
                              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqhom1/",
                              "created": 1728835015,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lrr3cnv",
                                  "score": 7,
                                  "body": "So why is the US economy better off in terms of inflation than most other developed countries?",
                                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr3cnv/",
                                  "created": 1728842025,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lrr63rz",
                                      "score": 7,
                                      "body": "I’m a big advocate of economic stimulus, but the US had the significant advantages of issuing the global reserve currency and energy independence. \n\nGiven these advantages, I think it was perfectly logical for the US to go really big. However, I think it’s a mistake to believe that other developed economies could simply copy America’s playbook.",
                                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr63rz/",
                                      "created": 1728842886,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lrr6mx0",
                                          "score": -2,
                                          "body": "I totally agree with that analysis. I wasn't saying that other countries should have done what the US did, more just trying to point out that it wasn't as simple as the other person was trying to make it seem.",
                                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr6mx0/",
                                          "created": 1728843054,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "lru9j2w",
                                      "score": 2,
                                      "body": ">So why is the US economy better off in terms of inflation than most other developed countries?\n\nThe U.S. exports its inflation.\n\nhttps://kenaninstitute.unc.edu/kenan-insight/how-the-u-s-exports-inflation-through-a-strong-dollar/\n\nhttps://amp.cnn.com/cnn/2022/09/28/investing/fed-interest-rates-dollar-global-consequences",
                                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lru9j2w/",
                                      "created": 1728887516,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lruhc6h",
                                          "score": 2,
                                          "body": "It can only last so long",
                                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lruhc6h/",
                                          "created": 1728893449,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "lrwd374",
                                      "score": 1,
                                      "body": "Dude that’s because the US is so damn influential and is the global reserve currency. Other countries can’t be as reckless as the US when it comes to spending. As another commenter said, the US exports there inflation. Millions will suffer but hey Atleast the US stock market is at ATH.",
                                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrwd374/",
                                      "created": 1728923857,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lrrx8fa",
                          "score": 5,
                          "body": "So you know that Trump spent more and pushed up the deficit higher of you compare the two though right?",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrrx8fa/",
                          "created": 1728851593,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lrsg38c",
                          "score": 2,
                          "body": "Companies increasing prices above increases costs was the primary driver of inflation.",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsg38c/",
                          "created": 1728858064,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lrrkxzc",
                          "score": 1,
                          "body": "Not sure why you're being downvoted for having essentially the right take on this. Then again this is reddit...",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrrkxzc/",
                          "created": 1728847640,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lru9eqp",
                  "score": 2,
                  "body": ">Its kind of hard to believe \n\nIt’s really not, if you shop at the grocery store every week.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lru9eqp/",
                  "created": 1728887435,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ls27a7b",
                      "score": 1,
                      "body": "Auto insurance rose 8% 3 consecutive times over 18 months.  Homeowners insurance increased.  Medical insurance increased are offsetting any wage growth.  Daycare is going up 8% at the start of the year.  \n\n\nTLDR wage growth has been left behind while inflation ran wild.  We are all feeling the effects of that.  Inflation has stabilized at a higher base cost.\n\n\nTLDR compound inflation is a bitch",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/ls27a7b/",
                      "created": 1729009924,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lrpbfgu",
                  "score": 1,
                  "body": "It looks like you shared an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.cnbc.com/2024/09/24/september-consumer-confidence-falls-the-most-in-three-years.html](https://www.cnbc.com/2024/09/24/september-consumer-confidence-falls-the-most-in-three-years.html)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpbfgu/",
                  "created": 1728817531,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrq3lf5",
                  "score": -14,
                  "body": "Yeah because anyone who was fiscally responsible got fucked basically.  40% of the nation probably will never own a house at this point.  And I went from making 3x fast food wages to 1.8x.\n\nI'm sure it's great if you are wfh tech who moved into the country side.  The rest of us not so much.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrq3lf5/",
                  "created": 1728830280,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrq76mh",
                      "score": 14,
                      "body": "US has a 65.6% homeownership rate.   \n\nAre you really punching down to fast food wages? You should be making more, not fast food wages should be less. That's a very zero sum/scarcity mindset you have there.      \n\n\nhttps://fred.stlouisfed.org/series/RHORUSQ156N",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrq76mh/",
                      "created": 1728831517,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrqq3oi",
                          "score": 1,
                          "body": ">You should be making more, not fast food wages should be less.\n\nThat doesn't make any sense. It doesn't matter what anyone makes. The point is he should be making a lot more, not a little more, than a fast food worker. The dollar's value will find its equilibrium based off that ratio, but its nominal value isn't relevant to the argument. \n\n>Are you really punching down to fast food wages?\n\nYes. What's wrong with that? We speak nicely of their work out of social courtesy, not because anyone actually believes their labor is valuable.",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqq3oi/",
                          "created": 1728837803,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lrqehyq",
                          "score": -4,
                          "body": "> Are you really punching down to fast food wages? \n\nNope.  Just saying my job didn't keep up with inflation and I don't give a shit anymore about it.\n\n> a very zero sum/scarcity mindset you have there. \n\nNo your just reading into things that aren't there and are substituting your own conclusions.",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqehyq/",
                          "created": 1728833997,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrqetnn",
                              "score": 1,
                              "body": "git gud",
                              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqetnn/",
                              "created": 1728834101,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lrqwr4k",
                  "score": -1,
                  "body": "That's the tail of inflation effect. Which is exactly as it should be. Nobody was waving a flag at the top saying \"but we have ample cash!\" But that's just where we were at the top of inflationary data. Good luck.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqwr4k/",
                  "created": 1728839971,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrqu820",
              "score": 5,
              "body": "The \"bag\" meaning balancing monetary creation as bank credit or deficit spending is the whole economy - the GDP.  The bag is always getting \"passed\" as politicians and bankers come and go.",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqu820/",
              "created": 1728839161,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrq32jt",
              "score": -1,
              "body": "Let's party like it's 1999.  :D  Of course this is when it all corrects.",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrq32jt/",
              "created": 1728830095,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lruq2w9",
          "score": 3,
          "body": "Two days after elections: Wall street reder than red square in Moscow",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lruq2w9/",
          "created": 1728899760,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrp0ery",
          "score": -71,
          "body": "Yeah that's not suspicious at all",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp0ery/",
          "created": 1728809938,
          "depth": 1,
          "replies": [
            {
              "id": "lrp0i5d",
              "score": 82,
              "body": "I am sad that we're at a point in society where adults doing their jobs competently is suspicious.",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp0i5d/",
              "created": 1728810003,
              "depth": 2,
              "replies": [
                {
                  "id": "lrp1tpj",
                  "score": 71,
                  "body": "Pretty sad to see comments like that on this sub.  The Fed has been unwinding inflation for 2.5 years and have been extremely transparent in their approach.  Pulling off a soft landing after seeing the highest inflation rate in 40 years is nothing short of incredible.\n\nI don't know why a recovering US economy can't be celebrated by these people, but instead they want to cry conspiracy.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp1tpj/",
                  "created": 1728810931,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrp4aew",
                      "score": 21,
                      "body": "It's because people seem to have lost all sense of critical thinking. They're listening to politician that keep claiming that everything is bad, that the current government is ruining the economy, and other doom and gloom messaging. So when some good news manages to pierce the veil of their bubble, it comes out of nowhere, so they don't believe it and claim it's a lie. I bet a lot of them are not even aware that the inflation has been going down steadily, and the economy has been recovering amazingly well compared to the rest of the world. They were probably too busy being angry about other issues that politicians keep pushing on them.",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp4aew/",
                      "created": 1728812678,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrp5soi",
                          "score": 23,
                          "body": ">I bet a lot of them are not even aware that the inflation has been going down steadily, and the economy has been recovering amazingly well compared to the rest of the world.\n\nMost of them don't even realize the rest of the world had high inflation too.  They literally believed this was exclusively a US problem caused by the president.",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp5soi/",
                          "created": 1728813728,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrp7vf3",
                              "score": 14,
                              "body": "I think also that many of them believe price level = inflation. So, they see prices above where they were 3 years ago and think that means we still have inflation.",
                              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp7vf3/",
                              "created": 1728815164,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lrpshbq",
                                  "score": 8,
                                  "body": "Exactly. They don't understand this is the new norm. They somehow think deflation will occur and prices must come back to what they were before COVID",
                                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpshbq/",
                                  "created": 1728826071,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lrqgiv0",
                                      "score": 1,
                                      "body": "Yep, they’re in for a surprise. I bet trump thinks that too, and he probably spreads that misinformation to his followers who believe everything he says. When, in the reality the rest of us live in, he is a moron.",
                                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqgiv0/",
                                      "created": 1728834644,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lrqse5x",
                                          "score": 3,
                                          "body": "I’m not convinced trump even thinks about those sort of things.\n\nI wish the Republican Party would go back to the party of fiscal responsibility rather than the party of whatever their opponents don’t want.\n\nOnce upon a time they were a balance to the other side.  Now they’re apparently just there to sow discord.",
                                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqse5x/",
                                          "created": 1728838559,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "lrqypjd",
                              "score": 5,
                              "body": "There’s a rest of the world?",
                              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqypjd/",
                              "created": 1728840586,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lrqrzlo",
                              "score": 1,
                              "body": "Not to mention the fact that they seem to forget which president was leading things that lead to the high inflation, and which one was leading things when that inflation was brought under control.",
                              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqrzlo/",
                              "created": 1728838424,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lrqf84u",
                      "score": 2,
                      "body": "💯 \n\nFed couldn’t pull off a reversal this fast in 2008, but look at where we are now in the market. It’s astounding. Record breaking, every day. Yes, prices are much higher than they were before, but I hate to say it, people will get used to it after a while. I say this as someone who has lived through several eras of inflation and unfortunately, companies never lower prices once they see what people will pay for things.",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqf84u/",
                      "created": 1728834229,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrui8e0",
                          "score": 1,
                          "body": "Paper towels are a commodity, we saw that during the pandemic.  Now they are $3 a roll!  I don't see inflation going much higher,  people can barely afford their lifestyles now.  However, prices went up so much so fast, it's still kind of sticker shock going to the grocery store or home depot.  Eggs were 1.99 now 4.39 locally here in NY.  The only item which has gone down, mind you I haven't had a delivery of heating oil, is low octane gas prices. The higher end is still 4.35 here and I think the peak was Just 4.99.  Prices won't ever go down,  but they sure have to up less.  2% on 1.99 is easier to swallow that 2% on 4.99 .  That's just math,  but the actual cost of the % is still higher. Car and home prices have risen incredibly fast, wages not so much",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrui8e0/",
                          "created": 1728894124,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lrp18t5",
                  "score": -18,
                  "body": "People in government jobs claiming to have done their job competently is indeed suspicious.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp18t5/",
                  "created": 1728810525,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrp7ipo",
                      "score": 15,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp7ipo/",
                      "created": 1728814921,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrsf8fj",
                          "score": 1,
                          "body": "The Federal Reserve System takes the form of corporations that issue shares, but it is not private. Its structure and mission are defined by law and its leadership is appointed by the President. It’s “independent within the government”.",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsf8fj/",
                          "created": 1728857751,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lrp4jsn",
                      "score": 12,
                      "body": "Where has the government claimed that? You're throwing suspicion without any substance. The Fed hasn't made any claims. It's just some economists in a news article making those claims.",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp4jsn/",
                      "created": 1728812858,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lrp12vq",
                  "score": -10,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp12vq/",
                  "created": 1728810409,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrp1gia",
                      "score": 18,
                      "body": "So what's the conspiracy here? That the Fed is being nefarious by...? being good at its job? Or they were faking being bad before to...? make Kamala Harris look bad so they could...? make her look better when they stopped faking being bad? I guess?",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp1gia/",
                      "created": 1728810676,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lrp7avo",
              "score": 11,
              "body": "Imagine discounting anything that doesn’t match your worldview as fake news",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp7avo/",
              "created": 1728814773,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrpw4fn",
      "score": 23,
      "body": "so what happens when good prices actually start stabilizing/rising again and/or the massive shortage of multifamily housing in the pipeline (starts dropped off like a cliff when the Fed started raising rates) causes rents to jump again? are people not concerned about this?",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpw4fn/",
      "created": 1728827545,
      "depth": 0,
      "replies": [
        {
          "id": "lrr372s",
          "score": 22,
          "body": "It's cyclical. Welcome to economics. ",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr372s/",
          "created": 1728841977,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrrn222",
          "score": 1,
          "body": "Depends on why goods prices are rising.\n\nIf they're rising because we just need more supply to come online and the increases are temporary with relief coming, Fed may not overreact and just take a wait and see approach.\n\nUnless it's irrational spiral up with expectations becoming de-anchored, it may not be a reason for concern.",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrrn222/",
          "created": 1728848320,
          "depth": 1,
          "replies": [
            {
              "id": "lrvkpd0",
              "score": 1,
              "body": "what about the issue with rents?",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrvkpd0/",
              "created": 1728914502,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrp9lc5",
      "score": 55,
      "body": "The war in the Middle East could pump up the oil price, which means higher inflation, so the Fed will likely be cautious.",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp9lc5/",
      "created": 1728816331,
      "depth": 0,
      "replies": [
        {
          "id": "lrpbny1",
          "score": 109,
          "body": "I just called Iran and sorted things out",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpbny1/",
          "created": 1728817677,
          "depth": 1,
          "replies": [
            {
              "id": "lrpdov2",
              "score": 31,
              "body": "Thanks man! I'll call Israel",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpdov2/",
              "created": 1728818899,
              "depth": 2,
              "replies": [
                {
                  "id": "lrpjiwa",
                  "score": 25,
                  "body": "No answer.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpjiwa/",
                  "created": 1728822017,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrpyp6w",
                      "score": 17,
                      "body": "I went to a bar mitzvah once. Let me try.",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpyp6w/",
                      "created": 1728828517,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lrqi22h",
                      "score": 9,
                      "body": "Did you try paging them?",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqi22h/",
                      "created": 1728835136,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lrsfh4m",
              "score": 1,
              "body": "Over here, officer! Arrest this man for violating the Logan Act!",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsfh4m/",
              "created": 1728857839,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrvhksx",
              "score": 1,
              "body": "I sent Abdul a picture of his house",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrvhksx/",
              "created": 1728913356,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrpw5ua",
              "score": 1,
              "body": "Thanks Bill Nye 🤝can you call my wife next?",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpw5ua/",
              "created": 1728827560,
              "depth": 2,
              "replies": [
                {
                  "id": "lrqbgrw",
                  "score": 4,
                  "body": "Inertia is a property of matter",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqbgrw/",
                  "created": 1728832975,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lrsfgop",
          "score": 2,
          "body": "US is producing record oil. Middle East is now raising production as US producers are eating their breakfast. More likely to have negative oil prices again.",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsfgop/",
          "created": 1728857834,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrpelks",
          "score": -2,
          "body": "They could just dump the other half of the SPR, problem solved. Better save it for the midterms.",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpelks/",
          "created": 1728819424,
          "depth": 1,
          "replies": [
            {
              "id": "lrsbo1b",
              "score": 2,
              "body": "Half of the SPR would cover US consumption for about 8 days",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsbo1b/",
              "created": 1728856453,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrq3hsl",
      "score": 7,
      "body": "Time to lower interest! ",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrq3hsl/",
      "created": 1728830244,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrty5ig",
      "score": 11,
      "body": "The claim that the Fed has hit its 2% inflation target is premature. \n\nCore inflation, which is more indicative of long-term trends, is still running above 2%, largely due to elevated housing costs. \n\nCutting rates too aggressively could spur demand, driving prices higher again. While the trend is improving, the Fed must be cautious not to undermine its progress by acting too soon.",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrty5ig/",
      "created": 1728880081,
      "depth": 0,
      "replies": [
        {
          "id": "lrui17y",
          "score": 5,
          "body": "Fed ain't being cautious. The supposed target is to average 2% over time. We had four years of inflation significantly higher than that, haven't even hit 2% yet and they're already panicking about inflation visiting a number below 2. \n\nThey're fine with 3-4%, because of of course they are. They and their friends are in the (owning) class that is prospering in the current situation.",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrui17y/",
          "created": 1728893978,
          "depth": 1,
          "replies": [
            {
              "id": "lrwxrk0",
              "score": 1,
              "body": "I didn't say they are being cautious.\n\nI said they must be cautious not to undermine its progress by acting too soon.\n\nThat means the need to be cautious not to cause issues with their cuts.\n\nCut too rapidly, it can spike inflation. \n\nThe Fed didn't panic about the negative month of CPI. The market did.",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrwxrk0/",
              "created": 1728930310,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrs13pn",
      "score": 5,
      "body": "RemindMe! 5 months",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrs13pn/",
      "created": 1728852849,
      "depth": 0,
      "replies": [
        {
          "id": "lrs18jl",
          "score": 1,
          "body": "I will be messaging you in 5 months on [**2025-03-13 20:54:09 UTC**](http://www.wolframalpha.com/input/?i=2025-03-13%2020:54:09%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrs13pn/?context=3)\n\n[**3 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1g2lc41%2Fthe_federal_reserve_may_have_pretty_much_just_hit%2Flrs13pn%2F%5D%0A%0ARemindMe%21%202025-03-13%2020%3A54%3A09%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201g2lc41)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrs18jl/",
          "created": 1728852891,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrswy1p",
      "score": 4,
      "body": "If they’ve really hit that 2% target, that’s a big deal for the Fed. It’s what they’ve been aiming for to balance growth and keep prices stable. But with everything still feeling expensive, it’ll be interesting to see how this plays out in the real world, like if it means interest rates start to chill out a bit.",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrswy1p/",
      "created": 1728864435,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lru3mpu",
      "score": 4,
      "body": "Just keep not counting numbers that you don’t like to get the number you want!!!",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lru3mpu/",
      "created": 1728883391,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrsf059",
      "score": 8,
      "body": "Lmao. Yeah those numbers are pure garbage.",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsf059/",
      "created": 1728857668,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrp27av",
      "score": 43,
      "body": "Now we just need 8% deflation compounded over the next three years to make up for the utter fucking stupidity of “it’s transitory” you know because fair and free market and all … then remove seven trillion from their balance sheet at the same rate they printed again because who doesn’t want a fair and free market and the economy gets to zero pretty quick.",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp27av/",
      "created": 1728811195,
      "depth": 0,
      "replies": [
        {
          "id": "lrplhgq",
          "score": 12,
          "body": "That is how you end up like japan but without the infrastructure",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrplhgq/",
          "created": 1728822980,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrp4hrh",
          "score": 47,
          "body": "It was transitory though. The debate was if we will ever hit 2% or not with the fed's detractors arguing a permanent (as opposed to transitory) elevation in the natural rate of inflation. Also it seems you are conflating change of price with the rate of change of price (aka inflation)",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp4hrh/",
          "created": 1728812820,
          "depth": 1,
          "replies": [
            {
              "id": "lrsffm3",
              "score": 3,
              "body": "Lmao no it wasn't. They were calling it a blip. They weren't even going to raise rates until shit hit the fan.",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsffm3/",
              "created": 1728857824,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrp5iik",
              "score": -51,
              "body": "That’s fine if you want to define it that way. So in that case we now need 8% “transitory” deflation to get back in line with 2% average. Not conflation price at all as the rate of change of price needs to fall into the negative e.g.) deflation, it’s ok it will be transitory.",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp5iik/",
              "created": 1728813533,
              "depth": 2,
              "replies": [
                {
                  "id": "lrpk69m",
                  "score": 16,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpk69m/",
                  "created": 1728822339,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrp8atp",
                  "score": 22,
                  "body": "What needs to happen is the congress and state/local governments need to tackle housing supply. Housing is the huge issue imo causing so many middle class people to have no confidence in this economy (and lose their faith in the American dream) because they can’t buy a house in a reasonable location for an affordable multiple of their annual income.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp8atp/",
                  "created": 1728815456,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrqhk1x",
                      "score": -2,
                      "body": "The mortgage rates will come down with interest rate cuts, and Harris is offering subsidies for first time homebuyers. Hopefully, that will help.",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqhk1x/",
                      "created": 1728834975,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrs17pj",
                          "score": 1,
                          "body": "The fed rate doesn't directly effect residential mortgage rates. The residential rates have increased post fed cut.",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrs17pj/",
                          "created": 1728852883,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lrqsqpm",
                  "score": 2,
                  "body": "No the price doesn't need to go back to 2021 levels because that is deflationary. If prices fall then producers lose incentive to produce and start laying off people leading to mass employment. What we want instead is a rise in wages. Then both of them need to rise in tandem at 2% yoy",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqsqpm/",
                  "created": 1728838673,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrsc1vi",
                      "score": 0,
                      "body": "> If prices fall then producers lose incentive to produce and start laying off people leading to mass employment.\n\nThis assume their production costs remain the same while the sales price for their product decreases. This isn't often the case",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsc1vi/",
                      "created": 1728856589,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lrqgsvp",
          "score": 19,
          "body": "8% deflation would kill the economy. Read a book",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqgsvp/",
          "created": 1728834732,
          "depth": 1,
          "replies": [
            {
              "id": "lrr9qcp",
              "score": -5,
              "body": "man these bankers sure have gaslight everyone its crazy.\n\nWe HAVE to have a steady erosion of the middle class's ability to purchase goods and assets, and if we don't have that. .. \n\nThe entire economy will implode! What an absolutely disgusting way the modern financial system has been structured.",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr9qcp/",
              "created": 1728844025,
              "depth": 2,
              "replies": [
                {
                  "id": "lrrbtf6",
                  "score": 3,
                  "body": ">We HAVE to have a steady erosion of the middle class's ability to purchase goods and assets, and if we don't have that. ..\n\n>The entire economy will implode! What an absolutely disgusting way the modern financial system has been structured.\n\nIronically, inflation is the only thing wiping away your grandparents and parents absolutely insane national debt, and the only thing keeping billionaires from setting up ultrawealth for their families that lasts for thousands of years.\n\nWith inflation, the debts of WW2 and the Cold War can be forgotten without paying. With inflation, the wealth of the Rockefellers, the Carnegies, and other titans of centuries past is diluted to nothing, and only the new money remains. \n\nBut sure, the bankers have this one weird gaslighting trick to destroy the middle class... \n\nWhen you're ready to tighten your belt and cut social services to pay down your granddaddys wars, then we can talk about deflation.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrrbtf6/",
                  "created": 1728844684,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrrccpb",
                      "score": -7,
                      "body": "there is that gaslighting I'm talking about! what a thing to behold lol.",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrrccpb/",
                      "created": 1728844859,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrrcrz4",
                          "score": 6,
                          "body": "> aNyThInG i dIsAgReE wItH iS gAsLiGhTiNg\n\nYou can't fix stupid, but damn you can laugh at it.",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrrcrz4/",
                          "created": 1728844995,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrre9ns",
                              "score": -10,
                              "body": "Indeed I am having a good laugh at you. Thanks :)",
                              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrre9ns/",
                              "created": 1728845479,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lrreszu",
                                  "score": 6,
                                  "body": "Aww, bless your heart. You can tell you're really smart by the way you refuse to engage at all and ineptly misuse the tiktok-ified pop-psychology term 'gaslighting'.\n\nShame that us dumb people have to make do with actual debate, information, facts and real discourse, drat 😉😘\n\nAnd plus -- you've got a full blown doomer conspiracy-bro posting in support of you. Damn! Such brilliant company to keep.",
                                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrreszu/",
                                  "created": 1728845654,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lrqpjbf",
              "score": -7,
              "body": "I am not saying you are wrong. But at the same time, when have we actually seen deflation? Everything written about deflation seems to be in theory. As far as I know currencies collapse from hyper inflation. Never from deflation. I never understand why deflation is such a boogeyman, while inflation is what has actually been killing our standard of living since I've been born. They are 2 sides of the same coin.",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqpjbf/",
              "created": 1728837618,
              "depth": 2,
              "replies": [
                {
                  "id": "lrqsa05",
                  "score": 13,
                  "body": "The great depression is one of the big reasons Hitler got into power and WW2 started man.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqsa05/",
                  "created": 1728838521,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrqv08n",
                      "score": 4,
                      "body": "So true, yet so forgotten.",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqv08n/",
                      "created": 1728839412,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrqwrgu",
                          "score": 0,
                          "body": "I guess you forgot about the Wiemar Republic.",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqwrgu/",
                          "created": 1728839973,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lrr3lj7",
                              "score": 4,
                              "body": "You mean the government of Germany that was in power in 1929?  Umm...",
                              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr3lj7/",
                              "created": 1728842101,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lrqwgsn",
                      "score": 2,
                      "body": "Hyperinflation caused the great depression. Deflation was a result of their dollar collapsing from inflation. Germany was screwed well before The Great Depression.",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqwgsn/",
                      "created": 1728839881,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lrr586d",
                  "score": 3,
                  "body": "The Great Depression. That's when.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr586d/",
                  "created": 1728842611,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrqqe10",
                  "score": 8,
                  "body": "Really, here is something that you can read to help you understand the terms you’re using.\n\n[deflation in American history](https://www.investopedia.com/ask/answers/040715/were-there-any-periods-major-deflation-us-history.asp)\n\nIf you’ve heard of the Great Depression, you know about deflation. You must be trolling. Not wasting my time anymore.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqqe10/",
                  "created": 1728837897,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrqv81q",
                      "score": -3,
                      "body": "Right before the Great Depression there was 20% inflation. The deflation was caused by inflation making everyone broke. Deflation wasn't the cause of the depression. Inflation was.\n\n https://www.macrotrends.net/2497/historical-inflation-rate-by-year",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqv81q/",
                      "created": 1728839482,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrr62vb",
                          "score": 5,
                          "body": "\"The deflation was caused by inflation.\"\n\nJust say you won't consider anything that doesn't support your convictions.",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr62vb/",
                          "created": 1728842878,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lrtwf4t",
                  "score": 2,
                  "body": "Switzerland had 5 years of slight deflation. The economy grew and unemployment fell nothing really bad happened. Its a small country though with high savings rate. Usually countries' economies crash when deflating.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrtwf4t/",
                  "created": 1728879098,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lrq2nvb",
          "score": 10,
          "body": "You can’t be serious. 8% deflation over the next three years would kill the economy and put us in a depression.",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrq2nvb/",
          "created": 1728829951,
          "depth": 1,
          "replies": [
            {
              "id": "lrqokki",
              "score": -1,
              "body": "Ya I would buy so much less if prices went down. I only buy when prices go up! I never buy things on sale or go to dollar stores. Only top dollar prices for me!",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqokki/",
              "created": 1728837298,
              "depth": 2,
              "replies": [
                {
                  "id": "lrqvpq0",
                  "score": 7,
                  "body": "Tell me you don’t know anything about economics without telling me you don’t know anything about economics. \n\nDeflation is bad for the economy because it discourages spending, investment, and consumption at the macro level. Sure, deflation would benefit inelastic essentials like food, but in a service based economy that relies heavily on capital investment and consumption, 8% deflation over several years would have disastrous effects. Deflation increases the purchasing power per dollar, which on the surface sounds good until you realize it also means wages will go down. It also discourages investment at all levels since rampant deflation would create a sentiment that it’s better to hold off since you can get more for your money later on. Why take the risk investing in the market or investing in R&D if you could earn 8% just having the money sit in a bank account. \n\nHigh deflation would also decimate people with mortgages or loans since the payments on the loan remain the same while the purchasing power per dollar (and their wages) would be going down. So their monthly mortgage payments would be going up over time in real terms. High inflation is also bad, but a small amount of inflation like 2% benefits everyone because it means spending and investment is encouraged since money is losing 2% of its value if it's doing nothing, and payments on mortgages and loans go down in real terms over long periods. Overall, deflation or zero inflation creates a culture of saving (like in Japan) and a small amount of inflation creates a culture of spending/investing.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqvpq0/",
                  "created": 1728839642,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrr8zkt",
                  "score": 3,
                  "body": "Literally 100% of economists — from across the ideological spectrum — would tell you an 8% deflation rate would be disastrous.\n\nEveryone and every business would hold onto their money because its value would grow just by doing nothing. Investments would stall, consumer spending would drop precipitously beyond bare necessities, hiring would freeze, wages would fall, jobs would increasingly be lost, and economic growth would reverse.\n\nRespectfully, you have no idea what you're talking about.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr8zkt/",
                  "created": 1728843787,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lru4axp",
                      "score": 1,
                      "body": "The US went from 1.4% to 7% between 2020-2021. They would have told you that was disastrous. That's not even enough time for peoples wages to adjust. Not to mention 2022 was still stuck at 6.5%.\n\n8% deflation would only bring prices back to where there were last year or the year before that. You wouldn't be able to keep most products in stock because people would be buying them so fast. Then guess what? The prices would go back up again. But somehow everyone has been brainwashed into this idea of a \"downward spiral of deflation.\" Everyone old enough to buy goods just experienced massive inflation. Do you think they are going to wait for even lower prices? They know it won't last, they will stock up like crazy while things are cheap. Thus creating inflation again.",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lru4axp/",
                      "created": 1728883862,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lru5kku",
                      "score": 1,
                      "body": "People hold on to their money so that they can inevitably spend it. Deflation doesn't make life free. They would save for a house, a car, big ticket items. Before you know it prices would be back up again. The idea of a downward spiral of deflation makes no sense. Especially in the modern world. Life moves way faster than in the 20s. Also there are generations of pent up demand. Families that have been put on hold because of all the not stop inflation. There were not multiple generations stalling on having a family back in the 20s.\n\nI know people with enough cash to buy a house from 10 years ago but get out bit now. They would finally be able to buy a house on the spot. There is plenty of cash waiting to be spent, but it's not quite enough for our inflationary environment so they keep saving, despite inflation. Deflation will unlock all of that pent up spending.",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lru5kku/",
                      "created": 1728884776,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ls07daz",
                          "score": 1,
                          "body": "Yeah, that's not how it works.\n\nYou can argue our monetary policy is too inflationary in recent decades, but I don't think any economist would think deflation would be beneficial. I'm not saying our recent price inflation hasn't been a problem.\n\nAnd I'm not one of these people who hangs on the word of any economist. After all, different economists have all sorts of different views. But I don't think any — from Austrian School'ers to Marxists — would think deflation would be a good idea.",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/ls07daz/",
                          "created": 1728977071,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lrp7sny",
          "score": 14,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp7sny/",
          "created": 1728815110,
          "depth": 1,
          "replies": [
            {
              "id": "lrr03bd",
              "score": 0,
              "body": "So your solution to inflation is increase it even more by increasing the price of labor? As we’ve seen in Seattle, that destroys a local economy.",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr03bd/",
              "created": 1728841015,
              "depth": 2,
              "replies": [
                {
                  "id": "lrr3xr7",
                  "score": 7,
                  "body": "Seattle's local economy is destroyed?",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr3xr7/",
                  "created": 1728842208,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrryb1b",
                  "score": 3,
                  "body": ">that destroys a local economy.\n\n>Seattle\n\nYou wot m8?",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrryb1b/",
                  "created": 1728851942,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lrq29un",
              "score": -20,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrq29un/",
              "created": 1728829813,
              "depth": 2,
              "replies": [
                {
                  "id": "lrq2unt",
                  "score": 18,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrq2unt/",
                  "created": 1728830018,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrqj36d",
                      "score": -7,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqj36d/",
                      "created": 1728835476,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrr6xgq",
                          "score": 2,
                          "body": "Using the example of a 1% wealth tax does not equate to penalizing businesses and wealth acquisition to the point of people not wanting to conduct business in the country.",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr6xgq/",
                          "created": 1728843146,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lrran8o",
                          "score": 1,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrran8o/",
                          "created": 1728844309,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lrq0pa0",
          "score": 5,
          "body": "I had someone here tell me that Jerome Powell pulled off a masterclass, and that it was in fact \"transitory\" all along. Ignoring the fact that they had to hike rates to the highest level in recent history to unfuck the mess that he started.",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrq0pa0/",
          "created": 1728829252,
          "depth": 1,
          "replies": [
            {
              "id": "lrqi2wb",
              "score": 3,
              "body": "Who started the mess? Trumps policies started the mess. Trump demanded 0% rates and even tried to get Powell to go below that at one point. Yes, NEGATIVE. This was to benefit the rich and facilitate debt/borrowing for HIMSELF. Trump started that mess",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqi2wb/",
              "created": 1728835144,
              "depth": 2,
              "replies": [
                {
                  "id": "lrsgasu",
                  "score": 7,
                  "body": "Other central banks around the world had already gone negative. I doubt Trump even understands how the federal funds rate works. His mental model is probably only as deep as “lower the rate = press the gas pedal, and that’s good for my re-election prospects”.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsgasu/",
                  "created": 1728858140,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lrsr7s2",
                  "score": 3,
                  "body": "Yep, Trump was demanding quantitative easing and zero interest rates BEFORE COVID.  There were three rate cuts in the last quarter of 2019.\nThe fed dumped trillions into the economy in 2020 and 2021 to counter Trumps economic failures, there is no way we couldn't have inflation.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsr7s2/",
                  "created": 1728862191,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrtalcs",
                      "score": 1,
                      "body": "Indeed! Thanks for the added context",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrtalcs/",
                      "created": 1728869777,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lsc5kth",
                      "score": 1,
                      "body": "We all know the real reason for inflation is corporate greed and price gouging,  By inflating the prices of EVERYTHING artificially corporations used COVID and the UKRANIE WAR as an excuse to make record profits at the cost of the everyday Joe, not only that with inflation came a massive rise in interest rates which led to the corporative executives best friends (banks) to offer credit and mortgages and interest rates which allowed BANKS to gain record profits.\n\n  \nCorporations and banks should be held accountable.",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lsc5kth/",
                      "created": 1729156626,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lsdig4z",
                          "score": 1,
                          "body": "I dont think you understand the extent of the injection of dollars by the fed and the rate adjustments. The M2 was at 15.4 trillion in Jan 2020 and by  April of 2022 it was at 22 trillion, a 42% increase. \nYes profits and gouging played a big part, but the extent of quantitative easing made it impossible to not have major inflation. \nhttps://fred.stlouisfed.org/series/WM2NS",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lsdig4z/",
                          "created": 1729178183,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lrqz051",
                  "score": 0,
                  "body": "Welcome to reddit, where Trump is reponsible for all of Americas woes.",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqz051/",
                  "created": 1728840676,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lrr9o11",
                      "score": 1,
                      "body": "The Fed probably would have acted the same regardless — as every other central bank did — so blaming Trump for that in particular is not accurate, but it's true he demanded it and even more.\n\nAnd he is responsible for numerous other terrible policies and harmful rhetoric.",
                      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr9o11/",
                      "created": 1728844005,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lrsrqsz",
                          "score": 4,
                          "body": "His response to Covid was a disater even before it hit.  \nRemoving our embedded scientists in China and WHO that were there to give and early warning, and they dismantling the pandemic early warning groups at the State Department and the White House was criminally incompetent.  Then the graft, corruption, laziness, ignorance, theft of state's property, and spread of misinformation really added to the disaster.  \nCovid could have happened anytime, but trump literally made everything worse, and it is fair to judge him on that.",
                          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsrqsz/",
                          "created": 1728862397,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lrq3pup",
              "score": 2,
              "body": "Arson fire fighter.  He screwed up housing badly.",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrq3pup/",
              "created": 1728830324,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lrpfzha",
          "score": 1,
          "body": "Deflation?",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpfzha/",
          "created": 1728820188,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrqwy5i",
          "score": -1,
          "body": "Definitely learn to read a book. Your words all all wrong.",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqwy5i/",
          "created": 1728840031,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrtcopm",
      "score": 3,
      "body": "I donrt really believe the data we're given for a minute. Inflation is clearly still high by consumer standards as realistic  prices of basic commodities are still extremely high. \n\nI think they're about to fuck around and find out. Cutting too fast while REAL inflation is still too high.",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrtcopm/",
      "created": 1728870601,
      "depth": 0,
      "replies": [
        {
          "id": "ls0647i",
          "score": 1,
          "body": "Are you expecting prices of basic commodities to go down with low inflation? Low inflation just means the price doesn’t go up very fast\n\nOnly deflation would reduce the prices across the board, which nobody wants to happen for all the other negative affects of that",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/ls0647i/",
          "created": 1728976204,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lrp3ogv",
      "score": 8,
      "body": "Jerome gonna have his own monument built soon.",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp3ogv/",
      "created": 1728812249,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrq3lp7",
      "score": 6,
      "body": "I think inflation may rise again. FED won't cut generously again.\n\nStock market is over priced and may enter a correction.",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrq3lp7/",
      "created": 1728830283,
      "depth": 0,
      "replies": [
        {
          "id": "lrr21zx",
          "score": 5,
          "body": "Inflation rose even just this week to 2.4. I dunno what this post is even pointing to. Energy, insurance, and housing will rise in the next year.",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr21zx/",
          "created": 1728841623,
          "depth": 1,
          "replies": [
            {
              "id": "lrrwxgn",
              "score": 2,
              "body": "Exactly",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrrwxgn/",
              "created": 1728851493,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrrsfym",
      "score": 4,
      "body": "It did more than that…. It destroyed the labor market and the middle class.",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrrsfym/",
      "created": 1728850043,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrsf6ur",
      "score": 1,
      "body": "TLT is looking ripe, but I admittedly don't really understand it on a deep level. It got hyped and then abandoned recently, do you guys think it's a buy? It feels like there is very little downside, I'm considering it for one of my safer picks.",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrsf6ur/",
      "created": 1728857736,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrz7k7y",
      "score": 1,
      "body": "Get ready for the asset bubble and *real life inflation:price gouging* to get even worse",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrz7k7y/",
      "created": 1728958636,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrss8ne",
      "score": 1,
      "body": "Sure thing pal",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrss8ne/",
      "created": 1728862588,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrv7tk2",
      "score": 1,
      "body": "But they pretty much didnt tho, did they?",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrv7tk2/",
      "created": 1728909401,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lrpichv",
      "score": -10,
      "body": "Everything is so absolutely fucked lol. 2% sick. Thank god they tamed inflation after destroying any shot at making life affordable. On the brink of a depression and any can kick to just make people think there is hope is pathetic. No shot at deflation to return to normal so good luck. But hey the stock market is delusional at all time highs so silver lining",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpichv/",
      "created": 1728821425,
      "depth": 0,
      "replies": [
        {
          "id": "lrpx77c",
          "score": 11,
          "body": "The economy is good. If this is your outlook on it’s it’s not based in reality and is probably a reflection of a skill issue.",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpx77c/",
          "created": 1728827953,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lrqrqmj",
          "score": 1,
          "body": "Deflation is terrible for everyone.\n\nYou seriously think that deflation makes economies better or more fair? It does the opposite.",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrqrqmj/",
          "created": 1728838341,
          "depth": 1,
          "replies": [
            {
              "id": "lrr9ugc",
              "score": 2,
              "body": "Some people may luck out in deflation. For example, if someone owned 50% of their investments in bonds and t-bills, the price of the bonds would go up as rates are lowered to zero percent again.\n\nDuring deflation when nobody wants to spend money or borrow at 3% to buy a home, the bond holders could sell some high-priced bonds to the QE banks when bond prices are high and rates are low, and buy houses at bargain prices during times of super low mortgage rates.\n\nThis is why it's good to keep a few bonds in your investments because the next recession or depression cycle could unexpectedly appear at any time. Good quality long term maturity bonds help hedge recession and low rates. T-bills help hedge high rates set by the Fed.",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrr9ugc/",
              "created": 1728844061,
              "depth": 2,
              "replies": [
                {
                  "id": "lrt6x28",
                  "score": -1,
                  "body": "Never good to have bonds in a portfolio",
                  "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrt6x28/",
                  "created": 1728868298,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lrp5ugy",
      "score": -4,
      "body": "If the Fed is happy with the way things are, why would they change things?",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp5ugy/",
      "created": 1728813762,
      "depth": 0,
      "replies": [
        {
          "id": "lrp8e8e",
          "score": 13,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrp8e8e/",
          "created": 1728815522,
          "depth": 1,
          "replies": [
            {
              "id": "lrq7omy",
              "score": 2,
              "body": "Seems like near perfect analogy. Below are just me thinking aloud.\n\nIn other words, we do not want to stifle the animal spirit(or momentum) of the economy, since it takes a long time to get it back again). Back in 2009 both the federal govt and fed did not do much hence the recovery took a very long time.\n\nFed's biggest worry is: wage price spiral which was a problem after pandemic due to labor shortage, now it does not seem to be a problem since companies are not hiring aggressively.\n\nThat said, I don't think Fed is going to cut rates aggressively, rates are not very high at the moment, we do not want inflation to come back again, that will set things back. They will go slow and easy, 25bps cuts, unless inflation is really down below 2.5% consistently, at the moment it is not below 2.5% and it is too early, we had only like 4-5 months of inflation below 3%.",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrq7omy/",
              "created": 1728831690,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lrps5kj",
              "score": 1,
              "body": "I really like this analogy, why are you getting downvoted? Can someone explain it please?",
              "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrps5kj/",
              "created": 1728825933,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lrpf09r",
      "score": -5,
      "body": "Truck prices are more or less back to where they were pre pandemic.",
      "permalink": "/r/stocks/comments/1g2lc41/the_federal_reserve_may_have_pretty_much_just_hit/lrpf09r/",
      "created": 1728819651,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The Federal Reserve is nearing its 2% inflation target, which could lead to more interest rate cuts.",
    "companies": [
      "Goldman Sachs",
      "Cleveland Fed",
      "PNC"
    ],
    "tickers": [],
    "main_ticker": []
  }
}