{
  "title": "Get in on Uranium Now",
  "score": 3015,
  "selftext": "**Since 2020, the price of uranium has gone from $21/lb to a high of $106/lb in Feb 2024. The price has experienced a slight pull back since then to $83/lb. I believe this 4-5x change in the price of uranium to be small compared to what lies ahead, and I will explain the reasons why in this paper.** \n\n**What is Uranium?**\n\nUranium is an abundant, radioactive metal naturally occurring in earth's crust. The vast purpose of it today is used for creating nuclear fuel to provide energy. It is one of the cleanest burning fuels and very easy on the environment. Think of Uranium as a gas pump, there are different options you can choose between based on grade. We will focus on the two main isotopes for Uranium. When it is mined, approximately 99.3% is uranium-238 and 0.7% is uranium-235.\n\nU-238 is a critical component of plutonium production which in itself gives a TON of demand. The major application of Uranium in the military sector is depleted Uranium (DU). DU is mostly U-238 after U-235 has been removed. It is used to create armor piercing rounds and military projectiles. The high density of DU makes weapons highly effective. There are other important uses of U-238, such as counterbalancing aircraft, though we are not focusing on those.\n\nU-235 is even more important because for the most part, this is what fuels nuclear reactors. In order to power a nuclear reactor, the concentration of U-235 needs to be 3-5% instead of 0.7%. The higher concentration makes it fissionable, meaning it can power light-water reactors which are the most common reactor design in the USA (United States Nuclear Regulatory Commission). One kilogram (2.2 LBS) of U-235 produces as much energy as 3,306,930 pounds of coal.\n\n**HALEU**\n\nHigh-assay low-enriched uranium. A crucial material needed to deploy advanced nuclear reactors. Currently, HALEU is not commercially available from US based suppliers. Boosting domestic supply could spur the development of advanced reactors in the US (Energy.gov). In November, the DOE reached a key milestone under its HALEU demonstration project, when a company produced the nation’s first 20 kilograms of HALEU. Thus, providing a first of its kind production in the United States in more than 70 years. Amid growing efforts to secure a reliable domestic nuclear fuel supply, the DOE has awarded contracts to six companies as part of an $800 million initiative to bolster the deconversion of high-assay low-enriched uranium (Roan, 2024).\n\nThe existing fleet of US reactors run on enriched uranium up to 5% with U-235. However, most advanced reactors require HALEU which is enriched between 5% to 20% in order to achieve smaller and more versatile designs with the highest standards of safety, security and nonproliferation. HALEU also allows developers to optimize their systems for longer life cores, increased efficiencies, and better fuel utilization. Together, the US, Canada, France, Japan and the UK have announced collective plans to mobilize $4.2 billion in government-led spending to develop safe and secure nuclear energy supply chains (Energy.gov). \n\nAs we now know, enriched uranium is crucial. Although, the enrichment process is very costly. Russia is the biggest player in the enrichment process. They are responsible for roughly 44% of the world’s enrichment capacity and supply approximately 35% of imported nuclear fuel to the US. As of August 12th, 2024, Uranium imports into the USA from Russia are outlawed. This allows $2.7 billion in funding to build out the U.S uranium industry specifically, to increase production of LEU and HALEU. The DOE estimates that US utilities have roughly 3 years of LEU available through existing inventory or pre-existing contracts. To ensure no plants are disrupted, a waiver process is in order to allow some imports of LEU from Russia to continue for a limited time. “In the meantime, we’re taking aggressive steps to establish a secure and reliable uranium supply market” (Energy.gov). \n\n**Uranium Supply**\n\nNow, the supply that was once held of uranium is running out. “The inventory overhang that was so damaging to the market for almost a decade has been largely consumed, and going forward, we’re going to have an increasing reliance on primary supply” (World Nuclear News). Idled mines are now starting production again, as well as increases in mines under development, and planned mines. “There is no doubt that sufficient uranium resources exist to meet future needs, but producers have been waiting for the market to rebalance before starting to invest in new capacity and bring idled capacity back into operation. This is now happening (World Nuclear News).\n\nThe uranium market has been facing a supply deficit for years due to underinvestment. The problem is that uranium mines take a long time and require a ton of capital to get up and running. A mine can take 10-15 years to begin production AFTER they are opened. \n\nAs with other minerals, investment in geological exploration generally results in increased known resources. Over 2005 and 2006, exploration efforts resulted in the world’s known uranium resources increasing by 15% (World Nuclear Association). Therefore, there is no need to anticipate any uranium shortage.The world’s current measured resources of uranium will last about 90 years. This represents a higher level of assured resources than is normal for most minerals. There is nearly limitless supply because most of it has not been discovered due to little investment in mining and exploration. To be clear, although we know this uranium exists, that does not mean it has been mined. \n\nPrimary Supply - This type of supply refers to uranium extracted directly from mining.The primary supply has been under heavy pressure in recent years due to low uranium prices. Low prices lead to reduced mining operations. This is because mining is incredibly expensive and companies won’t do it if there is no good price incentive at which they could sell the uranium. It is forecasted that uranium mining will not meet the reactor demands for at least 15 years. Now, it is also estimated that by 2035, primary uranium production will decrease by 30% due to resource depletion and mine closures. New mines will only be able to compensate for the capacity of the exhausted mines.\n\nSecondary Supply - This refers to all uranium that is not sourced directly from mining but from other inventories and recycled materials. This includes, civil stockpiles, military stockpiles, recycled uranium and enrichment tails. Civil stockpiles (uranium reserves held by utilities, hedge funds, and government) grew immensely after the 2011 Fukushima disaster. Many reactors shut down due to the worries surrounding uranium, and investment in the nuclear sector decreased. Due to this, there was a large oversupply of uranium. Since then, these stockpiles have been largely drawn upon to meet reactor demand, instead of relying on primary supply. So, utilities have been relying on their inventory to fuel their reactors, instead of getting fresh uranium from mines. This has caused a gradual depletion of their reserves. There is no mathematical way to rely on reserves anymore. The ONLY option is to produce uranium in order to keep reactors operational, while meeting future demand.\n\n**Uranium Demand** \n\nThe United States, China, and France represent around 58% of global uranium demand. Uranium demand can be characterized as a predictable function of the number of operating nuclear power plants, their capacity factors and fuel burn up levels. As of April 30th, 2024, there are 94 operating nuclear reactors in the United States. The global count of operating nuclear reactors is 440. These account for 9% of the world's electricity. Currently, there are 60 nuclear reactors in production across 16 countries spanning into 2030. About 90 more reactors have been planned and over 300 have been proposed. \n\nLooking ten years ahead, the uranium market is expected to grow. The 2023 World Nuclear Association’s Nuclear Fuel Report shows a 28% increase in uranium demand over 2023-2030. This same report predicts a 51% increase in uranium demand for the decade 2031-2040. Global demand for electricity may rise 165% by 2050 while at the same time, 101 countries have committed to net-zero carbon emission goals and are actively pursuing a shift to clean energy.\n\nhttps://preview.redd.it/ld8y5xf7u4vd1.png?width=975&format=png&auto=webp&s=8cd6d742feca0b2df30d583972a4ed949e064941\n\n**Global Price of Uranium Last 25 Years (USD/Lbs)**\n\n**Uranium Production**\n\nThe main producers of uranium are Kazakhstan, Canada, Namibia, Australia, and Uzbekistan. Kazakhstan is the major producer. In 2022, they produced 43% of the world’s uranium. The company Kazatomprom is responsible for the massive production within the country. Very big news came out recently stating they have slashed their production target for 2025 by 17%. This is due to project delays and sulfuric acid shortages (a critical component of uranium extraction). They are expected to produce 25,000-26,500 tonnes of yellowcake (a concentrated form of uranium ore produced during the early stage of processing).This move is likely to continue the upward pressure on uranium prices. This slash in production is occurring while Kazatomprom has their lowest reported uranium inventory levels since 1997 of 4,142 tonnes of uranium, down 31% from the previous year (Dempsey, 2024). “This is a structural problem. It won’t just be the west saying this is an issue for us; it will also be Russia and China saying it’s a problem for our new nuclear power plants” (Nick Lawson, CEO of Ocean Wall). \n\nUranium prices have been low for decades due to oversupply and stockpiles. This has made it less appealing to develop new mines and instead, rely on existing mines and supply. However, the US and other countries are showing increased signs of uranium mining at an alarming rate. In the first quarter of 2024, the United States produced more than 82,000 LBS of uranium which is more than the entire 2023 production. In Q2 of  2024, production increased to 97,709 LBS, an 18% increase from Q1 2024. While this increased production is significant for a domestic supply, it does not begin to put a dent in the global deficit. It simply goes to show the US is beginning their own production of uranium. \n\nhttps://preview.redd.it/0i0y5ta8u4vd1.png?width=975&format=png&auto=webp&s=fea4c5c8d96e63e0991cbee91763b86ffdd1d513\n\n**United States Uranium Production 2000-2024 Q2 lbs**\n\nIn a recent interview with Justin Huhn, a uranium market expert, he stated, “YTD there has been 54 million pounds contracted. Demand pulled back temporarily and when that happened, price kept rising. It's a hugely important indicator that when demand comes back in, which it is starting to, the prices are going higher. We're starting to see early signs of that. Honestly, I think we are on the cusp of a very large movement in the coming weeks. We're going to see a competitive environment for limited supply. That's what is coming next. The ceiling in the contracts tells you where the price is going. The 3 and 5 year forward tells you where the spot is going. Every piece of evidence in the physical market is telling us that prices are going higher.\"\n\n\"Companies need uranium and they aren't going to not buy it at price xyz. Now, could we get to a point where logically the price of uranium utility does not justify continued operations? That's possible. And unless we have a balanced market, that might be the limiting upside factor. Price would have to be somewhere in the $700s for the average utility to not afford to buy uranium in order to operate their facilities.”\n\nhttps://preview.redd.it/tryxvqs8u4vd1.png?width=975&format=png&auto=webp&s=9d232e82dee2be8fcd1a85af980584987b2bcb4d\n\n**World Uranium Production vs Reactor Requirements, 1945-2022 tU**\n\n# Conclusion \n\nAlthough we’ve seen drastic changes in the price of uranium already, I believe the bull market is just beginning. There is immense demand, and production simply can’t meet the requirements. Prospective mines can take 10-15 years to become operational, while 30% of current mines are estimated to be depleted by 2035. There is not enough time available for the uranium supply to meet the demand despite increases in production. Companies are willing and obligated to secure nuclear fuel at almost any price. Increased investment into nuclear energy is happening from a governmental side and big tech. Amazon, Microsoft and Google have all come out with news recently, investing insane amounts into nuclear. Countries are uniting in the fight against climate change to establish a global supply of clean, zero-carbon energy. Therefore, I believe that as the supply continues to dwindle and demand continues to increase, the fight for uranium that will ensue is going to send the price to levels we have never before seen in history. \n\n**Investment Ideas**\n\nI think mining companies are best set up to gain from this market. A high uranium price means they earn higher revenues by selling it. This also allows them to further develop mines and explore new areas, increasing overall production. We are in a seller dominated market where prices are based on bidding wars between utilities, governments, and hedge funds. These mining companies are Cameco (CCJ) currently trading at $50.86 and NexGen Energy (NXE) trading at $7.26. I also like the mining ETF Range Nuclear Renaissance Index (NUKZ) trading at $38.31 and Sprott Uranium Miners ETF (URNM) trading at $48.26. The other companies I like in this sector are Clean Harbors, Inc. trading at $257.48 and Constellation Energy (CEG) trading at $265.86. Clean Harbors has a dominant position in the market for the handling and disposal of nuclear waste. They also have very good management. I’d say they are my favorite pick out of the entire sector. Aware that this is WSB, YOLO calls on URNM is the play. This is a chance to create generational wealth.\n\n**Disclaimer** \n\n**This is not financial advice.**\n\nEdit - These companies are trading higher now. I wrote this DD a few days ago.",
  "link_flair_text": "DD",
  "id": "1g51fj0",
  "num_comments": 724,
  "created_utc": 1729090811,
  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/",
  "comments": [
    {
      "id": "ls7kqvp",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 7 | **First Seen In WSB** | 3 weeks ago\n**Total Comments** | 8 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1g4leam/why_the_uranium_bull_market_will_continue/) [x](https://www.reddit.com/r/wallstreetbets/comments/1g4m0m6/why_i_believe_the_bull_market_for_uranium_will/) [x](https://www.reddit.com/r/wallstreetbets/comments/1g4mt99/why_i_believe_the_bull_market_for_uranium_will/) [x](https://www.reddit.com/r/wallstreetbets/comments/1fn1c62/why_i_believe_palantir_pltr_will_continue_to/) [x](https://www.reddit.com/r/wallstreetbets/comments/1fn2tq4/why_i_believe_palantir_pltr_will_continue_to/) [x](https://www.reddit.com/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/) \n**Account Age** | 6 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7kqvp/",
      "created": 1729090825,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls7m7gc",
      "score": 2036,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7m7gc/",
      "created": 1729091308,
      "depth": 0,
      "replies": [
        {
          "id": "ls892wr",
          "score": 142,
          "body": "Half-life 3",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls892wr/",
          "created": 1729098590,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lscmeoo",
          "score": 21,
          "body": "By the time I read his post, all of them already pumped and dumped.",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/lscmeoo/",
          "created": 1729166349,
          "depth": 1,
          "replies": [
            {
              "id": "lscojzb",
              "score": 7,
              "body": "Thank god it was so long, or I’d have been left holding radiated bags.",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/lscojzb/",
              "created": 1729167334,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ls9xwjw",
          "score": 83,
          "body": "**TL,DR from ChatGPT**\n\n**Summary: Uranium Market Report**\n\n**Price Trends:** Since 2020, uranium prices have surged from $21/lb to $106/lb in February 2024, currently stabilizing at $83/lb. The report suggests that this increase is only the beginning, with further growth expected.\n\n**Uranium Overview:** Uranium is a naturally occurring radioactive metal, primarily used for nuclear energy. The key isotopes are U-238 (used in military applications) and U-235 (used to fuel nuclear reactors). U-235 is particularly efficient, with one kilogram producing energy equivalent to over 3 million pounds of coal.\n\n**HALEU and Enrichment:** High-assay low-enriched uranium (HALEU) is critical for advanced nuclear reactors. The U.S. is investing in domestic HALEU production to reduce reliance on imports, especially from Russia, which controls a significant portion of global enrichment capacity. The U.S. has started producing HALEU domestically, supported by government initiatives.\n\n**Supply Challenges:** Uranium supply is tightening due to depleted inventories and underinvestment in mining. Mines are expensive and slow to develop, often taking 10-15 years to become operational. The market is shifting to rely more on primary mining as secondary supplies dwindle. Primary production is forecasted to decrease by 30% by 2035, highlighting a potential supply gap.\n\n**Demand Growth:** The U.S., China, and France account for 58% of global uranium demand. As of 2024, there are 440 operating reactors worldwide, with many more planned. The World Nuclear Association predicts a 28% increase in demand from 2023-2030 and a 51% rise from 2031-2040, driven by global clean energy goals.\n\n**Global Production:** Kazakhstan is the leading producer, supplying 43% of global uranium. However, production cuts due to delays and shortages could put further pressure on prices. The U.S. has also increased its domestic uranium production in 2024, signaling a shift toward self-reliance.\n\n**Investment Insights:** The report suggests that mining companies are well-positioned to benefit from rising uranium prices. Companies like Cameco, NexGen Energy, and ETFs such as URNM and NUKZ are highlighted as investment opportunities. Big tech companies like Amazon and Google are also investing in nuclear energy, emphasizing the growing interest in this sector.\n\n**Conclusion:** The report anticipates a bullish market for uranium due to increasing demand and limited supply. With countries seeking clean energy and reducing carbon emissions, uranium's role as a key energy source is set to grow, potentially driving prices to unprecedented levels.\n\n**Investment Disclaimer:** The recommendations are not financial advice.",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls9xwjw/",
          "created": 1729118263,
          "depth": 1,
          "replies": [
            {
              "id": "ls9xwky",
              "score": 29,
              "body": "PUT YOUR HANDS UP mardie007!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls9xwky/",
              "created": 1729118264,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ls7nk0e",
      "score": 1537,
      "body": "Too many words. Where I put monies?",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7nk0e/",
      "created": 1729091747,
      "depth": 0,
      "replies": [
        {
          "id": "ls7xarr",
          "score": 638,
          "body": "All in UUUU\n\nhttps://preview.redd.it/81o2s6er65vd1.jpeg?width=1290&format=pjpg&auto=webp&s=789bc2d2b07be4b47c54358d9503253e7f9a5c8f",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7xarr/",
          "created": 1729094860,
          "depth": 1,
          "replies": [
            {
              "id": "ls8dyyu",
              "score": 405,
              "body": "Buying power is a huge buy signal",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8dyyu/",
              "created": 1729100122,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ls8a1ok",
              "score": 193,
              "body": "Puts on Uranus and calls on UwU",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8a1ok/",
              "created": 1729098891,
              "depth": 2,
              "replies": [
                {
                  "id": "ls97qub",
                  "score": 36,
                  "body": "What the hell is even that??",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls97qub/",
                  "created": 1729109499,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lsaioe6",
                      "score": 65,
                      "body": "Daddy chill",
                      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/lsaioe6/",
                      "created": 1729126101,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ls8ggrn",
              "score": 30,
              "body": "I like that buying power, force is strong with us, Uranium it is.",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8ggrn/",
              "created": 1729100899,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ls8btju",
              "score": 34,
              "body": "I like it. Sound of apes",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8btju/",
              "created": 1729099446,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ls8v448",
              "score": 5,
              "body": "Is Public good for options?",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8v448/",
              "created": 1729105489,
              "depth": 2,
              "replies": [
                {
                  "id": "ls94p94",
                  "score": 9,
                  "body": "No fees, but still lacking a lot of strategies. I prefer Fidelity. My boring portfolio is on Fidelity.",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls94p94/",
                  "created": 1729108542,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ls8h40w",
              "score": 11,
              "body": "I don’t even know if this company does uranium. Just general overall energy. But WTF up 17%!",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8h40w/",
              "created": 1729101098,
              "depth": 2,
              "replies": [
                {
                  "id": "ls9uv0w",
                  "score": 11,
                  "body": "Pretty sure they do uranium..",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls9uv0w/",
                  "created": 1729117143,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lsb7dhq",
                  "score": 8,
                  "body": "They're in uranium and also basically every radioactive mineral that's naturally available. They're gonna be the radioactive minerals equivalent of Rio tinto in the next 10 years",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/lsb7dhq/",
                  "created": 1729135916,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ls81lhz",
          "score": 96,
          "body": "Uuuu, dnn\n\nBoth popped 14% today.",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls81lhz/",
          "created": 1729096233,
          "depth": 1,
          "replies": [
            {
              "id": "ls879kh",
              "score": 124,
              "body": "Buy high, haha. There have been like 5 trends of ups and downs in the past year going up 10% then down 15%. I’d venture to say it might not be the best time to buy today right after another pump, but who knows.",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls879kh/",
              "created": 1729098012,
              "depth": 2,
              "replies": [
                {
                  "id": "ls8ch83",
                  "score": 56,
                  "body": "too late all in 100000 after 15% pump to the moon baby make me rich!",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8ch83/",
                  "created": 1729099651,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ls91sku",
                  "score": 19,
                  "body": "You could say that Uranium is volatile",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls91sku/",
                  "created": 1729107624,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ls8jrqk",
                  "score": 13,
                  "body": "Bought at 0.75 and 3.28. It has seen a lot of ups and downs. I'm holding",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8jrqk/",
                  "created": 1729101919,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ls9xgb5",
              "score": 8,
              "body": "oklo is now up 45% today",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls9xgb5/",
              "created": 1729118097,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ls8dsiu",
              "score": 9,
              "body": "Ooh that chart looks horrible. I’m not a TA guy, but it doesn’t look like the trend is your friend there.",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8dsiu/",
              "created": 1729100065,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ls8i5y0",
          "score": 84,
          "body": "Hi,\n\nA couple uranium sector ETF's:\n\n* Sprott Uranium Miners ETF (URNM): 100% invested in the uranium sector: [https://sprottetfs.com/urnm-sprott-uranium-miners-etf/](https://sprottetfs.com/urnm-sprott-uranium-miners-etf/)\n* Global X Uranium index ETF (HURA): 100% invested in the uranium sector\n* Sprott Junior Uranium Miners ETF (URNJ): 100% invested in the junior uranium sector\n* Global X Uranium ETF (URA): 70% invested in the uranium sector\n\nLook at their holdings to get an idea on individual uranium companies\n\n**This isn't financial advice. Please do your own due diligence before investing**\n\nCheers",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8i5y0/",
          "created": 1729101423,
          "depth": 1,
          "replies": [
            {
              "id": "lsa3xht",
              "score": 33,
              "body": "Yes sir, this man right here, he’s providing financial advice without a license! THIS MAN RIGHT HERE!",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/lsa3xht/",
              "created": 1729120504,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ls7s1xc",
          "score": 106,
          "body": "SMR /OKLO for AI nuclear",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7s1xc/",
          "created": 1729093196,
          "depth": 1,
          "replies": [
            {
              "id": "ls7v66s",
              "score": 215,
              "body": "the more buzz words the better",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7v66s/",
              "created": 1729094186,
              "depth": 2,
              "replies": [
                {
                  "id": "ls93fdt",
                  "score": 50,
                  "body": "> AI nuclear\n\nI'm sold af. Bring on the radioactive sexbots.",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls93fdt/",
                  "created": 1729108142,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ls86w54",
                  "score": 19,
                  "body": "Yeah ai and nuclear are some scary buzzwords grampa 👴👴👴",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls86w54/",
                  "created": 1729097896,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ls8945i",
                      "score": 24,
                      "body": "Wtf even is ai nuclear?",
                      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8945i/",
                      "created": 1729098601,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ls8i5sm",
                          "score": 18,
                          "body": "how the world will end",
                          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8i5sm/",
                          "created": 1729101422,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ls89bxs",
                          "score": 14,
                          "body": "Small modular reactors that fit in a warehouse to power AI supercomputers/data centers",
                          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls89bxs/",
                          "created": 1729098669,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ls7x1qz",
              "score": 9,
              "body": "🚀🚀🌙",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7x1qz/",
              "created": 1729094779,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ls82zro",
              "score": 8,
              "body": "Damn, why are these two up so much today?",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls82zro/",
              "created": 1729096677,
              "depth": 2,
              "replies": [
                {
                  "id": "ls83b64",
                  "score": 29,
                  "body": "Google deal using SMR tech\n \nAI data centers will be powered by this technology",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls83b64/",
                  "created": 1729096778,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lsa2ein",
              "score": 5,
              "body": "up 40+%   \ngonna be a dump soon",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/lsa2ein/",
              "created": 1729119929,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ls8r4bo",
          "score": 10,
          "body": "Pumpkin spot prices are hot right now. I'd buy a lot of pumpkin futures for 11/1 delivery based on the trendline I'm looking at.",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8r4bo/",
          "created": 1729104237,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ls7s9tm",
          "score": 49,
          "body": "Perhaps you can just read the section \"Investment Ideas\". Although, in order to understand the gravity of the uranium market, do yourself the favor and read the entire report.",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7s9tm/",
          "created": 1729093265,
          "depth": 1,
          "replies": [
            {
              "id": "ls7xs74",
              "score": 137,
              "body": "Lol “read”",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7xs74/",
              "created": 1729095015,
              "depth": 2,
              "replies": [
                {
                  "id": "ls7z3wn",
                  "score": 54,
                  "body": "why read when i can copy and paste the text into an nuclear reactor powered AI engine and ask for a summary?",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7z3wn/",
                  "created": 1729095436,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ls87yh2",
                      "score": 17,
                      "body": "Nuclear powered AI? Bullish af.",
                      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls87yh2/",
                      "created": 1729098233,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ls8mxt1",
              "score": 15,
              "body": "\"ChatGPT - summarize this report like I'm on my third booster.\"",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8mxt1/",
              "created": 1729102922,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ls9skhc",
          "score": 4,
          "body": "Uranium go boom.",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls9skhc/",
          "created": 1729116315,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ls7ovrx",
          "score": 21,
          "body": "LAC!",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7ovrx/",
          "created": 1729092174,
          "depth": 1,
          "replies": [
            {
              "id": "ls7r55w",
              "score": 27,
              "body": "Isnt that lithium",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7r55w/",
              "created": 1729092903,
              "depth": 2,
              "replies": [
                {
                  "id": "ls7tt09",
                  "score": 67,
                  "body": "close enough",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7tt09/",
                  "created": 1729093752,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ls7uyaq",
                  "score": 22,
                  "body": "No it’s a basketball team",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7uyaq/",
                  "created": 1729094117,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ls84o3b",
                      "score": 12,
                      "body": "People from Lithiumania are Lithiums",
                      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls84o3b/",
                      "created": 1729097204,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ls86qz9",
                          "score": 8,
                          "body": "“People from Phoenix are called Phoenicians.”",
                          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls86qz9/",
                          "created": 1729097852,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ls8b9jv",
                              "score": 6,
                              "body": "Known for their window treatments",
                              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8b9jv/",
                              "created": 1729099273,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ls8sxbe",
                                  "score": 8,
                                  "body": "This guy knows Phoenicians.",
                                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8sxbe/",
                                  "created": 1729104802,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ls7u0of",
                  "score": 6,
                  "body": "Basically the same thing, right?",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7u0of/",
                  "created": 1729093820,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ls7sjr4",
          "score": 6,
          "body": "$NNE $CCJ ![img](emote|t5_2th52|4276)",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7sjr4/",
          "created": 1729093353,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ls7ytzp",
          "score": 6,
          "body": "Add NuScale Power Corp to the list",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7ytzp/",
          "created": 1729095346,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ls7w73u",
      "score": 1289,
      "body": "These posts always come out after the 30% pump, never before...Way to predict the present.  \n\nThe power of 2 human eyes.",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7w73u/",
      "created": 1729094506,
      "depth": 0,
      "replies": [
        {
          "id": "ls86vjk",
          "score": 138,
          "body": "just gotta chase that green dildo...",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls86vjk/",
          "created": 1729097891,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ls8mgmv",
          "score": 226,
          "body": "people been posting about the uranium thesis multiple times a week. the posts only get traction after the 30% pump because that’s when people start paying attention",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8mgmv/",
          "created": 1729102769,
          "depth": 1,
          "replies": [
            {
              "id": "ls8ps3s",
              "score": 93,
              "body": "Thanks Gold, I couldn't agree more.\n\nI tried posting this on here days ago, but it kept getting banned because the links I had for my sources. Good thing there is a whole lot more room for these stocks to run :)",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8ps3s/",
              "created": 1729103821,
              "depth": 2,
              "replies": [
                {
                  "id": "ls8rrgk",
                  "score": 27,
                  "body": "it’s a classic, people only care to hear out the thesis once the chart looks good and psych themselves out because it’s “too late”. it’s so easy to just go along with consensus and never think critically only to then express frustration that you miss every train",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8rrgk/",
                  "created": 1729104437,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ls855sq",
          "score": 25,
          "body": "And these post never shows their positions.\nLooks like pump and dump and scam 100% \n\nMost of the company’s make year by year less income, how should this go good???\n\nThe whole world goes in renewable technologies, nuclear facilities are good for the next 5 to 15 years, then they will die…\n\nAnd currently the fusion technology reaches day by day better results, so I will pass…",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls855sq/",
          "created": 1729097359,
          "depth": 1,
          "replies": [
            {
              "id": "ls8uu7k",
              "score": 83,
              "body": "Pump and dump of a several billion dollar global commodities market? Lmao?\n\nThe amount of upvotes on this really demonstrates the level of regardation in this sub",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8uu7k/",
              "created": 1729105403,
              "depth": 2,
              "replies": [
                {
                  "id": "ls917n8",
                  "score": 17,
                  "body": "people screech P&D when they miss the plain obvious.",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls917n8/",
                  "created": 1729107438,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ls953k3",
                      "score": 28,
                      "body": "Its ridiculous lmao, its like the people who yell short squeeze non stop ever since gamestop.\n\nThe idea that a retail investor could pump and dump a commodities market as large as uranium is like, hilariously regarded.",
                      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls953k3/",
                      "created": 1729108666,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ls953n4",
                          "score": 14,
                          "body": "Squeeze deez nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls953n4/",
                          "created": 1729108667,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ls959dp",
                              "score": 3,
                              "body": "😍",
                              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls959dp/",
                              "created": 1729108717,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ls8bwn1",
              "score": 38,
              "body": "About 60 reactors are under construction across the world. A further 110 are planned. \n\n[Source](https://world-nuclear.org/information-library/current-and-future-generation/plans-for-new-reactors-worldwide)",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8bwn1/",
              "created": 1729099472,
              "depth": 2,
              "replies": [
                {
                  "id": "ls90i60",
                  "score": 7,
                  "body": "How many are under deconstruction tho? Germany has none left I think.",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls90i60/",
                  "created": 1729107211,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lsbhs6f",
                      "score": 7,
                      "body": "This is literally the only country in the world who is shutting them down. Everyone else is reopening, and building new ones. Wake up, the wind has changed.",
                      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/lsbhs6f/",
                      "created": 1729141129,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lsc6njr",
                      "score": 4,
                      "body": "Yeah germany is about as regarded as the people in this sub. They're the only country rhat's actively shutting them down while everyone else is planning/constructing new ones or bringing old ones back online",
                      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/lsc6njr/",
                      "created": 1729157391,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lsc8ylo",
                      "score": 8,
                      "body": "Germanys too busy importing immigrants and losing their identity lol",
                      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/lsc8ylo/",
                      "created": 1729158971,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ls7rx5y",
      "score": 243,
      "body": "Sorry I can't read more then 2 sentences a day. I just need 3 or 4 letters.",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7rx5y/",
      "created": 1729093153,
      "depth": 0,
      "replies": [
        {
          "id": "ls8cg6s",
          "score": 63,
          "body": "URNM",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8cg6s/",
          "created": 1729099642,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ls8gybo",
          "score": 14,
          "body": "$BSENF or $FIND if you really can't read 5 letters",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8gybo/",
          "created": 1729101049,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ls7x9vj",
          "score": 5,
          "body": "How do you want to approach the issue? Mines, utilities, suppliers or volatility?",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7x9vj/",
          "created": 1729094852,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ls7sz9x",
      "score": 79,
      "body": "Been in and out of uranium for a few years and sold recently after having caught 30%+ move on CCJ but went back in yesterday like a true regard ![img](emote|t5_2th52|8882)\n\n400K+ position on ☢️. [https://imgur.com/a/4HAy6Pb](https://imgur.com/a/4HAy6Pb)",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7sz9x/",
      "created": 1729093489,
      "depth": 0,
      "replies": [
        {
          "id": "ls8tfef",
          "score": 15,
          "body": "> Been in and out of uranium for a few years\n\nI've been in CCJ since Fukushima lol. Finally sold today after basically 2X'ing (not great, I def caught a falling knife even though I resolutely believed in Nuclear). And then I read this haha.",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8tfef/",
          "created": 1729104957,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ls7ol4t",
      "score": 259,
      "body": "Where were you 3 years ago?",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7ol4t/",
      "created": 1729092079,
      "depth": 0,
      "replies": [
        {
          "id": "ls7sq1l",
          "score": 204,
          "body": "Focused on AI / big tech. People will be saying the same thing in another 3 years.",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7sq1l/",
          "created": 1729093409,
          "depth": 1,
          "replies": [
            {
              "id": "ls7tbva",
              "score": 134,
              "body": "The purpose of uranium is just to power AI/ big tech anyways\n\nSo were still end up focused on AI, just figuring out what are the shovels to sell to profit",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7tbva/",
              "created": 1729093602,
              "depth": 2,
              "replies": [
                {
                  "id": "ls7w8fz",
                  "score": 54,
                  "body": "IMO, even without AI we will see power/electricity demands continue to grow. EVs, for one. Unless we can figure out sustainable fusion, I see more room for nuclear fission/uranium to grow in the near term future. ",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7w8fz/",
                  "created": 1729094518,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ls830q0",
                      "score": 17,
                      "body": "So every step in the process is a value added step. And every step has a margin of profit that has to include all previous steps within it. If AI is the end result then it has to have the largest profit percent to sustain all the steps before it. If there was somehow a surprise uranium deposit or something that would be great for a single business but at the end of the day AI is what has to have the profit to make that meaningful.",
                      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls830q0/",
                      "created": 1729096686,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ls8gwak",
                          "score": 7,
                          "body": "It's a global race to general artificial intelligence right now. Scalability has more or less been solved and general AI can be achieved with a massive amount of scale behind it. This will not be a quick process, it'll take years to just build the infrastructure to house and power these server farms.\n\n Profits are kind of a given when you produce a machine that is smarter than the entirety of humanity.",
                          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8gwak/",
                          "created": 1729101032,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ls8jwr9",
                              "score": 6,
                              "body": "This assumes that what you describe is possible , if it isn’t then all of this is worthless",
                              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8jwr9/",
                              "created": 1729101962,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ls8v09k",
                                  "score": 4,
                                  "body": "Everything we know about physics tells us it is not impossible. As the guy above you said it's a scalability problem. It's an enormously complex problem but not unsolvable.",
                                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8v09k/",
                                  "created": 1729105455,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ls8anhq",
                      "score": 3,
                      "body": "Yeah, sustainable fusion energy is the utopian holy grail. But we’re missing a few very important pieces of the tech tree before it’s going to be remotely possible. A big one is room temp superconductors. Which is part of why there was such a craze about LK-99 last year. It ended up being a false alarm. But if it had worked, that would have been a massive step.",
                      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8anhq/",
                      "created": 1729099081,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ls87b8r",
                  "score": 5,
                  "body": "SMR (the reactor not the ticker) tech goes beyond that, data centers are the catalyst it needed to get the development\n\nthe question is how fast and how far can it go",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls87b8r/",
                  "created": 1729098027,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ls7rot3",
      "score": 313,
      "body": "When people are mining for gold, it pays to own the shovel. Don’t bet on commodities bc a company can produce technology to 10x realizable supply. Better to invest in the uranium mining/enriching value chain",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7rot3/",
      "created": 1729093079,
      "depth": 0,
      "replies": [
        {
          "id": "ls7rskd",
          "score": 586,
          "body": "Oop didn’t realize this was WSB… I mean buy uranium and store it at home until price go up",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7rskd/",
          "created": 1729093112,
          "depth": 1,
          "replies": [
            {
              "id": "ls7sau5",
              "score": 155,
              "body": "Daddy, why is the basement bright green all the time?",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7sau5/",
              "created": 1729093274,
              "depth": 2,
              "replies": [
                {
                  "id": "ls7zk6l",
                  "score": 167,
                  "body": "Aurora Borealis",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7zk6l/",
                  "created": 1729095582,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ls8ccio",
                      "score": 63,
                      "body": "Uh... Aurora Borealis!? At this time of year, at this time of day, in this part of the country, localized entirely within your basement?",
                      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8ccio/",
                      "created": 1729099610,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ls8lbot",
                          "score": 33,
                          "body": "May I see it?",
                          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8lbot/",
                          "created": 1729102408,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ls8lk0t",
                              "score": 34,
                              "body": "…No.",
                              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8lk0t/",
                              "created": 1729102480,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ls844zv",
                  "score": 20,
                  "body": "Don't worry about sweety. Now go glow outside please",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls844zv/",
                  "created": 1729097038,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ls8vxyi",
                  "score": 4,
                  "body": "Green = gains",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8vxyi/",
                  "created": 1729105755,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ls8n4nc",
              "score": 13,
              "body": ">Oop this WSB! buy uranium 🦍 💎👊🏠 🚀🚀🔥🔥🚀🚀\n\nFTFY. Too long, not regarded enough, and no emojis",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8n4nc/",
              "created": 1729102982,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ls8vp4c",
          "score": 6,
          "body": "> Better to invest in the uranium mining/enriching value chain\n\nWho, then? Or is there an ETF that collects these?",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8vp4c/",
          "created": 1729105675,
          "depth": 1,
          "replies": [
            {
              "id": "ls9mhs8",
              "score": 6,
              "body": "The enrichment chain is almost entirely owned by Governments.\n\n EU Quango's and Rosatom are the only players that matter. China also has some but that amounts to China building exactly enough centrifuges to keep their own reactors fueled, no more, no less. \n\nYes, the enrichment facilities in the US are almost all owned by EU governments.",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls9mhs8/",
              "created": 1729114230,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ls8mlhi",
          "score": 3,
          "body": "Explain like I'm 5 please",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8mlhi/",
          "created": 1729102812,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ls817hx",
          "score": 5,
          "body": "So avoid oil company stocks? ",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls817hx/",
          "created": 1729096108,
          "depth": 1,
          "replies": [
            {
              "id": "ls81m4u",
              "score": 23,
              "body": "Extracting resources from the ground that release known climate warming gases into the atmosphere seems like a highly unsustainable business model to me, so I’m not particularly attracted to oil stocks, no.",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls81m4u/",
              "created": 1729096239,
              "depth": 2,
              "replies": [
                {
                  "id": "ls84lvd",
                  "score": 31,
                  "body": "quick somebody tell Warren Buffet",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls84lvd/",
                  "created": 1729097185,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ls8pgd5",
                      "score": 23,
                      "body": "Buffet's gonna die any day now. He doesn't have to worry about pollution anymore lmao",
                      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8pgd5/",
                      "created": 1729103719,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ls7uzum",
      "score": 53,
      "body": "Too late, I already took your words for financial advice! I'm getting a lawyer!",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7uzum/",
      "created": 1729094131,
      "depth": 0,
      "replies": [
        {
          "id": "ls90dc3",
          "score": 7,
          "body": "Take him to the cleaners!",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls90dc3/",
          "created": 1729107168,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ls7orcr",
      "score": 169,
      "body": "Baseload power from nuclear is a match made in heaven for AI's data center needs. Also, the world's clean energy transition needs nuclear.\n\nUranium got crushed in a decade long bear market last decade. The underdevelopment of new deposits and mines is an incredible setup for this cycle. \n\nURNM and URA are good ETFs to take a look at for ways to play the trend.",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7orcr/",
      "created": 1729092135,
      "depth": 0,
      "replies": [
        {
          "id": "ls86ger",
          "score": 5,
          "body": "does owning stock in those come with different tax forms or is it no different than the usual? having to own commodities vs just other companies.",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls86ger/",
          "created": 1729097760,
          "depth": 1,
          "replies": [
            {
              "id": "ls9btu9",
              "score": 5,
              "body": "Nothing different with taxes when owning URNM or URA (same as any stock...as least from a USA standpoint)",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls9btu9/",
              "created": 1729110781,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ls8i432",
      "score": 43,
      "body": "Hi everyone,\n\nFor those looking at investment possibilities in the uranium sector\n\nA couple uranium sector ETF's:\n\n* Sprott Uranium Miners ETF (URNM): 100% invested in the uranium sector: [https://sprottetfs.com/urnm-sprott-uranium-miners-etf/](https://sprottetfs.com/urnm-sprott-uranium-miners-etf/)\n* Global X Uranium index ETF (HURA): 100% invested in the uranium sector\n* Sprott Junior Uranium Miners ETF (URNJ): 100% invested in the junior uranium sector\n* Global X Uranium ETF (URA): 70% invested in the uranium sector\n\nLook at their holdings to get an idea on individual uranium companies\n\n**This isn't financial advice. Please do your own due diligence before investing**\n\nCheers",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8i432/",
      "created": 1729101407,
      "depth": 0,
      "replies": [
        {
          "id": "ls8mg3h",
          "score": 13,
          "body": "Thanks Napalm, glad to see you here!",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8mg3h/",
          "created": 1729102764,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ls8noft",
          "score": 9,
          "body": "cheers napalm",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8noft/",
          "created": 1729103158,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ls7t2j3",
      "score": 27,
      "body": "OP has life saving in uranium",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7t2j3/",
      "created": 1729093518,
      "depth": 0,
      "replies": [
        {
          "id": "ls8ptdc",
          "score": 10,
          "body": "Unironically yes I do. Not OP but I've bet my life on nuclear",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8ptdc/",
          "created": 1729103833,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ls7usx4",
      "score": 22,
      "body": "Me big dumb, but if Uranium skyrockets in price like we're hoping, isn't it bound to the glass ceiling that is the price/kwhr on the standard grid?  Combined cycle LNG generators are pretty cheap and relatively easy to take on/off line as demand changes compared to nuclear.\n\n\n\n\nDon't get me wrong, I love nuclear but like all means of generation the value is relative to, well, the other means of generation.  ",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7usx4/",
      "created": 1729094070,
      "depth": 0,
      "replies": [
        {
          "id": "ls8nfp4",
          "score": 30,
          "body": "no because unlike with other forms of fuel, uranium costs are a tiny portion of the overall cost of building and operating a reactor. the majority of the cost is the upfront capex for building the reactor - 10s of billions for big multi-reactor plants. then, the marginal cost of loading them with reactor is almost negligible in comparison. due to how expensive reactors are to build, countries can’t afford to let then sit idle regardless of uranium prices. It was calculated that ~$700/lbs is the cutoff at which point it becomes uneconomical to keep running the reactors. this is 8x the current price. due to these factors, uranium supply is price-inelastic",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8nfp4/",
          "created": 1729103080,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ls8kuj5",
          "score": 10,
          "body": "Not badly. That price for uranium is in the multiple hundred dollar range ($500 to $800) compared to current $84/lb. Unlike gas and oil, the U3O8 fuel is not a major part of the overall cost to a utility running a nuclear plant. It's something like 20% of the cost. When CapEx is in the billions, you don't just not buy fuel to keep it running.",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8kuj5/",
          "created": 1729102258,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ls9n69h",
          "score": 5,
          "body": "The real limit is that there are quite large sources of U that become very shiny at a 100 euro. If all the phosphate mines install uranium recovery, they're not going to turn those off again later even if the price drops.",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls9n69h/",
          "created": 1729114461,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ls9uc4f",
      "score": 20,
      "body": "Guys, if you are new to this sector, please read this message as a bit of advice from someone who has been in this investment since 2019. It is a volatile sector. Expect big drops of 20% in mid cap stocks and even more in small caps. Within a week. This happens also for the upside like we see this month for a lot of the U equities.\n\nThat said, there is unbelievable valuation and immense upside to many uranium juniors and business focused on the fuel cycle (enrichment etc).\n\nThis sector moves at a glacial speed, and many stocks do get ahead of themselves. Do lots of homework on companies that are developers of mines. The only producers that need to be considered for a newbie is Cameco, Uranium energy Corp, boss energy and energy fuels. If you want more then look at Sprotts Uranium information on their website. \n\nDon't listen to hype on YouTube, X, and other sources. It's a great opportunity to buy a non fungible, scarce and undervalued commodity, but don't expect to make life changing money if you consider yourself an average investor, much of the easy money has been made already in the sitting and waiting. \n\nNow is the time to look for value, performance and the companies that are actually going to be able to mine this resources at significant quantities well into the future. Alongside the companies involved in the other services in the sector.\n\nThis bull market is not a flash in the pan. This time for the nuclear industry, its game on.",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls9uc4f/",
      "created": 1729116951,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls7kphj",
      "score": 38,
      "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7kphj/",
      "created": 1729090812,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls7sm46",
      "score": 30,
      "body": "All bets on dnn🗿",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7sm46/",
      "created": 1729093374,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls7nrmk",
      "score": 102,
      "body": "https://preview.redd.it/kuq9xqgpx4vd1.png?width=191&format=png&auto=webp&s=0a92299e4e11392ec214b1e6902d199a32d895cb",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7nrmk/",
      "created": 1729091816,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls7wa5u",
      "score": 13,
      "body": "No way - bought some from the Libyans in 1986, turned out to be just a disassembled pinball machine.",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7wa5u/",
      "created": 1729094533,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls88cp0",
      "score": 14,
      "body": "Great, now WSB got *Uranium Fever.*",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls88cp0/",
      "created": 1729098360,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls7ttrb",
      "score": 28,
      "body": "Man I wish I could read",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7ttrb/",
      "created": 1729093759,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls7r0hf",
      "score": 36,
      "body": "Now? The right moment was three months ago or maybe two years ago. Uranium have seasonality.  If you go in now and dont exit at the right moment you will go down by a lot.\n\nBtw  from now i think it will go up for another 20% then it will go hugely down in the first 3 months of 2025",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7r0hf/",
      "created": 1729092861,
      "depth": 0,
      "replies": [
        {
          "id": "ls7s73o",
          "score": 18,
          "body": ">If you go in now and don’t exit at the right moment you will go down by a lot.\n\nHow dare you critize my stock strategy?",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7s73o/",
          "created": 1729093241,
          "depth": 1,
          "replies": [
            {
              "id": "ls7serd",
              "score": 22,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7serd/",
              "created": 1729093309,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ls7x2e7",
      "score": 9,
      "body": "Honestly why tf when people tell me to invest it’s always in shit that has already 5x in a couple of years or months",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7x2e7/",
      "created": 1729094785,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls7mj52",
      "score": 37,
      "body": "No mention of LEU?",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7mj52/",
      "created": 1729091414,
      "depth": 0,
      "replies": [
        {
          "id": "ls7x0on",
          "score": 10,
          "body": "All of this is impossible without them!",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7x0on/",
          "created": 1729094769,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ls84lkq",
      "score": 16,
      "body": "Let me know when we invest in Uranus",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls84lkq/",
      "created": 1729097182,
      "depth": 0,
      "replies": [
        {
          "id": "ls8fb7u",
          "score": 7,
          "body": "Traded daily behind the Wendy's dumpster.",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8fb7u/",
          "created": 1729100541,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ls7vbgy",
      "score": 8,
      "body": "Ah I see Uranium gang has made a roaring comeback",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7vbgy/",
      "created": 1729094232,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8kkrm",
      "score": 9,
      "body": "https://preview.redd.it/kmotfzgws5vd1.png?width=962&format=png&auto=webp&s=1011610e217f02a3347ab0239890d6c43b58866f\n\nYolo on 400 UUUU and 20 URNM. I have now the uranium fever",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8kkrm/",
      "created": 1729102173,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls7u67u",
      "score": 8,
      "body": "Thank you for this, next paycheck is all in on this.",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7u67u/",
      "created": 1729093867,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls7pj0j",
      "score": 26,
      "body": "I bought a lot of uranium glass in the last two years. Did I do well?",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7pj0j/",
      "created": 1729092382,
      "depth": 0,
      "replies": [
        {
          "id": "ls7r7y9",
          "score": 35,
          "body": "Only if you turned it into a buttplug",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7r7y9/",
          "created": 1729092929,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ls7u95b",
      "score": 34,
      "body": "All in UUUU\n\nhttps://preview.redd.it/kvotd50w35vd1.jpeg?width=1290&format=pjpg&auto=webp&s=33e00636dc2671df814f05a66ba25b0db2d10fa0",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7u95b/",
      "created": 1729093894,
      "depth": 0,
      "replies": [
        {
          "id": "ls7unfv",
          "score": 24,
          "body": "Name checks out because we have a whale right here!!",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7unfv/",
          "created": 1729094022,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ls831lc",
          "score": 7,
          "body": "BP checks out",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls831lc/",
          "created": 1729096694,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ls7qyn2",
      "score": 11,
      "body": "Top uranium companies to look into?",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7qyn2/",
      "created": 1729092845,
      "depth": 0,
      "replies": [
        {
          "id": "ls8kyum",
          "score": 12,
          "body": "CCJ, URNM, URA, UEC, LEU, UROY, DNN, ect..",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8kyum/",
          "created": 1729102296,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ls7t6z3",
          "score": 17,
          "body": "See section \"Investment Ideas\". There are plenty of Uranium stocks to choose from. Some people will disagree with what I picked.",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7t6z3/",
          "created": 1729093559,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ls8e0pm",
          "score": 6,
          "body": "check out [URNM](https://finance.yahoo.com/quote/URNM/holdings/) holdings\n\n[SRUUF](https://finance.yahoo.com/quote/SRUUF/) for the commodity itself",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8e0pm/",
          "created": 1729100137,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ls8hrjp",
          "score": 5,
          "body": "Hi,\n\nA couple uranium sector ETF's:\n\n* Sprott Uranium Miners ETF (URNM): 100% invested in the uranium sector: [https://sprottetfs.com/urnm-sprott-uranium-miners-etf/](https://sprottetfs.com/urnm-sprott-uranium-miners-etf/)\n* Global X Uranium index ETF (HURA): 100% invested in the uranium sector\n* Sprott Junior Uranium Miners ETF (URNJ): 100% invested in the junior uranium sector\n* Global X Uranium ETF (URA): 70% invested in the uranium sector\n\nLook at their holdings to get an idea on individual uranium companies\n\n**This isn't financial advice. Please do your own due diligence before investing**\n\nCheers",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8hrjp/",
          "created": 1729101301,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ls7s4yb",
          "score": 10,
          "body": "SMR / OKLO are best picks for the technology used for powering AI datacentres",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7s4yb/",
          "created": 1729093223,
          "depth": 1,
          "replies": [
            {
              "id": "ls7syki",
              "score": 17,
              "body": "Both over 30% up today.",
              "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7syki/",
              "created": 1729093483,
              "depth": 2,
              "replies": [
                {
                  "id": "ls7xia9",
                  "score": 10,
                  "body": "wtf....",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7xia9/",
                  "created": 1729094926,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ls7xvea",
                  "score": 3,
                  "body": "I was buying all month. It will still probably run for a good while. Might be a small correction coming but I am long",
                  "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7xvea/",
                  "created": 1729095044,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ls8mrw4",
          "score": 4,
          "body": "I like UUUU CCJ DNN EU WUC and Myriad Uranium",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8mrw4/",
          "created": 1729102869,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ls7u0wq",
      "score": 4,
      "body": "Jan 2026 URA 35c",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7u0wq/",
      "created": 1729093822,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls86f10",
      "score": 5,
      "body": "Let's just buy real uranium instead",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls86f10/",
      "created": 1729097748,
      "depth": 0,
      "replies": [
        {
          "id": "ls8ddct",
          "score": 4,
          "body": "[https://finance.yahoo.com/quote/SRUUF/](https://finance.yahoo.com/quote/SRUUF/)",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8ddct/",
          "created": 1729099932,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ls7otb7",
      "score": 14,
      "body": "I sold ALTM with 70% gains, and now holding LAC, already 20% gains. LAC today signed a big deal! Get your shares boys!",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7otb7/",
      "created": 1729092152,
      "depth": 0,
      "replies": [
        {
          "id": "ls7s2rp",
          "score": 9,
          "body": "I just looked and it's at $3 down from the year's high of 7. Not exactly a safe bet.",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7s2rp/",
          "created": 1729093203,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ls7v00s",
      "score": 3,
      "body": "NLR is another great Uranium ETF. Bought in late last year and early this year, up 27% plus 3% dividend. Holding for the long",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7v00s/",
      "created": 1729094132,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls7zqf5",
      "score": 4,
      "body": "People have been taking up this for a while now and it does nothing. I wish it would. I own a lot of urnm. Like way fucking more than I should. But it won't. For whatever reason.",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7zqf5/",
      "created": 1729095638,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls9743f",
      "score": 4,
      "body": "Excellent piece, sir. Best regards.",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls9743f/",
      "created": 1729109300,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsah7nw",
      "score": 5,
      "body": "GO UUUU 🇺🇸",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/lsah7nw/",
      "created": 1729125542,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsan2u0",
      "score": 5,
      "body": "UUUU up 27% since I bought it",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/lsan2u0/",
      "created": 1729127774,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls7y7py",
      "score": 3,
      "body": "Neat",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7y7py/",
      "created": 1729095151,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8fhy1",
      "score": 3,
      "body": "The power demand of AI will effectively promote the demand for nuclear power",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8fhy1/",
      "created": 1729100599,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8j0r8",
      "score": 3,
      "body": "URNM/URNJ have been doing very very well.\n\nStill DCAing... the uranium bull market is coming!",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8j0r8/",
      "created": 1729101687,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8n66r",
      "score": 3,
      "body": "SRUUF",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8n66r/",
      "created": 1729102995,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8x16s",
      "score": 3,
      "body": "PDN.AX, BMN.AX, AGE.AX",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8x16s/",
      "created": 1729106104,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls90ud5",
      "score": 3,
      "body": "Get in degens, we're going to uranus!!",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls90ud5/",
      "created": 1729107320,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsavmzc",
      "score": 3,
      "body": "Nuclear AI is about to run wild. $OKLO, $NNE, $SMR, $UUUU, $URMN",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/lsavmzc/",
      "created": 1729131052,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsc97b9",
      "score": 3,
      "body": "UEC?",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/lsc97b9/",
      "created": 1729159128,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls7qbt9",
      "score": 10,
      "body": "It's true there is potential. The downside is that this industry is affected by world wide events. E.G. Fukushima. Prior to that westinghouse which was owned by Toshiba was forecasting a similar nuclear Renaissance. They began producing 4 AP1000 nuclear reactors (2 in SC, 2 in GA) the nrc retroactively changed seismic requirements for the foundations of the reactors in the middle of construction. The 2 in SC were abandoned and comprise of a 20 billion dollar hole in the ground. This also forced westinghouse into chapter 11 bankruptcy and was sold by Toshiba. There are substantial risks, which are world wide, to the industry itself.  Just to keep all potential investors aware. ",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7qbt9/",
      "created": 1729092639,
      "depth": 0,
      "replies": [
        {
          "id": "ls7ubc6",
          "score": 6,
          "body": "Thank you for this. It is very important to be aware of the potential risks as history goes to show, the market can swing very fast in either direction. I believe that as gen 4 reactors come out, nuclear disasters will be FAR less likely due to the increased safety measurements and size of the reactors. It is an incredibly powerful power generator but also incredibly dangerous.",
          "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7ubc6/",
          "created": 1729093913,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ls8wrjj",
      "score": 4,
      "body": "Tired of reading these and not getting in on the action. UUUU here I come",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8wrjj/",
      "created": 1729106019,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls7vo0p",
      "score": 2,
      "body": "Worth mentioning the recent news of ORANO’s multi-billion dollar investment to bring uranium enrichment back to Oak Ridge, TN.",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls7vo0p/",
      "created": 1729094341,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls80h7k",
      "score": 2,
      "body": "I have a considerable position in UROY.\n\nBasically it is a uranium mining royalty company.\nThey have a stake in good projects currently in active production and in some more speculative ones. In addition, they have around 250 to 300 M in ore, which is quite interesting given that the price has up vs 300M market cap. (Edit: market cap value)\n\nAnother positive point is the structure, with general costs of 3 to 5M per year. There is no need to increase them even with the growth of the business.\n\nThe administration is made up of personnel with a lot of experience in the sector. \n\nThere are also some risks, but I consider it an asymmetric investment.",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls80h7k/",
      "created": 1729095876,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls83jie",
      "score": 2,
      "body": "didnt read all that, doubling my zircon holdings instead ![img](emote|t5_2th52|52627)",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls83jie/",
      "created": 1729096851,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls83kdg",
      "score": 2,
      "body": "Someone quick, tell me what options to buy",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls83kdg/",
      "created": 1729096859,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls848nh",
      "score": 2,
      "body": "I'm fucking sorry I did not read anything past its $84 a pound. how do I, some guy in California, acquire say 11LB of the raw material?",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls848nh/",
      "created": 1729097070,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls84jcd",
      "score": 2,
      "body": "nice, doubled my positions yesterday :)",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls84jcd/",
      "created": 1729097163,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls869du",
      "score": 2,
      "body": "Uranium fever has gone and got me down",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls869du/",
      "created": 1729097699,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls87o5i",
      "score": 2,
      "body": "If anyone wants another point of view that is bullish check out the pod cast Macro Voices. My positions 50 share $URNM, 10 share $LNR.",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls87o5i/",
      "created": 1729098141,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8a9ac",
      "score": 2,
      "body": "Ive missed every URA dip in the last 3 or 4 years by simply not buying long dated calls on it when its around or under 25",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8a9ac/",
      "created": 1729098957,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8ad3q",
      "score": 2,
      "body": "A guy posted this 8 days ago here: [https://www.reddit.com/r/wallstreetbets/comments/1fzevyv/leu\\_nuclear\\_boogaloo/](https://www.reddit.com/r/wallstreetbets/comments/1fzevyv/leu_nuclear_boogaloo/) . Seeing a lot of green, nice!",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8ad3q/",
      "created": 1729098990,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8e9sg",
      "score": 2,
      "body": "buy some Uranium for yourself: [SRUUF](https://finance.yahoo.com/quote/SRUUF/)\n\nif you want to know more I recommend: [this account](https://x.com/quakes99)",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8e9sg/",
      "created": 1729100216,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8evxh",
      "score": 2,
      "body": "I am in!! Bought CCJ stocks based on this DD.",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8evxh/",
      "created": 1729100409,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8iwam",
      "score": 2,
      "body": "Fuck it",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8iwam/",
      "created": 1729101648,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8p9d5",
      "score": 2,
      "body": "D to the N to the N!!!",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8p9d5/",
      "created": 1729103658,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8r0ex",
      "score": 2,
      "body": "Very insightful but you could have mentioned it earlier",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8r0ex/",
      "created": 1729104203,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8r1aj",
      "score": 2,
      "body": "What stocks are uranium?:)",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8r1aj/",
      "created": 1729104210,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8se9n",
      "score": 2,
      "body": "I'm thinking the only reason this got this many upvotes is because uranium is up big today",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8se9n/",
      "created": 1729104637,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8vuex",
      "score": 2,
      "body": "Well that was a lot.",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8vuex/",
      "created": 1729105723,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8xxg2",
      "score": 2,
      "body": "Nice gain today",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8xxg2/",
      "created": 1729106389,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8zhap",
      "score": 2,
      "body": "I can’t read",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8zhap/",
      "created": 1729106882,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls8zq72",
      "score": 2,
      "body": "Remind me tomorrow",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls8zq72/",
      "created": 1729106961,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls904cs",
      "score": 2,
      "body": "Jesus fuckin christ thats way too long to read",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls904cs/",
      "created": 1729107088,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ls91v2c",
      "score": 2,
      "body": "Closest thing i can get into is uranus.... 😀😀😀😀",
      "permalink": "/r/wallstreetbets/comments/1g51fj0/get_in_on_uranium_now/ls91v2c/",
      "created": 1729107646,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The post discusses the rising uranium price and investment opportunities in uranium mining companies and ETFs.",
    "companies": [
      "Cameco",
      "NexGen Energy",
      "Clean Harbors, Inc.",
      "Constellation Energy"
    ],
    "tickers": [
      "CCJ",
      "NXE",
      "NUKZ",
      "URNM",
      "CEG"
    ],
    "main_ticker": [
      "URNM"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The post discusses the current state and future potential of the uranium market, highlighting supply constraints, increasing demand, and opportunities for investment in uranium mining companies.",
    "stock_recommendations": "The user is recommending to buy stocks in uranium mining companies such as Cameco (CCJ), NexGen Energy (NXE), and ETFs like Range Nuclear Renaissance Index (NUKZ) and Sprott Uranium Miners ETF (URNM).",
    "is_recommending_stock_buying_or_selling": true,
    "buy_or_sell": "buy",
    "sentiment_summary": "There is positive sentiment as the author believes in a bullish uranium market with increasing demand and recommends buying stocks in various mining companies and ETFs.",
    "sentiment": "positive"
  }
}