{
  "title": "European Stocks",
  "score": 36,
  "selftext": "Good evening everyone!\n\nDo any of you guys have European stocks as a significant part of your portfolio? I am worried that mainly owning American stocks and ETFs puts me at a massive risk in case of a downturn. Especially considering the P/E ratios of American stocks are much higher than those of their European counterparts at the moment.\n\nWould you consider buying some European (mainly Dutch, Danish and so) stocks in order to reduce your exposure to a potential heavy drop in American stocks? Or do you think in such scenario European stocks would drop just as much? In that case, the (expected) lower gains of European markets up to that point would mean owning them was not worth it.\n\nThank you very much in advance!",
  "link_flair_text": "Advice Request",
  "id": "1g5wf9e",
  "num_comments": 111,
  "created_utc": 1729186217,
  "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/",
  "comments": [
    {
      "id": "lsely8l",
      "score": 27,
      "body": "I have quite a few european stocks even tho the US is the core of my portfolio\n\nRolls Royce and HSBC in the UK  \nAllianz in Germany  \nASML in the Netherlands  \nFerrari in Italy  \nAirbus and LVMH in France  \nNovo Nordisk in Denmark\n\nout of them the only one I’m uncertain atm is LVMH due to the constant weak data, I’ve owned all of these stocks for a long time, I’d judge ASML a really good buy rn as it lost a lot due to its guidance\n\n(I’m from Italy, one of the reasons i wanted more European stocks was to reduce my exposure to the USDEUR rates, but overall i still prefer the US to invest in)",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsely8l/",
      "created": 1729190643,
      "depth": 0,
      "replies": [
        {
          "id": "lsil2jn",
          "score": 5,
          "body": "I would scrap Allianz, replace w/AXA or Generali.\nHSBC I would immediately dump, there is not one single good bank in Europe (I'm an ex banker)\nASML is tricky, high risk/reward \nFerrari is full of fraud, wouldn't dare to touch it. Same as Stellantis. \nAirBus is indeed a good choice especially with Boeing doing so bad\nNovo Nordisk is the largest holding in my portfolio European wise\nI also have Boskalis, Nationale Nederlanden, Volkswagen, debt of Hungary, Porsche and guillemot (they own Thrustmaster which is a daughter and henceforth the value of guillemot is easily >50% undervalued. \nI am also long Michelin (the tires) they will soon shoot up as their new technology will reduce cost, enhance margins and throw Pirelli of the thrown. \n\nI occasionally short European stocks like \n\n- deliveroo\n- Aviva \n- just eat \n- ViaPlay\n\nEtc.\n\nSimple as those firms are debt > abs(sum of inventory) so intrinsically these firms are dead already they just regularly restructure debt.",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsil2jn/",
          "created": 1729254077,
          "depth": 1,
          "replies": [
            {
              "id": "lsj3btf",
              "score": 4,
              "body": "mhh that is actually some interesting insights, HSBC is the smallest position of my portfolio, a bit more than 1% of it, i was tempted to increase it due to its hefty dividend, why would you say that i should dump it? an insight from an ex banker on this would be very helpful, same for Allianz, i've been very happy with them so far.  \nagreed on airbus and ASML (even tho to me in the long term ASML doesn't feel too risky), dunno about Ferrari, it fells overvalued but they do have an incredbile business model with amazing margins.  \nVW feels dangerous due to how much they're struggling and their lucklaster performance in EVs, i think they can catch ground and the german gov would never let them fail but these factors dont really encorage me to put my money on them",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsj3btf/",
              "created": 1729260961,
              "depth": 2,
              "replies": [
                {
                  "id": "lsj50xh",
                  "score": 4,
                  "body": "I was head of front office of a large UK bank. \n\nIt's rotten. They have so much loan books under water, only JPMorgan is the safest banking bet.\n\nDividend wise can't you look at Nestle? Everywhere in the world someone eats their candy daily. \n\nSame goes for Unilever. \n\nFerrari; I was involved in a court case with John Elkann who had his assets seized (I did regulatory work for the bank too) - and Elkann is boss from Stellantis all the way down to Ferrari that by definition is conflict of interest so that whole chain is fraud 100%. You can check Elkann had his assets seized. \n\nVW + Porsche simple as the latter is a cash cow, and VW will slowly but surely profit from the demise of Stellantis (check Stellantis last results and their drop). \n\nI was in court against them so I can't say to much except what is public. Stellantis to Ferrari - one long way of fraud.",
                  "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsj50xh/",
                  "created": 1729261527,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lsnebnc",
                      "score": 2,
                      "body": "Thanks, that was actually really interesting to read and I’ll def take what you’ve said into consideration as i do more research",
                      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsnebnc/",
                      "created": 1729319655,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lsnsu7i",
                          "score": 3,
                          "body": "It's the only part of Finance I enjoy. Trading isn't difficult once you find out how everything in the product chain, hierarchial chain, the whole hamstercage (micro/macro), yield curve's of firms, countries, continents are all somewhat correlated in a few big matrices. \n\nLet me know if you need more help. This puzzle work is (i'm very subjective here) - a lot of fun.",
                          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsnsu7i/",
                          "created": 1729329707,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lshh954",
          "score": 1,
          "body": "What is your opinion on Rolls Royce?",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshh954/",
          "created": 1729229914,
          "depth": 1,
          "replies": [
            {
              "id": "lsidfdu",
              "score": 2,
              "body": "Held them since February last year, I own 5000 shares (RR not RYCEY) right now and it has become the largest single stock in my portfolio, ever since they started recovering from the disaster that was the pandemic they've been on an incredible bull run, rightfully so if i may add  \nTheir engine department is a vital part of a suplly chain that is starved by the lack of new engines, thus giving them a strong and safe market to expand in, their military division is performing amazingly and their work on modular nuclear reactors, that i was already very positive on last year, is now even more important as big tech pivots to nuclear.  \nnow, their valuation has gone really high, I dont know if i'd buy a sizeble amount now, but im very bullish on their future and i def will keep their stock for a long time.",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsidfdu/",
              "created": 1729250547,
              "depth": 2,
              "replies": [
                {
                  "id": "lsisfo2",
                  "score": 2,
                  "body": "You own $3.6 million worth of Rolls Royce stock?\n\nAssumung you're not filthy rich already, this seems really unwise. And even if you are, not having an exit strategy for this kind of stock seems crazy to me, especially since it sounds like you already made decent money.",
                  "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsisfo2/",
                  "created": 1729257048,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lsitor4",
                      "score": 6,
                      "body": "uhm, it's 5 pounds a share ahah, i think you're confusing with RYCEY (the US market ticker), i own RR stock on the London stock market ahah  \nits about 30K euros",
                      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsitor4/",
                      "created": 1729257518,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lsiyf44",
                          "score": 2,
                          "body": "Ahh, that makes more sense. 😂",
                          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsiyf44/",
                          "created": 1729259263,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lsiz0hm",
                              "score": 3,
                              "body": "yeah, man i wish i had 3.6 millions to pour into a stock ahahah",
                              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsiz0hm/",
                              "created": 1729259471,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lsfk946",
          "score": 1,
          "body": "ASML is very interesting rn, but also listed on US exchange so yeah",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsfk946/",
          "created": 1729201724,
          "depth": 1,
          "replies": [
            {
              "id": "lshazt2",
              "score": 3,
              "body": "The problem is AI was so hyped that it pushed so many stocks up. I think ASML may have a decent buying opportunity at some point soon.",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshazt2/",
              "created": 1729226434,
              "depth": 2,
              "replies": [
                {
                  "id": "lsigxbt",
                  "score": 3,
                  "body": "ASML has a very decent buying opportunity right now",
                  "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsigxbt/",
                  "created": 1729252222,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lseg0wr",
      "score": 14,
      "body": "Not a significant part of my portfolio, but I like Zeal Networks (ETR: TIMA). They run lotteries so it is mostly betting on the economies in Europe (esp. Germany) sucking, which European leadership seems to have a strong commitment to.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lseg0wr/",
      "created": 1729188762,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lseahbi",
      "score": 18,
      "body": "Europe as tepper noted is on 14* vs 22* for the us market.\n\nUnfortunately if US went into downturn Europe would do as badly as the US at least historically\n\nEurope tends to do well when China does better and maybe as a recovery play\n\nIn terms of stock picks I like Diageo, Louis Vuitton and L’Oréal as fairly valued quality companies 😴 boring I know.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lseahbi/",
      "created": 1729187032,
      "depth": 0,
      "replies": [
        {
          "id": "lseefk4",
          "score": 9,
          "body": "It's just not the best century to be European is it? ☹️\n\nThank you very much for your answer!",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lseefk4/",
          "created": 1729188262,
          "depth": 1,
          "replies": [
            {
              "id": "lseq8a6",
              "score": 17,
              "body": "Pretty much yeah. We are slowly becoming insignificant",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lseq8a6/",
              "created": 1729192005,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lseb65g",
      "score": 21,
      "body": "Well, I'm from Denmark and I already have some European stocks. \n\n\nCurrently I own \n\nNOVO\n\nGenmab \n\nCBrain \n\nAirbus \n\nI used to have \nCarlsberg - sold with loss \n\nDontNod - profit \n\nEmbracer Group - profit \n\n\nI also have some asian stocks and a generel index for India. \nDiversifying is pretty important to me",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lseb65g/",
      "created": 1729187246,
      "depth": 0,
      "replies": [
        {
          "id": "lsfd2y9",
          "score": 2,
          "body": "How’s GMAB?",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsfd2y9/",
          "created": 1729199290,
          "depth": 1,
          "replies": [
            {
              "id": "lsfrjx3",
              "score": 0,
              "body": "I'm about 60% up, but it's down recently. \nIt's a decent company and very exclusive regarding their workforce. Novo hires every available body but Genmab finds the superqualified.\n\nI'm long long on Genmab",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsfrjx3/",
              "created": 1729204349,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lsfkpiw",
          "score": 1,
          "body": "which index for India are you following?",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsfkpiw/",
          "created": 1729201881,
          "depth": 1,
          "replies": [
            {
              "id": "lsfrxgt",
              "score": 6,
              "body": "iShares MSCI India UCITS ETF - it's been good. Sometimes outperforming the US markets but not for long. The S&P always delivers above in the end. But it's very good as a safeguard. Because it lives it own life, away from the american companies.",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsfrxgt/",
              "created": 1729204490,
              "depth": 2,
              "replies": [
                {
                  "id": "lsfskpo",
                  "score": 1,
                  "body": "thank you!!",
                  "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsfskpo/",
                  "created": 1729204730,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lsgjnnc",
                  "score": 1,
                  "body": "Ahem- Jupiter India returned 60% (peak) last year. You need the right platform to use it, obvs...",
                  "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsgjnnc/",
                  "created": 1729214744,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lseccs2",
      "score": 17,
      "body": "I own a couple of European drug stocks, because I like drug stocks.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lseccs2/",
      "created": 1729187614,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lseg7on",
      "score": 10,
      "body": "I have a number of European stocks because I think they're very good companies, but European stocks aren't going to be immune if there was a significant decline in the US...",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lseg7on/",
      "created": 1729188821,
      "depth": 0,
      "replies": [
        {
          "id": "lsfkeln",
          "score": 5,
          "body": "European stocks follow US market quite closely.\n\nWith The mini crash in augustus, bank stocks dropped here as well. 🥲",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsfkeln/",
          "created": 1729201776,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lsev2nx",
      "score": 7,
      "body": "Usually when things are bad in US things go down in Europe as well.\n\nIf I were you I’d just focus on buying good companies regardless of where they are from. \n\nPersonally I’m investing in an India ETF but not so much for the sake if diversification mostly because I see a lot of upside, it’s one of the fastest growing major economies in the world and it’s projected to continue expanding due to\n\nA large young workforce\nIncreasing urbanisation\nRising middle-class consumption\n\nSo you have strong economic fundamentals and diversification away from developed markets due to India’s decoupling from the us & Europe.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsev2nx/",
      "created": 1729193546,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lseys3l",
      "score": 8,
      "body": "I own ONON the Swiss athletic shoe company and ASML that makes semiconductor machines.  Personally, anymore I don’t’ think it makes much of a difference if a down turn comes. Most Euro businesses turn a lot of revenue in the US.  And some of these companies require some ADY fees.  Just buy quality companies that you like to follow. If you want a few other international ideas, look at Mercado Libre MELI. Sea Ltd SE, and NU holdings NU.  Great growth trajectories.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lseys3l/",
      "created": 1729194729,
      "depth": 0,
      "replies": [
        {
          "id": "lsf45ir",
          "score": 1,
          "body": "Thank you very much ! I'll make sure to check them out !",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsf45ir/",
          "created": 1729196429,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lsehyjm",
      "score": 5,
      "body": "Allianz, Munich Re, BASF, Rheinmetall, Siemens. Just some famous german Stocks i‘d like to mention.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsehyjm/",
      "created": 1729189373,
      "depth": 0,
      "replies": [
        {
          "id": "lsgdegd",
          "score": 2,
          "body": "Siemens energy doing quite good",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsgdegd/",
          "created": 1729212409,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lsejta4",
      "score": 6,
      "body": "I own quite a bit of philips, I got a lecture from the CFO in uni, made me believe that they would 100% recover from the sleep apnea machine debacle and bought most of it around the 12-14 euro mark. Got some nice returns so far. I believe the fair value to lie atleast around 50 euros per share.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsejta4/",
      "created": 1729189959,
      "depth": 0,
      "replies": [
        {
          "id": "lsgplre",
          "score": 2,
          "body": "I've owned PHG since 1996. Interesting company, No returns for 30 years. Avoid.",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsgplre/",
          "created": 1729216999,
          "depth": 1,
          "replies": [
            {
              "id": "lshn0kn",
              "score": 1,
              "body": "I mean the company was doing fine until the sleep apnea device issues. Like I said, I bought it at 12-14 euros just because I believe they are worth around 50, if they reach that price I'm going to sell. I like their medical device approach they are choosing instead of the full electronics focus.",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshn0kn/",
              "created": 1729233500,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lseklp1",
          "score": 1,
          "body": "I know nothing about the sleep apnea machine debacle, seems like a very interesting topic, they definitely did drop a lot!",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lseklp1/",
          "created": 1729190211,
          "depth": 1,
          "replies": [
            {
              "id": "lsg7mbw",
              "score": 8,
              "body": "Europe's economic engine is Germany, which is in recession. Ageing demographic, small market and over-regulation of companies are some of the reasons why you won't find trillion-dollar market cap, monopolistic companies in Europe. They all are and prefer to stay niche. Gov. doesn't let them become too big/too powerful. So, if you like niche businesses/sectors, below are some example:\n\n* ASML (semiconductor machinery supplier)\n* [European car makers - why so dirt cheap? ](https://www.reddit.com/r/stocks/comments/1dgtm4k/european_car_makers_why_so_dirt_cheap/)\n* Luxury, fashion - LVMH, Hermes \n* Real estate - Vonovia \n* FMCG, Processed foods - Nestle, Unilever\n* [Booking.com](http://Booking.com) (now it's a U.S stock)",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsg7mbw/",
              "created": 1729210302,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lsgkgen",
              "score": 2,
              "body": "Philips Sleep Apnea machines are fine!. I use one and it 's perfqviiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiinnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnzzzzzzzzzzzzzzzzzzzzzzzzzz",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsgkgen/",
              "created": 1729215048,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lsf17y8",
      "score": 5,
      "body": "I've got shares in BAE Systems, Rheinmetall and Rolls-Royce, which, due to the Russian invasion of Ukraine and Europe's increasing need to defend itself, thus purchasing new weapons systems and upgrading existing ones, have done well recently.\n\nAlso in Vanguard S&P 500.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsf17y8/",
      "created": 1729195500,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsfd45x",
      "score": 4,
      "body": "ASML",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsfd45x/",
      "created": 1729199302,
      "depth": 0,
      "replies": [
        {
          "id": "lshpvpr",
          "score": 1,
          "body": "Quite expensive for European company",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshpvpr/",
          "created": 1729235357,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt7qj18",
      "score": 4,
      "body": "I’ve got the following European Stocks that I didn’t see mentioned yet:\n\n- Alk-Albello AS, marker leader in allergische immmunotherapies, could have a similar run like Novo Nordisk \n\n- Santander, strong operations on LatAm\n\n- K+S AG, agriculture cannot function without fertilizer \n\n- Bollore, overlooked conglomerate with an interesting mix of operations, from ports in Africa to a major shareholding in Universal Music and Vivendi. Market value is lower then sum of its part. \n\n- TotalEnergies, major player in both fossil and renewable energies.\n\n- Vinci, only European company that is a truly global infrastructure play.\n\n- Veolia, energy, water, waste, what’s not to like. \n\n- Renewi, as long as there are humans, we’ll produce waste. Lots of opportunities in changing waste streams as well as recycling and urban mining. \n\n- Equinor, invest with the sovereign wealth fund of Norway, they’ll make sure that the cash keeps flowing.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lt7qj18/",
      "created": 1729622398,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lseomv0",
      "score": 3,
      "body": "You have a lot of good heavy quality companies in europe, my picks are a lot around scandinavia\n\nWithing medical/biotechcompanies from denmark with novo trading low right now and bavarian who is up there with mpox.\n\nQuality millitary/defense/industry\nLike SAAB and kongsberg group\n\nThen again great companies like ASML, Siemens, investor AB, Evolution AB and the sleeping giant Ericsson just to name a few.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lseomv0/",
      "created": 1729191493,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsf27or",
      "score": 3,
      "body": "I love \"Saab\"",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsf27or/",
      "created": 1729195814,
      "depth": 0,
      "replies": [
        {
          "id": "lsf49e1",
          "score": 1,
          "body": "Why??",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsf49e1/",
          "created": 1729196463,
          "depth": 1,
          "replies": [
            {
              "id": "lsf4j4u",
              "score": 2,
              "body": "Expanding a lot. War Stock. Sweden buys a lot and US military too. And just overall great business with solid numbers",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsf4j4u/",
              "created": 1729196549,
              "depth": 2,
              "replies": [
                {
                  "id": "lsf4z2j",
                  "score": 1,
                  "body": "This looks like great advice, thank you very much! I'll make sure to check it out",
                  "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsf4z2j/",
                  "created": 1729196689,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lsf62oy",
                      "score": 2,
                      "body": "It's been falling lately, I just keep buying more. There are some growth concerns but I don't agree with them. Still, it's a risk🤷\n\nMaybe check out rheinmetall AG, another war stock\n\nOr lexans, they make huge power wires, and got backorders for many years. Also building a new factory. These 3 are my favorites \n\nIf ur into drug stocks, Novo nordisk is cheap atm.\n\nOr maybe bank stocks, but about those I can't say much except we got good dividends. (My dad holds KBC)",
                      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsf62oy/",
                      "created": 1729197036,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lsfx804",
          "score": 1,
          "body": "they sold only cars part to China?",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsfx804/",
          "created": 1729206463,
          "depth": 1,
          "replies": [
            {
              "id": "lshoopw",
              "score": 1,
              "body": "No?",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshoopw/",
              "created": 1729234570,
              "depth": 2,
              "replies": [
                {
                  "id": "lshr1tc",
                  "score": 1,
                  "body": "NEVS",
                  "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshr1tc/",
                  "created": 1729236150,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lshr4iv",
                      "score": 1,
                      "body": "Saabs car department is long gone. Now they make war stuff/jets.",
                      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshr4iv/",
                      "created": 1729236201,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lsfkiho",
      "score": 3,
      "body": "Been loading the boat on this $NVO dip, trades 1/3 the P/E of LLY, with larger sales of Ozempic/Wegovy than Zepbound.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsfkiho/",
      "created": 1729201813,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lshatha",
      "score": 4,
      "body": ">Dutch, Danish\n\nYou could've just said ASML and Novo Nordisk lol.\n\nBut yeah, it's not a bad idea to have some European exposure. They have good companies there but it tends to be a bit less innovative. You're more likely to find companies that do a few things very well and keep at it for a long time.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshatha/",
      "created": 1729226341,
      "depth": 0,
      "replies": [
        {
          "id": "lshtown",
          "score": 1,
          "body": "I wasn't particularly thinking about them, even though they would be the most obvious examples. The reason was, I believe those two to be the best performers in Europe in the following years.",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshtown/",
          "created": 1729237979,
          "depth": 1,
          "replies": [
            {
              "id": "lshundu",
              "score": 2,
              "body": "Yeah, tbh though, ASML and NVO are so disproportionately large, they have an enormous impact on their respective economies.\n\nSo much so that NVO is a major reason why Denmark was largely unscathed by inflation (demand of the krone was high, so they didn't need to raise interest rates as much as the rest of the EU to maintain the peg with the euro).",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshundu/",
              "created": 1729238641,
              "depth": 2,
              "replies": [
                {
                  "id": "lshw6lk",
                  "score": 1,
                  "body": "That's wild lol",
                  "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshw6lk/",
                  "created": 1729239718,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lsmssv9",
      "score": 3,
      "body": "Many have American customer base. Most sink together.  I am more in favor of etfs by country. Europe is no longer even a marge market anymore.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsmssv9/",
      "created": 1729307808,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsedmbv",
      "score": 2,
      "body": "I'm personally looking to buy BE semiconductor and ASML soon, both Dutch companies.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsedmbv/",
      "created": 1729188005,
      "depth": 0,
      "replies": [
        {
          "id": "lseek7a",
          "score": 1,
          "body": "I don't really know anything about them, can you tell me what makes you want to buy them ?",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lseek7a/",
          "created": 1729188303,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lsfpxst",
      "score": 2,
      "body": "there’s hardly anything worth owning except the top US stocks. LVMH and ASML are the best in Europe",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsfpxst/",
      "created": 1729203754,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lshobs6",
      "score": 2,
      "body": "Airbus. They are clearly the leader in the aviation with all the missteps by Boeing. They have weak guidance due to some supply chain issues but I’m backing them to solve them. Amazing order backlog so demand isn’t an issue. Plus decent defense play. \n\nOther than this, I just sip in large cap EU funds and a defense fund.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshobs6/",
      "created": 1729234340,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsieyip",
      "score": 3,
      "body": "There are good businesses in Europe, and these trade at a much lower price that in the US where the valuation ratios are to the roof. However, history has shown that if there is a massive drop in the US stock markets, the European markets will follow too. \nIt's a good source of diversification for some of the US specific risks (highly concentrated markets, upcoming election) but not to hedge against a crash",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsieyip/",
      "created": 1729251299,
      "depth": 0,
      "replies": [
        {
          "id": "lsifmxc",
          "score": 1,
          "body": "Thank you very much for your answer !\n\nWhat could hedge against a Crush but not slow down too much if this Crush takes a while to happen ?",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsifmxc/",
          "created": 1729251626,
          "depth": 1,
          "replies": [
            {
              "id": "lsig4sp",
              "score": 2,
              "body": "Other investments than equities (bonds, gold and commodities, real estate, etc..). You cannot diversify/hedge yourself for the long term without affecting your shorter term returns.",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsig4sp/",
              "created": 1729251861,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lsjtjbd",
      "score": 2,
      "body": "I own LVMH in France. There has been a huge sell-off in the luxury sector recently because China is struggling. But the future looks brighter imo.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsjtjbd/",
      "created": 1729269363,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsjynln",
      "score": 2,
      "body": "I bought the dip of ASML since it tanked a lot",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsjynln/",
      "created": 1729270962,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsk224z",
      "score": 3,
      "body": "I am Czech so I hold some Czech stocks, some US stocks and world ETF.\n\nKOMERČNÍ BANKA boring bank PE 9,5 dividend 10%\n\nMONETA MONEY BANK boring bank PE 10 dividend 9%\n\nCOLTCZ arms manufacturer grows like crazy, has taken over American Colt, several smaller companies, Selier and Bellot amunition manufacturer etc. but it is creating new stocks to buy all those companies. Curently little bit down after printing new stocks.\n\nI dont think Europe reduce exposure to heavy drop in US markets.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsk224z/",
      "created": 1729272039,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsod0eu",
      "score": 2,
      "body": "Good point, but take this into account. The stocks that go up more have been for decades the US ones.\n\nSaying this I own DB and IFNNY (both german) I dont like macro in Europe much. And like you said, If US goes down Europe gonna sink too most likely.\n\nOwn some Brazil, Argentina and Taiwan stocks too.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsod0eu/",
      "created": 1729341195,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsf12zd",
      "score": 2,
      "body": "No, and no interest in adding any.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsf12zd/",
      "created": 1729195455,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsecut0",
      "score": 1,
      "body": "No. But I have stuff in Canada and Australia.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsecut0/",
      "created": 1729187768,
      "depth": 0,
      "replies": [
        {
          "id": "lsediid",
          "score": 1,
          "body": "Do you think Europe will perform worse in the coming years or why not buy some of those too ?",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsediid/",
          "created": 1729187972,
          "depth": 1,
          "replies": [
            {
              "id": "lseeh8g",
              "score": 5,
              "body": "(I am Italian, living in Switzerland)\n\nThe reasons I prefer to invest outside of Europe are:\n- I like to find everything in English\n- Many European countries don't protect the rights of companies and shareholders (see for example Italy and taxation of extra profits of banks)\n- I don't think the € is going to do great\n\n(If I had to invest in Europe I would for sure invest in Switzerland)",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lseeh8g/",
              "created": 1729188276,
              "depth": 2,
              "replies": [
                {
                  "id": "lsef7px",
                  "score": 5,
                  "body": "I absolutely agree with your first two points, however, why do you think the euro will perform worse than the dollar ? Seems like the BCE is not printing nearly as much as the Fed is.\n\nI too am European (Spain), hopefully some day I can find a job in Switzerland, what would you recommend in order to land one ?",
                  "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsef7px/",
                  "created": 1729188508,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lseg8x8",
                      "score": 4,
                      "body": "Because our countries do whatever is possible to tax every thing that moves. We may print less, but if the economy shrinks we are still in a worse spot.\n\nI would say that you should try to be very good at whatever you do. However there is some competition. If you spoke French or German at B2/C1 level, it would improve your odds quite a bit, because you would compete for job to which most expats are not applying.",
                      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lseg8x8/",
                      "created": 1729188832,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lsek5r7",
                          "score": 1,
                          "body": "Those are tough, thanks for the advice!",
                          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsek5r7/",
                          "created": 1729190070,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lsglccb",
                      "score": 3,
                      "body": "In most areas they expect perfect written German because that's the official language, but you have to learn Romansch as well because that's what everyone speaks.\n\nThey do it to keep people out!\n\nQue tengas suerte!",
                      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsglccb/",
                      "created": 1729215379,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lserylr",
      "score": 1,
      "body": "I'm American and have stock in Rolls Royce, ticker Rycey. I'm seeing this as a hedge against the US dollar and also a company that is likely undervalued, some analysts show as much as 52%. They are in the SMR space as well so this stock could really pop in the coming years. As usual, this is not financial advice, just my take.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lserylr/",
      "created": 1729192555,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsfrsyl",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsfrsyl/",
      "created": 1729204442,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsfz31p",
      "score": 1,
      "body": "If you want to add Developed Market Int’l stocks, you can try adding DFAI to your portfolio. It’s a ETF primarily composed of Euro/Japanese stocks based on factors. This also means it cuts out Emerging Markets, which is represented through DFAE and is more volatile. DFAI is great if you want to focus on countries with more established economies.\n\nI wouldn’t worry about missing out from only investing in the American market. The US weighs so heavily on the global economy that other markets just follow what happens with the US. You can buy individual stocks but you will really have to hope you choose right when you are less familiar with the foreign environments.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsfz31p/",
      "created": 1729207156,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsgac45",
      "score": 1,
      "body": "Novo.. around.. 1%of mine..?",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsgac45/",
      "created": 1729211294,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsgd9tq",
      "score": 1,
      "body": "CFRUY",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsgd9tq/",
      "created": 1729212362,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsgp4we",
      "score": 2,
      "body": "I recently made a large purchase of Lvmuy.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsgp4we/",
      "created": 1729216815,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsgpcth",
      "score": 1,
      "body": "had an sold Scandic, skanska, nu bank, prosus, alibaba, reduced bdory ! Brought 1.5 years ago decent returns sorta worried about the market. Retained, city lodge hotels, standard bank, just brought raiffeisen, n wizz air, looking at  bradesco, and other things with ties to Russia Ukraine etc with low downside great upside, trump probably now favorite so risk reward needs to be OK, kinda worried bout market reaction to trump win but mildly optimistic!",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsgpcth/",
      "created": 1729216901,
      "depth": 0,
      "replies": [
        {
          "id": "lshtccw",
          "score": 1,
          "body": "If Trump wins, investing in companies with ties to Russia and Ukraine is bad ? What sort of sectors would benefit from the end of the war ?",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshtccw/",
          "created": 1729237736,
          "depth": 1,
          "replies": [
            {
              "id": "lshukjj",
              "score": 1,
              "body": "Povided they get an agreement the oligarchs get there assets back in the deal potentially but big ????.Ukraine and Russia get agreement will be able to open up and trade. The restrictions on Russia will get lifted ass they were only in place duye to Crimea + wars etc if war stops Putin will want restrictions gone too and trump is a twat but if Russians are buying shit he ain't going to give a fuck! Airlines and airspace gets opened Europe will do quite well he will want to get it done quick win people over then say how great he is etc etc, american business will be cautious but will still go back its too good a market!",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshukjj/",
              "created": 1729238587,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lsgq4ys",
      "score": 1,
      "body": "Baesy",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsgq4ys/",
      "created": 1729217205,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsh92qc",
      "score": 1,
      "body": "AZN; NVS; ASML; SPOT; ETN are all in my portfolio. Because they are great companies with great potential. There are a lot of great European companies and there is no reason to ignore them completely. Diversifying across countries is not a bad thing, even if not necessary. Look for good companies in safe countries.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsh92qc/",
      "created": 1729225438,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lshbj0f",
      "score": 1,
      "body": "I love Spotify (the product and the stock)",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshbj0f/",
      "created": 1729226714,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lshhffa",
      "score": 1,
      "body": "No. I plan to keep it that way.\n\nBest part is, I'm from the EU.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshhffa/",
      "created": 1729230019,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lshkop4",
      "score": 1,
      "body": "Diversifying with European stocks can help reduce risk, but both markets might decline simultaneously.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lshkop4/",
      "created": 1729232009,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsi1xpc",
      "score": 1,
      "body": "No, I do not own or ever buy foreign stocks. I stick to the American stock market.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsi1xpc/",
      "created": 1729243732,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsjbv5k",
      "score": 1,
      "body": "I put some in ETFs, for diversification purposes in case shit hits the fan in US",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsjbv5k/",
      "created": 1729263748,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsvwoat",
      "score": 1,
      "body": "I’ve been watching and waiting to pounce on HEINY.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsvwoat/",
      "created": 1729451030,
      "depth": 0,
      "replies": [
        {
          "id": "lsvx80l",
          "score": 1,
          "body": "Doesn't really look to be growing much... Why do you trust it ?",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsvx80l/",
          "created": 1729451200,
          "depth": 1,
          "replies": [
            {
              "id": "lsvyjv8",
              "score": 1,
              "body": "I trust the branding. I haven’t invested yet, just watching. It’s pretty low rn. Could be a quick swing for 10-20% if you get in at the bottom. About half my investments are short term, weeks or months. This is one I’m keeping my eye on",
              "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsvyjv8/",
              "created": 1729451601,
              "depth": 2,
              "replies": [
                {
                  "id": "lsw9a1f",
                  "score": 1,
                  "body": "I'm curious about short term investment, are you usually as succesful with it as you are with long term investments ?",
                  "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsw9a1f/",
                  "created": 1729454825,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lswl55q",
                      "score": 2,
                      "body": "I turn anywhere from 10-25% on short term investments. Some I reinvested, others I’m holding. My long term investments are mainly in general infrastructure and cultural direction. You gotta have your ear to the ground.",
                      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lswl55q/",
                      "created": 1729458438,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lsedmy4",
      "score": 1,
      "body": "I'm personally looking to buy BE semiconductor and ASML soon, both Dutch companies.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsedmy4/",
      "created": 1729188010,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsf3c1z",
      "score": 2,
      "body": "No matter how Ukraine war ends, or who wins US election Europe will pay and US companys will take profit.",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsf3c1z/",
      "created": 1729196168,
      "depth": 0,
      "replies": [
        {
          "id": "lsf4fup",
          "score": 1,
          "body": "You are probably right on this one",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsf4fup/",
          "created": 1729196520,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lsiso5t",
      "score": 1,
      "body": "I dont invest in europe because im patriotic",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsiso5t/",
      "created": 1729257138,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsgaiit",
      "score": 0,
      "body": "To identify European stocks that have value, i use : [https://tickerbell.com/screener](https://tickerbell.com/screener)\n\nUsually i turn on the 'Intrinsic Value' Filter here, and turn on the Rest of the World Checkbox.\n\nFrom here, what i have been building positions so far is :\n\n[TKAMY](https://tickerbell.com/ticker/TKAMY/tab/Outlook)\n\n[RWEOY](https://tickerbell.com/ticker/RWEOY/tab/Outlook)\n\n[BURBY](https://tickerbell.com/ticker/BURBY/tab/Outlook)\n\n[SBGSY](https://tickerbell.com/ticker/SBGSY/tab/Outlook)\n\n[SMSOF](https://tickerbell.com/ticker/SMSOF/tab/Outlook)\n\n[BRDCY](https://tickerbell.com/ticker/BRDCY/tab/Outlook)\n\n[REMYY](https://tickerbell.com/ticker/REMYY/tab/Outlook) - this one just got added \n\n  \nLet me know if these help, or if you find any better stocks !!",
      "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsgaiit/",
      "created": 1729211360,
      "depth": 0,
      "replies": [
        {
          "id": "lsgll24",
          "score": 1,
          "body": "RR, MKS !!",
          "permalink": "/r/stocks/comments/1g5wf9e/european_stocks/lsgll24/",
          "created": 1729215468,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}