{
  "title": "Intel seeks billions for minority stake in Altera business, sources say",
  "score": 67,
  "selftext": "Intel is looking to sell at least a minority stake in its Altera subsidiary that would raise several billion dollars in cash for the struggling firm, according to people familiar with the matter. This move that would represent a sharp about face from its earlier public messaging about the larger company’s prospects.\n\nThe storied semiconductor firm has made overtures to a number of private equity and strategic investors this week, said the people, who requested anonymity to speak freely about confidential information. Intel has expressed to some of those investors that it would be possible to acquire a majority stake in the Altera business, which was valued at $16.7 billion when Intel acquired it in 2015, said one of the people.\n\nIntel is looking for a deal that values Altera at around $17 billion, said the people.\n\nA representative for Intel did not immediately respond to a CNBC request for comment. The sale process represents an abrupt about-face from Intel’s prior commentary on Altera, where as recently September its CEO said that Intel’s leadership considered the business to be a core part of Intel’s future.\n\nIntel has previously said that it could look to monetize its Altera business via an initial public offering, possibly as soon as 2026. But the idea of taking strategic or private equity investment would be a marked acceleration of those plans.\n\nCEO Pat Gelsinger and his leadership team have previously said that Intel understands its disadvantaged position and is working aggressively to remedy it. To be sure, the sale of a minority stake in Altera would allow Intel to more easily pursue its semiconductor fabrication ambitions and assuage investors that it has a strong path forward as an independent company.\n\nBut the sale process also comes as Qualcomm has expressed interest in acquiring its onetime rival, a deal which would face fierce regulatory scrutiny and reshape semiconductor industry. Intel has to grapple with a significant debt load, and has seen its stock plunge more than 50% year-to-date.\n\nSource: https://www.cnbc.com/2024/10/18/intel-seeks-billions-for-minority-stake-in-altera-business-sources-say.html",
  "link_flair_text": null,
  "id": "1g66y0u",
  "num_comments": 10,
  "created_utc": 1729215409,
  "permalink": "/r/stocks/comments/1g66y0u/intel_seeks_billions_for_minority_stake_in_altera/",
  "comments": [
    {
      "id": "lsgozoj",
      "score": 25,
      "body": "Still wouldn’t touch Intel with a ten foot pole right now.\n\nNever forget nana.",
      "permalink": "/r/stocks/comments/1g66y0u/intel_seeks_billions_for_minority_stake_in_altera/lsgozoj/",
      "created": 1729216759,
      "depth": 0,
      "replies": [
        {
          "id": "lshj1ju",
          "score": 6,
          "body": "Buy high sell low",
          "permalink": "/r/stocks/comments/1g66y0u/intel_seeks_billions_for_minority_stake_in_altera/lshj1ju/",
          "created": 1729230990,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lsjm4ya",
          "score": 8,
          "body": "i've heard this exact comment at least 5 times this year, switching intel with:   \n  \nBanks; Microstrategy; Coinbase; China; Crowdstrike. \n\nThen, when the stock turns it around, the comments becomes \"ooh but it was obvious, with the (government backing) and (strategic importance), it was never in question it was gonna recover\".",
          "permalink": "/r/stocks/comments/1g66y0u/intel_seeks_billions_for_minority_stake_in_altera/lsjm4ya/",
          "created": 1729267007,
          "depth": 1,
          "replies": [
            {
              "id": "lsjv4fg",
              "score": 4,
              "body": "Intel is quite a different beast to right this time around compared to the others, even with government backing and strategic importance, it is very capital intensive to do what they're trying to do, couple it that it comes at a time of weakness for the company, and so there is a lot of doubt on the chances of intel recovery, which makes it quite a risky thing to go long on.",
              "permalink": "/r/stocks/comments/1g66y0u/intel_seeks_billions_for_minority_stake_in_altera/lsjv4fg/",
              "created": 1729269861,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lslbyrx",
              "score": 3,
              "body": "Any company that doesn’t go under will eventually post a profit.  \n\nThat doesn’t mean any real money will be made off of it by buying any time soon.",
              "permalink": "/r/stocks/comments/1g66y0u/intel_seeks_billions_for_minority_stake_in_altera/lslbyrx/",
              "created": 1729287011,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lsi5hnl",
          "score": 4,
          "body": "I remember people saying the same thing about AMD and glad I brought a ton at $2.50.  Anything below $20 is a good buy.",
          "permalink": "/r/stocks/comments/1g66y0u/intel_seeks_billions_for_minority_stake_in_altera/lsi5hnl/",
          "created": 1729246060,
          "depth": 1,
          "replies": [
            {
              "id": "lsitv6p",
              "score": 5,
              "body": "This time it's different",
              "permalink": "/r/stocks/comments/1g66y0u/intel_seeks_billions_for_minority_stake_in_altera/lsitv6p/",
              "created": 1729257584,
              "depth": 2,
              "replies": [
                {
                  "id": "lsjrpvx",
                  "score": 3,
                  "body": "Buy AOL.",
                  "permalink": "/r/stocks/comments/1g66y0u/intel_seeks_billions_for_minority_stake_in_altera/lsjrpvx/",
                  "created": 1729268790,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lshq7eo",
          "score": 1,
          "body": "Buy calls leaps ..",
          "permalink": "/r/stocks/comments/1g66y0u/intel_seeks_billions_for_minority_stake_in_altera/lshq7eo/",
          "created": 1729235579,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lsjt47e",
      "score": 6,
      "body": "Reverse monopoly. A struggling company spends their cash to try to prop up another struggling company. \n\n\nThe positives: Nepotism execs can now send their kids to either company and not be accused of nepotism.",
      "permalink": "/r/stocks/comments/1g66y0u/intel_seeks_billions_for_minority_stake_in_altera/lsjt47e/",
      "created": 1729269230,
      "depth": 0,
      "replies": []
    }
  ]
}