{
  "title": "OKLO - Multimillionaire Maker",
  "score": 234,
  "selftext": "One of many examples from the DOE you can can find if you take a few minutes to do research vs just spewing random bullshit that sounds good:\n\n\"Revitalize and strengthen the front- end of the nuclear fuel cycle and domestic nuclear industry: Smartly decrease undue permitting and regulatory burdens on industry to level the domestic playing field and value attributes provided by U.S. commercial nuclear power;\"  \n[https://www.energy.gov/articles/restoring-americas-competitive-nuclear-energy-advantage](https://www.energy.gov/articles/restoring-americas-competitive-nuclear-energy-advantage)\n\n**TL;DR:**  \nOklo is a highly speculative but potentially transformative investment, driven by its advanced nuclear reactor technology and leadership under Sam Altman. While there’s no revenue yet, the company’s micro-reactor technology has secured significant partnerships, including a pilot with the U.S. Air Force, a deal with Equinix, and a partnership with Diamondback Energy. Oklo’s decentralized grid model offers energy resilience and scalability, especially in military and data center applications.\n\nOklo represents a once in a lifetime opportunity to get in early on a company that can likely achieve a 100bn market cap within 10 years. A decentralized grid adds stabilities that even an extremely redundant grid has difficulties providing.\n\n**This is a highly speculative investment. There's no revenue, and you are making a bet that this technology will 1) work 2) gain traction.**\n\n**Board / Leadership:**\n\nAs stated above, this is a highly speculative investment. In these cases, I believe one of, if not the most important factors are the people in charge. In this case, we have a board led by non-other than Sam Altman. Sam's ambitions for OpenAI and his own need for tremendous energy are probably the largest thing in Oklo's favor. Either you believe in Sam Altman, or you don't. It's similar to how/why TSLA achieved its silly market cap, and despite Elon's constant over promises and under delivery TSLA has market cap of 691.56bn at the time of writing.\n\n* **Sam Altman** – **Board Chair** \\- if you don't know who he is or why this matters, just stop reading now.\n* **Chris Wright** \\- CEO of Liberty Energy, bringing extensive experience in the energy sector. His knowledge of energy technologies and market dynamics supports Oklo's efforts to position its advanced reactors within the broader energy landscape\n* **Richard Kinzley** \\- Chief Financial Officer at Black Hills Corporation, a diversified energy company. His expertise in financial management and regulatory compliance aids Oklo in navigating the financial aspects of the energy industry.\n* **Lt. General John Jansen (Ret.)** – **Board Member** \\- Lt. General John Jansen is a retired officer of the United States Marine Corps with a distinguished military career. His leadership experience and strategic planning skills contribute to Oklo's organizational development and operational excellence.\n\n**Current Projects and Department of Energy Progress**\n\n1. Micro-Reactor Pilot Program with the U.S. Air Force\n2. In August 2023, the Department of the Air Force, in partnership with the Defense Logistics Agency Energy, announced a critical milestone in piloting advanced nuclear energy technology. They issued a Notice of Intent to Award (NOITA) a contract to Oklo Inc. to site, design, construct, own, and operate a micro-reactor facility at Eielson Air Force Base in Alaska. This facility will be licensed by the Nuclear Regulatory Commission (NRC).\n3. **Energy Resilience:** The ability to generate reliable power in remote locations enhances operational readiness and mission assurance for military installations.\n4. **Scalability:** Successful implementation could lead to broader adoption across other military bases, indicating a significant market expansion within the Department of Defense.\n5. **Strategic Advantage:** Utilizing advanced nuclear technology aligns with national interests by promoting energy independence and reducing reliance on fossil fuels.\n6. Partnership with Diamondback Energy\n   1. In April 2024, Oklo signed a non-binding Letter of Intent (LOI) with Diamondback Energy Inc., a major independent oil and natural gas company operating in the Permian Basin. The agreement outlines plans for a 20-year Power Purchase Agreement (PPA) where Oklo would supply 50 megawatts of reliable and emission-free electricity using its Aurora powerhouses.\n      1. **Terms:** Oklo intends to license, build, and operate powerhouses capable of generating 50 MW of electric power, with options to renew and extend the PPA for an additional 20 years.\n      2. **Business Model:** Oklo's design-build-own-operate approach allows customers like Diamondback to purchase power without complex ownership issues or significant capital investments.\n      3. **Long-Term Partnerships:** Extended PPA options indicate confidence in the technology's longevity and reliability.\n7. Potential in Data Centers\n   * **Equinix Deal (April 2024)** Equinix, a leader in data center colocation and the largest data center real estate investment trust (REIT), is pioneering the integration of nuclear energy into its infrastructure. In April 2024, Equinix entered into a groundbreaking agreement with Oklo, putting down $25 million to secure between 100–500 MW of power from Oklo’s small modular reactors (SMRs). Equinix aims to purchase this energy under long-term contracts, signaling a significant step toward transforming data center energy sustainability. Oklo’s SMRs are designed to generate up to 15 MW of power and can operate for over a decade without needing refueling, offering a scalable and reliable energy solution. The partnership demonstrates the data center industry's growing interest in accelerating the transition to nuclear energy, with a focus on reducing carbon footprints and enhancing energy reliability.\n   * **Wyoming Hyperscale Partnership (May 2024)** In May 2024, Oklo announced a partnership with Wyoming Hyperscale, a leading sustainable data center developer. The collaboration aims to deliver 100 MW of clean power to Wyoming Hyperscale’s state-of-the-art data center campus through Oklo’s Aurora powerhouse. This partnership aligns with the growing trend of AI-driven digitalization, which is rapidly increasing the demand for sustainable and scalable energy solutions.\n\n**Department of Energy Progress**\n\n* **Approval of the Aurora Fuel Fabrication Facility Conceptual Design:** In a significant milestone, the DOE approved the conceptual design for Oklo's Aurora Fuel Fabrication Facility, located at Idaho National Laboratory (INL). This facility will be instrumental in converting used nuclear material recovered from the DOE’s former EBR-II reactor into usable fuel for Oklo’s advanced nuclear power plants. The facility will fabricate high-assay low-enriched uranium (HALEU) fuel, sourced from the EBR-II reactor, for the Aurora powerhouse—a liquid-metal-cooled fast reactor designed to operate on both fresh HALEU and used nuclear fuel.\n* **Fuel for Aurora:** The Conceptual Safety Design Report, submitted earlier this year to DOE’s Idaho Operations Office, outlines the safety and operational design of the facility, marking an important step in demonstrating advanced fuel recycling technologies. Oklo has been granted access to 5 metric tons of HALEU under a cooperative agreement awarded in 2019. This HALEU will power the initial Aurora reactor core, with the first commercial Aurora powerhouse expected to be deployed by 2027.\n* **Regulatory and Site Development:** Oklo is working closely with INL and DOE to finalize the facility’s design and obtain the necessary regulatory approvals to begin construction. Additionally, Oklo has secured agreements with the DOE to begin site characterization of their preferred location for the Aurora powerhouse at INL, supporting their combined license application to the U.S. Nuclear Regulatory Commission (NRC). DOE will retain ownership of the HALEU during and after its use in the reactor, highlighting a continued collaboration on resource management and safety.\n* **GAIN Vouchers and ARPA-E Support:** Oklo has received ongoing support from the DOE through GAIN (Gateway for Accelerated Innovation in Nuclear) vouchers, which have provided funding to advance the Aurora powerhouse’s design. Additionally, Oklo has secured funding from the DOE's ARPA-E program to demonstrate advanced nuclear fuel recycling technologies, further positioning the company at the forefront of nuclear innovation.\n\n**Implications for Future Growth:**\n\n* **Fuel Recycling Leadership:** The development of the Aurora Fuel Fabrication Facility and Oklo’s collaboration with INL positions the company as a pioneer in fuel recycling technologies, offering significant potential to reduce nuclear waste and enhance fuel efficiency.\n* **Regulatory Confidence:** Oklo’s ongoing progress with DOE and NRC regulatory milestones reflects confidence in its technology and is paving the way for future commercial reactor deployments.\n* **Strategic Funding Opportunities:** Oklo’s partnerships with DOE and other federal agencies continue to unlock funding for research, development, and technology deployment, accelerating the commercialization of its advanced nuclear power solutions.\n\n**EDIT 1:** bunch of people claiming regulatory issues will slow down OKLO. I'd encourage these people to look at the recent DOE publications regarding this, and their language around streamlining approvals to remain competitive. Given the current geopolitical sitaution, I believe it's more likely than not, that in the name of national security this will need to be streamlined. Given the people who support Oklo, they are well positioned to benefit from this.\n\n**EDIT 2: LOL AT ALL THE MORONS WHO DIDN'T BUY OKLO AFTER I POSTED THIS.** \n\n**Positions:**\n\nhttps://preview.redd.it/aa8s04uroqvd1.png?width=1439&format=png&auto=webp&s=0bcfbde96f0d13fa97d8ae666ccf2d6c5c13455b",
  "link_flair_text": "DD",
  "id": "1g7cr74",
  "num_comments": 236,
  "created_utc": 1729355501,
  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/",
  "comments": [
    {
      "id": "lspffot",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 23 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1dhlyia/vz_upside_from_iphone_apple/) \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspffot/",
      "created": 1729355504,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lspmqyv",
      "score": 209,
      "body": "More into the companies mining uranium. Selling the picks and shovels…",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspmqyv/",
      "created": 1729357908,
      "depth": 0,
      "replies": [
        {
          "id": "lsr532o",
          "score": 18,
          "body": "+1 on that...uranium was already in a large supply deficit before the just-starting-boom in SMRs. Now the demand tailwinds are starting to pick up as well. u/putridfries u/goldandkarma u/True_Swimming_2904 u/Putrid_Race6357 \n\nTheres a good DD list of future factors [https://docs.google.com/spreadsheets/d/107orNKWThCBA279JCmhx5jbXaL2n4it1PqmQHRgnasM/edit?gid=0#gid=0](https://docs.google.com/spreadsheets/d/107orNKWThCBA279JCmhx5jbXaL2n4it1PqmQHRgnasM/edit?gid=0#gid=0)\n\nhttps://preview.redd.it/npm9oy04gsvd1.png?width=2916&format=png&auto=webp&s=ef9319d194c9b371d3e026a62c478deb5f92f77c",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsr532o/",
          "created": 1729376525,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lsq4e9g",
          "score": 38,
          "body": "same here. less speculative play that also has immense upside",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsq4e9g/",
          "created": 1729363690,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lspuedg",
          "score": 4,
          "body": "Which ones are you looking at currently?",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspuedg/",
          "created": 1729360415,
          "depth": 1,
          "replies": [
            {
              "id": "lsrkami",
              "score": 20,
              "body": "UUUU and DNN all the way.   Full disclosure I own both.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrkami/",
              "created": 1729382201,
              "depth": 2,
              "replies": [
                {
                  "id": "lu9czcf",
                  "score": 1,
                  "body": "Uranium is going to lag the reactor producers.  Need reactors to need uranium, duh",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lu9czcf/",
                  "created": 1730157066,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "luker8v",
                      "score": 1,
                      "body": "Sure, but if you invest in an SMR company you don't get any upside to nuc energy. As I see it, you're essentially hedging directly into the AI hype.",
                      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/luker8v/",
                      "created": 1730313860,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lsq37du",
              "score": 26,
              "body": "$UUUU",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsq37du/",
              "created": 1729363297,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lsq8w9q",
              "score": 21,
              "body": "DNN",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsq8w9q/",
              "created": 1729365224,
              "depth": 2,
              "replies": [
                {
                  "id": "lst6ftk",
                  "score": 7,
                  "body": "DNN is tight as hell... rock it!",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lst6ftk/",
                  "created": 1729409259,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lsrwoqx",
                  "score": 5,
                  "body": "[deleted]",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrwoqx/",
                  "created": 1729387003,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lss554p",
                      "score": 2,
                      "body": "Well at least 2026. But if things seem to be going well as predicted idk 2028-2030. Maybe longer, need to see how the picture develops as time goes on.",
                      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lss554p/",
                      "created": 1729390383,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lstywft",
                  "score": 3,
                  "body": "Awesome",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lstywft/",
                  "created": 1729427472,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lsr2rrl",
              "score": 6,
              "body": "I have URNM. Its been good/bad for me.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsr2rrl/",
              "created": 1729375662,
              "depth": 2,
              "replies": [
                {
                  "id": "lsr5bw5",
                  "score": 3,
                  "body": "Good ETF choice 👏 It has a nice basket of uranium miners and the actual commodity of uranium. Good upside while reducing individual company risk, dilution risk and jurisdictional risk.",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsr5bw5/",
                  "created": 1729376616,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lsr634x",
                      "score": 8,
                      "body": "Since I've had it, it underperformed spy, which is my baseline. So I'm generally annoyed. Hope only goes so far. But this is wsb so no one cares about smart investments.",
                      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsr634x/",
                      "created": 1729376898,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lsr6hrd",
                          "score": 1,
                          "body": "Yeah...URNM might take 6 - 18mo to start outperforming IMHO as the supply deficit can only be held off for so long thru dwindling inventories and loans.",
                          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsr6hrd/",
                          "created": 1729377051,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lsqaclx",
              "score": 13,
              "body": "Cameco.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqaclx/",
              "created": 1729365722,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lsqw4ns",
              "score": 2,
              "body": "NexGen",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqw4ns/",
              "created": 1729373217,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lsubffl",
              "score": 2,
              "body": "CCJ",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsubffl/",
              "created": 1729432708,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltgmdru",
              "score": 1,
              "body": "URA",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/ltgmdru/",
              "created": 1729743074,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lsq2zrp",
          "score": 3,
          "body": "I have UROY. What is your opinion?",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsq2zrp/",
          "created": 1729363231,
          "depth": 1,
          "replies": [
            {
              "id": "lsrq8vq",
              "score": 3,
              "body": "Sell it.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrq8vq/",
              "created": 1729384494,
              "depth": 2,
              "replies": [
                {
                  "id": "lsrrjz1",
                  "score": 1,
                  "body": "Why?",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrrjz1/",
                  "created": 1729384993,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lsswtn2",
                      "score": 4,
                      "body": "It’s not a miner.  Royalties haven’t been done with uranium.  Might work but personally I’d stick with miners",
                      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsswtn2/",
                      "created": 1729403074,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lsth70f",
          "score": 2,
          "body": "For example?",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsth70f/",
          "created": 1729416742,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lsuv8gl",
          "score": 1,
          "body": "isn't the production of uranium being regulated though ? little likelyhoow to see big gains there",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsuv8gl/",
          "created": 1729439496,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lsuverf",
          "score": 1,
          "body": "That worked super well with EVs and Lithium... Wait a minute",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsuverf/",
          "created": 1729439551,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lszeaib",
          "score": 1,
          "body": "Do these reactors use other fuels like thorium salt or exclusively uranium?",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lszeaib/",
          "created": 1729505086,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lsznh9z",
          "score": 1,
          "body": "GE Vernova (GEV) is a much better play for that strategy.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsznh9z/",
          "created": 1729510375,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lu8r9o0",
          "score": 1,
          "body": "Not applicable here. OKLO doesn’t need uranium, they’re using recycled nuclear waste, and have enough to power all potential plants for 100 years. It also makes Oklo the best bet bc they can save tons of money this way. More customers, more profits, cheaper energy.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lu8r9o0/",
          "created": 1730150051,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lspkxq2",
      "score": 35,
      "body": "Op, when are they getting revenue?",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspkxq2/",
      "created": 1729357329,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lspgnhg",
      "score": 113,
      "body": "The regulatory approvals alone will take years to get. They don't hand out these things like candy, even if you are a successful programmer. You really think that the current hype will last through years of money losing and slow regulatory progress?",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspgnhg/",
      "created": 1729355911,
      "depth": 0,
      "replies": [
        {
          "id": "lsrbor4",
          "score": 14,
          "body": "This is an old talking point before the recent demand surge and geopolitical risk. If this type of local energy solution is needed for the US to compete in AI, we will get it done. OKLO’s design was tested and proven over three decades at INL, making it less risky relative to novel designs from their peers.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrbor4/",
          "created": 1729378990,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lsq8u78",
          "score": 22,
          "body": "Disagree. We are in a tech race with China.(think of the race to the moon but ai and ai peripherals) The government isn’t going to lose this one",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsq8u78/",
          "created": 1729365205,
          "depth": 1,
          "replies": [
            {
              "id": "lsqo6j9",
              "score": 5,
              "body": "Idk, government probably dislikes nuclear even more than the public. You’ve got oil & gas lobbyists teaming up with environmentalists to shoot it down, not to mention all the “nuclear scary” people.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqo6j9/",
              "created": 1729370460,
              "depth": 2,
              "replies": [
                {
                  "id": "lsqx31r",
                  "score": 29,
                  "body": "I work in the utility industry. The fear of rolling blackouts and skyrocketing rates due to big data is way bigger than the worry about nuclear. The smr revolution is happening.",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqx31r/",
                  "created": 1729373560,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lujfddc",
                      "score": 1,
                      "body": "If you don't mind sharing, what companies are on your radar? The established ones like rr/wrestinghouse  or the startups -- and why?",
                      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lujfddc/",
                      "created": 1730303414,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lukpdfl",
                          "score": 1,
                          "body": "It’s all very speculative right now because none of the public companies have built anything in the US. To my knowledge The private ones are the only ones making moves in actual construction. I haven’t seen where to buy into Westinghouse. \n\nFwiw: I bought smr at $2.49, oklo at $8.20, nne at $11.34, rycey at $2.34.",
                          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lukpdfl/",
                          "created": 1730317016,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "luksfl9",
                              "score": 1,
                              "body": "Thanks for sharing. As for Westinghouse, CCJ/Brookfield is now 49/51 owner as of last year. \n\nhttps://www.cameco.com/media/news/cameco-and-brookfield-complete-acquisition-of-westinghouse-electric-company",
                              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/luksfl9/",
                              "created": 1730317915,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lsy23nb",
                  "score": 4,
                  "body": "You don’t think Microsoft or Amazon or Google or Meta have any influence with the government? They are all racing to secure base load power that meets their carbon emissions commitments. December last year cop28 accord to triple nuclear by 2050. But big tech has seen this coming for a long time. Sam Altman first met with oklo in 2014. The deal announced a few weeks ago for Microsoft to reopen three mile island was a watershed moment. This is happening.",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsy23nb/",
                  "created": 1729477583,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lstxhhl",
              "score": 1,
              "body": "If the government were so insistent on winning this, there wouldn't be part 810 controls preventing \"export control\" of this material, especially advanced reactors, with China.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lstxhhl/",
              "created": 1729426775,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lspjdin",
          "score": 21,
          "body": "It did for $UBER",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspjdin/",
          "created": 1729356821,
          "depth": 1,
          "replies": [
            {
              "id": "lspjuqp",
              "score": 24,
              "body": "Let's be honest... it still is for $TSLA. Where is FSD? Maybe next year in a few cities for robo taxi as well?",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspjuqp/",
              "created": 1729356980,
              "depth": 2,
              "replies": [
                {
                  "id": "lspq7so",
                  "score": 12,
                  "body": "FSD is a scam though, we cant call a slow process on that because it simply doesnt work so there's 0 chance of being approved right now.",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspq7so/",
                  "created": 1729359040,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lspw2f0",
                      "score": 15,
                      "body": "Like micro nuclear home reactors are working dude.",
                      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspw2f0/",
                      "created": 1729360966,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lstz8wx",
                          "score": 1,
                          "body": "Touché",
                          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lstz8wx/",
                          "created": 1729427637,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lspiojm",
          "score": 16,
          "body": "This is a fair questions. I didn't invest in OKLO as a momentum play and I foresee a lot of volatility in the coming years. Ultimately, I do think OKLO has the team to get all the approvals they need with NRC/DOE, etc.\n\nLet's not forget that with Sam Altman, OKLO likely gets added support from **Paul Nakasone** and **Larry Summers**. The amount of energy AI will require at the current pace will require technology like OKLO to meet that demand. Given the current geopolitical environment, I wouldn't be surprised if the we start to see things being accelerated.\n\nFinally, this works in the company's benefit long term. As you point out, this is a fairly large gate. Once they achieve it, it does provide a fairly large protective moat as competitors will have to go through the same process.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspiojm/",
          "created": 1729356589,
          "depth": 1,
          "replies": [
            {
              "id": "lssn2qv",
              "score": 2,
              "body": "I’ve met nakasone a few times when he was the DIRNSA. If he has even heard of OKLO I would be amazed. His role at open AI is cyber warfare related, not energy related. Even so, just slapping a generals name on something as support works for almost no one.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lssn2qv/",
              "created": 1729397974,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lspv26u",
          "score": 6,
          "body": "It used to be literal years, with the advance act it can go from 6 months to 20 months to get approved",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspv26u/",
          "created": 1729360637,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lstqj5h",
          "score": 1,
          "body": "ChatGPT still isn’t making money",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lstqj5h/",
          "created": 1729422998,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lsvomga",
          "score": 1,
          "body": "You're underestimating the power of lobbyist and big tech. Theres more pressure than ever to come up with a power solution.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsvomga/",
          "created": 1729448572,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lsqye95",
          "score": 1,
          "body": "I think this is one thing where a Trump win will be best for this stock. Trump and Elon want to reduce regulatory hurdles, which would bring this product to market faster.\n\nNot wanting to debate politics, but I do think the election drastically affects this stock.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqye95/",
          "created": 1729374036,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lsprjan",
      "score": 13,
      "body": "who's the chief technology officer",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsprjan/",
      "created": 1729359472,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lspm4ug",
      "score": 85,
      "body": "this is being pumped up all over, i'd stay away",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspm4ug/",
      "created": 1729357711,
      "depth": 0,
      "replies": [
        {
          "id": "lspw4sd",
          "score": 14,
          "body": "Id agree.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspw4sd/",
          "created": 1729360988,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lsrbwzy",
          "score": 7,
          "body": "It’s big money seeking long-term sector exposure now that AI demand is beginning to actually materialize. This isn’t a ‘pump and dump’ investment.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrbwzy/",
          "created": 1729379075,
          "depth": 1,
          "replies": [
            {
              "id": "lst9p15",
              "score": 1,
              "body": "Okay…. Then tell us why this stock and not other 10 companies working on the same thing!",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lst9p15/",
              "created": 1729411515,
              "depth": 2,
              "replies": [
                {
                  "id": "lszb7j2",
                  "score": 3,
                  "body": "Because the chairman is also the chairman for OpenAi, people will go bananas when it gets announced they’re working together.",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lszb7j2/",
                  "created": 1729503009,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt8e1mf",
                      "score": 1,
                      "body": "OpenAI doesn't have data centers, they use Azure. Their partnership with MSFT likely rules out AWS, GCP and META as potential partners for good.",
                      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lt8e1mf/",
                      "created": 1729629607,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lszn6ge",
                  "score": 1,
                  "body": "Technically speaking, other companies ARE working on the same thing and are experiencing the same growth.\n\nLook at nuscale for example, they also promise nuclear for predictable energy for data centers- their stock almost doubled in the past month",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lszn6ge/",
                  "created": 1729510222,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lstuw4r",
          "score": 4,
          "body": "Reads like those penny stock write ups before a pump and dump. What the fuck is a non binding letter of intent?",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lstuw4r/",
          "created": 1729425446,
          "depth": 1,
          "replies": [
            {
              "id": "lsznpex",
              "score": 3,
              "body": "> What the fuck is a non binding letter of intent?\n\nBackup toilet paper.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsznpex/",
              "created": 1729510487,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lsuqo0l",
          "score": 1,
          "body": "its only up %200 in the last month! what do you mean?!? /s",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsuqo0l/",
          "created": 1729438001,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lsqedx1",
      "score": 12,
      "body": "Always love the DDs when company is up 100% in the past week.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqedx1/",
      "created": 1729367096,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lspzxah",
      "score": 29,
      "body": "I think people are underestimating the time frames when it comes to nuclear power. You don't just flip a switch on this thing. Even three mile islands reactivation of the reactor shut down in 2019 will take years\n\nIt's the future and without a doubt the most efficient way to expand the power grid, but this won't be something up and running and fully functional in like 2027. Nuclear energy is great but the regulatory hoops will take a while\n\nAnd it should, we've learned much about nuclear energy in the last 50 years that will make it even more safe, but again this won't be flipping a switch. There will be plenty of money to be made from nuclear energy, but this one is a pump and dump",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspzxah/",
      "created": 1729362225,
      "depth": 0,
      "replies": [
        {
          "id": "lsqe5rn",
          "score": 7,
          "body": "Not to mention growing competition from renewables. It’s worth just taking a scroll through all the products being funded by the same programs that are funding this, like ARPA-E. Efficiency, reliability, cost, storage, everything is being improved on by lots of companies. Nuclear may be surpassed before these decades-long processes even get close to completion. \n\n*Those* are the companies to take note of for IPO.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqe5rn/",
          "created": 1729367019,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lsrcddd",
          "score": 1,
          "body": "How are these timeframes unrealistic aside from your vague pessimism? What reasons to you have to believe that OKLO will not deploy their 15MW at INL by 2027, or even 2028? It’s not a novel design, their reactor (EBR2) already had ran for three decades between 1964-1994, they are building a replica.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrcddd/",
          "created": 1729379243,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lsq94xz",
      "score": 8,
      "body": "LEU is the “shovel” in this situation. Supplier of HALEU",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsq94xz/",
      "created": 1729365307,
      "depth": 0,
      "replies": [
        {
          "id": "lsr5o07",
          "score": 2,
          "body": "Excellent picks and shovel play...URNM is another beneficiary of that same approach",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsr5o07/",
          "created": 1729376742,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lsrr577",
          "score": 2,
          "body": "I'll do you one better, Centrus is using gas centrifuge tech, invest in companies developing centrifuges and sell the shovel making tools and the shovels",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrr577/",
          "created": 1729384835,
          "depth": 1,
          "replies": [
            {
              "id": "lstxrpt",
              "score": 1,
              "body": "Centrus is stuck making 20kg a year because the DOE can't give them any more centrifuges",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lstxrpt/",
              "created": 1729426919,
              "depth": 2,
              "replies": [
                {
                  "id": "lsv5fm7",
                  "score": 1,
                  "body": "Hmm this is interesting \nDo you mind sharing where you got this info from ? I am researching the whole nuke area and would like to see for myself",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsv5fm7/",
                  "created": 1729442752,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lsu9rex",
              "score": 1,
              "body": "I'll do you one better.  CCJ has **REAL** contracts through its 49% ownership https://info.westinghousenuclear.com/news/westinghouse-selected-by-u.s.-department-of-energy-for-haleu-contract",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsu9rex/",
              "created": 1729432073,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lssy4an",
      "score": 6,
      "body": "stop playing just buy sprott physical uranium $SRUUF",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lssy4an/",
      "created": 1729403854,
      "depth": 0,
      "replies": [
        {
          "id": "lsu2ix3",
          "score": 3,
          "body": "Agreed …ticker is $SRUUF in USA and $U.UN on the Canadian exchange",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsu2ix3/",
          "created": 1729429117,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lspssob",
      "score": 25,
      "body": "Up 175% in the past month…. I ain’t buying that shit ![img](emote|t5_2th52|4271)",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspssob/",
      "created": 1729359885,
      "depth": 0,
      "replies": [
        {
          "id": "lsqgiq1",
          "score": 2,
          "body": "Interesting people said same thing about asts then it went up 500 more percent",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqgiq1/",
          "created": 1729367827,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lsrcng8",
          "score": 1,
          "body": "You don’t think the company could be worth more than $2B in the long term? NuScale is currently worth $5B and they are farther behind in timelines.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrcng8/",
          "created": 1729379345,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lsqbfbj",
      "score": 10,
      "body": "'Sam Altman led'\n\n'While theres no revenue yet....'",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqbfbj/",
      "created": 1729366081,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsqacb8",
      "score": 5,
      "body": "I’ve been picking up shares here and there of Oklo and SMR … up over 100% on SMR and about 50% oklo\n\nDNN and CCJ are where most of my chips are at though in the nuclear sector. \n\nCCJ has Westinghouse so they are a full spectrum nuclear company. From mining to reactors to waste. And they have SMRs. And they have built reactors all over the world. \n\nOklo had a contract but it is pending and investigation in Alaska. So I am watching that before deciding to invest more.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqacb8/",
      "created": 1729365719,
      "depth": 0,
      "replies": [
        {
          "id": "lsu9hp8",
          "score": 3,
          "body": "You forgot refining and HALEU production that CCJ owns.  Something about real contracts versus future contracts makes it the real hidden gem.\n https://info.westinghousenuclear.com/news/westinghouse-selected-by-u.s.-department-of-energy-for-haleu-contract",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsu9hp8/",
          "created": 1729431968,
          "depth": 1,
          "replies": [
            {
              "id": "lsxewwk",
              "score": 1,
              "body": "Yes you’re right. I just did a quick recap of some things off the top of my head, but researching CCJ you can see they have their claws sunken into seemingly every aspect of the nuclear industry.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsxewwk/",
              "created": 1729468902,
              "depth": 2,
              "replies": [
                {
                  "id": "lsy8eac",
                  "score": 2,
                  "body": "Yeah, now I just need them to report decent earnings on 11/07.  I'm chest deep in $35 LEAPS bought near their low.  I could use a nice 10x.",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsy8eac/",
                  "created": 1729480029,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lsq2pmc",
      "score": 24,
      "body": "Yeah just wait until they fall back $5 again then maybe buy. This is a 2027 play.\n\n!banbet OKLO drop below $7 before 2027. 1 week ban.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsq2pmc/",
      "created": 1729363140,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsppqnl",
      "score": 22,
      "body": "They’ll dilute shares because they make no money and will need to scale to be competitive. I do not like this stock right now. Once they have a viable path of revenue and profitability, I’ll get in. Not right now; it’s a quintessential meme stock.\n\nMy advice: Sell. You got a lucky bump.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsppqnl/",
      "created": 1729358883,
      "depth": 0,
      "replies": [
        {
          "id": "lspqwmr",
          "score": 27,
          "body": "Yeah, I’m going to listen to a guy named GoodbyeNVDA.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspqwmr/",
          "created": 1729359266,
          "depth": 1,
          "replies": [
            {
              "id": "lsptkum",
              "score": 37,
              "body": "You’re right. Now, I hope you hold OKLO. Don’t ever sell. If you do, you’re a pussy.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsptkum/",
              "created": 1729360143,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lsr5i9c",
          "score": 2,
          "body": "Definitely dilution risk with OKLO at some point...but not sure when. They'll need a lot more cash eventually.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsr5i9c/",
          "created": 1729376683,
          "depth": 1,
          "replies": [
            {
              "id": "lsrcus9",
              "score": 4,
              "body": "They are fully funded through first couple of builds through 2028, in part because they were awarded fuel by the DOE and they have $240M in the bank thanks to the SPAC.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrcus9/",
              "created": 1729379418,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lsq9huw",
      "score": 8,
      "body": "The nuclear run is just starting. Everyone in this thread will look like fools come next week",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsq9huw/",
      "created": 1729365431,
      "depth": 0,
      "replies": [
        {
          "id": "lsrdlt8",
          "score": 4,
          "body": "Yeah what we’re seeing is a somewhat expected reaction of people who are unfamiliar with the company/sector seeing a large recent run-up in price. Are they actually looking into the root cause of *why* it’s running up in price? No, of course not. Instead it’s all about labeling it a pump and dump, mostly because they’re envious of the early crowd.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrdlt8/",
          "created": 1729379696,
          "depth": 1,
          "replies": [
            {
              "id": "luji59q",
              "score": 1,
              "body": "Can you elaborate on why you don't see CCJ/RR as competition? Aren't they also in the SMR space?",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/luji59q/",
              "created": 1730304247,
              "depth": 2,
              "replies": [
                {
                  "id": "lujqkq1",
                  "score": 1,
                  "body": "hey John- I see them as long term competition but not really in the short-term domestically. This makes a big difference, given that the US is projected to be a global leader in AI- which will require massive data center rollout w/ local energy needs.\n\nCCJ has AP1000 developed through Westinghouse, but those aren’t classified as SMRs and lack the GenIV advanced reactor benefits (cost & scalability, nuclear recycling etc). They are currently developing an AP300 to compete with OKLO, but that SMR won’t be available until early 2030s and is a novel design.\n\nRR is starting to make headwind w/ SMR development in Europe, however it will be awhile before the expand to US given little to no prior involvement with the NRC, especially given their novel design. I expect them to compete within the US around mid-2030s.\n\nIn short, OKLO’s 2027 target will allow for significant first mover advantage. Given their owner & operator approach to sell power through PPAs instead of designs, it will allow them to debt finance future builds after 2027 using future cash flows. Projected breakeven for each reactor is 6 years, with a 20+ year lifetime before refueling is required. With each new site approval after 2027 taking as little as 7 months, they will be able to scale rapidly and dominate market share, similar approach as UBER or AMZN in the early days.\n\nThere is risk of course, but I see them as the best long-term bet, especially given the connection to OpenAI.",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lujqkq1/",
                  "created": 1730306782,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lukd2ot",
                      "score": 1,
                      "body": "Thank you for the insights, I'm trying to learn about this space. As an outsider, I've been bullish on nuclear for energy reasons, and I see this recent AI hype as a potential cause to get the ball rolling. If you don't mind some further questions: \n\n1. What are the the most significant potential impediments you see towards OKLO's 2027 target? Especially any that could kill momentum until the mid-2030s?  For example, I don't have any idea that NRC will approve OKLO recent LPP given that it seems completely novel. Given the time-sensitivity and the NRC's prior denial, this concerns me. Do you share the same concern?\n\n2. Are you familiar with this supply chain in general? I'm wondering if the correct investment for me is perhaps further up the chain.",
                      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lukd2ot/",
                      "created": 1730313368,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lspvyco",
      "score": 8,
      "body": "What does it make to praise, love and adore a new company which has 0 service to common people, and hate mistrust companies like tesla, Facebook, or every other. \nIts intersesting. \nI belive you are talking only of gambling and speculating.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspvyco/",
      "created": 1729360929,
      "depth": 0,
      "replies": [
        {
          "id": "lspwfjo",
          "score": 15,
          "body": "It's almost like I posted to WSB and wrote in bold:\n\n**This is a highly speculative investment. There's no revenue, and you are making a bet that this technology will 1) work 2) gain traction.**",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspwfjo/",
          "created": 1729361086,
          "depth": 1,
          "replies": [
            {
              "id": "lsq22tb",
              "score": 1,
              "body": "Still , there are no fans for Products of well established comp",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsq22tb/",
              "created": 1729362934,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lsq4var",
              "score": 1,
              "body": "so you made that bet with very strong position, do you have a reason to believe it's likely that 1) and 2) will happen? Btw I also have a position. Just curious, what makes you convinced.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsq4var/",
              "created": 1729363849,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lsqe2bp",
      "score": 3,
      "body": "> Secured [...] a pilot with the U.S. Air Force\n\nMakes sense, the air force would need a lot of them",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqe2bp/",
      "created": 1729366986,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsr0ye0",
      "score": 3,
      "body": "If it was called Open Uranium and was a non profit maybe I would have considered it",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsr0ye0/",
      "created": 1729374977,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsrf7zy",
      "score": 3,
      "body": "Completely agree on the long-term opportunity here. It also makes sense why people feel reluctant given the recent run-up in price. There’s a reason for this though, given that demand has significantly materialized from big tech, and now we’re seeing big money flooding in for SMR sector exposure. This company had virtually no awareness within the investment community until last week. Due to this, there’s likely a much higher relative price floor than others are eluding to- it’s now baked into the cake so to speak. This is not a ‘pump and dump’ investment.\n\nThere are plenty of reasons to believe why OKLO would win in this space, OP did a great job of capturing those above. They have the healthiest balance sheet amongst SMR projects, a strong leadership team with PhDs, first mover advantage within the NRC application process and have hired on former regulatory staff, reactor technology that was already proven through decades of testing between 1964-1994, unique expertise within uranium recycling, and probably most importantly, partnership commitments driven by a robust commercialization model that is scalable and profitable overtime. This fits well with the future local energy needs of AI data centers.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrf7zy/",
      "created": 1729380298,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lssdcs4",
      "score": 3,
      "body": "I would rather bet on Orano, they have been recycling waste for 55 years. They are already quite established internationally.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lssdcs4/",
      "created": 1729393706,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsq7epu",
      "score": 3,
      "body": "My father in law used to say that IF he was 4 feet shorter he could walk under tables. His point was IF.\nI purchased OKLO at 8.93 and sold 40 % at 15.48 only to watch it spike again the following day.\nI reduced my position for money management purposes to reduce my risk. I'll continue to hold my remaining shares and I'll wait to see IF they prove themselves or not.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsq7epu/",
      "created": 1729364714,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lspw0ew",
      "score": 2,
      "body": "🚀🚀🌙",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspw0ew/",
      "created": 1729360948,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsqbnbi",
      "score": 2,
      "body": "Counterpoint: the market is so forward looking that potential revenue sources in the far future are starting to be priced in now",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqbnbi/",
      "created": 1729366158,
      "depth": 0,
      "replies": [
        {
          "id": "lubzju4",
          "score": 1,
          "body": "at only a 3B market cap?",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lubzju4/",
          "created": 1730201701,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lsqmc4w",
      "score": 2,
      "body": "I had 100 shares and sold a $10 CC. Fuck me.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqmc4w/",
      "created": 1729369829,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsqre34",
      "score": 2,
      "body": "If you managed to make money on this shitco, SMR or NNE congratulations, now take the profits and move into companies that will make actual money in this sector.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqre34/",
      "created": 1729371558,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsr49th",
      "score": 2,
      "body": "If I'm heavily invested in NLR and minor in FANG, isn't that enough exposure to the sector? Oklo seems to risky and speculative at this stage. It seems so far from any real revenue or profit.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsr49th/",
      "created": 1729376222,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsrfj9y",
      "score": 2,
      "body": "What do you guys think about the Nukz Etf? Would it be better just buy stock in the “best” 10 holdings or is this etf worth the expense fee and any dead baggage it may hold? I think it may be my route until I’m better educated, also feeling late to the party in general.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrfj9y/",
      "created": 1729380415,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsw2g6f",
      "score": 2,
      "body": "The CEO of OKLO is incredibly impressive.  Look up his interviews on YouTube or Spotify.  Guy is so legit.  Oh, he’s also advised by Sam Altman and Peter Thiel…",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsw2g6f/",
      "created": 1729452788,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsxahun",
      "score": 2,
      "body": "Where da fuck were you 1 month ago with your DD when this stock was around $6’s!!?",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsxahun/",
      "created": 1729467239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lspsqzs",
      "score": 5,
      "body": "Wow, Scam Altman. I don’t think Elon 2.0 is as capable of getting people convinced on his bullshit. \n\nI feel like when they decided to build him they threw in a little bit of Zuckerberg genes. A bit of the alien lizard ones. 👽🦎",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspsqzs/",
      "created": 1729359870,
      "depth": 0,
      "replies": [
        {
          "id": "lspv8vc",
          "score": 1,
          "body": "yea please give 2 examples of Altman being a scammer.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspv8vc/",
          "created": 1729360698,
          "depth": 1,
          "replies": [
            {
              "id": "lsr43ag",
              "score": 7,
              "body": "He's milking investors with AGI just like Elon has been doing with FSD. Drove competent and moral people away from OpenAI and turned the company into a desperate for profit money losing sinkhole that will swallow a lot of value from the market when the shit hits the fan. Yes these are not facts but he's Elmo material in my book too",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsr43ag/",
              "created": 1729376155,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lspzb9y",
              "score": 4,
              "body": "1) Selling a shitcoin crypto 2) taking advantage of poors by harvesting biometric data in lieu of said shitcoin. 3) using an NPO designation when beneficial for tax purposes and murky oversight, while having an LP for venture.  While this isn’t a scam, I’ve seen how this turns out a couple times in my career.  It leaves an accountability gap that can create incredible conflicts of interest and opens the door for fraud.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspzb9y/",
              "created": 1729362023,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lspwrp8",
      "score": 4,
      "body": "Ok grandpa, let’s go back to bingo!",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspwrp8/",
      "created": 1729361199,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsqcspd",
      "score": 4,
      "body": "These are pump and dumps at the moment imo. The boat already left for this round. Will they some day? Possible. I thought about it before the pump and did my research and just felt it was too risky. I was tired of locking up money and missing opportunities for so long. I'm not in a rush to set some bags down, and hold some different ones.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqcspd/",
      "created": 1729366553,
      "depth": 0,
      "replies": [
        {
          "id": "lsre1gi",
          "score": 2,
          "body": "Right, because recent stock appreciation always has to be driven by a ‘pump and dump’, right? It’s definitely not because large money is seeking long-term SMR sector exposure now that AI demand is materializing…",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsre1gi/",
          "created": 1729379856,
          "depth": 1,
          "replies": [
            {
              "id": "lsrkutl",
              "score": 1,
              "body": "Nothing new. Why do you think Sam started OKLO. There was already a run up or two and nothing. This will drop again. Then they'll be some news, it'll run up, and back down. So many hurdles and regulations... think EV stocks or like virgin galactic for now.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrkutl/",
              "created": 1729382418,
              "depth": 2,
              "replies": [
                {
                  "id": "lsrmk1g",
                  "score": 1,
                  "body": "Are you comparing the SPAC merger hype to what’s been going on lately in the news to drive the price? I think a lot of that risk has been baked in, and still is. As we see further regulatory streamlining, increased public support, and company progress that will translate to further upside. I agree with you that it’s still a risky bet regardless- not for everyone.",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrmk1g/",
                  "created": 1729383076,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lsrngof",
                      "score": 1,
                      "body": "What I'm saying is these are one negative article away from dropping back down. That's my thesis. It may be wrong, but I wouldn't consider it until it drops again. Then I say load up for the next positive article.",
                      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrngof/",
                      "created": 1729383426,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lsrnt2g",
                          "score": 1,
                          "body": "Yeah I think a future OpenAI partnership might be half baked into the current valuation- I wonder when that would happen",
                          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrnt2g/",
                          "created": 1729383558,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lsrrwh8",
                              "score": 2,
                              "body": "All I know is these are like 2030 type stuff. Anything is possible till then which is why I dont think current prices are worth it. I am pro nuclear though so I'm excited for the prospects of smal scale, large scale, mining, ect., and I'm glad to hear these titans are getting involved. There was a docu out there correlating excess energy with increasing the quality of life and a next wave of industrialization. Certainly beats renewables!",
                              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrrwh8/",
                              "created": 1729385127,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lsrtc1l",
                                  "score": 1,
                                  "body": "Yeah, well put. I do think that 2030-2040 will type time frame for mass-scaling, essentially everything before that is approval and getting everything ready for commercialization. You should keep your eye on the prices going forward though, maybe there will be a better entry point you feel comfortable with! Also I think there’s some ETF options out there too like $NUKZ",
                                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrtc1l/",
                                  "created": 1729385677,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lsrv4ti",
                                      "score": 2,
                                      "body": "I already have a watch list for them. I debated buying around 6. Its not the style I want to play. I don't want that 'darling attachment' emotion. I look for reds lately, not trying to find the next new thing. I'm looking for something that dips so I can swing the rebound.",
                                      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrv4ti/",
                                      "created": 1729386386,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lspvtev",
      "score": 4,
      "body": "This \"DD\" is perfect for the regards here. If you follow, you're the dumb fuck.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspvtev/",
      "created": 1729360885,
      "depth": 0,
      "replies": [
        {
          "id": "lsq9161",
          "score": 5,
          "body": "translated: I was asleep to the very obvious nuclear hype going on all month and now that bulls are making epic gains I'm upset that my balls are too tiny to join them",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsq9161/",
          "created": 1729365271,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lspwidn",
          "score": 5,
          "body": "Buy puts then and post position.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspwidn/",
          "created": 1729361112,
          "depth": 1,
          "replies": [
            {
              "id": "lspxe3q",
              "score": -1,
              "body": "Or ignore you completely.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspxe3q/",
              "created": 1729361403,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lsqa9yl",
      "score": 2,
      "body": "Pump and dump",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqa9yl/",
      "created": 1729365697,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsqczqy",
      "score": 2,
      "body": "they wouldn't have gone public if it wasn't a total scam and a rug pull. The prcess is lengthy like others pointed out and even if this has a future it's highly speculative and risky. I'd get puts short term and benefit from the fomo's",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqczqy/",
      "created": 1729366619,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsqw6nn",
      "score": 2,
      "body": "This post screams try hard pump and dump.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqw6nn/",
      "created": 1729373238,
      "depth": 0,
      "replies": [
        {
          "id": "lsre5if",
          "score": 1,
          "body": "What makes you think that? It seems very easy for you to label things that. How much do you know about the company, sector, and opportunity?",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsre5if/",
          "created": 1729379897,
          "depth": 1,
          "replies": [
            {
              "id": "lsrf1j1",
              "score": 2,
              "body": "Nothing but a bunch of agreements. Other companies already ahead, and smr have been shown to have worse cost/power gen ratio than originally outlined.\n\nThe company has no revenue and no facility.\n\nEDIT: I looked up your history, you are shilling...",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrf1j1/",
              "created": 1729380231,
              "depth": 2,
              "replies": [
                {
                  "id": "lsrg3ts",
                  "score": 2,
                  "body": "What companies do you think are ahead? If OKLO is able to meet their 2027 timeline, or even call it 2028, that would make them the very first domestic deployment. After which, NRC recently mentioned that subsequent approvals could take as little as 7 months for new sites.\n\nYou’re right, they don’t have any revenue or facility *yet*. However they are fully funded through their first couple builds given their fuel awarded from DOE and $240M in the bank. No other SMR company is that well funded right now. Question- why do you think that risk is not baked in at only a $2.3B market cap?",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrg3ts/",
                  "created": 1729380629,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lsrgomu",
                      "score": 2,
                      "body": "It's fucking nuclear power. It will take forever to get anything built and done.\n\nLiterally ticker SMR is farther ahead, and semi owned by Fluor, a company that knows how to build things. There are also companies using SMR pilots in the UK and here in Canada.\n\nThis company is using Sam Altman as a flag, and it will take forever to see any value, or it will pump and dump and leave bag holders for 5 years.",
                      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrgomu/",
                      "created": 1729380839,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lsriquk",
                          "score": 1,
                          "body": "SMR’s soonest deployment won’t be until early 2030’s and it seems like they are getting out of their 12x50MW version since it wasn’t economically viable. Their 6x77MW plant will likely not be deployed until 2033, so in what way are they ahead? Their NRC design license is pointless when it requires a subsequent construction and operating license from the customer.\n\nI agree that Nuclear has taken forever in the past given the red tape at the NRC and historically low public support for it- that’s all changing now, hence the massive stock appreciation lately. This is in spite of the fact that most investors agree with everything you have said- it’s what will continue to drive upside going forward. As further demand from big tech materializes and the NRC continues streamline approvals, it only gets better from here.\n\nI’m not going to change your mind one bit, but keep an eye out for big regulatory news following this election cycle- I think you will be encouraged by what gets done.",
                          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsriquk/",
                          "created": 1729381604,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lsrijs1",
                      "score": 1,
                      "body": "Also, you made some cash on the stock, good for you, no problem making money \n\nBut remember, I see a year ago you are talking about BRLT stock. How is that going today?",
                      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrijs1/",
                      "created": 1729381530,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lsrjxmq",
                          "score": 3,
                          "body": "I follow the news closely on OKLO as a long term investment, I bought in at a very early stage and I have never sold a single share. My account posts are mostly following the SMR space because I moderate a sub that follows that sector closely.\n\nI ran into BRLT because I had gotten my wife her engagement ring from there in 2021 and it was a great experience. After researching the company, it seemed like a good long term investment since they would win market share overtime driven by omnichanel. Unfortunately the post-COVID wedding boom ended and inflation stalled the high end luxury market. As I got more passionate in the SMR space, I did sell that for a loss and put that money into OKLO.",
                          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrjxmq/",
                          "created": 1729382061,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lsrmqlb",
                              "score": 1,
                              "body": "All good. I'm not argumentative, but nuclear hype already popped off, I made some quick money from uranium miners already.\n\nSure looks like you mod the oklo sub...\n\nOther issues for nuclear power gen companies, regulation, speed, NIMBY effect, talent crunch, not to mention other methods of power gen.",
                              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrmqlb/",
                              "created": 1729383146,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lspqqn6",
      "score": 0,
      "body": "This feels like a company that will have a 200 dollar IPO.. 3 years later, it will be down to 5 dollars and 5 years after that 1000 dollars. \nIt's not something for retail investors to put money into yet.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspqqn6/",
      "created": 1729359212,
      "depth": 0,
      "replies": [
        {
          "id": "lspypij",
          "score": 14,
          "body": "It won’t IPO. It’s already “P”",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspypij/",
          "created": 1729361828,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lsppnho",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsppnho/",
      "created": 1729358854,
      "depth": 0,
      "replies": [
        {
          "id": "lsppnl0",
          "score": 2,
          "body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsppnl0/",
          "created": 1729358855,
          "depth": 1,
          "replies": [
            {
              "id": "lspq2yn",
              "score": 1,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspq2yn/",
              "created": 1729358996,
              "depth": 2,
              "replies": [
                {
                  "id": "lspq31f",
                  "score": 1,
                  "body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                  "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspq31f/",
                  "created": 1729358997,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lsppxpk",
          "score": 2,
          "body": "PLTR the ~100bn market cap company? Yes, I agree.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsppxpk/",
          "created": 1729358948,
          "depth": 1,
          "replies": [
            {
              "id": "lspuz9g",
              "score": 3,
              "body": "the same company trading at 100xFCF?",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lspuz9g/",
              "created": 1729360609,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lsqqpt8",
      "score": 1,
      "body": "RemindMe! 3 months",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqqpt8/",
      "created": 1729371326,
      "depth": 0,
      "replies": [
        {
          "id": "lsqqvai",
          "score": 1,
          "body": "I will be messaging you in 3 months on [**2025-01-19 20:55:26 UTC**](http://www.wolframalpha.com/input/?i=2025-01-19%2020:55:26%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqqpt8/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1g7cr74%2Foklo_multimillionaire_maker%2Flsqqpt8%2F%5D%0A%0ARemindMe%21%202025-01-19%2020%3A55%3A26%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201g7cr74)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqqvai/",
          "created": 1729371377,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lsqqvil",
      "score": 1,
      "body": "Up 95% in a week? Puts it is.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqqvil/",
      "created": 1729371379,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsqrm6z",
      "score": 1,
      "body": "RemindMe! 3 months",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqrm6z/",
      "created": 1729371636,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsqsbqv",
      "score": 1,
      "body": "Reminds me of the days when wsb patrons where shilling shitcoins on here",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqsbqv/",
      "created": 1729371877,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsqu5on",
      "score": 1,
      "body": "Honestly just buy puts",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqu5on/",
      "created": 1729372521,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsqx9f1",
      "score": 1,
      "body": "Good DD but you missed the fact that Peter Thiel is a sole limiter partner as well. Palantir can make this more efficient, and will have inside access to service multiple data centers of Palantir clients.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqx9f1/",
      "created": 1729373623,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsr6guf",
      "score": 1,
      "body": "Ah yes the amphetamine fueled hindsight DD.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsr6guf/",
      "created": 1729377042,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsrftko",
      "score": 1,
      "body": "Puts this week.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrftko/",
      "created": 1729380523,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsrjocm",
      "score": 1,
      "body": "Just put life savings into this one! So sure it’s gonna be 500 by year end next year",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsrjocm/",
      "created": 1729381960,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsryzyt",
      "score": 1,
      "body": "TLDR. All in.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsryzyt/",
      "created": 1729387925,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lss4alq",
      "score": 1,
      "body": "Passsssss",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lss4alq/",
      "created": 1729390037,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lss4d0c",
      "score": 1,
      "body": "This is the worst pitch I’ve ever read: There is a guy! Also another guy who was in a different career field!",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lss4d0c/",
      "created": 1729390063,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsselwa",
      "score": 1,
      "body": "So what you're telling us is buy 15P exp 11/15.  Got it.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsselwa/",
      "created": 1729394230,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsswz8g",
      "score": 1,
      "body": "Why didn’t you provide this DD before it went 150%? A little too latr",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsswz8g/",
      "created": 1729403165,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lst0t3i",
      "score": 1,
      "body": "Anyone looking at BWXT? Was reading about more into it today",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lst0t3i/",
      "created": 1729405546,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lst6mxf",
      "score": 1,
      "body": "Just buy rycey",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lst6mxf/",
      "created": 1729409395,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lstr1bf",
      "score": 1,
      "body": "Just the regulatory hurdles to connect to the grid take almost a decade, not to mention the government isn’t just gonna allow any Joe Schmo to deal with spent radioactive fuel rods",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lstr1bf/",
      "created": 1729423296,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lstuzke",
      "score": 1,
      "body": "Anyone want me to sign a non-binding letter of intent to purchase this stock if it flatlines?",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lstuzke/",
      "created": 1729425498,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsukn23",
      "score": 1,
      "body": "NXE... the resource they're sitting on is massive.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsukn23/",
      "created": 1729435992,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsvftfk",
      "score": 1,
      "body": "Haha lost me at Sam Altman ",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsvftfk/",
      "created": 1729445964,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lswhdol",
      "score": 1,
      "body": "Oklo either goes to 0 or 100x in 5 years.   One or another.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lswhdol/",
      "created": 1729457288,
      "depth": 0,
      "replies": [
        {
          "id": "lt0d9n3",
          "score": 1,
          "body": "Unlikely. If they mess up execution I can easily see them being acquired for more than current market cap.",
          "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lt0d9n3/",
          "created": 1729520733,
          "depth": 1,
          "replies": [
            {
              "id": "lt0dowp",
              "score": 1,
              "body": "They haven't build one yet.  AFAIK only China has built a commerical SMR in Linglong One.    It ain't easy.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lt0dowp/",
              "created": 1729520874,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lu8rici",
              "score": 1,
              "body": "You’re laughing your way to the bank today huh? :)\n\nGood DD.",
              "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lu8rici/",
              "created": 1730150125,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lswicde",
      "score": 1,
      "body": "1000 shares already and waiting for the trend…",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lswicde/",
      "created": 1729457577,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lszc52p",
      "score": 1,
      "body": "Builders ran too hard, rotate into miners now, I prefer URNJ for leverage 👌",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lszc52p/",
      "created": 1729503662,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsr2kpw",
      "score": 1,
      "body": "Cool story, I'm staying away from this one. I don't have faith in Sam Altman",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsr2kpw/",
      "created": 1729375588,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsqm5fl",
      "score": 1,
      "body": "RKLB will be sooner I think",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqm5fl/",
      "created": 1729369766,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsqyegf",
      "score": 1,
      "body": "Long post \nPuts",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lsqyegf/",
      "created": 1729374038,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lssa61d",
      "score": 1,
      "body": "You want to invest in uranium and nuclear energy, this ain't it.",
      "permalink": "/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/lssa61d/",
      "created": 1729392376,
      "depth": 0,
      "replies": []
    }
  ]
}