{
  "title": "Disney will name new CEO in early 2026; Gorman to become board chair next year",
  "score": 131,
  "selftext": "Disney has tapped James Gorman to replace Mark Parker as the company’s next chairman, effective in January, as the media giant lays the groundwork to name a successor for CEO Bob Iger in early 2026, the company said Monday.\n\nGorman joined Disney’s board less than a year ago and was named the head of the succession planning committee in August. He will continue to lead that committee after he takes over as board chairman from Nike Executive Chairman Parker.\n\n“The Disney board has benefited tremendously from James Gorman’s expertise and guidance, and we are lucky to have him as our next chairman – particularly as the board continues to move forward with the succession process,” Iger said in a statement. “I’m extremely grateful to Mark Parker for his many years of board service and leadership, which have been so valuable to this company and its shareholders, and to me as CEO.”\n\nParker will step down after nine years on the Disney board “to focus on other areas” of his work, according to a Disney statement. That includes spending more time working on Nike-related matters, according to a person familiar with the matter. Elliott Hill took over as Nike CEO last week, replacing John Donahoe.\n\nEarly 2026\n\nDisney had initially targeted 2025 to announce a successor, as CNBC reported last year. Pushing the date back to early 2026 will give the board more time to conduct due diligence on both internal and external candidates, according to people familiar with the matter, who asked not to be named because the discussions are private.\n\nGorman has experience with succession planning: He oversaw the orderly transfer of power at Morgan Stanley, with Ted Pick succeeding him as CEO there at the start of this year.\n\nSuccession hasn’t been smooth at Disney. The board fired Iger’s handpicked successor, Bob Chapek, in November 2022 after a turbulent tenure that lasted less than three years. Iger returned to the CEO job, and now, Disney shareholders are eager to see a succession plan stick.\n\nIger’s four direct reports — ESPN Chairman Jimmy Pitaro, Disney Experiences Chairman Josh D’Amaro, and Disney Entertainment Co-Chairmen Dana Walden and Alan Bergman — have all interviewed with the succession committee in recent weeks, since Gorman took over in August, according to the people familiar.\n\nGorman said in a CNBC interview in March, before taking over as the board’s succession chair, that Disney was running a “forward-looking, forward-leaning, incredibly disciplined process.”\n\nStill, while putting a specific timeline on naming a successor adds a bit of clarity to the search, it also means the question of who will take over for Iger will continue to hover over the company for another year.\n\nIger has pushed back his retirement five different times to continue to lead Disney as CEO. Activist investor Nelson Peltz focused on the board’s failure to name a lasting successor in his unsuccessful campaign to gain board seats earlier this year.\n\nIger’s current contract as CEO runs until Dec. 31, 2026. He and the board haven’t decided if Iger will extend his board tenure past 2026, said the people familiar.\n\nSource: https://www.cnbc.com/2024/10/21/disney-ceo-succession-plan-board-chair.html",
  "link_flair_text": null,
  "id": "1g8oo5x",
  "num_comments": 33,
  "created_utc": 1729514332,
  "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/",
  "comments": [
    {
      "id": "lt0ikyl",
      "score": 64,
      "body": "Their own product has taught me just because somebody is going away doesn’t  mean somehow they won’t inexplicably show up again later when they don’t know what else to do. ",
      "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0ikyl/",
      "created": 1729522485,
      "depth": 0,
      "replies": [
        {
          "id": "lt18vdg",
          "score": 17,
          "body": "Bob Iger A.I.",
          "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt18vdg/",
          "created": 1729530720,
          "depth": 1,
          "replies": [
            {
              "id": "lt3ffu3",
              "score": 4,
              "body": "We have hologram technology, and now AI. They could enslave him forever...",
              "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt3ffu3/",
              "created": 1729555973,
              "depth": 2,
              "replies": [
                {
                  "id": "lt50x3y",
                  "score": 1,
                  "body": "Bob A.I.ger",
                  "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt50x3y/",
                  "created": 1729582743,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lt1m62i",
          "score": 2,
          "body": "Same with starbucks with their schultz ai",
          "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt1m62i/",
          "created": 1729534799,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt08z6n",
      "score": 52,
      "body": "Whatever they decide, they need to make sure it's a clean break from Iger. No more executive chairman or advisor to the CEO, new guy needs to come in a fresh slate. Not trying to please the old guy or be his puppet as that's what led to the problem with the last dude.",
      "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt08z6n/",
      "created": 1729519256,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt03r9t",
      "score": 16,
      "body": "Iger will actually retire or remain in the shadows?",
      "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt03r9t/",
      "created": 1729517359,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt008lo",
      "score": 24,
      "body": "Too little, too late?",
      "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt008lo/",
      "created": 1729516014,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt0sfa4",
      "score": 4,
      "body": "A random suit? Oh man... Disney might be in trouble",
      "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0sfa4/",
      "created": 1729525636,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt0oy2a",
      "score": 7,
      "body": "The slow moving tragedy that we’ve all watched for years.",
      "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0oy2a/",
      "created": 1729524531,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt0tibz",
      "score": 7,
      "body": "At least for once, they didn’t claimed “toxic fans” for this move…",
      "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0tibz/",
      "created": 1729525972,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt0bwgy",
      "score": -11,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0bwgy/",
      "created": 1729520269,
      "depth": 0,
      "replies": [
        {
          "id": "lt0dq3g",
          "score": 9,
          "body": "The issue isn't the brown people. The issue is shitty stories. \n\nDisney has had no problem making well-recieved movies and shows with characters of all kinds of skin color and backgrounds. \n\nBut sure, \"brown people bad\" /s",
          "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0dq3g/",
          "created": 1729520885,
          "depth": 1,
          "replies": [
            {
              "id": "lt0tpvp",
              "score": 3,
              "body": "Nobody mentioned “brown people” except you…\n\nBut shitty stories written by bad writers hired not based on ability… so the guy might have a point.",
              "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0tpvp/",
              "created": 1729526038,
              "depth": 2,
              "replies": [
                {
                  "id": "lt0ug0g",
                  "score": 5,
                  "body": "> Nobody mentioned “brown people” except you…  \n\n\nBecause DEI is just a thinly veiled dogwhistle. It's very clear what they meant, they didn't even bother to hide it when they replied. From their reply to my comment:   \n\n\n> it's shoving scenes of brown people triumphing over supposed white oppressors down my throat when I came to be entertained.  \n\n\nAnd so far, out of the people who have bothered to reply, you're the first person to mention DEI hires on the writing side. The other chuckleheads are arguing about people of color in the movies. One of them went on a spiel about black people in Rings of Power and Star Wars. ",
                  "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0ug0g/",
                  "created": 1729526263,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lt0fhj8",
              "score": -4,
              "body": "[removed]",
              "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0fhj8/",
              "created": 1729521473,
              "depth": 2,
              "replies": [
                {
                  "id": "lt0fwx1",
                  "score": -2,
                  "body": "> It has nothing to do with brown people, it's shoving scenes of brown people triumphing over supposed white oppressors down my throat when I came to be entertained\n\n\nSuch as...? \n\n\n> Same thing with the dumb marvel scenes of women working together in completely impractical scenarios to overpower men. It's cool if it makes sense, it's fucking stupid if the pretext is \"I won because I'm a woman and women are better than men.\"\n\n\nWhere has this ever happened in an MCU movie/show? There was a single scene in Endgame that remotely fits this description, and everyone thought it was stupid, but it hardly ruined the movie. MCU has gone downhill over the years, but it's not because of your imaginary \"woman beats man because she's a woman\" ",
                  "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0fwx1/",
                  "created": 1729521616,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt0hm1i",
                      "score": -12,
                      "body": "It’s obvious when you look at ticket sales and public opinion. Don’t need to provide you examples just look at the stock, the box office sales etc . People don’t want this shit. The most recent best example would be the Acolyte. Terrible plot, retcon a bunch of established lore, and DEI crap all over it. Instantly not renewed for some seasons. There’s your proof, you can google for more",
                      "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0hm1i/",
                      "created": 1729522172,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt0tvyh",
                          "score": 7,
                          "body": "There's so many logical flaws with that analysis. I wonder how you choose your portfolio",
                          "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0tvyh/",
                          "created": 1729526090,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lt0jais",
                          "score": 11,
                          "body": "When you're making claims that DEI is what's ruining Disney, and \"brown vs white\" and \"women vs men\" stories being the problem, then yeah, you should probably provide examples.\n\n\nYou can make a shitty movie without DEI. Hell, Elemental didn't even have humans and didn't do that well, what's the excuse there?\n\n\n> Terrible plot, retcon a bunch of established lore\n\n\nSeems to me that this is probably the issue and not the brown people... ",
                          "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0jais/",
                          "created": 1729522714,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lt0mbr8",
                              "score": -10,
                              "body": "It’s not just the fact that oh they are brown they are bad. It’s the forced inclusion. Star Wars was all white excluding Lando and then mace windu that was it. To try and include a bunch of people of color NOW is just a forced experiment and it doesn’t align with the established universe. It’s like the elves being black in the rings of power. Ohhh so you want to DEI a bunch of colored people in to lord of the rings because there was none in the movies? That implies that all of these black elves are massacred at some point as they are nonexistent in the movies following chronologically. From the acolyte there were countless cringe moments, cutting her dreads with a lightsaber to seem edgy, chanting space magic to make a force baby, having a scene dedicated to going over pronouns they identify as. Elements is an outlier I agree did poorly due to bad writing and non compelling concept, but the rest of their releases were terrible. These recent marvel movies and recent shows on Disney + have been abysmal . Disney needs to bring back traditional values and not put a second thought into including gay/trans/people of color. It can be about people of color IE mulan I loved, but if it’s about a Nordic princess I don’t think including a funny Asian side character is needed",
                              "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0mbr8/",
                              "created": 1729523692,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lt0qv8p",
                                  "score": 10,
                                  "body": "So... your entire argument is \"they never had black people in Star Wars before\"? Your issue is that in a franchise full of aliens of every color of the rainbow, they decided to cast black people... \n\n\n> It’s like the elves being black in the rings of power. Ohhh so you want to DEI a bunch of colored people in to lord of the rings because there was none in the movies? That implies that all of these black elves are massacred at some point as they are nonexistent in the movies following chronologically.\n\n\nOr you know... They're still around and just aren't on screen because they aren't relevant to the plot. I noticed a distinct lack of hippos in those movies as well. Must mean they were all hunted to extinction, right? \n\n\n> From the acolyte there were countless cringe moments, cutting her dreads with a lightsaber to seem edgy... \n\n\nShe cut her hair to take her sisters place, just like Mulan cut her hair with a sword to take her father's place. Or is your issue with the dreadlocks? \n\n\n> chanting space magic to make a force baby,\n\n\nThat was just a stupid plot point that had nothing to do with DEI and is irrelevant to this discussion \n\n\n> having a scene dedicated to going over pronouns they identify as.\n\n\nThere was no scene \"dedicated\" to going over pronouns. There was a single 2 word comment in once scene about a character's gender. \n\n\n> Disney needs to bring back traditional values and not put a second thought into including gay/trans/people of color.\n\n\nThere it is. All that yapping and you finally figured out what you really wanted to say. You probably could've just said that you don't want gays or blacks in your Disney movies and saved yourself a bit of time ",
                                  "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0qv8p/",
                                  "created": 1729525148,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lt0rnuf",
                                      "score": -7,
                                      "body": "K dude put all your money into Disney stock you are right there is nothing wrong and people aren’t upset. The gays and people of color are completely right and every white man is a a bigot.",
                                      "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0rnuf/",
                                      "created": 1729525398,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lt0sdmh",
                                          "score": 8,
                                          "body": "I never said there wasn't anything wrong with Disney, just pointing out that people of color and gays aren't the problem. \n\n\nAnd clearly people are upset - you just went on a long tirade about gay and black people in Disney movies, but I suspect you're just conflating bad storytelling with your bigoted views",
                                          "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0sdmh/",
                                          "created": 1729525622,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lt0lz97",
                          "score": 2,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0lz97/",
                          "created": 1729523581,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lt0i5p1",
                  "score": -10,
                  "body": "You are 100% correct.  Nothing Disney in my household any more. My kids have noticed it in the movies and have no interest in them any more either",
                  "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0i5p1/",
                  "created": 1729522349,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lt0i9uh",
              "score": -1,
              "body": "It’s the activists. Who said anything about brown people. Your racism is showing.   ¯\\\\\\_(ツ)_/¯",
              "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0i9uh/",
              "created": 1729522386,
              "depth": 2,
              "replies": [
                {
                  "id": "lt0kb5x",
                  "score": 12,
                  "body": "From their reply \n\n\n> it's shoving scenes of brown people triumphing over supposed white oppressors down my throat when I came to be entertained.\n\n\nAt least they can be honest with themselves and acknowledge that they have an issue with the non-white people in the movies. \n\n\nDEI has turned into a dog whistle for people complaining about people of color and women and other minority groups in media and positions of power. \n\n\nBut yeah, I'm the racist one /s \n\n\nYou people act like people of color and women, gays, etc. are the only people capable of making bad choices because it allows you to ignore the real problems ",
                  "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0kb5x/",
                  "created": 1729523044,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lt3g2wb",
      "score": -2,
      "body": "Bobby boy was too deep into the wokeism.   Basically drove the company into the ground.",
      "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt3g2wb/",
      "created": 1729556211,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lszxp3i",
      "score": -1,
      "body": "Interesting stuff!",
      "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lszxp3i/",
      "created": 1729514995,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt0i2pk",
      "score": 0,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0i2pk/",
      "created": 1729522322,
      "depth": 0,
      "replies": [
        {
          "id": "lt0ye8r",
          "score": 9,
          "body": "You’ve been holding?  Good lord….",
          "permalink": "/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/lt0ye8r/",
          "created": 1729527502,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}