{
  "title": "Is Cisco the Modern Day Cisco?",
  "score": 62,
  "selftext": "For the last few months, maybe about a year or so, there have been a lot of smart (and regarded) attempts to liken Nvidia to Cisco by showing their various charts with creative crayon drawings to show whatever angle the person took to try and convince the world the sky is yet again falling, but of course Nvidia charges on - and so does Cisco.\n\nCisco made the components for hardware that was getting pumped up by dot-com mania, and since Nvidia is doing that for AI now, everybody thinks Nvidia is going to tank today or tomorrow or last year lol but whenever the AI bubble might pop, it's probably not today.\n\nSo the question is, why is Cisco worth half a trillion dollars?\n\nThey run on no news, and appear to have innovated nothing for the last 10 - 20 years.\n\nMaybe the equation everybody is missing is:\n\nNvidia =/= Cisco\n\nbut rather\n\nCisco = Cisco\n\nAnd history does have a way of repeating itself.",
  "link_flair_text": "Discussion",
  "id": "1g8rhoh",
  "num_comments": 56,
  "created_utc": 1729522163,
  "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/",
  "comments": [
    {
      "id": "lt0hlkg",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 months ago\n**Total Comments** | 119 | **Previous Best DD** | \n**Account Age** | 2 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0hlkg/",
      "created": 1729522168,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt0ingq",
      "score": 70,
      "body": "The only company that can out Cisco the Cisco is Cisco.",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0ingq/",
      "created": 1729522507,
      "depth": 0,
      "replies": [
        {
          "id": "lt0p55h",
          "score": 23,
          "body": "Let me see that thooooonnnngggg!",
          "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0p55h/",
          "created": 1729524595,
          "depth": 1,
          "replies": [
            {
              "id": "lt11hhv",
              "score": 3,
              "body": "Hahahaha",
              "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt11hhv/",
              "created": 1729528463,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lt3ji2e",
              "score": 2,
              "body": "This comment is gold and I would reward you but I lost all my money trading options.",
              "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt3ji2e/",
              "created": 1729557478,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lt0rruj",
              "score": 6,
              "body": "Use name checks out",
              "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0rruj/",
              "created": 1729525433,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lt0jgfm",
      "score": 34,
      "body": "Cisco is Intel's younger brother slightly less dysfunctional but dna runs deep.",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0jgfm/",
      "created": 1729522768,
      "depth": 0,
      "replies": [
        {
          "id": "lt12k0u",
          "score": 5,
          "body": "DNA rarely runs",
          "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt12k0u/",
          "created": 1729528796,
          "depth": 1,
          "replies": [
            {
              "id": "lt2i33g",
              "score": 0,
              "body": "Ran down your mama’s leg. \n\nSorry, I couldn’t resist.",
              "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt2i33g/",
              "created": 1729544422,
              "depth": 2,
              "replies": [
                {
                  "id": "ltyc6yc",
                  "score": 1,
                  "body": "Damn - no sense of humor at all.",
                  "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/ltyc6yc/",
                  "created": 1729997800,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lt0mveo",
      "score": 25,
      "body": "CSCO is has been basically revenue-flat and earnings-flat for at least 5 years.   \nThey are basically a utility or consumer staple at this point.   \nWhen your router dies, you replace it. Just like a garbage disposal or toaster.  \nNot sure where the valuation comes from except maybe riding NVDA hype.   \nTrailing PE over 22? When it was 14 last April? Pass.",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0mveo/",
      "created": 1729523866,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt0nhee",
      "score": 13,
      "body": "The issue with dot-com valuations was the \"hockey stick\" analysis that was being done to sell the stocks to retail investor. No mention that to maintain the upward trajectory every email inbox would receive 1,000,000 pieces of email, every human on Earth would spend 48hrs a day looking at online ads, and every country would need to reach personal consumption levels on par with the US by 2005.\n\nI worked in the industry at the time. \"Business development\" sales decks were literally insane. Whoever could make the most outlandish projections were being promoted, regardless of whether they were ever successful in delivering anything they ever promised.\n\nPeople who knew what was going on were just on for the ride. The crash was coming. No one knew when. Many people lost a lot of money betting on the crash too early.",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0nhee/",
      "created": 1729524063,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt0je3y",
      "score": 17,
      "body": "> _\"So the question is, why is Cisco worth half a trillion dollars?\"_\n\nPretty sure they are the industry's gold standard when it comes to networking equipment. If not Cisco then who do you think deserves that title? As far as I can tell, they are the \"scaffolding\" of the internet and I do not see any meaningful competition to dethrown them.",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0je3y/",
      "created": 1729522747,
      "depth": 0,
      "replies": [
        {
          "id": "lt0l226",
          "score": 8,
          "body": "For basic switching this is still true, but for Firewalls/security they are generally considered an inferior option to Palo Alto and Fortinet.",
          "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0l226/",
          "created": 1729523286,
          "depth": 1,
          "replies": [
            {
              "id": "lt4mrgn",
              "score": 2,
              "body": "calls on Fortnite",
              "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt4mrgn/",
              "created": 1729573788,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lt0kee0",
          "score": 0,
          "body": "Cisco is a brand name for products that are OEM manufactured (like Nvidia) in various other countries.\n\nThe brand name is popular or familiar among the networking guys who are in their late 40's - 60's that have been running their switches and other boring equipment for a while, but if guys like Sam Altman or even Jensen were to recognize a $250B market cap they could just easily leverage their manufacturing contacts in Korea, China, Taiwan, Malaysia, etc.\n\nTheir only value is that they currently exist.\n\nNvidia could actually gain a lot by eating their business up a little bit to help reduce friction & reduce cost on overall computer systems for the future.\n\nApple, Microsoft, and Google all should be honing in on it. Cisco is a label now, and not a very popular one among the next generation. Plus as a stock it's boring. They are at their previous peak level which means they are headed for a dip - perhaps a dip some may buy - but a dip none the less.",
          "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0kee0/",
          "created": 1729523074,
          "depth": 1,
          "replies": [
            {
              "id": "lt0lkyv",
              "score": 13,
              "body": "> The brand name is popular or familiar among the networking guys who are in their late 40's - 60's that have been running their switches and other boring equipment for a while\n\nPlease, tell me what new company is now doing what Cisco does but better? \n\nHP switches are okay but not nearly as reliable, Ubiquiti has shit support, Cisco bought Meraki, so who has as big a piece of the networking pie as Cisco?",
              "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0lkyv/",
              "created": 1729523454,
              "depth": 2,
              "replies": [
                {
                  "id": "lt0lrgv",
                  "score": 5,
                  "body": "[deleted]",
                  "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0lrgv/",
                  "created": 1729523512,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt0ny7a",
                      "score": 3,
                      "body": "Arista is not a \"new\" company.\n\nGood product though.",
                      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0ny7a/",
                      "created": 1729524212,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lt0ng19",
                      "score": 2,
                      "body": "They're the main competitor to Cisco but they're not really eating Cisco's lunch, they're a fraction of Cisco's size and while we use Arista switches in our data center where latency matters most, we use Cisco in our office where support and reliability matter most.",
                      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0ng19/",
                      "created": 1729524051,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lt0xsjz",
                      "score": 2,
                      "body": "I'll see your Arista and raise you Juniper and Aruba. Point here is, it's not that cisco isn't the cool hip brand to go with or that they are behind in innovation, it's their licensing that is pushing people away from Cisco and looking for better alternatives.",
                      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0xsjz/",
                      "created": 1729527312,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt11fsp",
                          "score": 1,
                          "body": "Both Juniper and Arista are HP.",
                          "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt11fsp/",
                          "created": 1729528448,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lt1icwn",
                              "score": 1,
                              "body": "Juniper buyout hasn’t closed yet but should by early next year",
                              "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt1icwn/",
                              "created": 1729533616,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lt0mzdt",
                  "score": 4,
                  "body": "Agreed. Network/wireless engineer, while I do like a few of the other offerings, Cisco is still far and away the biggest name in the game, and one of the standards in networking.",
                  "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0mzdt/",
                  "created": 1729523902,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lt0pwb3",
                  "score": 1,
                  "body": "Ruckus\n\nEdited to add… ruckus is light years better than Cisco on the back side, and much cheaper.\n\nThe config commands are sleek and simple and it takes just a few minutes to take a switch (networking gear) from zero config to fully running whatever network you want.\n\nCisco is bloated and outdated.",
                  "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0pwb3/",
                  "created": 1729524838,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt0sggl",
                      "score": 2,
                      "body": "Ruckus feels like a toy compared to Cisco, support was useless the few times I dealt with them and I don't know a single customer that runs Cisco switches today that would feel comfortable switching to Ruckus on the backend. I guess if you focus on the SMB sector it's enough to throw in a couple access points and a switch, but when you're talking enterprise customers no one wants to run Ruckus.",
                      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0sggl/",
                      "created": 1729525646,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt0uaa0",
                          "score": 1,
                          "body": "When was the last time you used one? The Brocade days?\n\nI switched over my entire network from Cisco to Ruckus, and run all my access points with a zone controller. 20 site locations spread over 100 miles 15 vlans, around 125 access points, all routing to the top level facility.\n\nThe part that took the longest was getting the switches.",
                          "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0uaa0/",
                          "created": 1729526214,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lt0wdig",
                              "score": 1,
                              "body": "> When was the last time you used one? The Brocade days?\n\nBefore they changed hands half a dozen times and then again 3 or 4 years ago when I was working at a service provider. I'm sure it works great for your situation, I just wouldn't trust it to run my local network, it feels like an incomplete product and it doesn't meet or needs nor do I feel comfortable with the support we received on these products. \n\nI've had Cisco join a call that lasted a weekend while we swapped out and upgraded all of the equipment at a customer location, along with VMware, Microsoft, and IBM. Everyone was on the call just in case something went wrong we'd have immediate assistance. That's the kind of support I expect at the enterprise level, Ruckus just isn't there.",
                              "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0wdig/",
                              "created": 1729526869,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lt0mthy",
                  "score": -2,
                  "body": "Your questions are all valid, and inarguable, when it comes to validating their price/market cap as we both type this. However, we no longer live in a world where those details are sufficient to justify people holding it when there are companies that could also be considered overvalued like the megacaps, but their future story is still being gobbled up by institutional and retail investors.\n\nMaybe institutional investors and people who are knowledgeable about the products (like you) from having direct experience with it - are holding on - but few others are being brought up to speed or into the fold.\n\nTheir steam has no more rationale, and they don't even have a good irational story either. It's just kind of there.\n\nThe fact that they currently have this position you are articulating doesn't mean their stock needs to be as valuable as it is today, especially if one of the other existing hardware manufacturers can easily just replicate another brand of the same gear.",
                  "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0mthy/",
                  "created": 1729523850,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lt0nhli",
              "score": 7,
              "body": "Like corporations care if the \"younger generation\" likes a brand or not.\n\nCost, reliability, support - corporations where downtime costs them $125k an hour only care about not going down, and if it happens, how quickly they can recover.\n\nThe fact you are using people's age as a defining argument shows you should not be anywhere near a networking role.",
              "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0nhli/",
              "created": 1729524065,
              "depth": 2,
              "replies": [
                {
                  "id": "lt0omr7",
                  "score": -1,
                  "body": "Succession planning is important for corporations just as it is for individuals. If Cisco isn't paying attention to recent college grads and what benefits they want or how enticing the recruitment process is, they'll lose employees. Same goes for customers and resellers. It is a b2b sales company for sure, but that doesn't mean the next generation will be closed off to a better product or even a more consistent sales person.\n\nI'm telling you, 24 - 31 year olds who are installing a Cisco switch right now would buy/use one on their customers projects if it came from another competitor even if the only difference was brand name. In fact whoever has the remaining market share that Cisco lacks could beat them with the right investment & direction.",
                  "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0omr7/",
                  "created": 1729524431,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt0qbos",
                      "score": 1,
                      "body": "It has nothing to do with succession planning.\n\nI'm telling you, that those 24 - 31 year olds have little to zero impact on large projects. It will always be about cost, quality, supply and existing infrastructure.\n\nEnterprises buy equipment with a 3 / 5 / 7 / 10 year TCO plan.\n\nIt is rare to see a large company migrate to a new vendor and risk incompatibilities resulting in downtime when they have contracts stating 99.99% uptime guaranteed.",
                      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0qbos/",
                      "created": 1729524975,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt0rxxl",
                          "score": 0,
                          "body": "I didn't say they have impact on large projects. But eventually they will be decision-makers and need to be courted actively. Cisco is old and slow. They are holding on to the past and the future is going to leave them behind like it did in the 2000's. That's the signal everybody in the market has been showing with comparisons to Nvidia. It's a distraction to try to pump up what isn't there.\n\nCisco could still be market leader with half the market cap. That's the point beyond anything else. If they exist at $100B in value, they change nothing in their service, and might even be able to innovate after purging dead weight.",
                          "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0rxxl/",
                          "created": 1729525486,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lt0n53j",
              "score": 3,
              "body": "Not popular among thr next generation? Who cares, cisco is not a consumer brand. Most of their sales are professional. ",
              "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0n53j/",
              "created": 1729523953,
              "depth": 2,
              "replies": [
                {
                  "id": "lt0o29t",
                  "score": 2,
                  "body": "\"The next generation\" applies to technology providers as well. Engineers, electricians, and networking professionals are subject to brand loyalty and similar other qualities that apply to consumers in terms of how they make choices or change their mind. Product sales reps & distributors rule this world. If a competitor to Cisco brought donuts & pretzels to the counter at Wesco they'll be just as competitive as Cisco is lol. It actually doesn't take much from that perspective. The scale of Cisco might be hard to tackle but it's worth a lot less given all these factors and could be beaten quickly by somebody worthy of the task at the executive level.",
                  "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0o29t/",
                  "created": 1729524248,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt186t2",
                      "score": 3,
                      "body": ">If a competitor to Cisco brought donuts & pretzels to the counter at Wesco they'll be just as competitive as Cisco is lol.\n\nHave you ever had a job in your life that wasn't slinging sandwiches or offering fellatio",
                      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt186t2/",
                      "created": 1729530510,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt18pwg",
                          "score": 2,
                          "body": "Have you ever had a job that required selling electrical equipment to desk jockeys in the distribution business?",
                          "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt18pwg/",
                          "created": 1729530673,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lt1bb46",
                              "score": 2,
                              "body": "No but I work at the HQ of a larger manufacturing corporation with about a dozen factory locations where they try to keep the cost down by centralizing and consolidating IT solutions as much as possible. And if you're trying to plan 5-10 years down the line for let's say a factory networking solution (which is mission critical and not just a way to watch MrBeast videos on your phone), you're gonna do it based on requirements and cost.\n\nAnd the thing with Networking is, that it is not as commoditized as you claim. You need people to implement, monitor, test that shit and make sure that manufacturer and service provider still exists. And Cisco absolutely benefits from network effects, vertically integrating implementation and other services and a proven track record. And that shit holds way much more sway for execs or CTOs than donuts and pretzels. Guaranteed.\n\nGranted, I am not an expert on the nitty gritty of networking, but its far more than offering the best donuts or the best price. There are many factors to consider and Cisco's business is not \"just routers at scale\"",
                              "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt1bb46/",
                              "created": 1729531468,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lt1d4h4",
                                  "score": 1,
                                  "body": "Again, you provide a solid and valid argument for why the business of Cisco as a service provider is still necessary.\n\nBut nothing about these defenses of the company have much to do with the underlying conditions that lead to stock price or market cap increases. They are stale.",
                                  "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt1d4h4/",
                                  "created": 1729532018,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lt0rvzr",
      "score": 5,
      "body": "Cisco has a lot of work wife and work husband in UCS group.. they are doomed:) all they want to do is hangout…",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0rvzr/",
      "created": 1729525469,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt0y6eq",
      "score": 3,
      "body": "I haven't seen any stock in a while that's been connected to its fundamentals, and it looks like CSCO is no different. \n\nDon't look at price to earnings, don't look at the discounted cash flow of future earnings, just buy shares and sell them later to a greater fool.",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0y6eq/",
      "created": 1729527434,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt1kv9z",
      "score": 3,
      "body": "Of course it is",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt1kv9z/",
      "created": 1729534395,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt2f6x7",
      "score": 2,
      "body": "Cisco's market cap is $225 Billion, not sure where you're getting half a trillion.\n\nAnd they're trading at 22x earnings, which while a bit high, is very low for the tech sector.",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt2f6x7/",
      "created": 1729543637,
      "depth": 0,
      "replies": [
        {
          "id": "lt2go2k",
          "score": 0,
          "body": "So you agree they're not worth half a trillion, but rather at present, worth a quarter trillion, and they are much less attractive than the rest of the tech sector. That's my point. They don't have a story to run on to add another 10% to their market cap, which means they are destined to lose at least that much. The only real question is whether that will happen this week, this month, or this quarter. Your point is well taken, but think it proves mine.",
          "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt2go2k/",
          "created": 1729544022,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt3s4ni",
      "score": 2,
      "body": "Where u getting half a trillion dollars? I see 225 billion on here.",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt3s4ni/",
      "created": 1729560648,
      "depth": 0,
      "replies": [
        {
          "id": "lt40ua8",
          "score": 1,
          "body": "Today the market cap is $225B. If they are supposedly like Nvidia, they should be looking to double in value over the next year or two based on current projections and sentiment. If you can't tell a story that they will be exponentially increasing in value, how can their present day value be justified? In fact, it stands to reason that their present day value is bloated. They likely aren't actually worth more than $100B market cap, even though they stand as a fixture of their industry. That industry is going to change, they have no answer for it, and that's why I posed the hypothetical - also it helped make people look into it - so we'll see how things go.",
          "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt40ua8/",
          "created": 1729563877,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt0ifwj",
      "score": 4,
      "body": "Cisco has an absolutely fantastic core business. I think it has something to do with networking and electronics. Very bullish.",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0ifwj/",
      "created": 1729522441,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt1ayod",
      "score": 1,
      "body": "I personally loved the thong song, but can he follow it up? Bears chime in",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt1ayod/",
      "created": 1729531364,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt0hs59",
      "score": 1,
      "body": "Insane analysis",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0hs59/",
      "created": 1729522227,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt0m8g7",
      "score": 1,
      "body": "Literally 100% of the world needs networking products. All AI Literally runs on networking also.  Why do ppl sleep on this",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0m8g7/",
      "created": 1729523663,
      "depth": 0,
      "replies": [
        {
          "id": "lt0n5z5",
          "score": 2,
          "body": "You might be right. But nothing about Cisco is protective enough that another OEM brand couldn't modify an existing spec to compete with them. They are considered the \"800 pound gorilla,\" but they are being outpaced in terms of stock market value. I guess that's the most succinct point here. Their company is potentially a requisite for networking, but that doesn't mean it is worth $250B, and their chart looks like an innovative tech company, when they are an old fart by comparison.",
          "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0n5z5/",
          "created": 1729523961,
          "depth": 1,
          "replies": [
            {
              "id": "lt0q5jd",
              "score": 1,
              "body": "It's one thing to build a box...it's another to build a business with the manufacturing, capability, logistics, and support prowess that Cisco has. There's value in what Cisco provides, not just what Cisco sells. Sure a vendor can make a switch or a router, but does that same vendor also gathering global security analytics to identify 0-day attacks and understand what traffic traversed a network with that attack and immediately isolate those machines on the network by dynamically configuring the network? No random OEM can execute on that out of the gate.",
              "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0q5jd/",
              "created": 1729524920,
              "depth": 2,
              "replies": [
                {
                  "id": "lt0rlt5",
                  "score": -1,
                  "body": "If AI hardware can convince dozens of companies to lay off tens or hundreds of thousands of people because of how they imagine they can do things in the next 3 - 5 years, how is a box company like Cisco invulnerable to disruption from a serious competitor.\n\nImagine if Elon said he was going to take it on.\n\nRegards would eat it up so fast your switch would fry.",
                  "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0rlt5/",
                  "created": 1729525380,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt0sjea",
                      "score": 2,
                      "body": "None of what I mentioned was AI though, these capabilities have been around. It's about the platform. These AI hardware companies don't have the platform and they don't have the data. Cisco's TALOS group is second in size only to the NSA. When you have disparate vendors across your tech stack, unless they are all controllable via API you can't build a platform to control the network like Cisco can. And even if they are controllable you still have to build and integrate with everything and then there's the support nightmare when it doesn't. Cisco on Cisco just works.",
                      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0sjea/",
                      "created": 1729525672,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt0t2tb",
                          "score": 1,
                          "body": "I think I can modify my criticism of the company a bit to say, all of the people like yourself who know the industry on a hands-on level are right. It is the biggest, even if not the best, but often ubiquity is the best. However, from a shareholders' perspective they don't offer as much upside as the AI companies, they aren't innovating anything, which means they need to earn more to continue justifying higher stock price.",
                          "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt0t2tb/",
                          "created": 1729525839,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lt282b5",
      "score": -1,
      "body": "# Sega Model 3 Arcade Games. They look so good at 4k and were way ahead of their time.Sega Model 3 Arcade Games. They look so good at 4k and were way ahead of their time.",
      "permalink": "/r/wallstreetbets/comments/1g8rhoh/is_cisco_the_modern_day_cisco/lt282b5/",
      "created": 1729541510,
      "depth": 0,
      "replies": []
    }
  ]
}