{
  "title": "10-year Treasury yield jumps as investors monitor Fed speeches",
  "score": 112,
  "selftext": "It would be interesting to see that 10-year Treasury yield keeps going up when Fed starts to cut interest rates in September 2024 ... something went wrong very probably \\~\n\n&#x200B;\n\n**10-year Treasury yield jumps as investors monitor Fed speeches**\r\n\n[https://www.cnbc.com/2024/10/21/us-bonds-10-year-treasury-yield-in-focus-amid-flurry-of-fed-speeches.html](https://www.cnbc.com/2024/10/21/us-bonds-10-year-treasury-yield-in-focus-amid-flurry-of-fed-speeches.html)\n\n&#x200B;\n\n*The U.S. 10-year Treasury yield jumped on Monday as investors digest a flurry of speeches from Federal Reserve policymakers.*\r  \n\r  \n*The yield on the 10-year Treasury rose more than 9 basis points to 4.172 %. The yield on the 2-year Treasury was up about 7 basis points to 4.025%.*\r  \n\r  \n*Yields and prices move in opposite directions. One basis point equals 0.01%.*\r  \n\r  \n*On a day without any major economic data releases, market participants are likely to scrutinize comments from officials at the U.S. central bank.*\r  \n\r  \n*Dallas Federal Reserve President Lorie Logan said Monday she supports the current move to lowering interest rates, but that a patient approach will be needed.*\r  \n\r  \n*“If the economy evolves as I currently expect, a strategy of gradually lowering the policy rate toward a more normal or neutral level can help manage the risks and achieve our goals,” Logan said during a speech in New York. “However, any number of shocks could influence what that path to normal will look like, how fast policy should move and where rates should settle. In my view, the \\[Federal Open Market Committee\\] will need to remain nimble and willing to adjust if appropriate.”*\r  \n\r  \n*Minneapolis Fed President Neel Kashkari, Kansas City Fed President Jeff Schmid and San Francisco Fed President Mary Daly are also delivering remarks on Monday.*\r  \n\r  \n*The Federal Open Market Committee took the unusual step last month of lowering its baseline interest rate by a half percentage point, or 50 basis points, to a target range of 4.75% to 5%.*",
  "link_flair_text": "FOMC",
  "id": "1g8u0vr",
  "num_comments": 38,
  "created_utc": 1729528352,
  "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/",
  "comments": [
    {
      "id": "lt1ku0j",
      "score": 70,
      "body": "Interesting how markets want the rate to drop fast but don't want any potential recession news.",
      "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt1ku0j/",
      "created": 1729534384,
      "depth": 0,
      "replies": [
        {
          "id": "lt2v58i",
          "score": 14,
          "body": "whats more interesting to me how stocks are climbing higher but the risk free rate is also climbing",
          "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt2v58i/",
          "created": 1729548696,
          "depth": 1,
          "replies": [
            {
              "id": "lt3m2dl",
              "score": 0,
              "body": "I kinda wonder if BlackRock has something to do with that ",
              "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt3m2dl/",
              "created": 1729558418,
              "depth": 2,
              "replies": [
                {
                  "id": "lt5n25k",
                  "score": 2,
                  "body": "Speed has everything to do with it!",
                  "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt5n25k/",
                  "created": 1729596795,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lt3l0cq",
          "score": 11,
          "body": "In my view, the bond and stock market are opposing views. \nBond market traders are generally pessimistic and equity traders are generally optimistic. Bond traders are risk averse and stock traders are profit hunters.\n\nIt’s been proven time and again in the last 2 years.\n\nBond market sees risk of inflation resurging and rates staying higher. Equity market is looking at all the money that will flow into equity from fixed or mma account, once the rates comes down and all the new opportunities of growth in AI.",
          "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt3l0cq/",
          "created": 1729558036,
          "depth": 1,
          "replies": [
            {
              "id": "lt8q3kt",
              "score": 2,
              "body": "Bond traders aren’t expecting a resurgence in inflation, they’re seeing jobs and economic conditions holding up well. The 6-month CPI growth is below 1%.",
              "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt8q3kt/",
              "created": 1729633305,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltfsido",
              "score": 1,
              "body": "Looking at the GS analyst comment, they are worried about the market concentration in top 10 stocks and the high multiple PE. So their projection is S&P equal weighted index will grow at 8% and cap-weighted at 3%.  \nTheir analysis is that market will adjust to lower multiple as we see realistically normal growth ( and not the high growth values given to these companies).\n\nThe higher P/E is a concern, as long as you think growth is linear. Growth is always slightly exponential, unless interrupted by war or large natural calamity.  \nBut now, I think we are going to see an exponential growth in top companies which will make bring the multiples down ( or which justify the higher multiples). We cannot compare it with historical data without accounting for the increasing growth rate.\n\nAnd the large concentration in top company may look strange, till you compare the world now and 20-30 years back. The large companies today are more global than ever and have a bigger slice of overall activity in the world  ( anyone looking for information, today does google search, whereas 20 years back he was going to different libraries and publications. Every company's datacenter is today concentrated into 4 cloud companies, so these cloud companies are going to be big part of economy and hence market).  \nIn this current time, concentration allows growth acceleration. However technology and market are changing so rapidly that concentration in market no longer means you have to be less competitive or survive in slower growth mode.\n\nWith AI tech, we will see a growth acceleration that we have not seen since internet. In a decade. Productivity will be 3x of current, if not more. And the next AI companies will control an even bigger part of the overall work ( and hence the market). And the growth will be much faster than anything we have ever seen. And market will respond to higher growth by going higher.  \nOfcourse more money infusion into market, due to higher deficit will drive this number higher.\n\nIMHO, we will see atleast 13-15% S&P growth, but more likely 17% or higher.",
              "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/ltfsido/",
              "created": 1729731468,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lt1qdsh",
          "score": 5,
          "body": "If people are only looking at the GDP data, the so-called \"recession\" is not going to happen unless (1) people start to spend less and (2) corporates start to cut CAPEX ......\n\nSomehow long-term treasury yield is linked to the demand of treasury bond ...... looks like no one want to hold them though",
          "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt1qdsh/",
          "created": 1729536106,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt81wcv",
      "score": 5,
      "body": "The Fed emergency 50bp cut was a MISTAKE.",
      "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt81wcv/",
      "created": 1729625912,
      "depth": 0,
      "replies": [
        {
          "id": "lt86ymh",
          "score": 1,
          "body": "It's not an emergency cut ... regular meeting scheduled",
          "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt86ymh/",
          "created": 1729627460,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt1bbc4",
      "score": 25,
      "body": "Going by historical data on cyclically adjusted earnings yields and bond yields, it is very likely that bonds outperform the S&P500 over the next decade.",
      "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt1bbc4/",
      "created": 1729531470,
      "depth": 0,
      "replies": [
        {
          "id": "lt2nabb",
          "score": 12,
          "body": "Investing in US bonds will pose a significantly higher risk than it used to. The US government will be increasingly more incentivised to devalue the currency (the real value of its existing debt), as it circles down the debt spiral. In order to avoid eventual debt overload (most of the national budget spent on coupons alone), the real bond yields will need to become and stay negative. In case the private sector stops buying new debt under such unfair conditions, the FED will just buy it instead. It's called the \"inflation tax\", IIRC. The BLS and the media will in the meantime keep cooking the inflation statistics and covering it all up.",
          "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt2nabb/",
          "created": 1729546050,
          "depth": 1,
          "replies": [
            {
              "id": "lt7vkdt",
              "score": 2,
              "body": "Isn't that an argument for bigger cuts? Given that the coupons rate must be below inflation.",
              "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt7vkdt/",
              "created": 1729623961,
              "depth": 2,
              "replies": [
                {
                  "id": "ltbaz0n",
                  "score": 1,
                  "body": "That, and/or they will just let inflation run above coupon rates (whatever they may be). I just don't see how bond holders could win in such a plausible scenario. Not sure if S&P will be a clear winner, either. But since stocks are supposedly more risky than bonds, I would guess, that the overall yields in stocks (price increases + dividends) will remain higher than yields in bonds. There will be corrections, but corrections also happen in bonds (unless held to maturity).",
                  "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/ltbaz0n/",
                  "created": 1729674237,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lt2oa0t",
              "score": 1,
              "body": "So stay away from S&P and potentially bonds. Where do you put the money then?",
              "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt2oa0t/",
              "created": 1729546371,
              "depth": 2,
              "replies": [
                {
                  "id": "lt3lgpm",
                  "score": 1,
                  "body": "TIPS?",
                  "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt3lgpm/",
                  "created": 1729558198,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lt3jzl0",
                  "score": -6,
                  "body": "Gold",
                  "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt3jzl0/",
                  "created": 1729557658,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt3kgvl",
                      "score": 17,
                      "body": "Ammo, canned meat, and titty mags",
                      "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt3kgvl/",
                      "created": 1729557834,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lt2qkfx",
                  "score": -9,
                  "body": "The markets are so screwed up by the ridiculous policies, that one essentially needs to delve deeper and learn a bit of stock picking (and take otherwise unnecessary additional risks, unfortunately).\n\nOr find a reputable fund manager (who actually cares about performance, not just about collecting fees) and invest in an actively managed fund. Sadly, this can only be done based on past performance comparisons, and past performance is not a guarantee of future performance.",
                  "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt2qkfx/",
                  "created": 1729547130,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lt1m8m5",
          "score": 8,
          "body": "10% on bonds for the next 10 years average? I don't think so",
          "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt1m8m5/",
          "created": 1729534821,
          "depth": 1,
          "replies": [
            {
              "id": "lt2igs7",
              "score": 8,
              "body": "I think they're clearly saying that they aren't expecting the *average* return on S&P over the next decade... Which, yes, is around 9-11%, but after the massive bull market we've seen since 2010 and the current PE, there's an argument to be made that the next decade should see lower returns... No one knows for sure though.",
              "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt2igs7/",
              "created": 1729544535,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lt1mrd6",
              "score": -7,
              "body": "S&P500 is likely to return less than 3% over the next decade based on historical data. There has never been a time when P/E ratios were as high or higher than they are now, where returns have exceeded 3%. But there are a lot of cases where returns have been negative or sub 3%.",
              "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt1mrd6/",
              "created": 1729534981,
              "depth": 2,
              "replies": [
                {
                  "id": "lt1uouo",
                  "score": 15,
                  "body": "Just don’t invest in expensive tech stocks. The opportunity is elsewhere",
                  "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt1uouo/",
                  "created": 1729537424,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt1vlh1",
                      "score": 4,
                      "body": "I am invested in small cap value and international stocks as well, but the main issue is that any sort of catalyst that brings down tech stocks will likely bring down SCV/International as well. So bonds are a good hedge to own",
                      "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt1vlh1/",
                      "created": 1729537705,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt2orc0",
                          "score": 1,
                          "body": "Can't you just park the money in a one-month term deposit with (cancellable) automated renewal (and FDIC insurance)? How much more do you get on a bond and is it worth the price risk (+spread+fees)?",
                          "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt2orc0/",
                          "created": 1729546531,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lt2qrd2",
                              "score": 3,
                              "body": "interest rates are expected to decline in the coming months, so the idea is with a bond you lock in those returns over the long term.",
                              "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt2qrd2/",
                              "created": 1729547194,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lt38uhb",
                  "score": 1,
                  "body": "You understand that historical data like that is completely useless for making predictions, right?",
                  "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt38uhb/",
                  "created": 1729553569,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lt5vcnm",
      "score": 8,
      "body": "people here are stupid\n\nthey don't realize 4% interest rate is not high\n\nit's more of standard historical interest rate\n\nstock market hitting ATH, and bond yield going up and yield curve uninverting\n\ntells me that economy is good and it's sustainable even at 4% rate\n\nthat means pre covid era of hyper low interest rate era is over (and it's normal)\n\nmore like it depicts normalization of abnormal era.\n\nunlike other comments it doesn't mean anything is wrong atm and it's not contrary or opposing\n\nbond market and stock market is basically saying the same thing\n\neconomy is good and rate doesn't need to become artificially ultra low\n\nnormalization is here\n\naccording to how it's behaving,\n\nit's very likely big tech (btw, tesla is car company) will post record earning this quarter report so I'm super bullish short term but long term bearish\n\nmy prediction: we will have short squeeze starting very shortly before election with earnings report + after election",
      "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt5vcnm/",
      "created": 1729600500,
      "depth": 0,
      "replies": [
        {
          "id": "lt5ym74",
          "score": 0,
          "body": "But the S&P companies on average are profiting almost 5% more than they historically have done. ",
          "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt5ym74/",
          "created": 1729601807,
          "depth": 1,
          "replies": [
            {
              "id": "lt5ysly",
              "score": 3,
              "body": "earning is important but short term, market sentiment is more important\n\nIm guessing it's going to be super bullish from end of oct - jan\n\nand then Im bearish because asset prices are detached from reality without huge rate cut",
              "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt5ysly/",
              "created": 1729601876,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lt3gx68",
      "score": 2,
      "body": "Goldman Sachs said S&P 3% for a decade.\n\nhttps://www.cnbc.com/2024/10/21/goldman-forecasts-just-a-3percent-sp-500-annual-return-the-next-10-years.html",
      "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt3gx68/",
      "created": 1729556524,
      "depth": 0,
      "replies": [
        {
          "id": "lt58dx6",
          "score": 2,
          "body": "Let's see \\~",
          "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt58dx6/",
          "created": 1729587979,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt1drj8",
      "score": 2,
      "body": "Im ded",
      "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt1drj8/",
      "created": 1729532213,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt1lta5",
      "score": -1,
      "body": "You really want to short the 10 up here expecting yields to keep rising? Dangerous trade",
      "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt1lta5/",
      "created": 1729534688,
      "depth": 0,
      "replies": [
        {
          "id": "lt1srr1",
          "score": 0,
          "body": "Probably isn't actually until we get closer to the election. \n\n\nI'm extremely close to saying this move is no longer hawkish Fed speak/good data related at all. We saw this out of treasury rates back in the summer when the market was thinking it was very likely Trump will be the new president. \n\n\nSo, to keep a long story short, this may be more tariff fears related with the market now giving at least a 70%+ chance it's Trump again.",
          "permalink": "/r/stocks/comments/1g8u0vr/10year_treasury_yield_jumps_as_investors_monitor/lt1srr1/",
          "created": 1729536835,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}