{
  "title": "How are stocks valued in a company? because I think I was given 1% instead of 10%",
  "score": 217,
  "selftext": "I was earning $XXK/Annually, and I agreed to a 90/10 Cash/equity split. So that is technically $X,X00 of equity for the one year of work. The equity agreement they sent me stated that share value is at $0.0X. But when I calculated the total number of shares offered x the share value, it appears I was offered 1% of what I diverted, not 10%. \n\n\nIs this normal? What am I missing?\n\n\nEdit: This is a Medical Device Startup.\n\n**Edit2**: some nuances are omitted so as not to be identifiable\n\nSTOCK INCENTIVE PLAN\n\nSTOCK OPTION AGREEMENT\n\npar value $0.00001 per share, first set forth below\n\nNumber of Shares of Common Stock: XX,XXX\n\nExercise Price Per Share: $0.0X\n\nVesting Commencement Date: XXX XX, 2022\n\nAward Date: XXX XX, 2022\n\nExpiration Date: 10 Years After Award Date\n\nType of Option: Incentive Stock Option\n\nEdit3: Edited all my responses to remove identifying numbers, for reasons.",
  "link_flair_text": "Advice Request",
  "id": "1g93l9n",
  "num_comments": 109,
  "created_utc": 1729552022,
  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/",
  "comments": [
    {
      "id": "lt36e7d",
      "score": 383,
      "body": "Sounds like a question for your company",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt36e7d/",
      "created": 1729552688,
      "depth": 0,
      "replies": [
        {
          "id": "lt3dsr1",
          "score": 38,
          "body": "It's a small company of 3 employees. I was furloughed awhile back, and haven't even been totally let go or converted to a independent contractor yet. Just Limbo. . . \n\n\nI wasn't even given a full employment contract the way the more established and larger companies have you do. Besides the options agreement that I'm discussing here, there is no other documentation that I can fall back to, to clarify any of this. Just an a-hole of a CFO that tried to rip me off and I had to shut him down. I wouldn't trust any of his explanations anyways.",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3dsr1/",
          "created": 1729555363,
          "depth": 1,
          "replies": [
            {
              "id": "lt3n1tf",
              "score": 126,
              "body": "Your boss is an asshole and tried to rip you off? \n\nWhy haven’t you quit ?",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3n1tf/",
              "created": 1729558783,
              "depth": 2,
              "replies": [
                {
                  "id": "lt3sme4",
                  "score": 62,
                  "body": "Reddit in a nutshell.",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3sme4/",
                  "created": 1729560831,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lt3p3e8",
                  "score": 17,
                  "body": "Not my boss, the CFO. Biomedical Engineering isn't exactly a highly sought out degree compared to the primary disciplines. \n\nAlso, I was furloughed in 2022 when this whole thing started. Haven't been back since, nor formally let go.",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3p3e8/",
                  "created": 1729559524,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt47huu",
                      "score": 40,
                      "body": "in 3 people company, everyone is on the decision to screw you. For sure, that decision was not just made by CFO.  \nIf you are doing any work on the side for them, I would suggest just stop . and stop co-operating in anyway. If they need your help badly, then they will come back with a better contract.  \nIf not, chalk it as a learning lesson to always get contract before, not after.\n\nThe reason they will say is, at this time the stock is worth 30cents, not 3 cents as the stock value has risen with company growth. And they are not wrong. That's another reason to get early exercise",
                      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt47huu/",
                      "created": 1729566497,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt4sca8",
                          "score": 12,
                          "body": "I used to consider the former CEO a friend (he's younger than me and extremely naive and lacking in *street smarts*, as he's given me everything I need in writing to pursue legal action if they try to screw me over by denying the equity) which is probably why he stepped down from CEO to CTO. \n\n\n\nToday with all these awesome responses I got a clarified understanding of the difference between Options and Shares. Though I'm wondering, if I don't exercise today, can they sell the company tomorrow without my knowledge and not give me a last chance to exercise?",
                          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4sca8/",
                          "created": 1729577075,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lt52g27",
                              "score": 6,
                              "body": "Usually before a fund raise, the startup gets an auditor to evaluate the company. The stock value is reset to this after the funding round. ( reset for everyone including employees). \nThe company founders will warn their employees about this and ask them to pre-exercise before this happens. \nThe founders usually like to keep stock price low, to make it easier for employees to purchase. But stock price will rise after each uproubd funding.\n\nIf you didn’t exercise, then you don’t own the stock. since you don’t own the stock, you have no rights to vote in a company sale.\n\nMy knowledge maybe bit dated though.( or incorrect)",
                              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt52g27/",
                              "created": 1729583809,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lt437uq",
                      "score": 4,
                      "body": "Yet.",
                      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt437uq/",
                      "created": 1729564790,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lt4e1g0",
              "score": 15,
              "body": "This is all red flag territory.  As others have pointed out, perhaps you should consider quitting.\n\nFrom what you described, a 90/10 split on $65,000 per annum would be $58.5k in cash and $6.5k in shares*.  Depending on the share price (e.g. 0.03 per share = 216k shares) you would get more or less shares.\n\n* You mentioned \"options agreement\"... Are you getting shares or share options?  \n\nIf you're getting options, you are not actually being paid in shares but the 'option' to buy an amount of shares at an agreed price at a point in time in the future.\n\nIf you're getting shares, then it's effectively a form of debt/equity swap, i.e. the business is servicing its debt to you by paying you in equity.  In that case the share price may change over time, depending on the circumstances of the business at that time.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4e1g0/",
              "created": 1729569329,
              "depth": 2,
              "replies": [
                {
                  "id": "lt4tne6",
                  "score": 3,
                  "body": "Share options based on my current understanding. I'm not technically working for them. I was furloughed and never transitioned to Independent contractor due to some disagreement about the contract. Been in limbo since mid 2023. \n\n>If you're getting shares, then it's effectively a form of debt/equity swap\n\nis there any site you're aware of or particular terminology/topics that i can read about to fully grasp this concept? I don't want to have another freakout like what pushed me to make this post in the first place.",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4tne6/",
                  "created": 1729577901,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt4uuk8",
                      "score": 3,
                      "body": "It's the lack of any contracts etc that is the concern - apart from what sounds like a basic miscalculation of the volume of shares.  There should be a paper trail for something as complex as this - vesting periods, option pricing etc.\n\nIf it's a smaller business that is not listed (which it sounds like) then they may not even have shares but some other instrument like units in a trust or something like that.\n\nIn terms of reading up on it, nothing specific... There are articles on investopedia and sites like that, but just on reading your circumstances I wouldn't hold out much hope. \n\nWho else are they providing this arrangement to?   If other employees or many of your suppliers are being offered the same deal I would be very concerned.  While a debt/equity arrangement can be beneficial, if the company is struggling it can point to some real financial pressures.  If they are trading \"shares\" instead of paying people, there might be theoretically a shit tonne of shares owed to people, more than the business is worth or that can ever be reasonably redeemed.",
                      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4uuk8/",
                      "created": 1729578675,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt4x8lq",
                          "score": 2,
                          "body": "> If they are trading \"shares\" instead of paying people, there might be theoretically a shit tonne of shares owed to people, more than the business is worth or that can ever be reasonably redeemed.\n\n\nThis may explain why I had difficulty with the CFO when I initially protested not having the Options agreement signed and fully executed almost two years ago. He said that it doesn't look good to new investors to have so many shares distributed, and that I should be patient and as long as I have a copy of the document signed by me, it should be sufficient proof right? (Which based on what I've learned, is a SEC violation?) \n\n\nWith the statute of limitations on Oral Agreements, I couldn't wait any longer, it was either report them to the labor board for unpaid wages, or they fully execute the equity agreement.",
                          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4x8lq/",
                          "created": 1729580233,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lt5p49c",
                              "score": 5,
                              "body": "This guy’s fucking with you. You need to demand your options paperwork to be processed and legally executed. Either that, or threaten legal action. You may be worried about rocking the boat, but don’t worry about that; they obviously do not value your contribution and are using you if they’re treating you like this. They’re taking advantage of the fact that you’ve never done this before.",
                              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt5p49c/",
                              "created": 1729597780,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lt54w7u",
              "score": 3,
              "body": "Given the state of the company you describe they're probably not worth anything. \n\nIf you have no other documentation and the company won't help proving anything may be difficult. The equity agreement stating the value at $0.03, what is the date of that valuation? Is it at the time of purchase (12 monthly installments of $542?) or later? Maybe the value of the shares went down? \n\nAlso, were these shares or options? Because in your first post you call them shares and here options.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt54w7u/",
              "created": 1729585538,
              "depth": 2,
              "replies": [
                {
                  "id": "lt7444j",
                  "score": 1,
                  "body": "It was always framed as equity to me so I understood it as shares and such. Former CEO (My mentor) also didn't understand exactly what it all meant. I've made a second edit to the post with more details.",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt7444j/",
                  "created": 1729615476,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltggosv",
                      "score": 1,
                      "body": "These sound like options, which means you still have to pay $0.0X (which I assume is $0.03) to get each share. There is no point exercising them unless you can sell the shares for more than $0.03. Also, in most cases employee options like these normally expire once the employee leaves the company.",
                      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/ltggosv/",
                      "created": 1729740518,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lt7ezjy",
          "score": 2,
          "body": "This. Ask the company for clarification on how they determined the value of the stock and the overall equity pool size.",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt7ezjy/",
          "created": 1729618817,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt35x1x",
      "score": 59,
      "body": "Is that \"par value\" for the share, or the current share *price*?\n\n(or if your company is private, is $0.03 that the \"fair value\" they're using to calculate your compensation)?\n\nIf this is the \"par value\", then the $0.03 price is meaningless. Your compensation is based on, seemingly, a fair value of $0.30 -- which means you're getting the same amount of equity in absolute dollar terms, but fewer shares because each share is worth more.\n\nYou can probably reach out to your HR for more clarification.",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt35x1x/",
      "created": 1729552514,
      "depth": 0,
      "replies": [
        {
          "id": "lt37ul0",
          "score": 16,
          "body": "It's a private company I think, not sure where they're at atm. At the top the par value is $0.00001 per share first set forth below. \n\nNumber of Shares of Common Stock: XX,XXX\n\nExercise Price Per Share: $0.0X",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt37ul0/",
          "created": 1729553208,
          "depth": 1,
          "replies": [
            {
              "id": "lt39m99",
              "score": 37,
              "body": "I've worked at startups before and this is hard to answer without seeing the full term sheet.\n\n\n\nWhat I will say is: Exercise price is what you're buying it for, not what it's worth. What it's worth is hard to say with a private company, as they usually dictate when and who you can sell to.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt39m99/",
              "created": 1729553846,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lt41kk8",
              "score": 14,
              "body": "So your company market cap is 700 usd?",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt41kk8/",
              "created": 1729564156,
              "depth": 2,
              "replies": [
                {
                  "id": "lt4r84k",
                  "score": 1,
                  "body": "A while back it was *supposedly* 10 Mil. The 700USD is what my options were valued at, but my understanding of it and math were all wrong.",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4r84k/",
                  "created": 1729576384,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lt4dce3",
              "score": 9,
              "body": "Exercise price means you got options not shares. You strike (or buy shares) at $0.03. They’re worth whatever the current FMV of them are. This a good thing. If share price is $1, you net 0.97. If it was higher you net less.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4dce3/",
              "created": 1729569008,
              "depth": 2,
              "replies": [
                {
                  "id": "lt4tgv7",
                  "score": 3,
                  "body": "Since I just got it signed, and the CEO clarified for me that their latest valuation was at $0.XX, then I should just spend the $XXX or so and get those shares. Small risk for XX,000 shares. The device is novel and doesn't have an equal AFAIK.",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4tgv7/",
                  "created": 1729577787,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt574r5",
                      "score": 3,
                      "body": "It honestly seems like a win-win imo — if you think the stock price will go up (which it sounds like you do) you can just keep the shares and sell them when you need the money and if you think it won’t go higher than $0.59 you can still exercise the options and net an almost 20x ROI. Of course you can also choose a combination of the above two options and just sell some of the shares at 20x and hope the rest will go even higher.\n\nThis assumes of course that you’re able to sell your shares to someone and without more info it’s hard to say how troublesome that would be.",
                      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt574r5/",
                      "created": 1729587097,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lt6yesh",
                      "score": 1,
                      "body": "Depends when do the options expire?",
                      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt6yesh/",
                      "created": 1729613724,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt76x1n",
                          "score": 1,
                          "body": "in 2032. I guess my next line of questioning is that if I choose to wait on exercising, and they sell the company or do a IPO, will this negate the options? Are they required to inform me?",
                          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt76x1n/",
                          "created": 1729616320,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lt39885",
              "score": 3,
              "body": "idk what to tell you then, sorry",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt39885/",
              "created": 1729553706,
              "depth": 2,
              "replies": [
                {
                  "id": "lt3b9pu",
                  "score": 5,
                  "body": "Thank you for your time, nonetheless :)",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3b9pu/",
                  "created": 1729554440,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lt381ys",
          "score": -8,
          "body": "Unfortunately, the HR guy is also an asshole that I've had issue with and had to go over his head to the CEO and throw legal threats against to even get my Options agreement signed off on.",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt381ys/",
          "created": 1729553282,
          "depth": 1,
          "replies": [
            {
              "id": "lt3k71k",
              "score": 20,
              "body": "So its the HR guy, Ceo, and you, lol all 3 employees?",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3k71k/",
              "created": 1729557735,
              "depth": 2,
              "replies": [
                {
                  "id": "lt3l5v1",
                  "score": 5,
                  "body": "No, I was furloughed. \n\nCEO (New guy), \n\nCFO (just an asshole), \n\nCTO (Former mentor and CEO while I was still there fulltime)",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3l5v1/",
                  "created": 1729558091,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt3zgpe",
                      "score": 25,
                      "body": "So the entire workforce is 3 \"executives\"? What does this company do?",
                      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3zgpe/",
                      "created": 1729563366,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt41ah4",
                          "score": 17,
                          "body": "do execution",
                          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt41ah4/",
                          "created": 1729564048,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lt4cw5h",
                          "score": 7,
                          "body": "Sounds like 4 friends lol",
                          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4cw5h/",
                          "created": 1729568803,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lt4qszh",
                          "score": 3,
                          "body": "The current CEO is doing the public outreach, reaching out investors and basically running the ship etc. \n\nCFO runs the money.\n\nCTO (Former CEO) is doing what I used to do before my furlough, all the engineering and legwork.",
                          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4qszh/",
                          "created": 1729576130,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lt4g85f",
                      "score": 11,
                      "body": "This company sounds like a literal joke. It sounds like folks in the medical field who think they can push a successful startup. Cuz they went to medical school. \nNo indication of the company scaling. Your equity is worth nothing. It doesn't exist. \n\nFind a new job and take it as a stripe on your belt. Your written contract is important. And sure, plenty of medical start ups out there. But actually real companies.",
                      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4g85f/",
                      "created": 1729570377,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lt3iups",
      "score": 27,
      "body": "I know it’s too late here, but don’t accept private equity you don’t understand in lieu of cash compensation. There’s too many ways to get screwed over, even when you understand all the mechanics of the offer. If you don’t know how options and exercise prices work, you don’t even understand the mechanics.\n\nAnd, even with the mechanics down, most equity offers you won’t be able to understand.",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3iups/",
      "created": 1729557235,
      "depth": 0,
      "replies": [
        {
          "id": "lt3mqlg",
          "score": 5,
          "body": "Heck! Initially my former mentor asked me to take on 60/40. I said 90/10, and he came back with 75/25. I insisted 90/10. I did want *some* equity at the time because I did believe in the product since i was in that Engineering research lab that it stemmed from. . . had I the luxury I would have probably taken the larger equity portion. But now my mentor/former CEO has stepped down and I'm dealing with different people.",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3mqlg/",
          "created": 1729558666,
          "depth": 1,
          "replies": [
            {
              "id": "lt3ocg5",
              "score": 5,
              "body": "Fair, my advice can be different if you genuinely trust all the people involved. Then maybe it’s more a risk profile decision.\n\nIt’s that even when the big exit comes there’s tons of tricks and potential to devalue either partially or entirely minority positions. In addition to the actual business bet,  equity in a small private is basically a gamble that the dominant shareholders and buyer will not screw you over.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3ocg5/",
              "created": 1729559248,
              "depth": 2,
              "replies": [
                {
                  "id": "lt3podl",
                  "score": 1,
                  "body": "Is there any steps I can take to be more proactive in defending against the attempts to screw me over? I don't doubt the CFO and his parent Venture capital company (where he is also the CFO of) will try something. Especially since I've probably created the most friction with them, and he has already said some things verbally that would make the SEC raise their eyebrows. (I think)",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3podl/",
                  "created": 1729559739,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lt56g9z",
              "score": 3,
              "body": "Your mentor was the CEO? Aka the one signing your paychecks? Of course he wanted you to take more equity.. conflict of interest so the advice is shaky…\n\nMost startups fail and the equity is only worth something to you when the company makes a successful exit (sold or goes public). Sounds like the company is going downhill and the stocks will be worthless anyways.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt56g9z/",
              "created": 1729586623,
              "depth": 2,
              "replies": [
                {
                  "id": "lt753sm",
                  "score": 1,
                  "body": "Originally he wasn't, just the Co-Founder, but the first angel investors tried to quickly develop the product and sell fast, but when they realized they couldn't my mentor ended up taking over because they were about to sell it for scraps along with his IP from our University. idk, they've been at it for a few years now, and the device is novel and there aren't any like it. They're still going, and generating interest by a lot of HCP's.\n\nAlso, the CFO was signing the checks, he is a CFO as well for a parent venture capital company. That guy is the a-hole. . . as is expected i guess",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt753sm/",
                  "created": 1729615776,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt9slp0",
                      "score": 1,
                      "body": "Eh, welcome to corporate America, everyone is an asshole some are just a lot better at hiding it.",
                      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt9slp0/",
                      "created": 1729646672,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lt3c0pu",
      "score": 6,
      "body": "You are going to need to look at your contract.\n\nIt should tell you what the terms of your stock are.",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3c0pu/",
      "created": 1729554711,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt396cz",
      "score": 6,
      "body": "Exercise price is what you will pay for these shares when you decide to exercise the option. It is not the fair value.",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt396cz/",
      "created": 1729553688,
      "depth": 0,
      "replies": [
        {
          "id": "lt3b08n",
          "score": 1,
          "body": "So then this refers to \"If I cash out now, I'd only get 1/10th of what I diverted from cash to equity.\" Instead of the full amount I diverted in the first place. .  . I think I'm getting it. . .",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3b08n/",
          "created": 1729554346,
          "depth": 1,
          "replies": [
            {
              "id": "lt3c29d",
              "score": 11,
              "body": "No. Youd get the shares, for 0.03 each. But, what theyre worth is a different question we cant answer without more info.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3c29d/",
              "created": 1729554726,
              "depth": 2,
              "replies": [
                {
                  "id": "lt42db0",
                  "score": 5,
                  "body": "You’d have an idea if the company is granting additional options with a higher exercise price. It would indicate the value of the company is growing. As I noted in a separate response, there is risk that one exercises private company options and pays the exercise price for shares that may never become liquid (eg through an IPO or sale). OP should look at the documentation to see what his rights are as a shareholder in the company in terms of liquidity. OP may want to hold off exercising unless there is a liquidity event keeping in mind that options have expiry dates.",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt42db0/",
                  "created": 1729564462,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lt411qm",
              "score": 2,
              "body": "There is probably some kind of vesting schedule. Eg Some companies issue options that vest annually say 20% of the total grant is exercisable each year over 5 years. What does your documentation say about vesting? Also even though you are in a private company, the option / exercise price needs to be an estimate of the fair value of the underlying stock at the time of grant. There are formulas to calculate this for private companies. \n\nThe problem with stock options for private companies is that you may have to pay cash to exercise the options to get shares that may never become liquid. You may benefit if there is an IPO or a sale of the company.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt411qm/",
              "created": 1729563955,
              "depth": 2,
              "replies": [
                {
                  "id": "lt4r4qm",
                  "score": 1,
                  "body": ">The problem with stock options for private companies is that you may have to pay cash to exercise the options to get shares that may never become liquid. You may benefit if there is an IPO or a sale of the company.\n\nI guess my worry now is that I don't know what's going on since I'm not involved atm. So I wonder, if I don't exercise and they sell the company without telling me, do I just lose it all and am not allowed the chance to exercise? Are the required to inform me that this is happening or can it happen in secret? \n\nRight now I'm just trying to push to get my (what I thought was to be) shares on paper before the statute of limitations expired. I got that today finally, but then started freaking out when I calculated it.",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4r4qm/",
                  "created": 1729576327,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lt36uml",
      "score": 5,
      "body": "the 90/10 split is just from your 65k, right?  what does the total value of the company and the percentage have to do with that?  unless you thought you were getting 10% of the company. but then that would mean the company was just valued at 65k",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt36uml/",
      "created": 1729552850,
      "depth": 0,
      "replies": [
        {
          "id": "lt38qwb",
          "score": 2,
          "body": "Yes, the 90/10 split was from my salary/equity. Which amounts to be almost $6,789 (1 year 2 months)\n\nNumber of Shares of Common Stock: XX,000\n\nThe Exercise Price Per Share: is $0.0X\n\nwhen I calculate them the value is $XXX.XX (1/10th of the value I forgone in lieu of equity.) This is what has me going right now, did they pull a fast one on me and only give me 1% of the salary I diverted instead of 10% or is there something else I'm missing?",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt38qwb/",
          "created": 1729553531,
          "depth": 1,
          "replies": [
            {
              "id": "lt39j37",
              "score": 9,
              "body": "Taking shares instead of cash. In a private company. Is always a fast one.  Unless you are a family member or deep in the circle of lifers you always get fucked.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt39j37/",
              "created": 1729553814,
              "depth": 2,
              "replies": [
                {
                  "id": "lt3cvj2",
                  "score": 3,
                  "body": "I mean. . . I was an undergrad in the lab that this startup stemmed from. The Co-Founder/CEO was my mentor in that lab, but at some point, certain investors got involved and he stepped down. Now I'm in this and another predicament with them.",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3cvj2/",
                  "created": 1729555022,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt5h8sp",
                      "score": 3,
                      "body": ">Now I'm in this and another predicament with them.\n\nYou really need to get off reddit about this one. You've clearly got some fishy other things going on that you won't divulge here (probably rightly so). You should be talking to a lawyer who can help you navigate the situation, any advice you get here simply can't work without the full scope of your situation. It being two years since your \"furlough\" and you're still burning bridges is a giant red flag.",
                      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt5h8sp/",
                      "created": 1729593729,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt75udz",
                          "score": 1,
                          "body": "I was quiet and waiting patiently for them to come through, but somewhere in between the CEO stepped down to another position. I guess out of sight, out of mind.",
                          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt75udz/",
                          "created": 1729615996,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lt39bqb",
              "score": 8,
              "body": "No, you're mixing up the price you would buy those shares (you have options) vs their actual book value (estimate from historical PE block buys)",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt39bqb/",
              "created": 1729553741,
              "depth": 2,
              "replies": [
                {
                  "id": "lt3aqqg",
                  "score": 6,
                  "body": "this. the exercise price is not the FMV price of the company. you want the exercise price to be a low amount",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3aqqg/",
                  "created": 1729554251,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lt43x3z",
              "score": 3,
              "body": "Am I missing something. Forget options vs stock for a second. Are you saying the following:\n1. Your salary was $6789 for when you worked?\n2. 90% of that is cash, 10% is equity/options?\n3. Price for equity/options is $0.03?\n4. Number of shares you have is 22,630?\n\nIf yes, then \n1. 10% of 6789 is $678.90\n2. 678.9/.03 is how many shares/options you should own\n3. That math gives you 22,630.\n\nOr is the $6789 already 10% of your pay which was $67,890? Please correct any wrong assumptions.\n\nEDIT. Wow! I totally missed the first sentence that states 65k annually. Now I get your concern.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt43x3z/",
              "created": 1729565063,
              "depth": 2,
              "replies": [
                {
                  "id": "lt4rjz1",
                  "score": 1,
                  "body": ">Or is the $X,XXX already 10% of your pay which was $XX,XX0? Please correct any wrong assumptions.\n\nThis, yes. But apparently the CEO responded to me told me the FMV at the time was around $0.X0 but the exercise is $0.0X. Supposedly now (Almost 2 years later) the valuation is $0.XX.",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4rjz1/",
                  "created": 1729576586,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lt35t8z",
      "score": 2,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt35t8z/",
      "created": 1729552476,
      "depth": 0,
      "replies": [
        {
          "id": "lt37bzh",
          "score": 1,
          "body": "Common Stock: XX,XXX\n\nExercise Price: $0.0X \n\nTotals at $XXX.XX \n\nbased on the year and two-ish months I was with them it sounds to be exactly 1% instead of 10%.",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt37bzh/",
          "created": 1729553025,
          "depth": 1,
          "replies": [
            {
              "id": "lt38gd2",
              "score": 28,
              "body": "Exercise price is the price you would buy those shares at, not their value",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt38gd2/",
              "created": 1729553426,
              "depth": 2,
              "replies": [
                {
                  "id": "lt3918k",
                  "score": 14,
                  "body": "This is the correct answer. As to who you'd be able to sell those shares to in the company's current state is another question",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3918k/",
                  "created": 1729553636,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lt3a507",
                  "score": 5,
                  "body": "How does one determine the value of their shares at a private company?",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3a507/",
                  "created": 1729554033,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt3kfkf",
                      "score": 8,
                      "body": "The board will meet periodically and set a FMV (Fair Market Value), popular startups will have some price discovery in secondary markets to help justify/validate a current valuation.",
                      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3kfkf/",
                      "created": 1729557821,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lt3fq5k",
                      "score": 2,
                      "body": "You can estimate based on the last time the company raised money, by imputing from how many shares they gave away for that money, but ultimately if there’s nobody to sell those shares to it’s an illiquid asset. Possibly illiquid until company sale, IPO, bankruptcy, or other terms.",
                      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3fq5k/",
                      "created": 1729556079,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt3jkhd",
                          "score": 4,
                          "body": "EBITDA. Most mature private companies aren’t raising money outside",
                          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3jkhd/",
                          "created": 1729557502,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lt3a09h",
                  "score": -5,
                  "body": "That's my gripe, based on that I understand that I should be receiving 10 times the amount of shares for that purchase price. I don't know the current value unfortunately and I don't know if there is a way to know.",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3a09h/",
                  "created": 1729553985,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt3fglj",
                      "score": 8,
                      "body": "If the current or even future value is $0.33 per share, then no you’re receiving the correct amount of shares in the option. To clarify again, $0.03 is the price you pay when you want to receive the stock. It is an option to purchase. It is not the value you receive. If the value you receive for $0.03 is $3 per share you’re making instant 100x profit when you buy, more than what you feel has been promised. If the value is less than $0.03, you would probably not exercise your option to not lose money. These details and hopes of future stock value are things that you had to work out prior.",
                      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3fglj/",
                      "created": 1729555981,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lt38s8k",
              "score": 6,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt38s8k/",
              "created": 1729553545,
              "depth": 2,
              "replies": [
                {
                  "id": "lt3a7g3",
                  "score": -11,
                  "body": "That confuses me more, shouldn't I receive 10 times them amount of shares if the exercise price is $0.03. It seems like they sold them to me at $0.30/share.",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3a7g3/",
                  "created": 1729554058,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt4yugy",
                      "score": 3,
                      "body": "If you have an exercise price they haven't sold you anything yet. They have given you an option to buy a share at that price - probably under some set of conditions",
                      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4yugy/",
                      "created": 1729581308,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lt3qg3g",
              "score": 3,
              "body": "No employee that was furloughed would ever get 10 percent of the option pool.  Options are not shares, they're the right to buy them, often with stipulations like, you gotta be working for the company to earn them.\n\nMost option pools are 10 to 20 percent for the entirety of a companies employees.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3qg3g/",
              "created": 1729560022,
              "depth": 2,
              "replies": [
                {
                  "id": "lt3s06m",
                  "score": 2,
                  "body": "My confusion is the 10% of my salary, in terms of value conveyed in the equity that I was offered. 90/10 Cash/Equity. \n\nI was expecting $X,XXX worth of shares, but what threw me off was Exercise Price Per Share of $0.0X and when I calculated the shares times the value stated, I understood that I only received $XXX worth. But based on what people are saying, that may not be the case, and I need more info about what's going on behind the scenes since it's a private corporation.",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3s06m/",
                  "created": 1729560602,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt3unjy",
                      "score": 5,
                      "body": "That's you're strike price, not the fair market value.  They're valueing the company at 10x that, so $0.30 a share. \n\nThe next question be, who would buy them?  Is the company profitable?\n\nI think you're supposed to offer strikes at or near FMV.  But with a startup that doesn't exist until fundraising rounds or a 409A or 509A I forget what it's called.",
                      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3unjy/",
                      "created": 1729561591,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt3vybw",
                          "score": 3,
                          "body": "That contract is set to expire in 8 years from now. So my understanding of Strike price is that I can buy those shares at the 1/10th value of cash to equity diverted anytime between today and 8 years from now? \n\n\nIf they are fully vested, does that mean I already own those shares or did the 10% equity from my salary just pay to open up this option? \n\n\nSo in other words if I want to cash in and own those shares, I have to pay more money to get them, THEN get to sell them off? \n\n\nsorry ELI5.",
                          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3vybw/",
                          "created": 1729562071,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lt3xmqd",
                              "score": 7,
                              "body": "Yes, you can buy those shares for $670.  Most people don't have the money to buy their shares until a liquidation event, aka someone wants to buy your shares.  \n\nIf it was a public company, you'd buy the shares sell them on the market, theoretically for $6,700 let's say, then pay taxes on 6700 - 670.  \n\nSo you're basically forgoing $6,030 of cash payment in the hope your shares are worth anything someday.",
                              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3xmqd/",
                              "created": 1729562689,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lt3xolp",
                              "score": 5,
                              "body": "i think there's a fundamental misunderstanding. you have 0 equity in the company.\n\nyou have the right to purchase equity, at your strike price of 3 cents. however, if you choose not to exercise it (which means purchasing the shares at 3 cents a piece, 100 shares per contract), the option will expire worthless. this is called a stock option.\n\nthis is different than a RSU, a restricted stock unit, that takes time to vest. this would be given to you up front, and does not require you to purchase.\n\n\n\nyou should also know that startup shares are usually worthless. it can only be sold in a liquidation event, where a company will raise capital by selling shares, either creating them or allowing employees to sell them. Or in an IPO. other than that, it's almost impossible to sell shares",
                              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3xolp/",
                              "created": 1729562708,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lt3oso1",
              "score": 2,
              "body": "Worth noting that options expire, and often rapidly for people who are no longer staff, so if these options haven’t been executed, you may be at risk of owning nothing.\n\nYou need to read all the paperwork or follow up with the CFO.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3oso1/",
              "created": 1729559415,
              "depth": 2,
              "replies": [
                {
                  "id": "lt3r1vl",
                  "score": 2,
                  "body": "So they're marked as fully vested upon signing from XXX of 2022, and a portion of the at the end of 2022. I barely got them signed today due to the CFO's attempted shenanigans I waited in good faith until a few days before the oral agreement statute of limitations expires in 2 days. I know stupid on my part for allowing it to get this far. \n\n\nBut also, I was furloughed a month before I was presented with the equity, but was promised backpay for the time spent with them until they can secure new investors etc. I didn't quit or get terminated. Three months later same CFO tried saying that my contract was terminated on the day I was furloughed, and I responded back that it was not terminated, and no mention of the word termination or any variation was said to me, and that I was told it was a furlough and would be given backpay. He stfu after that.",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3r1vl/",
                  "created": 1729560247,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lt3jtfx",
      "score": 2,
      "body": "head march direction innate zephyr roll sharp faulty deserted memory\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3jtfx/",
      "created": 1729557595,
      "depth": 0,
      "replies": [
        {
          "id": "lt3oltw",
          "score": 2,
          "body": "> If you are believe this startup has a shot at success and you are in a position where they really need you\n\nThey did need me until the CEO stepped down to CTO and started doing my work. I've been furloughed since 2022, and never fully let go or asked to come back yet. What's at stake right now is the Equity that I barely got today (Just days away from the Statute of Limitations) and the rest of the equity I accepted in lieu of cash during the period they promised backpay when I was still doing work remotely. \n\nCFO Tried ripping me off by backdating my Independent Contractor agreement to the original furlough date, but I rejected it. So they still owe me 100% of 2.5 mos of salary in equity. Which should be more shares than this current issue since they were supposed to be issued around the same time. Another thing I need to watch out for.",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3oltw/",
          "created": 1729559345,
          "depth": 1,
          "replies": [
            {
              "id": "lt66r1l",
              "score": 2,
              "body": "dolls selective mysterious frame expansion cobweb spectacular gullible marvelous mourn\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt66r1l/",
              "created": 1729604834,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lt4596b",
      "score": 2,
      "body": "You need a lawyer to look at your employment contract and probably also some of the organizational documents for your company. This is a multifaceted question that deserves more attention than that of some random redditors.",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4596b/",
      "created": 1729565587,
      "depth": 0,
      "replies": [
        {
          "id": "lt4rul6",
          "score": 1,
          "body": "Sadly there's minimal documents between this startup and myself. It's  a weird situation, and mostly emails that prove what I'm owed, but no organizational documents in regards to equity were ever provided to me. Just this latest Option agreement with a 10 year expiration in eight years from now.",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4rul6/",
          "created": 1729576767,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt4aodk",
      "score": 2,
      "body": "Did you get stock or stock options?",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4aodk/",
      "created": 1729567826,
      "depth": 0,
      "replies": [
        {
          "id": "lt4shi7",
          "score": 1,
          "body": "Stock options apparently. It was always framed as *equity* to me. I gave up 10% of my $XXK salary just for the opportunity to buy stocks at a lower price?. . . so either way, my money is gone I assume? Still trying to wrap my head around how that works and the normalcy of it.",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4shi7/",
          "created": 1729577166,
          "depth": 1,
          "replies": [
            {
              "id": "lt5vsit",
              "score": 2,
              "body": "Options are equity. Options lock in the price. If the options haven’t expired, you can sell them or exercise them(which will require you to pay the strike price x quantity(and 1 option usually represents 100 shares). Most people sell options, rather than exercise them(since you’d have to have the cash to buy the shares at the contractual price). Options are an equity contract. You have right to buy at x price by y date, and this contract is a sellable asset.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt5vsit/",
              "created": 1729600682,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lt4b64a",
      "score": 2,
      "body": "1% for a founding engineer is common.\n\nYou can look at YC companies as an example.\n\nNobody gives a non co-founder > 2%",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4b64a/",
      "created": 1729568044,
      "depth": 0,
      "replies": [
        {
          "id": "lt4t2x2",
          "score": 1,
          "body": "I'm considered just an Engineer. My former Mentor/CEO was the one to take our mutual University Professors idea and make it into a product that lead to a startup. He's the PhD student, I was just the undergrad who was really good at prototyping to a point where I got better than him at his own device, hence why they took me on after graduation. \n\n\nFunny enough, he was saying he wanted to offer us all 1% for sticking around (There's 3 full-timers and everyone else is a Indepedent contractor. 7 Others including myself) but this furlough and my refusal to let his promises slide strained stuff between us. They've been quiet, but haven't formally let me go yet. Last word was that once they get proper investing, and take the product to market, they'll bring me back, but that was before the former CEO went to CTO and took over what I was doing.",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4t2x2/",
          "created": 1729577541,
          "depth": 1,
          "replies": [
            {
              "id": "lt4ujmw",
              "score": 2,
              "body": "This is a lesson of making upfront decisions.\n\nAt the start, you should have decided whether to take 1% or X% and join OR not join. Maybe for next time.\n\nThis is going to be messy. Because there is no written agreement. If you want to mess them up, you can bring them a lawsuit. The startup will almost guarantee to fail if you do. But I think you will get more than 1%. There is a small chance that the startup will work though.\n\nNow if you have signed an agreement before, and the agreement didn’t say anything about stocks, then you are in bad luck.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4ujmw/",
              "created": 1729578480,
              "depth": 2,
              "replies": [
                {
                  "id": "lt4wky3",
                  "score": 1,
                  "body": "It was during COVID recovery that I got approached by my mentor/CEO for the position, I had graduated months before Quarantine happened, and still hadn't landed a job after graduation. Most of what I was offered was by the CEO over email, the 90/10 split. When I joined it was a simple employment contract with no mention of the equity. \n\n\nThe current CEO and I just got it fully executed today, two days before the statute of limitations expired for oral/unsigned agreements. Hence my sudden freakout when I did my misunderstood calculations.",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4wky3/",
                  "created": 1729579806,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lt4cpht",
      "score": 2,
      "body": "Two things did you get shares outright or a warrant / option to buy shares? Is your company public or private? If your company is private there could be a difference in what “share price is” in terms of grant vs current market value. ESOPs or share grants for LLCs are typically based off a 409a analysis performed by an accounting firm rather than the then current “market value”. Theres sometimes a timing difference between the last 409a and the last capital raise or market check on share price depending on how small the company is. Smaller growth company’s 409a analysis is more about the financial projections of the company since the last capital raise rather than the current perceived value of it. It’s possible that the share price you see to calculate the value of your grant was done on the 409a but the actual value of the shares is higher. If you got options than it’s in your interest for share price to be low at the time of grant.",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4cpht/",
      "created": 1729568722,
      "depth": 0,
      "replies": [
        {
          "id": "lt4ta68",
          "score": 2,
          "body": "Thanks to all the responses I got, I understand now that it's an Option to buy shares. Private company. \n\nThe current CEO clarified for me that the exercise option is $0.0X per share, but the latest valuation they have is around 20x that. So almost double what my equity portion was supposed to be?",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4ta68/",
          "created": 1729577667,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt4ijh2",
      "score": 2,
      "body": "$0.03 might be the par value and not the market value",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4ijh2/",
      "created": 1729571540,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt4ty9x",
      "score": 2,
      "body": "That stock means nothing until IPO. And since you weren't fully vested, they gave you 1% as a pity. Otherwise it's 0%",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4ty9x/",
      "created": 1729578096,
      "depth": 0,
      "replies": [
        {
          "id": "lt4w390",
          "score": 1,
          "body": "The options were considered fully vested at the end of 2022. I just got that agreement fully executed today, and now I have to exercise the option. Though they are common shares.",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt4w390/",
          "created": 1729579484,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt5lod8",
      "score": 2,
      "body": "What is your vestment schedule? You should be asking HR these questions?",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt5lod8/",
      "created": 1729596108,
      "depth": 0,
      "replies": [
        {
          "id": "lt75zip",
          "score": 1,
          "body": "They were fully vested in 2022.",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt75zip/",
          "created": 1729616039,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt6i45l",
      "score": 2,
      "body": "If it’s not publicly traded, there is no telling.\nYou can use multiples or DCF, but it’s fuzzy. \nThat’s why stocks go up and down, because it’s so hard to value them with all the uncertainties the future holds.\n\nTalm to your company and ask for their calculations.",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt6i45l/",
      "created": 1729608635,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt3ikor",
      "score": 0,
      "body": "OP needs an advisor",
      "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3ikor/",
      "created": 1729557131,
      "depth": 0,
      "replies": [
        {
          "id": "lt3kdbz",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3kdbz/",
          "created": 1729557797,
          "depth": 1,
          "replies": [
            {
              "id": "lt3kq0i",
              "score": 3,
              "body": "They can tell him what he does, or doesn't have, and what options he has. Clearly he is over his head.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3kq0i/",
              "created": 1729557928,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lt3md3g",
          "score": 1,
          "body": "Any pointers on what to search for and where to find one?",
          "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3md3g/",
          "created": 1729558528,
          "depth": 1,
          "replies": [
            {
              "id": "lt3o9ek",
              "score": 0,
              "body": "Talk to 3 reputable advisors in your area. You'll learn a lot for free, and get a better idea if you need the help and which one is the best fit.",
              "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt3o9ek/",
              "created": 1729559217,
              "depth": 2,
              "replies": [
                {
                  "id": "lt5hddw",
                  "score": 4,
                  "body": "OP asked how to find an advisor and you said \"find 3\" lol",
                  "permalink": "/r/stocks/comments/1g93l9n/how_are_stocks_valued_in_a_company_because_i/lt5hddw/",
                  "created": 1729593801,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}