{
  "title": "Walmart will start delivering prescriptions as CVS and Walgreens struggle",
  "score": 73,
  "selftext": "As CVS and Walgreens shutter hundreds of stores nationwide to shore up profits and investor sentiment, Walmart said Tuesday that it is offering a new option for customers: Delivering prescriptions to their doorsteps.\n\nThe nation’s largest retailer said deliveries are now available in six states: Arkansas, Missouri, New York, Nevada, South Carolina and Wisconsin. The company said in a news release that it expects to deliver prescriptions in 49 states by the end of January. Prescription deliveries will not be available in North Dakota due to state laws, Walmart said.\n\nThe prescription delivery service is another example of how Walmart is trying to outmatch competitors on convenience along with low prices. With the new service, customers can get a mix of items dropped off during the same delivery, such as a box of tissues, blanket or chicken noodle soup.\n\nWalmart’s new delivery offering could be another blow to drugstore chains, which are falling out of favor with consumers in a trend that has hit their profits and stock prices and forced them to reconsider their strategies. Still, it is unclear how much market share Walmart could win from CVS and Walgreens, both of which offer same-day, one-day and two-day prescription deliveries.\n\nTom Ward, chief e-commerce officer for Walmart U.S., said the company added pharmacy deliveries because of shopper demand.\n\n“This is actually the number one service requested by our customers,” he said.\n\nHe said Walmart tested the deliveries in several states and saw that customers took advantage of getting a mix of items, including the prescription, in a single delivery.\n\nWalmart’s delivery service will be available for new prescriptions and refills, the company said. It will cost $9.95 for a delivery, the standard price for Walmart doorstep deliveries, but will be free for members of Walmart+, the company’s membership program.\n\nHealth insurance plans will be applied to the transaction, like they would in the store, the company said.\n\nThe deliveries will come with a few more safety steps than Walmart’s other deliveries, the company said: Medications will be put into tamper-evident packaging. Customers can track orders in real time through Walmart’s app or website and get a photo in the app or by email when the prescription is delivered. And when a customer orders a new prescription and chooses delivery, they are prompted to do a consultation with the pharmacy by phone.\n\nMost of Walmart’s annual revenue in the U.S. – nearly 60% – comes from groceries, but health and wellness is a growing category for the company, according to the retailer’s most recent annual filing for the fiscal year that ended Jan. 31. Health and wellness accounts for about 12% of its annual revenue in the U.S. It includes pharmacy, over-the-counter drugs and other medical products, optical services and other clinical services.\n\nA new challenge for drugstores\n\nAs of Monday’s close, shares of Walmart were up around 54% for the year. Meanwhile, shares of CVS were down roughly 26% so far this year, while shares of Walgreens were down nearly 60%.\n\nCVS is the top U.S. pharmacy in terms of prescription drug revenue, holding more than 25% of the market share in 2023, according to Statista data released in March. Walgreens trailed behind with nearly 15% of that share last year, while Walmart held just 5% of that share.\n\nCVS and Walgreens are grappling with falling reimbursement rates for prescription drugs. Inflation, softer consumer spending and competition from Amazon, big-box retailers and grocery stores are making it difficult for them to turn a profit at the front of the store, which carries cleaning supplies, beauty products and pantry staples, among other items.\n\nCVS CEO Karen Lynch left the company and was replaced by David Joyner last week, as CVS faces pressure from Wall Street and, more recently, an activist investor to turn around its business. On top of the leadership shakeup, CVS plans to cut $2 billion in expenses over several years. That includes slashing less than 1% of its workforce, or roughly 2,900 jobs, on the corporate side of its business.\n\nThe company is also wrapping up a three-year plan to close 900 of its stores, with 851 locations closed as of August.\n\nWalgreens is similarly cutting costs, announcing last week that it will close roughly 1,200 stores over the next three years, which includes 500 in fiscal 2025 alone. The chain has around 8,700 locations in the U.S., a quarter of which it says are unprofitable.\n\nWalmart has faced its own financial challenges on the health-care side of the business. The discounter planned to bring its low-price spin to health care by opening clinics that offered doctor, dentist and therapy appointments for less.\n\nYet in the spring, Walmart shuttered all of the clinics, saying in a news release at the time that it couldn’t operate a profitable business because of “the challenging reimbursement environment and escalating operating costs.”\n\nSource: https://www.cnbc.com/2024/10/22/walmart-will-start-delivering-prescriptions-as-cvs-walgreens-struggle.html",
  "link_flair_text": null,
  "id": "1g9hzoe",
  "num_comments": 29,
  "created_utc": 1729603284,
  "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/",
  "comments": [
    {
      "id": "lt6ktbi",
      "score": 20,
      "body": "Delivery is an expensive business. but, if you're already in it.... why not throw a bottle of pills in there? \n\nPrescriptions by mail is easy and cheap for the customer... not sure if that's already offered by WMT and others.",
      "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt6ktbi/",
      "created": 1729609491,
      "depth": 0,
      "replies": [
        {
          "id": "lt7c5xg",
          "score": 10,
          "body": "Amazon has a pharmacy that’s all delivery, actually well really well.\n\n\nLegally there are certain medications that can’t be delivered, like adderall, so if you have any of those it’s a bit inconvenient cuz you need another physical pharmacy’s",
          "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt7c5xg/",
          "created": 1729617945,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt6qh07",
      "score": 6,
      "body": "Vets Admin healthcare send our Rx in the mail, get with the program citizens.",
      "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt6qh07/",
      "created": 1729611260,
      "depth": 0,
      "replies": [
        {
          "id": "lt76kdw",
          "score": 3,
          "body": "was gonna say. The post office is the largest drug delivery mechanism in the US",
          "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt76kdw/",
          "created": 1729616214,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lt7wevp",
          "score": 0,
          "body": "Which can be great, but many prescriptions are for something acute and need to be filled right away.",
          "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt7wevp/",
          "created": 1729624229,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt67ty5",
      "score": 11,
      "body": "Personally, I would pay extra to not have some random amateur \"delivery person\" show up at my front door. Obviously for those not ambulatory, this is a good service.",
      "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt67ty5/",
      "created": 1729605210,
      "depth": 0,
      "replies": [
        {
          "id": "lt7yzc3",
          "score": 6,
          "body": "I used to have an Adderall script. Would I trust that to a stranger with a minimum wage job? Would the pharmacy even release a controlled substance to some random person? (Fucking lol.)",
          "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt7yzc3/",
          "created": 1729625021,
          "depth": 1,
          "replies": [
            {
              "id": "lt82atq",
              "score": 1,
              "body": "That is a good question.",
              "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt82atq/",
              "created": 1729626035,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lt6p3ia",
          "score": 3,
          "body": "It’s a drone if you are in the right spot",
          "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt6p3ia/",
          "created": 1729610829,
          "depth": 1,
          "replies": [
            {
              "id": "lt6qyo2",
              "score": 1,
              "body": "All right, I guess I would try that",
              "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt6qyo2/",
              "created": 1729611414,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltb0wt8",
              "score": 1,
              "body": "Wait, who's writing scripts for those kinds of drugs lol",
              "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/ltb0wt8/",
              "created": 1729667292,
              "depth": 2,
              "replies": [
                {
                  "id": "ltbtg6p",
                  "score": 1,
                  "body": "It ain’t the delivery boy.",
                  "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/ltbtg6p/",
                  "created": 1729684724,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lt6tv4g",
          "score": 1,
          "body": "> \"delivery person\"\n\nThis seems to imply you don't believe the delivery person is actually a delivery person. Is there more to this?",
          "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt6tv4g/",
          "created": 1729612313,
          "depth": 1,
          "replies": [
            {
              "id": "lt6yyda",
              "score": 10,
              "body": "My understanding is that the business model for these jobs is a contract worker or so called gig worker, not a full time employee. This is often a part time job and the worker uses their own vehicle. There are numerous problems with this. First, a lot of these people were not obtaining proper commercial vehicle insurance. Some insurance companies have cracked down on this, but the problem persists. This is a problem for everyone's rates, as it is insurance fraud. Another problem is people without proper documentation who are using third party credentials to go around the system and sign up for these jobs. In the \"old days,\" I knew my UPS driver and my mailman, and had known them for years. Obviously things have changed, which bring improvements, but also risks.",
              "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt6yyda/",
              "created": 1729613893,
              "depth": 2,
              "replies": [
                {
                  "id": "lt6zvkk",
                  "score": 2,
                  "body": "I don't disagree with any of this; however, it doesn't mean the delivery person isn't an actual delivery person. They are. They are delivering an order and are a person; hence, they are a delivery person.",
                  "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt6zvkk/",
                  "created": 1729614180,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt70xss",
                      "score": 7,
                      "body": "I guess so, I guess my point is they may be operating in violation of the terms of their contract or operating their vehicle illegally. They are not vetted to the extent that a full time employee is vetted. Perhaps they are a bad actor and will sue me for negligence after \"tripping\" on my front porch steps. Obviously these same issues could arise with a full time employee, but my point is that my mailman and my UPS driver go through a more rigorous hiring process and also are a union member, and I see them every day, not just once and then never again. So the trust is not there. But. yes technically there are a delivery person, but not what we normally mean by that.",
                      "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt70xss/",
                      "created": 1729614502,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt7d6wo",
                          "score": 3,
                          "body": "> But. yes technically there are a delivery person, but not what we normally mean by that.\n\nThe future is now. These types of deliverypeople are now incredibly common and expectations should be adjusted for that.",
                          "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt7d6wo/",
                          "created": 1729618260,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lt7w9m2",
                              "score": 2,
                              "body": "True, good point. My expectation is that I will steer clear from this at all costs.",
                              "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt7w9m2/",
                              "created": 1729624183,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lt6afmj",
      "score": 2,
      "body": "I've had some... odd experiences with Walmart grocery delivery. Not sure I'd trust them with my meds. I'll stick with the Mayo mail service, I think.",
      "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt6afmj/",
      "created": 1729606109,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt93609",
      "score": 3,
      "body": "Walmart is on fire this year",
      "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt93609/",
      "created": 1729637774,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt6ijav",
      "score": 2,
      "body": "You mean putting 2 pharmacies within a stones throw of each other EVERY SINGLE TIME, actually DIDNT end up being beneficial for both of them? I’m shocked I tell you",
      "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt6ijav/",
      "created": 1729608768,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt65e37",
      "score": 1,
      "body": "Didn’t do much for Amazon, doubt it will do much for Walmart",
      "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt65e37/",
      "created": 1729604352,
      "depth": 0,
      "replies": [
        {
          "id": "lt7edbz",
          "score": 4,
          "body": "Didn’t do much for Amazon yet, but their pharmacy business is going very very fast. It’s a fraction (like 0.6%) of CVS, but my educated guess is Amazon fills 375k-450k prescriptions a week. They also have higher margins than CVS with offering their own generic drugs (and a subscription service), they don’t have physical locations to pay for, and their staff are paid about 30% less than CVS pharmacists. \n\n\n\nKeep in mind amazons pharmacy only started 4 years ago and they already have this many prescriptions and service all 50 states. They also are working with around 100 pharmacists compared to CVS 30,000",
          "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt7edbz/",
          "created": 1729618624,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt6xi88",
      "score": 1,
      "body": "I've heard amazon also delivers prescriptions? Anyone have experience with that?",
      "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt6xi88/",
      "created": 1729613444,
      "depth": 0,
      "replies": [
        {
          "id": "lt95k57",
          "score": 2,
          "body": "They have been for a while. It works fine. Problem isnt Amazon, its insurers who dont let you use Amazon or your choice of pharmacy.\n\nSome insurers (like Aetna) make backdoor deals with pharmacies. For example, Aetna uses ExpressScripts which was spun off and likely owned by Walgreen insiders so guess what the only \"approved\" pharmacy is? This is the problem... And as you might expect, Express Scripts is flipping horrible. They send wrong doses (almost always less) and run out of stock on things multiple times a year.\n\nOn the other end, the insurers love these unreliable pharmacies because every prescription delayed or not filled, is money saved for them. So they want Express Scripts to be as bad as possible without breaking the law. They want it to be convoluted with many layers of communication that are hard to navigate.",
          "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt95k57/",
          "created": 1729638616,
          "depth": 1,
          "replies": [
            {
              "id": "lta4oh0",
              "score": 1,
              "body": "Oh man, that's awful. The insurance are working in cahoots with the pharmacies!",
              "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lta4oh0/",
              "created": 1729651011,
              "depth": 2,
              "replies": [
                {
                  "id": "ltauvdy",
                  "score": 2,
                  "body": "Insurance, when done for profit, will incentivize dishonesty. This is why its highly regulated. But unfortunately human language is inherently imperfect so its an endless cycle of laws and loopholes.",
                  "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/ltauvdy/",
                  "created": 1729663439,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lt6vgo9",
      "score": 1,
      "body": "Walmart does everything to capture market share.  Walgreens and CVS are doomed.",
      "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt6vgo9/",
      "created": 1729612805,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt78acj",
      "score": 1,
      "body": "Walgreens and CVS got crushed by the opiods settlement. I don't think Walmart pharmacy escaped that either. Its just that Walmart is so big and multi-category, that the other parts of the business can support the pharmacy division if or when it takes a hit like that.\n\nWalmart is category killer for retail. They are even targeting the business of amazon and ebay now, with their walmart. com.",
      "permalink": "/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/lt78acj/",
      "created": 1729616745,
      "depth": 0,
      "replies": []
    }
  ]
}