{
  "title": "Oklo short",
  "score": 43,
  "selftext": "Why is this stock pumping ?\n\nNuclear energy projects face strict regulatory scrutiny. Any set back would cause the stock to plummet?\n\nIdk developing new energy is cool but you would rather be a last adopter to this once it’s proven.\n\nAm I missing something?\n",
  "link_flair_text": "Discussion",
  "id": "1g9hf7l",
  "num_comments": 106,
  "created_utc": 1729601656,
  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/",
  "comments": [
    {
      "id": "lt5y8ej",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 10 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt5y8ej/",
      "created": 1729601659,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt5zjp1",
      "score": 85,
      "body": "Haven’t you heard? Nuclear is making a comeback. Those data centers aren’t going to power themselves.",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt5zjp1/",
      "created": 1729602171,
      "depth": 0,
      "replies": [
        {
          "id": "lt61kti",
          "score": 13,
          "body": "Yes, but when. Googles contract applies to plants being operable from 2030. Until then its maybe a demonstration project. \n\nWhat if one project faisl due to interest rates, lack of staff, regulation. Then the whole sector dumps.",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt61kti/",
          "created": 1729602949,
          "depth": 1,
          "replies": [
            {
              "id": "lt6s701",
              "score": 20,
              "body": "What if earth explodes. The market also dumps",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6s701/",
              "created": 1729611799,
              "depth": 2,
              "replies": [
                {
                  "id": "lt6yrn0",
                  "score": 7,
                  "body": "What market?",
                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6yrn0/",
                  "created": 1729613834,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lt73aic",
              "score": 11,
              "body": "you're asking all the doomsday what ifs and none of the winning scenarios. You're confused because you are biased and not giving it a compete consideration",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt73aic/",
              "created": 1729615223,
              "depth": 2,
              "replies": [
                {
                  "id": "lt74938",
                  "score": -6,
                  "body": "Doomsday? Google all the latest nuclear project. On average every nuclear project out of china is overrunning cost and time budget by 100%",
                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt74938/",
                  "created": 1729615518,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt74pun",
                      "score": 12,
                      "body": "\\> china\n\ngo back to the ball pit lil bro ![img](emote|t5_2th52|4271)",
                      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt74pun/",
                      "created": 1729615658,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt7hp3x",
                          "score": -6,
                          "body": "You make the awful impression, I have to admit it, that you have never read any piece against your position.",
                          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7hp3x/",
                          "created": 1729619652,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lt7i70w",
                              "score": 5,
                              "body": "In English please",
                              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7i70w/",
                              "created": 1729619803,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lt7z8he",
              "score": 2,
              "body": "Wait for correction. I bought and sold for profit and holding a small position.when it corrects I get to buy more shares.",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7z8he/",
              "created": 1729625100,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lt7ch2j",
          "score": -7,
          "body": "Why wouldn't cheaper energy sources take the win though?\n\nSolar is soooo much cheaper than nuclear and for things like data centers, you can build massive energy storage using technologies that cheap but aren't as efficient per kg like you would need for an EV",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7ch2j/",
          "created": 1729618039,
          "depth": 1,
          "replies": [
            {
              "id": "lt7su0w",
              "score": 11,
              "body": "Because you need power 24/7 you galactic genius. Storage is fucking hilariously expensive.",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7su0w/",
              "created": 1729623112,
              "depth": 2,
              "replies": [
                {
                  "id": "lt7v9h6",
                  "score": 1,
                  "body": "[Storage is delivering nuclear scale energy day in and day out in California.](https://blog.gridstatus.io/caiso-batteries-apr-2024/)\n\n[Generally renewables + storage are today cheaper than nuclear power.](https://www.lazard.com/media/gjyffoqd/lazards-lcoeplus-june-2024.pdf) \n\nThus the slice of grid where nuclear power excels is essentially peaking, something they are not capable of doing since they need to run at 100% 24/7 to only be a completely insane economic investment.\n\nI think you can imagine where we will be if Oklo ever gets a reactor connected to the grid.",
                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7v9h6/",
                  "created": 1729623867,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt7ylf8",
                      "score": 4,
                      "body": "Did you read the reports or just the soundbites? Lazard has still only added a few hours of storage to their “firmed” grid costs. When your grid is 50% intermittent, you will need overbuilt capacity and multi-day battery capacity to account for low generation periods in low production seasons. You can’t build grids based on project-scale economics. LCOE was NEVER meant to be a grid-scale tool. It is a project financing tool that completely fails to account for grid-scale costs.",
                      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7ylf8/",
                      "created": 1729624900,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt80z9g",
                          "score": -1,
                          "body": "See the recent study where it was found that nuclear power needs to come down 85% in cost to be competitive with renewables when looking into total system costs, due to both options requiring flexibility to meet the grid load.\n\n> The study finds that investments in flexibility in the electricity supply are needed in both systems due to the constant production pattern of nuclear and the variability of renewable energy sources. However, the scenario with high nuclear implementation is 1.2 billion EUR more expensive annually compared to a scenario only based on renewables, with all systems completely balancing supply and demand across all energy sectors in every hour. For nuclear power to be cost competitive with renewables an investment cost of 1.55 MEUR/MW must be achieved, which is substantially below any cost projection for nuclear power.\n\nhttps://www.sciencedirect.com/science/article/pii/S0306261924010882",
                          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt80z9g/",
                          "created": 1729625636,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lt81xop",
                              "score": 3,
                              "body": "Have you considered looking at nuclear costs in any country that is not Europe or the US? Because South Korea, Japan, and UAE are all building far more efficient reactors. Western countries are just seeing the effects of outsourcing their ability to build anything and paying the price with obscene project costs and time overruns. \n\nI’ll have to dig into the details from this paper but I’ll note that an Australian government-commissioned study found the exact opposite. Many of these studies embed bad assumptions (like LCOE using a 40-year time horizon because renewables are expected to last that long while nuclear plants are already approved for 70-80 years, for example). The number they arrive at in this study is such an aberration that I’m curious to see how they arrived at it.",
                              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt81xop/",
                              "created": 1729625923,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lt83rxb",
                                  "score": -1,
                                  "body": "It is quite in line with the [GenCost report](https://www.csiro.au/-/media/Energy/GenCost/GenCost2023-24Final_20240522.pdf) utilizing optimistic nth of a kind South Korean numbers and still finding nuclear power to be wholly uncompetitive.\n\n[We also can’t forget that South Korea had a massive corruption leading to a complete restructuring of their regulatory process, and the latest reactor taking 12 years to finish.](https://www.technologyreview.com/2019/04/22/136020/how-greed-and-corruption-blew-up-south-koreas-nuclear-industry/)\n\nThis excludes that they’ve vastly stepped back the safety requirements to cut costs, which won’t be accepted for western build. \n\nNo one knows the true cost of the Barakah project either. The only figure released is the planned figure when they started. \n\n[But we do know that it required under the table military deals to ink the contract.](https://thediplomat.com/2018/03/risky-business-south-koreas-secret-military-deal-with-uae/ ) Then nowadays both parties says “yessir very good project” even though it obviously was delayed by about 5 years. \n\nJapan have essentially shut down their industry. Nothing to gain from them. \n\nSo all I see is a lot of wishful thinking when nuclear power butts up against the reality of building one while being forced to pay the wages advanced economies.",
                                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt83rxb/",
                                  "created": 1729626489,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lt86jo5",
                      "score": 3,
                      "body": ">[Generally renewables + storage are today cheaper than nuclear power.](https://www.lazard.com/media/gjyffoqd/lazards-lcoeplus-june-2024.pdf)\n\nNow take out subsidies and find us an unbiased source. Good luck\n\nOKLO is pumping because it's a Scam Altman company. He already got a ton of money from MSFT for OpenAI. Don't be surprised when they come for a chunk of this one.",
                      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt86jo5/",
                      "created": 1729627332,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt897uz",
                          "score": -2,
                          "body": "You mean like this where the accident insurance for nuclear plants is required to only cover ~0.1% of a Fukushima scale incident?\n\nhttps://en.m.wikipedia.org/wiki/Price%E2%80%93Anderson_Nuclear_Industries_Indemnity_Act",
                          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt897uz/",
                          "created": 1729628150,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lt89mlw",
                              "score": 4,
                              "body": "Can you point to the map and show us where Fukushima, USA, is?\n\nBecause I can point to the map and show you completely destroyed solar farms in Hurricane Alley :)\n\nIt's hilarious that critics of nuclear baseload whine about how it's always available. OH NO, we can run desalination plants with the \"excess.\" Oh no, we won't need to have time-of-use pricing for electricity. Comical",
                              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt89mlw/",
                              "created": 1729628275,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lt8du9j",
                                  "score": -2,
                                  "body": "Let’s not learn anything from the rest of the world.\n\nDid those solar panels cause any subsidy payouts from federal money?",
                                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt8du9j/",
                                  "created": 1729629545,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lt8e6js",
                              "score": 5,
                              "body": "Don't engage with the regard known as u/ViewTrick1002. They're staunchly anti-nuclear, they usurped mod rights in the r/nuclearpower sub reddit and have been actively banning anyone in that subreddit who challenges their renewables astroturfing.",
                              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt8e6js/",
                              "created": 1729629648,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lt8qyzt",
                                  "score": 3,
                                  "body": "Yeah that thing changed all of its comments yesterday to make our conversation look different, have never seen anything more dishonest or gross",
                                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt8qyzt/",
                                  "created": 1729633586,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "lt8e6la",
                                  "score": 0,
                                  "body": "I've never read a k10, but I've pet plenty of k9s.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt8e6la/",
                                  "created": 1729629648,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "lt8f6lf",
                                  "score": -2,
                                  "body": "Please tell me where I am wrong :) Should be easier than attempting to do a character assassination.",
                                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt8f6lf/",
                                  "created": 1729629941,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lt8ghlv",
                                      "score": 6,
                                      "body": "You're the one who assassinated your own character. I'm just making sure everyone knows that all you do is astroturf renewables.",
                                      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt8ghlv/",
                                      "created": 1729630322,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lt8h13q",
                                          "score": 0,
                                          "body": "Still not pointing out any factual errors in my comments :)",
                                          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt8h13q/",
                                          "created": 1729630478,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lt7xmec",
                  "score": 0,
                  "body": "/r/confidentlyincorrect \n\nThe other user already sent you some info but in general, that's a very outdated view on solar...",
                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7xmec/",
                  "created": 1729624603,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt7y79e",
                      "score": 7,
                      "body": "No, it’s a systems level understanding of it. As Germany and other markets are proving, firming costs are very, very expensive. As intermittent sources become majority of the grid, the cost of firming becomes exponentially more expensive. There is really good modeling of this available now. it’s the reason Lazard had to completely revamp their LCOE, and their “firming” adjustment still only consists of 4 hours of storage.\n\nTo guarantee no brownouts, you will need several days of storage when accounting for minimal intermittent production. An overcast week in December in Germany will blow a hole in a 4-hour “firmed” grid.\n\nDon’t believe me, just read the Lazard LCOE+ report the other post linked without reading it apparently. CAISO shows the cost of firming is HIGHER than the cost of solar itself, and that’s with only 4-hour battery firming. Gas peakers (assumed in PJM and MISO calculations) are cheaper but defeat the point.",
                      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7y79e/",
                      "created": 1729624780,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt82ikm",
                          "score": -2,
                          "body": "You can easily use the overproduction from solar for hydrogen production and then use that as your storage for baseline (like some countries are doing)",
                          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt82ikm/",
                          "created": 1729626103,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lt7v6ss",
              "score": 5,
              "body": "not really cheaper when accounting for the storage needed to complement other on base load forms of clean energy. solar also requires orders of  magnitude more land than nuclear for equivalent output, which is either expensive or just not available",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7v6ss/",
              "created": 1729623844,
              "depth": 2,
              "replies": [
                {
                  "id": "lt7w0u2",
                  "score": 1,
                  "body": "Land use is included in solar cost and is very low, except in extremely rare cases like e.g. Monaco.\n\n[Generally renewables + storage are today cheaper than nuclear power.](https://www.lazard.com/media/gjyffoqd/lazards-lcoeplus-june-2024.pdf)",
                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7w0u2/",
                  "created": 1729624106,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt7zo8p",
                      "score": 3,
                      "body": "research is conflicting when it comes to your point about renewables plus storage being cheaper.\n\nhttps://preview.redd.it/xori8esfzcwd1.jpeg?width=1170&format=pjpg&auto=webp&s=1dfdb4838dc4c7dec220a2b45c8cb4fdab63b45c\n\nthe above is drawn from the recent DoE liftoff report.\n\nI’m not implying land use to be a cost issue. I’m referring to cases where the land is simply not available (or it’s politically infeasible to monopolize large swaths of land in an area) near the source of energy demand (e.g. a data center). building the solar farms further out means you have to build out extra energy transmission infrastructure or add load to an already overwhelmed grid",
                      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7zo8p/",
                      "created": 1729625234,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lt809x1",
                          "score": 1,
                          "body": "That entire report is an exercise in selectively choosing data to misrepresent renewables and present nuclear power in the best possible light and wishful thinking.\n\nTo the degree that the prominent \"renewables vs. nuclear\" graph they keep repeating throughout the report and webpage is straight up misleading.\n\nThis is the source:\n\n**[What is different about different net-zero carbon electricity systems?](https://www.sciencedirect.com/science/article/pii/S2666278721000234)**\n\nUtilizing **storage costs from 2018** and then of course making the comparison against the model not incorporating any hydrogen derived zero carbon fuel to solve seasonal problems.\n\nWhich is todays suggestion for solving the final few percent requiring seasonal storage in the late 2030s.\n\nSomething akin to todays peaker plants financed on capacity because they run too little to be economical on their own, but zero carbon. Can be hydrogen or biofuel derived. We will know in 10 years time.\n\nWould they have chosen the ReBF model the difference between made up optimal nuclear power and 2018 renewables would be: $80-94/MWh compared to $82-102/MWh.\n\nIt is essentially: Nukebros writes reports for nukebros based on selectively chosen outdated data, they confirm their own bias. Simply an attempt to justify another massive round of government subsidies on nuclear power.\n\nYou can bet on it working and some companies like Oklo gets a public payout. But given the experience curves we are seeing for renewables and storage I have my doubts that the politicians will persevere.",
                          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt809x1/",
                          "created": 1729625419,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lt86b73",
                              "score": 3,
                              "body": "citing hydrogen derived fuel as the necessary stopgap is optimistic - we’ve been hearing about hydrogen as the solution for over a decade now without much to see for it.\n\nif you really believe the DoE is inherently biased in favor of nuclear then so be it - I find that incredibly difficult with the absolute lack of investment in nuclear over the past decades, especially compared to the overwhelming amount of support other forms of clean energy have benefited from.\n\nsolar and wind have benefited from crazy subsidies and tax benefits for years while nuclear is just starting to get the same support. solar and wind have benefited from nth of a kind learning cost reductions whereas nuclear hasn’t had a chance to get there yet",
                              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt86b73/",
                              "created": 1729627260,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lt88qvr",
                                  "score": 0,
                                  "body": "If you cite two numbers in the report what’s the issue with also citing a third? \n\nEither way it’s old data.\n\nWe tried. [There was a massive subsidy push 20 years ago](https://en.wikipedia.org/wiki/Nuclear_renaissance_in_the_United_States). The end result was [Virgil C. Summer](https://en.wikipedia.org/wiki/Nukegate_scandal) and Vogtle.\n\nIt seems like you are attempting to rewrite history to try gloss over nuclear powers failures.\n\nSolar and wind had some subsidies, but the buildout you see today is because we’ve finally found an energy source cheaper than fossil fuels. \n\nAdd on that nuclear throughout its entire 70 year long massively subsidized life, including both plants and R&D always had a negative learning curve.\n\nhttps://www.sciencedirect.com/science/article/abs/pii/S0301421510003526",
                                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt88qvr/",
                                  "created": 1729628005,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lt8aelr",
                                      "score": 3,
                                      "body": "the US nuclear failures were a US policy failure, not an issue inherent to nuclear. china is building out a massive fleet of reactors on time and on budget. japan and korea did not face the same issues with budgetary and timeline overruns. the problem lies in western procurement procedures, the lack of standardized designs and the lack of a trained reactor construction workforce.\n\nnote that US nuclear power plant capex is amortized over 40 years, the initial lifespan of the reactors. given that the fleet is being granted life extensions for lifespans of 80 years (and will likely reach 100), this effectively means that we are heavily frontloading the cost of electricity to the first 40 years and getting effectively incredibly cheap electricity. better amortization of costs would yield far more representative (and lower) energy costs.\n\nwind and solar also are extremely dependent on climate and rely on the exploitation of materials such as lithium and REEs with a very high environmental footprint",
                                      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt8aelr/",
                                      "created": 1729628509,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lt8eypm",
                                          "score": -2,
                                          "body": "China finished 1 reactor last year and is in track for a massive 3 more this year.\n\nThey’ve essentially replaced their nuclear buildout with renewables.\n\nhttps://reneweconomy.com.au/chinas-quiet-energy-revolution-the-switch-from-nuclear-to-renewable-energy/\n\nTying up money for nearly 100 years because you need to find any possible angle to boost nuclear power is insanity.\n\nAre you going to hold on to your Oklo stock until 2124 to see the payout?!?!!\n\nThe environmental foot print is quite comparable to nuclear. Uranium mining and processing is extremely awful, nothing in the renewable supply chain compres. \n\nLooking into total material requirement nuclear power is worse than wind and in line with solar of.\n\nhttps://www.sciencedirect.com/science/article/pii/S095965262202131X",
                                          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt8eypm/",
                                          "created": 1729629877,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltaemaf",
              "score": 1,
              "body": "We need all the sources. Because variety makes sure the infrastructure is reliable.",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/ltaemaf/",
              "created": 1729655079,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltbqg9f",
              "score": 1,
              "body": "Solar and wind are laughable output compared to nuclear. The former two sources are more virtue signals than they are practical energy sources.",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/ltbqg9f/",
              "created": 1729683365,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lt866pe",
              "score": -1,
              "body": "This is a clown take. Solar =/= baseload. Good luck powering data centers on something that delivers power 30-40% of the time",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt866pe/",
              "created": 1729627222,
              "depth": 2,
              "replies": [
                {
                  "id": "lt86xpq",
                  "score": 0,
                  "body": "Keep reading",
                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt86xpq/",
                  "created": 1729627453,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt87zks",
                      "score": 0,
                      "body": "Dude this topic has been beaten to death already. Storage is a fucking waste of space, money, and not to mention mining battery metals is a disaster for the environment. \n\nClean, reliable, baseload is what the earth needs to move forward. \n\nFeel free to look at emissions data from Germany after they closed their NPPs. If the climate is changing, it's a complete regard move to hitch the energy boat to the changing climate.",
                      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt87zks/",
                      "created": 1729627774,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lt6xg6u",
      "score": 29,
      "body": "It’s a cycle. Buy high sell low.",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6xg6u/",
      "created": 1729613426,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt7j95l",
      "score": 39,
      "body": "I bought to hold. You should short. We’ll meet up next year over frosties and discuss how we both managed to lose money.",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7j95l/",
      "created": 1729620128,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt6axnx",
      "score": 13,
      "body": "Pumping a stock or a bunch of stocks on the premise that nuclear energy is the future of data centers.\n\nOR\n\nData centers on the moon.\n\n  \nSo pick your poison",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6axnx/",
      "created": 1729606278,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt6ause",
      "score": 23,
      "body": "FOMO. People want to get in early. Except they may end up getting in too early.",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6ause/",
      "created": 1729606251,
      "depth": 0,
      "replies": [
        {
          "id": "lt6y9pp",
          "score": 8,
          "body": "We may be early but we're not wrong. It'll pay.",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6y9pp/",
          "created": 1729613680,
          "depth": 1,
          "replies": [
            {
              "id": "lt70wc8",
              "score": 3,
              "body": "I never said it was wrong or that it was not going to pay off eventually. I perfectly understand the sentiment.\n\nHowever, having money in something for a time always carries some lost opportunity cost potential. Getting in too early and/or at a pumped up price means, that you forgo another investment opportunity using the money, which could yield better/safer annualized returns.",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt70wc8/",
              "created": 1729614490,
              "depth": 2,
              "replies": [
                {
                  "id": "lt748cs",
                  "score": 6,
                  "body": "Having money locked up in a long term play means the dummies in this sub can’t lose it.",
                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt748cs/",
                  "created": 1729615512,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lt7vvob",
                      "score": 2,
                      "body": "unironically my winning strategy",
                      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7vvob/",
                      "created": 1729624060,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lt729sh",
                  "score": 2,
                  "body": "[Just memeing... maybe not.](https://i.redd.it/4fbaz5h7fyu61.jpg)",
                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt729sh/",
                  "created": 1729614913,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lt6w7n3",
          "score": 1,
          "body": "This is definitely too early. I'm monitoring this sector for the next 5 years... It'll likely bubble then come crashing hard... I won't buy into it until we are at least 2-3 years out from it being a viable option.",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6w7n3/",
          "created": 1729613039,
          "depth": 1,
          "replies": [
            {
              "id": "lt7q8vw",
              "score": 6,
              "body": "Bubbles are when you make money.\n\nYou have to know when to get out and keep it.",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7q8vw/",
              "created": 1729622310,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lt79s52",
          "score": 1,
          "body": "A lot of nuclear stocks are up like 200% this year. I doubt we are too early. Speculation will fly before actual adoption, like for every new tech.",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt79s52/",
          "created": 1729617211,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lt7c3jj",
          "score": 1,
          "body": "We're no good at waiting.",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7c3jj/",
          "created": 1729617924,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt65j43",
      "score": 7,
      "body": "Investors crowding into stocks can bid up the price farther than most think possible (Marijuana stocks-2018, EV stocks-2020-2021, tech boom late 1990s)",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt65j43/",
      "created": 1729604401,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt608o4",
      "score": 9,
      "body": "Very tempting stock but the downsize is just as great.",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt608o4/",
      "created": 1729602441,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt5zgua",
      "score": 17,
      "body": "Random meme stocks like OKLO and IONQ are pumping. It’ll be short-lived.",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt5zgua/",
      "created": 1729602139,
      "depth": 0,
      "replies": [
        {
          "id": "lt789er",
          "score": 5,
          "body": "Why the smack on IONQ?",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt789er/",
          "created": 1729616736,
          "depth": 1,
          "replies": [
            {
              "id": "lt7g2ky",
              "score": -2,
              "body": "Do you even know where they’re getting their revenue from?",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7g2ky/",
              "created": 1729619151,
              "depth": 2,
              "replies": [
                {
                  "id": "lt7kp4y",
                  "score": 3,
                  "body": "No need to get hostile homie. I know nothing about the stock but I’m curious as to why you hold negative sentiments. Most of what I see re IONQ is favorable",
                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7kp4y/",
                  "created": 1729620579,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lt67da2",
          "score": 13,
          "body": "I’d probably take you more seriously if your name wasn’t GoodbyeNVDA",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt67da2/",
          "created": 1729605049,
          "depth": 1,
          "replies": [
            {
              "id": "lt6f7sr",
              "score": 6,
              "body": "NVDA has revenue, profit, and insane demand lol. Oklo has none of those things, nor will they for several more years. They don’t even have a real reactor or prototype yet. You’re literally just buying a company that’s selling dreams and CGI renderings.",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6f7sr/",
              "created": 1729607697,
              "depth": 2,
              "replies": [
                {
                  "id": "lt6fw5e",
                  "score": 1,
                  "body": "Sounds like TSLA but with slightly less success tbh",
                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6fw5e/",
                  "created": 1729607920,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lt74iff",
          "score": 7,
          "body": "theyre not meme stocks. they're highly speculative tech stocks.  \n  \nregards call it a meme or a P&D because the gains are biblical and they dont have the brains to figure out why, nor the balls to put their money where their mouth is\n\nhave fun watching on the sidelines cuck ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4276)",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt74iff/",
          "created": 1729615596,
          "depth": 1,
          "replies": [
            {
              "id": "lt7qf5n",
              "score": 1,
              "body": "Too much logic and truth for this group, you need to warn them next time",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7qf5n/",
              "created": 1729622365,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lt7fwur",
              "score": -1,
              "body": "I’m okay.",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7fwur/",
              "created": 1729619102,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lt6rt6a",
      "score": 6,
      "body": "This dude is gonna fight the nuclear bubble. Lmaoooooo GL OP.",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6rt6a/",
      "created": 1729611679,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt617q2",
      "score": 9,
      "body": "Oklo is not a ‘meme stock’ or a ‘pump and dump’, it’s a solid long-term investment.\n\nRecent catalysts- demand materializing from big tech when they have the first-mover advantage domestically, potential for upcoming massive deal with OpenAl, recent approval milestone with DOE on fuel fabrication, NRC gave clearer guidance last week saying that’s subsequent site build approvals can take as little as 7 months which will dramatically speed up scaling efforts.\n\nOther reasons to believe- They have the healthiest balance sheet amongst SMR projects, a strong leadership team with PhDs, first mover advantage within the NRC application process and have hired on former regulatory staff, reactor technology that was already proven through decades of testing between 1964-1994, unique expertise within uranium recycling, and probably most importantly, partnership commitments driven by a robust commercialization model that is scalable and profitable overtime. This fits well with the future local energy needs of AI data centers.\n\nI’d be careful from the standard WSB caveman logic, “it go up fast, so must go down”.",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt617q2/",
      "created": 1729602813,
      "depth": 0,
      "replies": [
        {
          "id": "lt639vf",
          "score": 12,
          "body": "Plus Sam Altman is well regarded",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt639vf/",
          "created": 1729603579,
          "depth": 1,
          "replies": [
            {
              "id": "lt65168",
              "score": 14,
              "body": "as is everyone on this sub",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt65168/",
              "created": 1729604221,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lt73m66",
              "score": 5,
              "body": "the fatcats know something we dont. This isn't pumping off of retail hype. This is pumping from whales getting in on information we dont have yet. Investors will be more than happy to ride or die with Mr. Altman, just look at the buyers showing up day after day after day on this.",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt73m66/",
              "created": 1729615323,
              "depth": 2,
              "replies": [
                {
                  "id": "lt746h7",
                  "score": 4,
                  "body": "I got in OKLO $12.75 and saw it drop to $6 after it went public so if someone knows something then that’s great to hear",
                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt746h7/",
                  "created": 1729615496,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lt630i1",
          "score": 5,
          "body": "something something it must go down. Got it! Thanks",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt630i1/",
          "created": 1729603483,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lt6ynmi",
          "score": 2,
          "body": "The subsequent approvals after the first is approved, after Oklo got laughed out of the room when they last attempted to certify their designs.\n\nWhy don't you talk about when they will break ground on their first reactor? Because then even 2030 becomes a speculative date?",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6ynmi/",
          "created": 1729613800,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lt62gjd",
          "score": 1,
          "body": "[removed]",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt62gjd/",
          "created": 1729603279,
          "depth": 1,
          "replies": [
            {
              "id": "lt62gka",
              "score": 2,
              "body": "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt62gka/",
              "created": 1729603279,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lt6fttf",
          "score": 0,
          "body": "> “it go up fast, so must go down”.\n\nWell, I guess that's score 1 for the caveman",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6fttf/",
          "created": 1729607898,
          "depth": 1,
          "replies": [
            {
              "id": "lt6jn2x",
              "score": 2,
              "body": "Back to Friday’s levels, ok.",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6jn2x/",
              "created": 1729609118,
              "depth": 2,
              "replies": [
                {
                  "id": "lt6r0jf",
                  "score": -1,
                  "body": "Well, I never said it had to go to 0, but it wasn't difficult to predict some pullback.  Granted, it's been slowly recovering all day though lol",
                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6r0jf/",
                  "created": 1729611429,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lt731v1",
              "score": 2,
              "body": "?",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt731v1/",
              "created": 1729615150,
              "depth": 2,
              "replies": [
                {
                  "id": "lt73el7",
                  "score": 0,
                  "body": "He made that post shortly before OKLO tanked at open.  It's been recovering all day since then though, so the caveman might end up losing that point again",
                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt73el7/",
                  "created": 1729615258,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lt7w9xv",
          "score": 0,
          "body": "bro you have like 50 posts shilling oklo, I promise the global price isnt gonna shift because you posted dozens of desperate paragraphs to a gambling subreddit.",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7w9xv/",
          "created": 1729624186,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lt9pl56",
      "score": 2,
      "body": "Something has to give, domestic energy production won't be able to keep up in a decade at this rate",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt9pl56/",
      "created": 1729645595,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt737cd",
      "score": 4,
      "body": "Didn’t Microsoft use an AI model to fill out all the paperwork required to get 3 mile island back up and running… to power data centers… for more AI? The SMR game seems lucrative if companies building data centers are going to train AI models to fill out all the paperwork to get nuclear plants. This in conjunction with more and more regulation that is pushing out coal/Nat gas plants as well as net zero initiatives makes sense. Nuclear causes almost no waste and doesn’t emit squat which means CEOs get big bonuses for meeting their emissions goals. Oklo is also backed by Sam Altman, you know, the guy who made OpenAI. The pieces all seem to come together, although I haven’t done a full DD on the current valuation. These are my initial thoughts.",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt737cd/",
      "created": 1729615197,
      "depth": 0,
      "replies": [
        {
          "id": "lt7494v",
          "score": 2,
          "body": "This combined with the fact that SA owns a measly 7 million OKLO shares- future partnership will come.",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7494v/",
          "created": 1729615519,
          "depth": 1,
          "replies": [
            {
              "id": "lt7w48n",
              "score": 0,
              "body": "saudi arabia?",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt7w48n/",
              "created": 1729624136,
              "depth": 2,
              "replies": [
                {
                  "id": "lta8ssk",
                  "score": 2,
                  "body": "Probably Sam Altman. He's the chairman for Oklo.",
                  "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lta8ssk/",
                  "created": 1729652613,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lt8dqct",
      "score": 1,
      "body": "Many utility companies (in the southeast especially) don’t have enough generation to meet the near term energy load. It takes a long time for utility companies to build new capacity due to public service commissions and the fact they pass the cost thru to the rate base but are restricted as to how much they can do that. States like Georgia are at risk of rolling blackouts because supply is almost equal to load which has been caused by recent construction of massive data centers and factories that have net zero goals and require non fossil fuel electricity. It took 10 years for Georgia power to build two nuclear reactors with 2 GW of supply. In that time a 1 GW data center was built right outside of it. \n\nSMRs and other distributed generation assets are increasingly being contracted by both offtakers and utilities to help meet the growing load centers that are outside of the traditional centralized distribution model (where most power goes to cities).",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt8dqct/",
      "created": 1729629512,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt6obhw",
      "score": 1,
      "body": "Stocks don't \"pump\", people do, so I am not sure what you're asking.",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6obhw/",
      "created": 1729610586,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt6cxhv",
      "score": 1,
      "body": "“Told you” - OP probably",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6cxhv/",
      "created": 1729606945,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt6pyi3",
      "score": 0,
      "body": "The only thing OKLO has is a pile of cash and a lot of promises. They also have an army of internet experts who will swear that nuclear is the future and that OKLO stock will make you a lot of money.",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt6pyi3/",
      "created": 1729611099,
      "depth": 0,
      "replies": [
        {
          "id": "lt73xua",
          "score": 4,
          "body": "retail isnt making a blip in OKLO. This is fatcat action.",
          "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt73xua/",
          "created": 1729615422,
          "depth": 1,
          "replies": [
            {
              "id": "lt85ku0",
              "score": 2,
              "body": "Exactly 45million/day in volume isn’t retail",
              "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt85ku0/",
              "created": 1729627038,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lt76xqh",
      "score": 0,
      "body": "There's a lot hype around nuclear and the big tech companies making commitments to it are driving more hype.  There's been a pretty active concerted effort to try and get people on board with nuclear that followed a handful of startups from different parts of the world.  Once everything cools you'll probably start seeing endless blame of the NRC and \"NIMBYs\" for \"*standing in the way of progress*\".",
      "permalink": "/r/wallstreetbets/comments/1g9hf7l/oklo_short/lt76xqh/",
      "created": 1729616326,
      "depth": 0,
      "replies": []
    }
  ]
}