{
  "title": "US SEC is having a set of eyes targeting at the short sellers.",
  "score": 96,
  "selftext": "* The SEC accused Ryan Choi of \"negligently engaging in a scheme to defraud\" the readers of Citron Research in connection with two social media posts with recommendations to buy two US stocks.\n* Choi agreed to pay $1.8 million to the SEC to settle the charges.\n* The settlement is likely to be a blow to Andrew Left, an activist short seller and the founder of Citron Research who is fighting SEC and Department of Justice charges filed in July alleging he engaged in a scheme to defraud Citron Research followers by publishing false and misleading statements regarding his stock trading recommendations.\n* The authorities in Los Angeles claimed Andrew Left generated at least $16 million in illegal trading profits through stock manipulation. Prosecutors and regulators accused him of using his fame to tell investors to do one thing while he traded the other way.\n* The SEC called it a “bait and switch” strategy.  Mr. Left apparently bought back stock immediately after telling his readers to sell, and he sold stocks immediately after telling his readers to buy.\n* Federal prosecutors claim Mr. Left used exaggerated language in his commentary and manipulated stock prices with his social media posts.\n\n[https://www.reuters.com/markets/us/us-sec-settles-charges-with-associate-short-seller-andrew-left-18-million-2024-10-22/](https://www.reuters.com/markets/us/us-sec-settles-charges-with-associate-short-seller-andrew-left-18-million-2024-10-22/)\n\n[https://www.nytimes.com/2024/09/09/business/andrew-left-citron-short-selling.html](https://www.nytimes.com/2024/09/09/business/andrew-left-citron-short-selling.html)",
  "link_flair_text": "Industry Discussion",
  "id": "1ga8gq3",
  "num_comments": 19,
  "created_utc": 1729683857,
  "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/",
  "comments": [
    {
      "id": "ltbtdp3",
      "score": 101,
      "body": "This seems to be less targeting short sellers and more targeting fraudsters. Which makes sense, short selling is a perfectly proper part of our market system, but people trying to manipulate the buying/selling activity of others for their own gain is fundamentally wrong",
      "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltbtdp3/",
      "created": 1729684692,
      "depth": 0,
      "replies": [
        {
          "id": "ltbvfhx",
          "score": 41,
          "body": "Yes the title of this post is wholly misleading. Short selling is a great way to speculate if done without additional malpractice.",
          "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltbvfhx/",
          "created": 1729685596,
          "depth": 1,
          "replies": [
            {
              "id": "ltc2vme",
              "score": 5,
              "body": "The title sounds like it was written by a GME cult member.",
              "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltc2vme/",
              "created": 1729688578,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltchdk2",
              "score": 4,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltchdk2/",
              "created": 1729693637,
              "depth": 2,
              "replies": [
                {
                  "id": "ltduedy",
                  "score": 1,
                  "body": "Not to mention they can dampen runaway enthusiasm.",
                  "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltduedy/",
                  "created": 1729708592,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ltcht0r",
          "score": 12,
          "body": "Short sellers are supposed to be the white blood cells of the market, but there has been a huge wave of ill intent and blatantly illegal acts. OP’s list is not even extensive for the news on short sellers that has come out this year.",
          "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltcht0r/",
          "created": 1729693777,
          "depth": 1,
          "replies": [
            {
              "id": "lth3azd",
              "score": 4,
              "body": "Sounds like a cancer",
              "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/lth3azd/",
              "created": 1729752345,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lte3db8",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/lte3db8/",
          "created": 1729711486,
          "depth": 1,
          "replies": [
            {
              "id": "ltebrzv",
              "score": 3,
              "body": "No company is brought to their knees by short sellers unless they are fundamentally broken to begin with. If the company is doing well, their stock price will recover.",
              "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltebrzv/",
              "created": 1729714002,
              "depth": 2,
              "replies": [
                {
                  "id": "ltj3aoj",
                  "score": 1,
                  "body": "That’s not true. Naked shorts have won because infinite numbers are larger than finite ones.",
                  "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltj3aoj/",
                  "created": 1729785114,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ltck9rr",
          "score": -6,
          "body": "Wow top reply in support of shorts. Hwang, cohen, left. Is there a reason every rich trader has a hedge fund? I wonder what the incentive is? if shorting is so much work, so risky, and so contrarian. \n\nLet me ask you this, which short sellers do not \"try to manipulate buying/selling activity of others for their own gain\"? I'll tell you, it's dangerously close to the investing principles of shorts, the cautionary statement you made. They're all using a similar playbook. Who created spoofing, pump and dump, short and distort, etc? Where did those strategies originate? \n\npretending that they haven't all been fined for malfeasance, the big players and the little ones, is folly friend. \n\nLike saying D\\_rump's cronies are not all the same, that they should be individually judged on the basis of their own actions... yea.. does that change the certainty of one's thought process about their guilt and criminally minded nature? no, no it does not.",
          "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltck9rr/",
          "created": 1729694561,
          "depth": 1,
          "replies": [
            {
              "id": "ltcqgcn",
              "score": 3,
              "body": "Ah yes a nonsense reply. If someone thinks a company is BS, they can bet against it by taking a short position. If they then publish publicly why they have taken this position, that's also perfectly fine. It incentivizes the discovery of negative information about companies, which we need for a healthy market.\n\nTrump btw has nothing to do with this.",
              "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltcqgcn/",
              "created": 1729696491,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltcrguj",
              "score": 4,
              "body": "What’s the difference between taking a short position and bleeding a stock out, vs taking a long position and pumping a stock up?\n\nI think what Cohen did with BBBY was far more damaging to retail investors than any short position taken in the last 5 years.\n\nAnd yes, I absolutely judge you based on posting in superstonk lol. ",
              "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltcrguj/",
              "created": 1729696806,
              "depth": 2,
              "replies": [
                {
                  "id": "ltesr75",
                  "score": 4,
                  "body": ">What’s the difference between taking a short position and bleeding a stock out, vs taking a long position and pumping a stock up?\n\nDisregarding the practice of naked shorting, a legitimate short position entails borrowing a share from someone and selling it to someone else.  At that point that single legitimate share is out there in two brokerage accounts, **artificially** inflating the Supply side of Supply/Demand.  (Furthermore, nothing necessarily prevents this share from being borrowed from the person who bought it from the short-seller, and so on.)\n\nA long position entails buying a share from someone else outright, that share leaves one account and enters another, still only one share.  If someone wants to buy shares when they are fundimentally overpriced, then that's what the demand **is**.  It isn't distorting Supply/Demand if the demand is there.    \nMaybe buying something overpriced is dumb?  You don't need to buy it if you think it's overpriced.",
                  "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltesr75/",
                  "created": 1729719094,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lthttw6",
                      "score": 1,
                      "body": "lol I know how shorting works I was trying to make a point. I have nothing against shorting, there’s nothing wrong with it.\n\nSame logic applies if I deposit cash in a bank account and then the bank lends it to someone as a loan. The dollar supply is artificially increased. But again, this is a good thing. \n\nIdk what point you’re trying to make?",
                      "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/lthttw6/",
                      "created": 1729768945,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltoylrm",
                          "score": 1,
                          "body": "You asked what's the difference between taking a short position or a long position, clearly implying that they were equivalent.  I was just answering your question and explaining the difference, not necessarily making a specific point.  \n\nI'm not sure what point you were trying to make by implying they were equivalent; If you already knew how shorting works then you already knew they were not equivalent.",
                          "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltoylrm/",
                          "created": 1729868300,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lte989o",
                  "score": 5,
                  "body": "Longs don’t sell something they never owned in the first place with a pinky promise to make it good later.",
                  "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/lte989o/",
                  "created": 1729713248,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ltf43f1",
              "score": 1,
              "body": "They have a hedge fund because it’s basically the only way to pool money outside of a mutual fund…",
              "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltf43f1/",
              "created": 1729722868,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltddlrg",
              "score": 1,
              "body": "So if you buy a stock of a company that’s cool and good. If you sell it in order to buy it back later cheaper that’s horrible?",
              "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltddlrg/",
              "created": 1729703532,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltgxnrl",
      "score": 4,
      "body": "Hopefully he gets a long vacation in a federal prison instead of another slap on the wrist fine.",
      "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltgxnrl/",
      "created": 1729748905,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltbx7cn",
      "score": 10,
      "body": "He did this for a while. I remember after GME he kind of got pissed at all the people attacking him and the recommendations went completely different from what they used to do. The reports were pretty half assed also after that. I am surprised any one who read it before would trade based on those reports.",
      "permalink": "/r/stocks/comments/1ga8gq3/us_sec_is_having_a_set_of_eyes_targeting_at_the/ltbx7cn/",
      "created": 1729686347,
      "depth": 0,
      "replies": []
    }
  ]
}