{
  "title": "Coca-Cola Non-GAAP EPS of $0.77 beats by $0.02, revenue of $11.9B beats by $290M, Shares -2% PM",
  "score": 42,
  "selftext": "\n\nKO Revenue of $11.9B (-0.8% YY) beats by $290M. Organic Revenues (Non-GAAP) Grew 9%.\n\nRevenue performance included 10% growth in price/mix and a 2% decline in concentrate sales. Concentrate sales were 1 point behind unit case volume, primarily due to the timing of concentrate shipments.\n\n**Full Year 2024**\n\nFor comparable net revenues (non-GAAP), the company expects a 4% to 5% headwind from acquisitions, divestitures and structural changes. Comparable EPS (non-GAAP) is expected to include a 1% to 2% headwind from acquisitions, divestitures and structural changes. — No Update\n\nThe company expects to deliver comparable currency neutral EPS (non-GAAP) growth of 14% to 15%. — Updated\n\nThe company expects comparable EPS (non-GAAP) growth of 5% to 8%, versus $2.69 in 2023. — No Update\n\nThe company expects to generate free cash flow excluding the IRS tax litigation deposit (non-GAAP) of approximately $9.2 billion.\n\n**Fourth Quarter 2024 Considerations** \n\nComparable net revenues (non-GAAP) are expected to include an approximate 4% currency headwind based on the current rates and including the impact of hedged positions, in addition to a 4% to 5% headwind from acquisitions, divestitures and structural changes.\n\n**Full Year 2025 Considerations**\n\nComparable net revenues (non-GAAP) are expected to include a low single-digit currency headwind based on the current rates and including the impact of hedged positions.\n\n  \nKey Takeaways:\n\nOrganic sales shine again Organic revenue rose 11% during the quarter vs a 9.3% consensus estimate, with unit case volume up +2% and Latin America up +12%. The organic sales growth outpaced PepsiCo's 9.3% mark in a recently completed period. Unit case volume was down 1% for Coca-Cola globally during the quarter, with growth led by Brazil, the Philippines and Japan but more than offset by declines in China and Türkiye.\n\nNorth America outperforms Unit case volume in North America showed flat growth in trademark Coca-Cola products, while water, sports, coffee and other beverages saw mixed results. Price/mix grew 11%, driven by favorable mix and pricing actions in the marketplace. Operating income grew 10%, benefiting from organic revenue growth.\n\nMargins march higher Consolidated comparable operating margin rose 90 basis points to 29.7% in the period. This improvement was primarily driven by strong organic revenue growth and restructuring bottling operations, partially offset by currency headwinds.\n\nLooking ahead Coca-Cola sees full-year adjusted organic revenue growth of +10% vs +9.0% consensus. The company expects to deliver comparable currency neutral EPS growth of +14% to +15%.\n\nComparable EPS (non-GAAP) percentage growth is expected to include a mid-single digit currency headwind based on the current rates and including the impact of hedged positions.",
  "link_flair_text": null,
  "id": "1ga9n28",
  "num_comments": 12,
  "created_utc": 1729687460,
  "permalink": "/r/stocks/comments/1ga9n28/cocacola_nongaap_eps_of_077_beats_by_002_revenue/",
  "comments": [
    {
      "id": "ltgx5k4",
      "score": 8,
      "body": "12 packs of Coke products here are $9/each though they do often go on sale.  I have no idea who on earth buys it at full price.",
      "permalink": "/r/stocks/comments/1ga9n28/cocacola_nongaap_eps_of_077_beats_by_002_revenue/ltgx5k4/",
      "created": 1729748616,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltcc9ew",
      "score": 20,
      "body": "Is KO the best place to park money? This is not 1980. They are a slow growth mature co. No upside",
      "permalink": "/r/stocks/comments/1ga9n28/cocacola_nongaap_eps_of_077_beats_by_002_revenue/ltcc9ew/",
      "created": 1729691932,
      "depth": 0,
      "replies": [
        {
          "id": "ltck0b8",
          "score": 20,
          "body": "wonder when people will realize that about Apple?",
          "permalink": "/r/stocks/comments/1ga9n28/cocacola_nongaap_eps_of_077_beats_by_002_revenue/ltck0b8/",
          "created": 1729694479,
          "depth": 1,
          "replies": [
            {
              "id": "ltcmc2z",
              "score": 9,
              "body": "Same here honestly. Im 29 though. So me looking at 40 years of growth on companies that IPOd recently have years of alpha runway is different from old people who invest in coca cola for their 3% qualified dividend. I still dont get it when they could be in schd with equivalent dividend and better growth than coca cola. If theyre going to die in 15 years better to be in higher performing index than an old company that will have to evolve in a competitive space-that they can then pass on to their offspring (schd)",
              "permalink": "/r/stocks/comments/1ga9n28/cocacola_nongaap_eps_of_077_beats_by_002_revenue/ltcmc2z/",
              "created": 1729695209,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltek8n0",
          "score": 13,
          "body": "I get it, Tortoise vs Hare. \n\nThe reason you want to park money into staples is precisely that they have a high likelihood of being around in 40, 60, 80 and 100 years and they are very likely to keep growing the entire time. This is why staples are powerful.\n\nFor instance, pull up a sector market share chart. If you do that you will notice something interesting. Techs market share has actually gone no where since the late 60s. It peaked in the .com bubble and is again in a slight bubble now, but overall, not changed since then. What has changed is the companies within. Lots of boom and busts and big time consolidation and concentration of value. \n\nStaples havent really changed much either in terms of market share but like I try to describe above, its very easy to pick winners from staples precisely because they are not boom and bust. At worst, they get bought out but they will never go obsolete. This low risk characteristic is extremely valuable because even a dummy can pick winner 90% of the time. You cant say that about picking tech or finance or even energy stocks. Are the big tech giants of the 60s still around? Some yes, but mostly no. Are all those popular fracking companies from the 2000s still around? Most went under in the financial crash. And banks are like revolving bankruptcies even if they dont go under entirely....\n\nFolks need to start respecting risk and practice risk mitigation. There is a total disregard for that on this channel in favor of getting rich quick on the next double or 10 bagger. Every portfolio posted is like 90% tech... many are 100% tech... its like everything thinks they will time the market just right to get out at peaks. It wont work. A few people will get rich, but most will look back and wish they bought KO instead.",
          "permalink": "/r/stocks/comments/1ga9n28/cocacola_nongaap_eps_of_077_beats_by_002_revenue/ltek8n0/",
          "created": 1729716508,
          "depth": 1,
          "replies": [
            {
              "id": "ltfvm4g",
              "score": 0,
              "body": "Thats not at all what i was referring too (no tortoise no hare). Simply alpha runway from the point of buying at a good price multiple after an IPO. Buying a long position while the stock is in the money with great prospects. Im in 5 of them right now that i found myself.  Its possible because im no genius, but i can read financials, 10ks and have an imagination of the future.  New sectors are transforming and popping up. Like i said, im 29. No one in their 20s should be buying  coca cola stock if they want to get rich. 10% revenue growth is okay. But is it the best place to park money? Most companies if you are into msrket research and you are decent, will exist in 30,40,50 years. I also didnt say select companies. The nasdaq and schd all have companies that will be around and carry the index overbthat same time horizon versus KO being a single company- yet will surpass KO in price appreciation  by 5x over 20 years, 10x in 30 years. And you want to throw in 'risk mitigation'. Coca cola will not exist forever.  Perhaps that is the best some can do. But i said what i said to have other readers who aspire for more to challenge their approach. Why are we in this game? To make good moves. To make big moves. If you're 60-65 and this a simple way to play the game and you cant do research or dont want to consult an FA, sure KO all the way with procter and gamble and the like.",
              "permalink": "/r/stocks/comments/1ga9n28/cocacola_nongaap_eps_of_077_beats_by_002_revenue/ltfvm4g/",
              "created": 1729732583,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lte6gs0",
          "score": 3,
          "body": "COKE is a better investment than KO but it flies under the radar.",
          "permalink": "/r/stocks/comments/1ga9n28/cocacola_nongaap_eps_of_077_beats_by_002_revenue/lte6gs0/",
          "created": 1729712433,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltddmpm",
          "score": -6,
          "body": "not to mention they are killing their customers with diabeetus.",
          "permalink": "/r/stocks/comments/1ga9n28/cocacola_nongaap_eps_of_077_beats_by_002_revenue/ltddmpm/",
          "created": 1729703540,
          "depth": 1,
          "replies": [
            {
              "id": "ltf2fuk",
              "score": 1,
              "body": "Ozempic",
              "permalink": "/r/stocks/comments/1ga9n28/cocacola_nongaap_eps_of_077_beats_by_002_revenue/ltf2fuk/",
              "created": 1729722295,
              "depth": 2,
              "replies": [
                {
                  "id": "ltf543d",
                  "score": 2,
                  "body": "they should partner and offer \"new raspberry coke ozempic\"",
                  "permalink": "/r/stocks/comments/1ga9n28/cocacola_nongaap_eps_of_077_beats_by_002_revenue/ltf543d/",
                  "created": 1729723225,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lth8ag4",
      "score": 2,
      "body": "So they jacked up the price by 11% but had no sales growth. All good till consumer sentiment turns! But they remain stable and steady at converting their great brand into free cash.",
      "permalink": "/r/stocks/comments/1ga9n28/cocacola_nongaap_eps_of_077_beats_by_002_revenue/lth8ag4/",
      "created": 1729755613,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjzs7a",
      "score": 0,
      "body": "There is talk of a boycott of KO.  Has to do with wokeness and DEI.  Nice dividend but be aware.",
      "permalink": "/r/stocks/comments/1ga9n28/cocacola_nongaap_eps_of_077_beats_by_002_revenue/ltjzs7a/",
      "created": 1729794756,
      "depth": 0,
      "replies": []
    }
  ]
}