{
  "title": "Tesla shares jump 6% on profit beat",
  "score": 340,
  "selftext": "* Tesla reported third-quarter earnings on Wednesday that topped analysts’ estimates even as revenue came in just shy of expectations.\n\nHere’s what the company reported compared with what Wall Street was expecting, based on a survey of analysts by LSEG:\n\n* **Earnings per share:** 72 cents vs. 58 cents expected\n* **Revenue:** $25.18 billion vs. $25.37 billion expected\n\nRevenue increased 8% in the quarter from $23.35 billion a year earlier. Net income rose to about $2.17 billion, or 62 cents a share, from $1.85 billion, or 53 cents s share, a year ago.\n\nTesla’s profit margins were bolstered by $739 million in automotive regulatory credit revenue during the quarter. The company has also been offering an array of discounts and incentives to spur sales.\n\nAutomotive revenue increased 2% to $20 billion from $19.63 billion in the same period a year earlier. Energy generation and storage revenue soared 52% to $2.38 billion, while services and other revenue jumped 29% to $2.79 billion.\n\nOperating margin was reported at 10.8% of sales to improve from last quarter's mark of 6.3%, and top last year's mark of 7.6%. Total GAAP gross margin was 19.8% vs. 17.9% a year ago and 18.0% in the prior quarter. Adjusted EBITDA was $4.67 billion vs. $3.76 billion a year ago. For the quarter, the EV juggernaut's adjusted EBITDA margin rose to 18.5% of sales from 16.1% a year ago.\n\n# \n\nTesla had already disclosed 462,890 deliveries for Q3. The electric vehicle maker said it produced 469,796 vehicles during the quarter. Tesla noted that 3% of the deliveries were subject to operating lease accounting. For reference, Tesla delivered 443,956 vehicles in Q2 of this year and 435,059 vehicles in Q3 of last year. Tesla's  all-time deliveries record was 484,507 vehicles in Q4 of 2023. Looking ahead, Tesla reiterated that plans for new vehicles, including more affordable models, remain on track for start of production in the first half of 2025.\n\n# More than just EVs\n\nTesla said energy storage deployments decreased sequentially in Q3 to a record 6.9 GWh, but were up 75% Y/Y. Overall, Tesla said energy services and other businesses are becoming increasingly profitable parts of the company. \"As energy storage products continue to ramp, and our vehicle fleet continues to grow, we are expecting continued profit growth from these businesses over time,\" noted TSLA. The company also said that it deployed and is training ahead of schedule on a 29k H100 cluster at Gigafactory Texas, where it expects to have 50k H100 capacity by the end of October.\n\n# Balance sheet\n\nTesla ended the quarter with a cash position of $33.6 billion. The sequential increase of $2.9 billion was a result of positive free cash flow of $2.7 billion. Operating cash flow was $6.3 billion during the quarter.\n\n**SUMMARY**\n\nWe delivered strong results in Q3 with growth in vehicle deliveries both sequentially and year-on-year, resulting in record third-quarter volumes. We also recognized our second-highest quarter of regulatory credit revenues as other OEMs are still behind on meeting emissions requirements.\n\nOur cost of goods sold (COGS) per vehicle came down to its lowest level ever at \\~$35,100. In order to continue accelerating the world’s transition to sustainable energy, we need to make EVs affordable for everyone, including making total cost of ownership per mile competitive with all forms of transportation. Preparations remain underway for our offering of new vehicles – including more affordable models – which we will begin launching in the first half of 2025. At our \"We, Robot\" event on October 10, we detailed our long-term goal of offering autonomous transport with a cost per mile below rideshare, personal car ownership, and even public transit.\n\nThe Energy business achieved another strong quarter with a record gross margin. Additionally, the Megafactory in Lathrop produced 200 Megapacks in a week, and Powerwall deployments reached a record for the second quarter in a row as we continue to ramp Powerwall 3.\n\nDespite sustained macroeconomic headwinds and others pulling back on EV investments, we remain focused on expanding our vehicle and energy product lineup, reducing costs and making critical investments in AI projects and production capacity. We believe these efforts will allow us to capitalize on the ongoing transition in the transportation and energy sectors.",
  "link_flair_text": null,
  "id": "1gak7c4",
  "num_comments": 489,
  "created_utc": 1729714585,
  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/",
  "comments": [
    {
      "id": "ltefao4",
      "score": 356,
      "body": "Genuinely, I am shocked.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltefao4/",
      "created": 1729715041,
      "depth": 0,
      "replies": [
        {
          "id": "ltflwza",
          "score": 40,
          "body": "Reddit is an echo chamber.",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltflwza/",
          "created": 1729729142,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lteg6a8",
          "score": 246,
          "body": "Why? Their revenues dropped and if it weren’t for 700M in regulator credits their margins would have been crushed.",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteg6a8/",
          "created": 1729715300,
          "depth": 1,
          "replies": [
            {
              "id": "ltegk0u",
              "score": 96,
              "body": "Automotive gross margins are up according to bloomberg.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltegk0u/",
              "created": 1729715412,
              "depth": 2,
              "replies": [
                {
                  "id": "ltej8dr",
                  "score": 102,
                  "body": "Tesla includes reg credits in their automotive gross margins.",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltej8dr/",
                  "created": 1729716209,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltekcid",
                      "score": 87,
                      "body": "They said auto margins (ex reg credits) went from 14.3%to 17.1%",
                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltekcid/",
                      "created": 1729716540,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltekuhv",
                          "score": 14,
                          "body": "Yup, that's good. They still include it unless specifically stated.",
                          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltekuhv/",
                          "created": 1729716688,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltemq5a",
                              "score": 57,
                              "body": "Yea because money is money. Arguably, it coming from competitors not meeting emission goals is even better.",
                              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltemq5a/",
                              "created": 1729717239,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lteo6kv",
                                  "score": 38,
                                  "body": "Well, the thing is it’s a political and transitory part of margin. If legacy automakers shift to electric or regulatory credit regime changes then that margin goes away quickly. \n\nNot a catastrophe though as Tesla would be profitable anyway and stock prices of Tesla have nothing to do with realistic earning outlook but fantasy of future things to come.",
                                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteo6kv/",
                                  "created": 1729717677,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ltgxpo6",
                                      "score": 8,
                                      "body": "Not transitory. Folks have been claiming it is transitory since 2009. And yet... here we continue to be.\n\nThere regulatory credits come from the EU, China, US CAFE GHG, CARB ZEV, and others. Legacy automakers are doing a piss poor job of meeting ever more stringent emissions standards across the globe. If anything, the regulatory credits are likely to increase over the next few years.",
                                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltgxpo6/",
                                      "created": 1729748935,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "ltfiv4p",
                                      "score": 10,
                                      "body": "> If legacy automakers shift to electric or regulatory credit regime changes then that margin goes away quickly.\n\n\nWell that's kinda like saying \"if a competitor can sell the same product cheaper the demand goes away\". You can say that about ANY company.",
                                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfiv4p/",
                                      "created": 1729728051,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "ltep4ef",
                                      "score": 6,
                                      "body": "I agree",
                                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltep4ef/",
                                      "created": 1729717964,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "lteomey",
                                  "score": 17,
                                  "body": "It's not industry standard and it's why their gross automotive margins look so inflated.\n\nGross automotive margins should just be the ratio of revenue from sales of vehicles to cost of goods sold for their automotive business. It should not include revenue from sales of other items such as regulatory credits.",
                                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteomey/",
                                  "created": 1729717812,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lteq1g8",
                                      "score": 0,
                                      "body": "Hehe yea, it's not industry standard because no one in the industry except Tesla has enough to sell them in volume.\n\nThese are not made out of thin air (maybe out of clean air), but are a direct result of EV sales.",
                                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteq1g8/",
                                      "created": 1729718249,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lteqdrd",
                                          "score": 9,
                                          "body": "It's not industry standard to include anything other than the vehicle sale price in the calculation. It's just one of the more egregious accounting tricks that Tesla uses to make it's financial health look better than it is.",
                                          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteqdrd/",
                                          "created": 1729718354,
                                          "depth": 9,
                                          "replies": []
                                        },
                                        {
                                          "id": "ltf04dj",
                                          "score": 4,
                                          "body": "Uh no that's completely incorrect.",
                                          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf04dj/",
                                          "created": 1729721509,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "ltf7jz5",
                                  "score": 2,
                                  "body": "yes, free factories.\n\n\"Competition\" is really charity",
                                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf7jz5/",
                                  "created": 1729724075,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "lthhu23",
                                  "score": 4,
                                  "body": "But, but but...the competition is coming? /s",
                                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lthhu23/",
                                  "created": 1729762048,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "ltf5llv",
                              "score": 8,
                              "body": "Yep, gotta remove those one time, 44 consecutive quarters of reg credits...",
                              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf5llv/",
                              "created": 1729723395,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ltfo1x6",
                          "score": 6,
                          "body": "I would love to hear the accounting on that jump...",
                          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfo1x6/",
                          "created": 1729729899,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltgw1rp",
                              "score": 5,
                              "body": "If only they had some sort of framework they had to use for accounting, and that we had an outside firm audit their accounting practices and controls so they just couldn't get away with making things up...",
                              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltgw1rp/",
                              "created": 1729747995,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ltfm2fj",
                      "score": 5,
                      "body": "That IS EXCLUDING credits. It specifically said so.",
                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfm2fj/",
                      "created": 1729729195,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltewkhu",
              "score": 30,
              "body": "cope hard reddit.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltewkhu/",
              "created": 1729720322,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltej439",
              "score": 33,
              "body": "Considering that YoY, Tesla earned only 185 million more on regulatory credits this quarter versus Q3 '23, it's not a big deal.  Besides, money is money, regardless of source. \n\nRegulatory credits are a steady, if small, portion of Tesla's income.  They'll continue to be steady revenue because other automakers aren't transitioning to EVs in high enough volumes.    \n\nBy comparison, the Energy business generated 2.376 Billion and Services generated 2.790 Billion.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltej439/",
              "created": 1729716173,
              "depth": 2,
              "replies": [
                {
                  "id": "ltescf7",
                  "score": 42,
                  "body": "Regulatory credits are 100% income (100% corporate profit).  Comparing the first 3 quarters of the year, their regulatory income is approximately $700 million higher than the previous highest year.  \n\nThey've pulled in about 1.7 - 1.8 billion in regulatory income in each of the last two years.  They're on course to pull in $2.5+ billion in regulatory income in 2024.  It's a pretty massive chunk of their total net income for having to do absolutely nothing to get it save sell the cars they were going to sell anyways.\n\nTheir net income through the first 3 quarters is 4.807 billion, versus $7.069 billion last year, or 32% lower y/y.  Remove the $700 million extra in regulatory credits y/y, and it would have been closer to $4.1 billion or a 42% drop in income y/y on their actual product sales.\n\nThey're on course to just about match their total unit vehicle sales y/y; they're still a bit behind last year through Q3.  The problem is that their long term guidance which helped lead to the run up (overvaluation) in the stock price is 50% CAGR between 2020 and 2030.  They rescinded that guidance in Q3 '23 because they don't believe it's possible anymore.  To stay even with the 50% CAGR in 2024, they'd have need to sell over 2.5 million vehicles, but they're on course to sell about 1.8 million.  2025 could see little if any sales growth versus 2023/2024.  However, to maintain the 50% CAGR in 2025, they'd have to hit 3.8 million vehicle sales.\n\nStarting to see the problem?  Their forward PE is based on crazy growth guidance, which even Tesla has admitted they can't hit, yet the stock is still trading at a forward PE of over 80.   Most of the major OEMs across the world trade a forward PE of between 5 and 7.\n\nTesla's sales aren't growing, their revenue isn't growing, and their income isn't growing, which means their PE is based on nothing more than a hope and a dream.\n\nIt seems to me that for the second year in a row, Tesla will only see an annual profit on account of government subsidies and regulatory credit sales.",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltescf7/",
                  "created": 1729718966,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltgxvst",
                      "score": 5,
                      "body": "Income is growing ex-regulatory credits.\n\nYou're just griping now.",
                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltgxvst/",
                      "created": 1729749033,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ltf4doo",
                      "score": 2,
                      "body": ">It seems to me that for the second year in a row, Tesla will only see an annual profit on account of government subsidies and regulatory credit sales.\n\nYou can call them subsidies all you like, but traditional automakers are able to not report billions in expenses on their income statements because they externalize the cost of pollution and global warming. This is simply leveling the playing field, albeit probably in a nonoptimal way.",
                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf4doo/",
                      "created": 1729722968,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ltenixy",
                  "score": -3,
                  "body": "These credits won't last forever.\n\nOther companies won't let Tesla drink their milkshake forever.",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltenixy/",
                  "created": 1729717478,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltesecc",
                      "score": 25,
                      "body": "Tesla themselves said in 2022 that they expect to see sequential declines in regulatory credit sales going forward, but they clearly underestimated the incompetence of their rivals.",
                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltesecc/",
                      "created": 1729718982,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltet620",
                          "score": 4,
                          "body": "Part of that is because ICV sales are holding better than expected.\n\nAnd traditional car companies not having the guts to take 2 or 3 years of increasing Capex to be able to transition to EV.",
                          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltet620/",
                          "created": 1729719225,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lteov8f",
                      "score": 10,
                      "body": "I don't think Tesla is counting on those credits lasting forever, nor should they really care.  \n\nLooking at page 26 of the shareholder slide deck, total revenue for Q3 '24 was  25.182 Billion of which 739 million was regulatory credits.  \n\n* That's 2.935% of their total revenue.  Not a lot.  If it evaporated instantly this would have no practical effect on their expansion plans\n   * Operating cash flow was +6.255 Billion and free cash flow +2.742 Billion.  The company has a war chest of 33.648 Billion in liquid assets. (page 4 of slide deck)\n\nTesla will sell the credits as long as they can.  Why not earn $ when it's there?  But they are certainly not running their business like they need the credits.  It's clear they don't",
                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteov8f/",
                      "created": 1729717887,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltewgxa",
                          "score": 10,
                          "body": "Just to repeat from my last comment, and add a bit more info, regulatory credit isn't simple revenue... it's 100% net income... 100% profits.\n\n739 million is 33.6% of Q3's net income.\n\nKeep in mind, a massive chunk of their remaining net income comes from government subsidies.  In the US for example, they're still seeing $7500 federal tax credits on a large percentage of their total sales which allows them to maintain higher MSRPs, translating into higher profit margins.  Most of their sales are in states with state EV tax credits as well, often in the $1500-$2500 range.  Some as high as $5000.\n\nTheir energy sales are even more subsidized than their car sales.  The federal government subsidizes something like 30%+ of the overall cost of a solar panel / home battery storage installation.  States with the highest rooftop solar adoption rates often have additional incentives on top.  Overall, it can reach up to 50%.  \n\nI'm not sure on their grid scale power storage, but I'm guessing the subsidies and/or the amount they're charging the government, which often has mandates written into law to have storage installed, are lucrative.\n\nLike 2023... if Tesla were to exclude regulatory credit income and government subsidies from their income, they'd likely be reporting a loss for 2024.  I guess this doesn't technically matter unless there were a risk that the subsidies were going to disappear in short order.. which there's no sign of.\n\nSome headwinds for Q4:\n\n* They've removed their lowest priced trim model 3 near the end of Q3, which had the imported Chinese LFP battery.  That could hit their overall sales numbers in Q4.  It also means they're not going to sell cars with the significantly cheaper LFP packs, which likely generated some decent profit margins.  These units didn't qualify for the full tax credit on sales; although I do believe they still qualified on leases, which Tesla would have had to roll into the lease price.  Not sure if they did or didn't do that.\n* They significantly cut the price of the Cybertruck and still don't seem to have a backlog after the price cut; per their estimated delivery dates on their site.\n* They've significantly cut the prices on their inventory vehicles.  Model 3s I've seen have up to $3k discounts applied.  Model Y has as much as $4k discounts applied.  Model Y accounts for the majority of their sales.  That said, they were also aggressively discounting inventory vehicles last year in Q4.\n* They're offering 0% financing offers; which I believe is new this year.  While this won't impact their unit sales, it will mean additional losses of up to $5k per vehicle over the course of the loan that they otherwise would have made on interest.\n\nI do expect Tesla to break their sales numbers from last year, if only because they're so deeply discounting their vehicles.  However, I expect their revenue and net income to be down in Q4 y/y as a result of their deep discounting.",
                          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltewgxa/",
                          "created": 1729720289,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltehhex",
              "score": 10,
              "body": "Clean your glasses, ya need to read the report again",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltehhex/",
              "created": 1729715689,
              "depth": 2,
              "replies": [
                {
                  "id": "ltehucc",
                  "score": 8,
                  "body": "What part of what I said contradicts with the report?",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltehucc/",
                  "created": 1729715796,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ltflzrp",
              "score": 2,
              "body": "GM 17% EXCLUDING credits.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltflzrp/",
              "created": 1729729169,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltfohb7",
              "score": 1,
              "body": "Could just be cause everything that meets good quarters has gone down lately? Idk lol",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfohb7/",
              "created": 1729730046,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltegbb9",
          "score": 15,
          "body": "Because Tesla is electric?",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltegbb9/",
          "created": 1729715341,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltfanui",
          "score": 8,
          "body": "genuinely, why? History repeats itself again and again. Redditors are morons and pretty much always wrong. pretty much called it here too  \nhttps://www.reddit.com/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/lreyskz/",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfanui/",
          "created": 1729725159,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lthgovg",
          "score": 2,
          "body": "even the bulls are pleasantly surprised I think\n\nI'm a shareholder and was expecting a dumpster fire lol",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lthgovg/",
          "created": 1729761283,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lth6d6j",
      "score": 24,
      "body": "They have 33B in the bank, that's crazy",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lth6d6j/",
      "created": 1729754322,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltef9wo",
      "score": 72,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltef9wo/",
      "created": 1729715035,
      "depth": 0,
      "replies": [
        {
          "id": "lteg6gm",
          "score": 111,
          "body": "Cybertruck was third best selling EV? Wtf",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteg6gm/",
          "created": 1729715301,
          "depth": 1,
          "replies": [
            {
              "id": "ltepxy2",
              "score": 53,
              "body": "The CT was also gross margin positive while they're still heavily ramping it. Meanwhile companies like Ford and GM still have more negative margins than Tesla has ever had in their history (although admittedly Tesla only ever had one quarter where they had negative gross margins), Ford is even struggling to get below -100% gross margin on EVs...",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltepxy2/",
              "created": 1729718218,
              "depth": 2,
              "replies": [
                {
                  "id": "ltesff2",
                  "score": 52,
                  "body": "People don't like these facts, truth is its hard to profitably make EVs. Rivian and Lucid are prime examples, because they can't hide their loses through profitable ICE sales.",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltesff2/",
                  "created": 1729718991,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ltfgms0",
                  "score": 16,
                  "body": "Positive in less than 1 year is crazy",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfgms0/",
                  "created": 1729727266,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ltewvg8",
              "score": 18,
              "body": "Get out of the reddit echo chamber.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltewvg8/",
              "created": 1729720422,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltek8h6",
              "score": 47,
              "body": "In a shareholder deck, Tesla boasted that it reached 7 million vehicles produced on Oct. 22nd, and that its newest offering, the Cybertruck, became the third best-selling fully electric vehicle in the U.S., behind only the Model 3 and Model Y.\n\nThat’s crazy, in a good way as I’m long.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltek8h6/",
              "created": 1729716507,
              "depth": 2,
              "replies": [
                {
                  "id": "ltexxjb",
                  "score": 5,
                  "body": "I'm curious if it will remain so. Word is they already burned through the 1m+ pre-orders, and only converted 25k orders total. The website shows I can custom order one and have it in 2 weeks so there doesn't seem to be any remaining backlog.",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltexxjb/",
                  "created": 1729720771,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltfbp0z",
                      "score": 10,
                      "body": "Wouldn’t the huge majority of the backlog be for the cheaper 40k model? Sounds like they still plan for a cheaper RWD model, though I doubt it will be as low as 40k. Maybe 50 or 60. Either way, I have to imagine most people reserved the cheaper one.",
                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfbp0z/",
                      "created": 1729725526,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ltf2ksx",
                      "score": 3,
                      "body": "Time will tell. Impressive feat, even if short lived.  Tesla said in the release that the Cybertruck “achieved a positive gross margin for the first time.”\nAnother impressive act. A culmination of all things Tesla has done over the years I feel.",
                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf2ksx/",
                      "created": 1729722342,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltfa013",
                          "score": 5,
                          "body": "Especially impressive when you realize all other EV trucks are still not profitable even though they’ve been out for years",
                          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfa013/",
                          "created": 1729724926,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltejbpj",
              "score": 16,
              "body": "That should surprise no one. There are some improvements lately, but no model of EV sold in the US has had the kind of production volume to compete with them.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltejbpj/",
              "created": 1729716236,
              "depth": 2,
              "replies": [
                {
                  "id": "lteqsxe",
                  "score": 22,
                  "body": "Lol the literal army of Tesla FUDbots are foaming at the mouth ready to argue with that.",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteqsxe/",
                  "created": 1729718485,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltfamvl",
                      "score": 9,
                      "body": "They big mad",
                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfamvl/",
                      "created": 1729725149,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltejoue",
              "score": 19,
              "body": "Will be for the foreseeable future as they ramp. US EV volume output besides Tesla is quite pathetic.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltejoue/",
              "created": 1729716345,
              "depth": 2,
              "replies": [
                {
                  "id": "ltf1gfc",
                  "score": 18,
                  "body": "Bit I thought everybody said it was going to be a total commerical failure?",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf1gfc/",
                  "created": 1729721962,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltf7pgb",
                      "score": 18,
                      "body": "reddit is full of idiots.",
                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf7pgb/",
                      "created": 1729724127,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltfahn8",
                          "score": 6,
                          "body": "Smug ignorant idiots who find comfort in the group-think one true opinion they all baby-bird into eachother’s mouths back and forth",
                          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfahn8/",
                          "created": 1729725098,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltehakf",
              "score": 14,
              "body": "This is old news",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltehakf/",
              "created": 1729715631,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltexw6k",
              "score": 8,
              "body": "It's a very devisive car. Everyone either loves or hates it. Haters will never touch it, but lovers will buy it since there's nothing that looks similar. \n\nEven if 90% hate it, 5% can't afford it and 5% love it, that would easily make it No1 in the USA.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltexw6k/",
              "created": 1729720758,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltfgpa2",
              "score": 9,
              "body": "Yup. Behind Model Y and Model 3. \n\n\"The competition is coming\" ..my ass.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfgpa2/",
              "created": 1729727291,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltfnkh7",
              "score": 7,
              "body": "Not only that, it also outsold its direct competitors, the F-150 Lightning and Rivian R1T, not just this past quarter but also YTD.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfnkh7/",
              "created": 1729729728,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltequnc",
              "score": 5,
              "body": "What, did the curated and bot infested internet tell you a false narrative that you believed? Reality is a bitch and numbers don’t lie.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltequnc/",
              "created": 1729718500,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltiokfv",
      "score": 14,
      "body": "6% ... lol.  This sub gets everything wrong.  It's almost impressive how consistently dumb.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltiokfv/",
      "created": 1729780629,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltex3xz",
      "score": 32,
      "body": "I sold all my shares 2 days ago that's why it went up. I don't have the heart to ride this wave.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltex3xz/",
      "created": 1729720499,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lteigph",
      "score": 216,
      "body": "Revenue up 8% YoY. PE100. Absolutely normal. Keep buying.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteigph/",
      "created": 1729715978,
      "depth": 0,
      "replies": [
        {
          "id": "ltejscy",
          "score": 109,
          "body": "It's insane. There's like 10 years of growth baked into the current price.",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltejscy/",
          "created": 1729716374,
          "depth": 1,
          "replies": [
            {
              "id": "ltetr23",
              "score": 49,
              "body": "That being true, Tesla does not have the valuation of the car company it is but that of the church it also is.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltetr23/",
              "created": 1729719413,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltemapu",
              "score": 58,
              "body": "Copy paste this comment since last 10 years. It always seems applicable.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltemapu/",
              "created": 1729717112,
              "depth": 2,
              "replies": [
                {
                  "id": "ltenjo1",
                  "score": 15,
                  "body": "I would say the last 6 is really when the stock became the first memestock and disconnected from fundamentals.",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltenjo1/",
                  "created": 1729717484,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ltetv30",
                  "score": 30,
                  "body": "Tesla's growth has slowed down considerably though. GM is growing earnings faster than Tesla and yet they're valued at 5.6x earnings while tesla is 60x earnings.",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltetv30/",
                  "created": 1729719448,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltf0rl5",
                      "score": 11,
                      "body": "Agreed. There are many bets that could potentially pay off for Tesla. At least, Elon convinces investors that way. Tesla builds its own hardware and software, so they are unique that way.",
                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf0rl5/",
                      "created": 1729721727,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ltgy4is",
                      "score": 7,
                      "body": "Check GM's EV earnings... oh, yeah, it's negative, even on a contribution margin basis. Going forward, only their EV earnings matter. Everything else is going to get nuked.",
                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltgy4is/",
                      "created": 1729749177,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltf39p2",
              "score": 2,
              "body": "and a flagship product that doesn't exist or has been recalled.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf39p2/",
              "created": 1729722581,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lteox5c",
          "score": 12,
          "body": "When it was 30B company was it a buying opportunity for you, or also hugely overvalued based on PE (negative   at the time)?",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteox5c/",
          "created": 1729717903,
          "depth": 1,
          "replies": [
            {
              "id": "lth4eos",
              "score": 2,
              "body": "TSLA's stock price leads fundamental \n\nTSLA will always be hyped to the moon\n\nThere is no way you can buy this company at fair value",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lth4eos/",
              "created": 1729753039,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lteitn9",
      "score": 168,
      "body": "Just another reminder that people bitching on reddit is in no way representative of the real world",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteitn9/",
      "created": 1729716086,
      "depth": 0,
      "replies": [
        {
          "id": "ltek6wa",
          "score": 29,
          "body": "😄. yeah. I see so much negativity on reddit man. people just want to thrash corporations left and right without any rational sometimes. \n\nTesla is polarizing of course, people have strong opinions about it.  \n\nNot a TSLA stock holder",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltek6wa/",
          "created": 1729716493,
          "depth": 1,
          "replies": [
            {
              "id": "ltf40q1",
              "score": 8,
              "body": "Tesla makes cars, cars are essential products, ppl are going to buy whichever one is the best bang for buck. They're like the Toyotas of EVs. I live in Texas. If I was going to boycott every business run by a Nazi I'd have no electricity, heat, groceries or services. \n\n\n\nPpl need to temper their expectations of how buyers can be 100% ethical 100% of the time with all their purchases.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf40q1/",
              "created": 1729722842,
              "depth": 2,
              "replies": [
                {
                  "id": "ltfb3r9",
                  "score": 8,
                  "body": "they are just fcking virtue signaling. These are the same people talking about environment all the time and critiquing companies but eat meat (which is a chunky contributor to pollution)",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfb3r9/",
                  "created": 1729725315,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lteuk5t",
          "score": 42,
          "body": "Just another reminder that the stock market can stay irrational longer than you can remain solvent.\n\nStop letting price movements inform you, thats what suckers do",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteuk5t/",
          "created": 1729719671,
          "depth": 1,
          "replies": [
            {
              "id": "ltf3wmc",
              "score": 7,
              "body": "and this is at the same price it was in 2020, so that doesn't seem like a great investment if we're look at those sorts of metrics.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf3wmc/",
              "created": 1729722802,
              "depth": 2,
              "replies": [
                {
                  "id": "ltf9dc1",
                  "score": 6,
                  "body": "but if instead of the 4 year chart, you look at the 5 year it shows a +1,200% gain, so ig it just depends on those sorts of metrics you want to look at..",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf9dc1/",
                  "created": 1729724706,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltfcbdx",
                      "score": 3,
                      "body": "or your entry point, if you got into bitcoin 10 years ago you'd be at a +18,091.2% gain.\n\nso yea, if you got in early enough into sure you might be doing fine, but since 2020 and learning who elon is and how he manages things seems to keep the price on a downward trajectory.",
                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfcbdx/",
                      "created": 1729725742,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltfzx1n",
                          "score": 3,
                          "body": "This stock ran to an insane valuation way too soon, it's not that the company hasn't delivered since then, it's just that it is taking time to grow into the lofty valuation the stock market assigned it in 2020/2021. The p/e ratio back then was over 1000, it's not Elon or the companies fault that the stock market got so frothy and speculative investors ran the price so high.",
                          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfzx1n/",
                          "created": 1729734131,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltgsdp1",
              "score": 1,
              "body": "You’re actually wrong, price movement is exactly how you should be reading the charts. ",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltgsdp1/",
              "created": 1729746023,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lteza7d",
          "score": 8,
          "body": "Tesla's net income is down 32% y/y through the first three quarters of the year.  Not good.\n\nTheir original guidance was 50% CAGR from 2020 - 2030.  They were above 50% through 2023.  Through 2024, their CAGR looks like it'll be dropping to around 38%.  If they maintain a similar unit sales volume in 2025, it'll drop to 30%.  Not good.\n\nTesla has a forward PE of over 72 right now, which will be even higher tomorrow.  Other OEMs, who have performed far better than Tesla recently, are sitting around forward PEs of 5-7.  Tesla's valuation heavily relies on the idea of constant future growth.\n\nTheir robotaxi event was generally scoffed at.  Not good.\n\nIt was fairly expected they'd beat estimates, and given how shit the stock has been lately, that often leads to a short term pump.  I could see a 61.8% retracement by the end of the month from wherever its high is over the next 1-2 days (probably right around 240, dropping to 222).  Then I imagine it'll pop back up to a lower high around 250-255.  Then, it's likely all down from there, likely back down to around the 160-175 area by beginning of next year... lining up with quarterly sales figures which I don't expect to be spectacular.  Maybe it beats last year, but that isn't saying much when they were previously claiming a 50% CAGR.\n\nWhy this stock is worth so much more than other auto OEMs is probably a question a lot of major investors are asking themselves.  A lot of them were betting on autonomous taxis... but Musk can only claim it's 1-2 years away for so long before they eventually start to wise up.  (10 years... he's been claiming that every year for 10 years straight now)\n\nThe stock's a dog, Meme investors just don't know it yet.  It's been in a long term downward trend, no doubt supported by a core of buy and hold forever insiders and cultists, and of course S&P index funds that will only sell if everyone else does.\n\nHell, GM is outperforming it...\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nImagine where this company would be if they weren't pulling in $10+ billion in government subsidies and regulatory credit sales every year...",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteza7d/",
          "created": 1729721224,
          "depth": 1,
          "replies": [
            {
              "id": "ltgs2be",
              "score": 9,
              "body": "Then buy puts! I bet you won’t. ",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltgs2be/",
              "created": 1729745862,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltf31mx",
              "score": 5,
              "body": "I ain't reading all that. Im happy for you tho or sorry that it happened.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf31mx/",
              "created": 1729722504,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lth4pf0",
              "score": 1,
              "body": ">Tesla's net income is down 32% y/y through the first three quarters of the year. Not good.\n\nWhat a forward thinking guy\n\nLOL",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lth4pf0/",
              "created": 1729753228,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltfjb10",
          "score": 3,
          "body": "FWIW, My next car is not going to be a Tesla. Many people like me in California bought teslas before Elon become the crazy lunatic he is now. For better or worse, he is the face of Tesla and I for one will not finance that.",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfjb10/",
          "created": 1729728209,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltjgm64",
      "score": 8,
      "body": "Up to 20% after open now.\n\nA reminder to everyone that Reddit is an echo chamber that will ALWAYS value polarizing opinions over anything else. Do your own research!",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltjgm64/",
      "created": 1729789088,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltejgv3",
      "score": 132,
      "body": "RIP for the smart people that buy puts due to their \"technical analysis\" (personal bias).",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltejgv3/",
      "created": 1729716278,
      "depth": 0,
      "replies": [
        {
          "id": "lteqybe",
          "score": 14,
          "body": "who needs technical analysis when you have [inverse reddit](https://np.reddit.com/r/stocks/comments/1g6ro6w/is_there_a_gain_that_makes_you_automatically/lsmwgpm/?context=10000)",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteqybe/",
          "created": 1729718532,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltf4zfu",
          "score": 15,
          "body": "Technical analysis. Lmao, the company just keeps firing employees while the revenue goes down. It’s the perfect storm",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf4zfu/",
          "created": 1729723180,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lteqza4",
          "score": 10,
          "body": "RIP to Elon haters too, there are a lot in this sub.",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteqza4/",
          "created": 1729718541,
          "depth": 1,
          "replies": [
            {
              "id": "ltf4ofm",
              "score": 34,
              "body": "TSLA can have a good quarter and Elon can still be a twat.\n\nAlso, let's not get too masturbatory about it, as TSLA is pretty far off its ATH while the rest of the market has gone nutso. We can argue that other car companies haven't done great either, but as we have been reminded 5000 times, TSLA isn't just a car company. And don't get me wrong, I am not betting against TSLA or Elon (except on Twitter... I did do that), but I certainly don't have a boner for how he has acted for a very long time now.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf4ofm/",
              "created": 1729723073,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltesg8x",
              "score": 36,
              "body": "reddit has been consistently wrong about tesla its comical",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltesg8x/",
              "created": 1729718998,
              "depth": 2,
              "replies": [
                {
                  "id": "ltet7h4",
                  "score": 31,
                  "body": "Relax it's still down 6% YTD in a craaaazy bull market",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltet7h4/",
                  "created": 1729719238,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltf3q6j",
                      "score": 11,
                      "body": "during a 3 year bull market, and it's ATH was November 04, 2021",
                      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf3q6j/",
                      "created": 1729722739,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ltey47i",
                  "score": 9,
                  "body": "Really? In what way? That shit is less than half its ATH and still extremely overvalued.   \nUnless you got in more than 4-5 years ago it’s been a terrible investment.",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltey47i/",
                  "created": 1729720832,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ltetjz6",
              "score": 6,
              "body": "Reading the irrational Elon hate is popcorn eating material",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltetjz6/",
              "created": 1729719349,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltesbkd",
      "score": 81,
      "body": "Here for the Reddit meltdown",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltesbkd/",
      "created": 1729718958,
      "depth": 0,
      "replies": [
        {
          "id": "ltghz3t",
          "score": 19,
          "body": "Reddit has been wrong about many things lol\n\nCan’t wait until Election Day",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltghz3t/",
          "created": 1729741073,
          "depth": 1,
          "replies": [
            {
              "id": "lth9bcf",
              "score": 1,
              "body": "It will be glorious.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lth9bcf/",
              "created": 1729756307,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltfguz5",
          "score": 1,
          "body": "I sold my TSLQ the second the EPS number hit. Got in long enough ago I'm still up overall.",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfguz5/",
          "created": 1729727347,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltej559",
      "score": 69,
      "body": "Great quarter, did not expect that, Impressive performance on COGS, Megapack and Tesla energy gross margin, as well as Service/Other. \n\nAlthough reddit will cry and complain.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltej559/",
      "created": 1729716182,
      "depth": 0,
      "replies": [
        {
          "id": "ltemqzn",
          "score": 32,
          "body": "Tesla Energy has been killing it.\n\n30% margins. Maxed out production at their current factory and their new factory will be online soon. Absolutely skyrocketing growth",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltemqzn/",
          "created": 1729717245,
          "depth": 1,
          "replies": [
            {
              "id": "ltenzyk",
              "score": 12,
              "body": "Energy man. 30.5% margin on lower Megapacks sales compared to Q2. \n\nAnd keep in mind, megapack factory China will come online Q1 2025 and China doesn't fuck around with ramping new products.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltenzyk/",
              "created": 1729717620,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lthe78b",
      "score": 6,
      "body": "Volumes is one thing, but I'm mostly impressed by the gross margins considering this is the biggest issue in the market right now. Most car manufacturers are struggling to make any margins while Tesla is increasing their margins while dropping prices. They even managed to get positive margins on the CT while still in the ramp up phase, which is crazy considering the (negative) margins on competitors EV trucks.\n\nIf they can keep this up, they are the only western car manufacturer right now whose able to compete with China on EVs and the volumes/market share will follow.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lthe78b/",
      "created": 1729759617,
      "depth": 0,
      "replies": [
        {
          "id": "ltihxdc",
          "score": 2,
          "body": "Margins are great (especially in the energy sector...30%...that's *massive*!)...Though I expect the margins in the auto sector to come down again next quarter since the boost from the Cybetruck founder series is now over. But if they can hold at around 15% there then that'd perfectly fine for me.",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltihxdc/",
          "created": 1729778465,
          "depth": 1,
          "replies": [
            {
              "id": "ltij4tf",
              "score": 1,
              "body": "The margins on the CT were only just positive, i think most of the margins come from m3/my",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltij4tf/",
              "created": 1729778870,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltegz1y",
      "score": 49,
      "body": "Redditnisngoing to hate this",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltegz1y/",
      "created": 1729715536,
      "depth": 0,
      "replies": [
        {
          "id": "lteqbiq",
          "score": 30,
          "body": "I'm literally hyperventilating right now this cannot happen Tesla can only go down because Tesla bad.",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteqbiq/",
          "created": 1729718335,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lteol58",
      "score": 20,
      "body": "Tesla Battery business seems very healthy so why does Enphase suck so hard?",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteol58/",
      "created": 1729717801,
      "depth": 0,
      "replies": [
        {
          "id": "ltf6kp5",
          "score": 14,
          "body": "How does reddit not understand residential vs utility scale solar yet?",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf6kp5/",
          "created": 1729723732,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lterhbc",
          "score": 2,
          "body": "Declining revenue outside of US because macro",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lterhbc/",
          "created": 1729718696,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltfjri1",
          "score": 1,
          "body": "I bought calls. Everything else about enph is bullshit and had no effect",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfjri1/",
          "created": 1729728373,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lteyz50",
      "score": 32,
      "body": "**Cybertruck is profitable** \n\nHoly fucking Reddit meltdown Batman",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteyz50/",
      "created": 1729721121,
      "depth": 0,
      "replies": [
        {
          "id": "ltfiudg",
          "score": 22,
          "body": "I’ve been seeing more cybertrucks on the streets lately. It’s definitely selling nicely, despite what people here want to believe",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfiudg/",
          "created": 1729728044,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltgtlfe",
          "score": 5,
          "body": "I'm not surprised. It has become a symbol of political and socioeconomic status, which \"fuels\" backlash from traditional ICE vehicle owners. This opposition only reinforces the perception. It will sell like hotcakes until which this perception is no longer.",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltgtlfe/",
          "created": 1729746653,
          "depth": 1,
          "replies": [
            {
              "id": "ltj15t4",
              "score": 4,
              "body": "I mean, at the end of a day its a giant ass truck that smokes sport cars and costs less than a Civic to operate. People want that, especially in the US",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltj15t4/",
              "created": 1729784483,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltgmivn",
      "score": 12,
      "body": "\" Elon is wrecking Tesla \" - much enriched reddit experts....\n\n  \n\"Cybertruck became the third best-selling EV in the U.S. for Q3 \" -> remember when they said cybertruck wouldn't even make it to market?\n\n  \nanother great quarter for the energy business from a business that is \"just a car company\"....",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltgmivn/",
      "created": 1729743141,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltegzcx",
      "score": 39,
      "body": "That's cool. I'm still 12% down on that dog ass stock.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltegzcx/",
      "created": 1729715539,
      "depth": 0,
      "replies": [
        {
          "id": "ltfc26o",
          "score": 4,
          "body": "because you bought at the wrong time. Shouldve bought at ~150$ when all the reddit idiots were sure its going to 50$",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfc26o/",
          "created": 1729725653,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltej7ik",
          "score": 16,
          "body": "Im still up189% but i used to be by over 1000%.. dont know what is worse...",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltej7ik/",
          "created": 1729716202,
          "depth": 1,
          "replies": [
            {
              "id": "ltenp5t",
              "score": 34,
              "body": "Being down 12% is worse.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltenp5t/",
              "created": 1729717530,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltepust",
              "score": 1,
              "body": "Ooof. I bought in December 2023. Only a few thousand dollars but I have it in my head i can't sell for a loss. Like Future Faraday...I lost 93% on that (but only $150 invested) and sitting tight...lmao.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltepust/",
              "created": 1729718191,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltf8kqc",
              "score": 1,
              "body": "I only know up is better than down.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf8kqc/",
              "created": 1729724427,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lteiwm7",
          "score": 5,
          "body": "buying at the top i see!",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteiwm7/",
          "created": 1729716111,
          "depth": 1,
          "replies": [
            {
              "id": "ltejx07",
              "score": 21,
              "body": "If he bought at the top he'd be down like 40%",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltejx07/",
              "created": 1729716412,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lteivqa",
          "score": 4,
          "body": "The only dog here is you for buying when you did.",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteivqa/",
          "created": 1729716104,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltekuwf",
      "score": 53,
      "body": "Just more validation as to why the average redditor spends their life underperforming the market. The amount of clueless and emotional bearish posts I see about Tesla on here every day is astounding. Even in this comment section there’s already people sputtering nonsense about “just wait the stock will still crater. Elon is cooking the books like Enron hur dur.” It’s lunacy at its finest.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltekuwf/",
      "created": 1729716691,
      "depth": 0,
      "replies": [
        {
          "id": "ltet6xd",
          "score": 32,
          "body": "To be fair even with this 6% bump tesla is still down for the year while spy is up 20% for the year",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltet6xd/",
          "created": 1729719233,
          "depth": 1,
          "replies": [
            {
              "id": "ltez3pz",
              "score": 11,
              "body": "This 100%. Elon nutswingers here pretending this is some huge win lol.  \nThis dogshit stock is at half of its ATH and still overvalued. \nThe risk hasn’t been worth the reward since like 2020",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltez3pz/",
              "created": 1729721163,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltf2kuz",
              "score": 6,
              "body": "Fair, though I don’t put much weight in short term price action. I rode meta from $180 in 2019 all the way up and then down to $90 in 2022. 3+ years to MASSIVELY underperform SPY. Literally down 50% while SPY was up 20%. But then the past 2 years it’s been a top performer and I’m back up 200%+ since buying in while SPY is up 90%. \n\nPoint being that the best time to buy Meta was when it was down and they were going through struggles. Same with Netflix. Same with Amazon. Same with Palantir. Same with Crowdstrike earlier this year. It’s literally just the same thing over and over again. Buy financially sound companies when they’re down and you will do well. Google is going through it right now and is an obvious buy. Tesla will likely be the same, but people hate Elon enough that they’d rather stick their head in the sand than look at the numbers to acknowledge it.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf2kuz/",
              "created": 1729722343,
              "depth": 2,
              "replies": [
                {
                  "id": "ltf6ozh",
                  "score": 11,
                  "body": "You were previously using the price movement of a single day as validation yet now you are dismissing the price movement over the course of a year because it is too short term. Cognitive bias?\n\nAll of your examples had pe ratios less than 20 during their crashes. Tesla is at 60 right now.\n\nIt is not the same thing over and over. Cisco, blackberry, and IBM were all financially sound yet their stock prices never recovered.",
                  "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf6ozh/",
                  "created": 1729723772,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ltg8i8y",
              "score": 1,
              "body": "Shhhh... let him have his moment lol.",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltg8i8y/",
              "created": 1729737247,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltj88x0",
              "score": 1,
              "body": "Now zoom out lmao",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltj88x0/",
              "created": 1729786602,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltgic87",
          "score": 6,
          "body": "The average Redditor lives in an echo chamber. Elon bad Gates good. Trump bad Kamala good. Do not have two perspectives and always follow the herd mentality.",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltgic87/",
          "created": 1729741234,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lten5m1",
          "score": 10,
          "body": "Lmao probably coping due to their poor ESG fund performance.",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lten5m1/",
          "created": 1729717367,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltfbenz",
          "score": 1,
          "body": "Everyone should have a bear and bull thesis on a stock they buy. Right now my bear thesis is even though tons of growth is already baked into earnings there are institutions dollar cost averaging and people buying the stock off good news to sell option contracts to people gamboling trump wins the election hoping his connections with Elon will allow for forced scalability backed by government money. If I start seeing a massive influx of option trading in the next several months I'm going to think this bump is temporary and that a new ramp rugpull cycle is here.",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfbenz/",
          "created": 1729725423,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltg9thp",
      "score": 6,
      "body": "Tesla bears are so mad rn they feel the need to post paragraphs about why it’s a bad stock",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltg9thp/",
      "created": 1729737742,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltke15e",
      "score": 3,
      "body": "Just shows people here don't know shit lmao",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltke15e/",
      "created": 1729799029,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltgeb6j",
      "score": 6,
      "body": "Inverse Reddit! Never bet against Tesla",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltgeb6j/",
      "created": 1729739518,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltff2h5",
      "score": 15,
      "body": "Tesla stock up 12% in the after hours\n\nFinancial illiterate, 1st world Communists from reddit got it wrong again (as always)",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltff2h5/",
      "created": 1729726712,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltemmnb",
      "score": 14,
      "body": "Where is that clown that went full port on puts LMAO!",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltemmnb/",
      "created": 1729717210,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltepwfm",
      "score": 12,
      "body": "10% margins with a 90 FWD PE",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltepwfm/",
      "created": 1729718205,
      "depth": 0,
      "replies": [
        {
          "id": "ltetgkb",
          "score": 10,
          "body": "But Dan Ives told me that this is considered ‘undervalued’…",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltetgkb/",
          "created": 1729719317,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltgynnp",
          "score": 1,
          "body": "70 FWD P/E according to Yahoo Finance, but here's the thing... that's based on a collection of analyst estimates and we know that those are trash. So why would you depend on that number?\n\nTrailing P/E is 60 and they will be growing next year and the following year and have a sizable command of the BEV market, which will grow to overtake most of the automotive market.",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltgynnp/",
          "created": 1729749488,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltf7lsc",
      "score": 7,
      "body": "This is going to be such a great post to come back to in 5 years",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf7lsc/",
      "created": 1729724091,
      "depth": 0,
      "replies": [
        {
          "id": "ltge8uv",
          "score": 4,
          "body": "Yep, when we’re at $1000+ with robotaxis everywhere and Optimus being ramped",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltge8uv/",
          "created": 1729739492,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltfq9u9",
          "score": 1,
          "body": "RemindMe! 5 years",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfq9u9/",
          "created": 1729730677,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltk2tmk",
      "score": 2,
      "body": "Tesla's growth is impressive, especially in diversifying revenue streams like energy storage. For any eCommerce ventures looking to keep pace with such dynamic markets, tools like Intelis could be a game-changer in optimizing your pricing strategy on platforms like Google Shopping. Success in these sectors often comes down to smart pricing decisions, and every edge counts!",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltk2tmk/",
      "created": 1729795670,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lteuqou",
      "score": 7,
      "body": "If you look at the investors slides.... A lot of the increase came from operational income (aka software accessory sales). \n\nThis came from the foundation edition CyberTrucks. Since the 20k mark up is counted as operational income.\n\nNow that they are transitioning from Foundation Editions to normal Editions of the Cybertruck...this is going to completely evaporate in Q4...\n\nSo.... Watch out for Guidance during the Earnings Call....",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteuqou/",
      "created": 1729719728,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltf3nd3",
      "score": 3,
      "body": "I made a decision long ago to stay away from trying to play this stock long or short and I feel really good about it.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf3nd3/",
      "created": 1729722713,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lteq7bf",
      "score": 8,
      "body": "Happy shareholder here\n\nWas totally expecting a dumpster fire of a quarter, so to see the exact opposite is great. \n\nThis is also why I don't try to time stocks lol, just buy good shit and hold on through the ups and downs",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lteq7bf/",
      "created": 1729718299,
      "depth": 0,
      "replies": [
        {
          "id": "ltfhfw4",
          "score": 3,
          "body": "Exactly TSLA is not for nervous people. If you can take a long term view, though...",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfhfw4/",
          "created": 1729727550,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltf725s",
      "score": 9,
      "body": "All the Elon haters here have told repeatedly multiple times to not let personal politics affect your investment judgement and now we're seeing a meltdown of all these alt-left redditors who bet the farm on puts blowing up their portfolio.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf725s/",
      "created": 1729723901,
      "depth": 0,
      "replies": [
        {
          "id": "ltfc1dv",
          "score": 4,
          "body": "Except their sales are down Q4 will be even worse.",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfc1dv/",
          "created": 1729725646,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltf1imi",
      "score": 3,
      "body": "Bought 50 shares today morning 🥳🥳",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf1imi/",
      "created": 1729721982,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltf9o8t",
      "score": 3,
      "body": "Wtf this is a surprise. Pretty shit earnings still excluding credit. Still went up like crazy",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf9o8t/",
      "created": 1729724813,
      "depth": 0,
      "replies": [
        {
          "id": "ltfdmw9",
          "score": 12,
          "body": "Why would you exclude credits? I mean it’s a product for them. \n\n52% energy growth YoY\n\n“Other” revenue now makes up 20% of their revenue. That’s not insignificant",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfdmw9/",
          "created": 1729726204,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltein4e",
      "score": 2,
      "body": "The guy who counted Elon’s tweets was right",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltein4e/",
      "created": 1729716031,
      "depth": 0,
      "replies": [
        {
          "id": "ltem3bo",
          "score": 1,
          "body": "Did he tweet a lot today?",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltem3bo/",
          "created": 1729717051,
          "depth": 1,
          "replies": [
            {
              "id": "ltepd4c",
              "score": 2,
              "body": "Over 15 times according to some redditor",
              "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltepd4c/",
              "created": 1729718039,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltev8tp",
      "score": 2,
      "body": "Will I be shocked if the stock goes down tomorrow? Can't say 🤣 but holding my puts a little longer.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltev8tp/",
      "created": 1729719891,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lti5o06",
      "score": 2,
      "body": "Not a single analysis on Elons tweets, poor explanation.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lti5o06/",
      "created": 1729774070,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltffxzm",
      "score": 1,
      "body": "Tesla down 4% year to date VOO up 22%. Think about that...",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltffxzm/",
      "created": 1729727021,
      "depth": 0,
      "replies": [
        {
          "id": "ltgijs5",
          "score": 5,
          "body": " Now go back 10 years?\n\nTell me the numbers now",
          "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltgijs5/",
          "created": 1729741326,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltfrefu",
      "score": 2,
      "body": "my calls will pay and that means more donations to Kamala Harris when I sell tomorrow. holding 350 calls. amazing. I don't like Elon but still makes money off him. same with DJT. Harris 2024.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfrefu/",
      "created": 1729731072,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltgteez",
      "score": 2,
      "body": "They used to love Elon til he got political. This being a left leaning social platform, all the hate makes sense.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltgteez/",
      "created": 1729746551,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltedxsl",
      "score": 3,
      "body": "**rubbing nipples**\n\nUpdate: up 18%, my girl letting me rub her nipples now too",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltedxsl/",
      "created": 1729714644,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltf2vm2",
      "score": 1,
      "body": "Sounds like Tesla is doing very well despite Reddit sentiment/bots saying otherwise. This has been the same story since 2015. Media says Tesla is struggling....they kept improving.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf2vm2/",
      "created": 1729722446,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltf1i0s",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltf1i0s/",
      "created": 1729721976,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltfhbm7",
      "score": 1,
      "body": "All that writing and not a single word about all their corn. They got a shit load of corn.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltfhbm7/",
      "created": 1729727509,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltgugbd",
      "score": 1,
      "body": "Why doesn’t Schwab go up/down after hours the way TD Ameritrade did?",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/ltgugbd/",
      "created": 1729747112,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lthrn81",
      "score": 1,
      "body": "This align with the recent lithium stock raise, overall, it's been a good year for me🍾.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lthrn81/",
      "created": 1729767847,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lthtsud",
      "score": 1,
      "body": "Tesla's strong Q3 earnings, margin improvements, and energy business growth highlight its long-term potential amid macroeconomic challenges.",
      "permalink": "/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/lthtsud/",
      "created": 1729768931,
      "depth": 0,
      "replies": []
    }
  ]
}