{
  "title": "Cool Stock Gift Ideas For A 16 Year Old Boy",
  "score": 59,
  "selftext": "My son is turning 16 and he's interested in investing.  I'd love to hear some ideas of stocks I could buy him for his 16th birthday...preferably stocks he'd be interested in (he likes sports, cars, sneakers, tech, gaming).\n\nThanks in advance!",
  "link_flair_text": "Advice Request",
  "id": "1gb2jiw",
  "num_comments": 60,
  "created_utc": 1729776242,
  "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/",
  "comments": [
    {
      "id": "ltithki",
      "score": 100,
      "body": "Let him decide honestly, when I was 16 my grandpa let me take the 700$ he had in a “trust” for me, I played around, bought some Boeing because war planes, and some take two interactive, since then I’ve turned my 700$ into 8grand, it’s been 3 years. Sometimes younger people are more aware of things that older people might not be privy too, I say let him make the decisions himself and if he makes a mistake he’ll learn from it, I don’t think it’s a good idea to let him into the market with only “winning” stocks, let him decide, let him win or loose, he’s young and now is the perfect time to learn the market for himself.",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltithki/",
      "created": 1729782147,
      "depth": 0,
      "replies": [
        {
          "id": "ltiu9om",
          "score": 43,
          "body": "Amazing!  I decided to take your advice and the advice of a previous comment and open him a fidelity teen account.  Fantastic job investing!!!!!",
          "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltiu9om/",
          "created": 1729782392,
          "depth": 1,
          "replies": [
            {
              "id": "ltiuk03",
              "score": 13,
              "body": "Just make sure he knows about capital gains! lol",
              "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltiuk03/",
              "created": 1729782480,
              "depth": 2,
              "replies": [
                {
                  "id": "ltj683a",
                  "score": 11,
                  "body": "If it’s a custodial account, the parent/custodian pays the taxes on trades until the child turns 18. Done this for 3 kids, the 4th turns 18 next year.",
                  "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltj683a/",
                  "created": 1729785991,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltj6zz1",
                      "score": 4,
                      "body": "Also first $2500 or so is tax-free",
                      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltj6zz1/",
                      "created": 1729786227,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltohf7y",
              "score": 2,
              "body": "Rocketlab stocks. Because rockets",
              "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltohf7y/",
              "created": 1729862629,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltke2ai",
          "score": 6,
          "body": "BS, 11 bagger on BA and TTWO lol",
          "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltke2ai/",
          "created": 1729799038,
          "depth": 1,
          "replies": [
            {
              "id": "ltkvju1",
              "score": 1,
              "body": "Your right it wasn’t just them two, i actually sold out of Boeing as soon as it hit around 200$, and ttwo, sold out around 200$ as well, both bought during the Covid crash, since then I’ve been vested in GATO bought around 3$ a share and I’m sitting pretty and am getting ready to diversify more",
              "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltkvju1/",
              "created": 1729804306,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltidezt",
      "score": 48,
      "body": "msft - microsoft owns minecraft // Take-Two Interactive (2k,gta,civ) // atvi( activision blizzard) althourgh they suck // man utd stock (pretty bad too ) // mcd (every kid knows mcdonald) // TKO Group Holdings (ufc + wwe or something) // disney //netflix .    im not saying these are \"good\" stocks to buy, but cool names.",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltidezt/",
      "created": 1729776923,
      "depth": 0,
      "replies": [
        {
          "id": "ltiteg2",
          "score": 18,
          "body": "ATVI is Microsoft",
          "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltiteg2/",
          "created": 1729782120,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltk11b0",
          "score": 6,
          "body": "I did this with my kids, but it didn't go so well. They didn't like it when they lost.\n\nWhatever you buy, get a little S&P 500 (VOO on Vanguard). You can buy fractional amounts of mutual funds on Vanguard which means you can spend any amount. It will be instructive for them to see how their individual stocks do compared with VOO.",
          "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltk11b0/",
          "created": 1729795133,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltim15j",
      "score": 25,
      "body": "I think a more fun evolution would be to go to fidelity.com and create an account and then create a youth investing account and put x amount of dollars in it and then on his birthday tell him to download the Fidelity app and give him the username and password and when he logs in he sees that he has x number of dollars to play around with and learn how to invest \n\nI did this with my daughter when she was 17 and gave her ideas every month (usually to buy index ETFs like s&p 500 ticker voo or a total market index like ticker VTI)\n\nWhen she turned 18 I turned the account over to her officially we helped her to start with $1, 075 at her eighteenth birthday and now she's not even 19 yet and she's already built her account up to $1,430 just checking it once a week and reinvesting your dividends\n\nIt's not about giving them a couple of stocks they can feel good about it's about giving them the tools to learn the process so they can build a lifetime of wealth Or at least not feel scared of the stock market and the idea of investing platform because they had at least some experience doing it while they were still young and we didn't have their own money at risk \n\n\nIf you can convince them to keep about 85 to 90% of their available funds in index funds like vti and VOO.... Then they can afford to play around with individual stocks with the extra 10% or they can see how good voo and vti do And realize very quickly it's easier to just keep buying index funds and never have to bother with individual stocks \n\nPs if you like this idea and need more information or have questions feel free to respond here or just hit me in the DMS and I will explain it more but it's super easy probably take you 20 minutes or so and whatever initial amount of money you want to get and you got to hook up your bank account to transfer the funds to your Fidelity account \n\nI also started a deal with my daughter that every time she got an A on her report card I would put x amount of dollars in her account and every time she got aBI would put half that and if she got low grades then I didn't put any extra in her account \n\nAnd now she works at Victoria's secret and she's putting her own money in her account",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltim15j/",
      "created": 1729779814,
      "depth": 0,
      "replies": [
        {
          "id": "ltipye4",
          "score": 6,
          "body": "I actually LOVE this idea!",
          "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltipye4/",
          "created": 1729781064,
          "depth": 1,
          "replies": [
            {
              "id": "ltiu4k8",
              "score": 1,
              "body": "Coolest part is - if you also have the fidelity account you can log in anytime and see how he's doing. \n\nOnly minor risk is - if he makes a lot of great choices and makes big profit you may owe taxes on it. (But depending on your own income - your taxes on $100 gain might be $20 or $24 it not going to be huge unless he does incredible gains like a miracle )",
              "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltiu4k8/",
              "created": 1729782347,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltif26h",
      "score": 16,
      "body": "Just spitballing:\n\nCars: Ferrari or Tesla would both be fun companies to boast about owning, or buy whatever car brand stock he likes (ford, GM, bmw, etc).\n\nGaming: the console makers like Nintendo, Sony, and Microsoft are all publicly traded. Actual game makers like Ubisoft or EA (who make all the popular sports games) are easy options. Maybe amd or Nvidia if he’s a kid who’s built his own pc.\n\nSports/sneakers: Nike or adidas. Callaway golf maybe if that’s his sport?\n\nTech: just any FAANG name",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltif26h/",
      "created": 1729777496,
      "depth": 0,
      "replies": [
        {
          "id": "ltj4odg",
          "score": 11,
          "body": "Have I heard \"options\"? Perfect gift!!!",
          "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltj4odg/",
          "created": 1729785524,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltj94ev",
          "score": 4,
          "body": "He needs to buy lope stock if he likes sports ",
          "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltj94ev/",
          "created": 1729786868,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltkn535",
          "score": 1,
          "body": "My kid bought banking and GE. The bank stock doubled in like 5 years, but GE did poorly. Now she likes VOO.",
          "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltkn535/",
          "created": 1729801752,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltm0fgn",
      "score": 3,
      "body": "For sports BATRK is good (if baseball is a sport he likes). It is Atlanta Braves stock, which until fairly recently was just a tracking stock but now is legitimately owning a piece of a major sports franchise. It definitely is not overvalued with a market cap just below what the estimated sale price would be if the team were for sale. There are a couple of other teams on the market or nearly so and if their sales go well the current estimated sale price for the team is likely to go up.",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltm0fgn/",
      "created": 1729818609,
      "depth": 0,
      "replies": [
        {
          "id": "ltpkbyc",
          "score": 3,
          "body": "He's actually a baseball player AND we live right outside of Atlanta.  Thank you for this!!!!",
          "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltpkbyc/",
          "created": 1729874960,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltikb0g",
      "score": 2,
      "body": "Adidas, Nike, On Running, Chipotle, McDonalds",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltikb0g/",
      "created": 1729779256,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltlr6bv",
      "score": 2,
      "body": "Quantum computing stocks. They’re years away from being profitable, but they’re gonna be at least somewhat relevant someday. There’s 2 companies , Rigetti (Rgti) and D-Wave ( qbts ) . They’re both around $1 per share . He might like that",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltlr6bv/",
      "created": 1729815244,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltltfco",
      "score": 2,
      "body": "Disney used to have a program that offered small number of shares on beautiful, frame worthy, certificates to give as gifts to kids.  Your son may be past the Disney stage though.",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltltfco/",
      "created": 1729816060,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltly1co",
      "score": 2,
      "body": "If he likes sports: Nike?\n\nIf you are thinking cars or tech: Tesla? Nvidia?\n\nPerhaps a ETF like VGT or FTEC will be better since it's a pool of stocks instead.",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltly1co/",
      "created": 1729817739,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltiiumx",
      "score": 2,
      "body": "Should maybe get him to pick 5 he likes and buy 1-5 of each and you can both watch as they grow over a year. Would help he understand the market early too",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltiiumx/",
      "created": 1729778775,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltm4ymj",
      "score": 1,
      "body": "RACE for car interest, CAVA for food interest.",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltm4ymj/",
      "created": 1729820268,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltmvpky",
      "score": 1,
      "body": "$AAPL will be on discount this Monday afternoon\n\nTry aiming for a price under $225",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltmvpky/",
      "created": 1729831215,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltyf51c",
      "score": 1,
      "body": "Buy him investing books \n\nThe intelligent investor \n\nThe essays of Warren Buffett",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltyf51c/",
      "created": 1729999033,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luf9bgs",
      "score": 1,
      "body": "Gsat 1.13 $\n\nGlobalstar is planning to launch up to eight satellites in 2025 to replenish its Low-Earth Orbit (LEO) constellation. The satellites will be launched by SpaceX and are intended to support Apple’s satellite emergency messaging service.\n\nHere are some details about the launch: Contract: Globalstar contracted SpaceX to launch the satellites for $64 million.\n\nSatellites: The satellites are being built by MDA, a Canadian manufacturer, and Rocket Lab is supplying the satellite bus.\n\nFunding: Apple is paying for 95% of the launch and manufacturing costs, and is also lending Globalstar $252 million.\n\nLaunch window: Globalstar aims to deploy the satellites before the end of 2025.\n\nLaunch failure: Globalstar plans to launch additional satellites within months of a launch failure to maintain service quality and safety\n\nGlobalstar’s constellation will consist of 48 LEO satellites, with four spares in orbit. The system’s software is located on the ground, which makes it easier to maintain and upgrade.",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/luf9bgs/",
      "created": 1730239548,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltivcdc",
      "score": 1,
      "body": "I bought my first stock when I was 16… I worked that summer and poured everything I made into Tesla and physical gold…. \n\nMy friends bought ps3 and games. I got what I wanted.\n\nWhat I’m trying to say is…. Get what the boy wants, don’t buy things for him that you want",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltivcdc/",
      "created": 1729782721,
      "depth": 0,
      "replies": [
        {
          "id": "ltixtj3",
          "score": 1,
          "body": "Honestly, he wants for nothing. He has all the gaming systems, a car, too many shoes.  \n\nHe's always been interested in stock trading.  He's even looked into what it entails as a possible career.  I'm just looking for a way to get him started in an age appropriate and fun way.",
          "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltixtj3/",
          "created": 1729783477,
          "depth": 1,
          "replies": [
            {
              "id": "ltiy8mr",
              "score": 0,
              "body": "I hear Ubisoft’s making some good games. Maybe get grandma in on it too….\n\nIf he likes stock trading, make a game of it. Get him to pick some stocks and if it does well in xx days, give him money/prize accordingly. \n\nThat’s how I learned about stocks, been doing mock trade since 14",
              "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltiy8mr/",
              "created": 1729783606,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltiyh1f",
      "score": 1,
      "body": "QQQ for the boy",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltiyh1f/",
      "created": 1729783675,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjks7k",
      "score": 1,
      "body": "Tell him to look into the companies of products he loves! For sports/sneakers maybe Nike/Addida’s. Cars, all be it a boring car, Tesla would be a smart shout - with pushes for all new vehicles to be electric vehicles by 2035, investing into companies dominating the EV market would be a smart idea (Tesla also does alot more than make cars). In terms of Tech, Nvidia would be a good one to look into, especially if he is also interesting in PC gaming. Hope he does well with whatever he choses!",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltjks7k/",
      "created": 1729790325,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltid1hf",
      "score": 0,
      "body": "Gambling stocks are always prone to exploding in a recession.",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltid1hf/",
      "created": 1729776791,
      "depth": 0,
      "replies": [
        {
          "id": "ltipevi",
          "score": 1,
          "body": "No they don’t, increases in both luck based and skill based gambling are positively correlated with consumer index scores.",
          "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltipevi/",
          "created": 1729780894,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltinu32",
      "score": 0,
      "body": "I'd go for Microsoft (gaming), Tesla (cars), McDonald's (food) and Nike/Adidas or ON Running (shoes). And maybe Alphabet if he's a YouTube-fan.",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltinu32/",
      "created": 1729780395,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lticnvn",
      "score": -4,
      "body": "DDI - South Korean gambling app\n\nDKNG - sports betting\n\nPLBY - …..\n\nPG: who doesn’t love pg",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/lticnvn/",
      "created": 1729776656,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltidvy8",
      "score": -4,
      "body": "I guess you could go with MSFT, any automotive stock (Ferrari, Tesla, just whatever brand he likes).\n\nbut you should really just get him and index fund. It’s boring but it makes money",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltidvy8/",
      "created": 1729777089,
      "depth": 0,
      "replies": [
        {
          "id": "ltifiep",
          "score": 9,
          "body": "My favourite presents when I was 16 were always prefaced with “it’s boring but”",
          "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltifiep/",
          "created": 1729777651,
          "depth": 1,
          "replies": [
            {
              "id": "ltiicuu",
              "score": 4,
              "body": "Username checks out.",
              "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltiicuu/",
              "created": 1729778610,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltin0wm",
      "score": 0,
      "body": "When will he assume control over the stocks? The answer matters for what I think will make for a “cool” gift",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltin0wm/",
      "created": 1729780133,
      "depth": 0,
      "replies": [
        {
          "id": "ltip7xs",
          "score": 1,
          "body": "I don't think he'd assume control until his 18th birthday.",
          "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltip7xs/",
          "created": 1729780835,
          "depth": 1,
          "replies": [
            {
              "id": "ltips05",
              "score": 0,
              "body": "Why get him a gift he can't use for 2 years? This seems more fun for you than it is for him",
              "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltips05/",
              "created": 1729781009,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltiyvg3",
      "score": 0,
      "body": "VT probably.  Why buy an individual stock when he should just buy etf and buy and hold forever, you'd be giving him bad habits at a young age.",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltiyvg3/",
      "created": 1729783796,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltj5btx",
      "score": 0,
      "body": "What about Victoria's Secret $VSCO ?",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltj5btx/",
      "created": 1729785720,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltj9agz",
      "score": 0,
      "body": "Nike stock , Tesla stock , GameStop stock just for the meme lol. ",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltj9agz/",
      "created": 1729786919,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjdmgq",
      "score": 0,
      "body": "Are you thinking a Brokerage account or an IRA?",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltjdmgq/",
      "created": 1729788210,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjls0o",
      "score": 0,
      "body": "Birk. It even has stock in its name, cannot go tits up.",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltjls0o/",
      "created": 1729790618,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltigzv3",
      "score": -5,
      "body": "Maybe some bitcoin and some Tesla",
      "permalink": "/r/stocks/comments/1gb2jiw/cool_stock_gift_ideas_for_a_16_year_old_boy/ltigzv3/",
      "created": 1729778155,
      "depth": 0,
      "replies": []
    }
  ]
}