{
  "title": "Explain how Fiverr exists in a world with AI agents",
  "score": 1152,
  "selftext": "I’ve been thinking on it, and there’s no way a company that is based on hiring freelancers to do coding (and steal IPs) can stay at their current valuations when AI agents become main stream. I mean, I made a Reddit scanner to look for certain keywords in comments on posts in an hour, works perfectly. It’s like 250 lines of code, and it was free. I have zero coding experience.\n\nSomeone explain why I shouldn’t go all in on puts against them and low-level development companies like Appian. Because to me, they seems like the next Chegg.\n\nFor context, I’ve already purchased some deep OTM puts a year or so out on Fiverr, Appian, and a couple consulting companies.\n\nEdit: Because a lot of people don’t seem to know what release I’m taking about, or know its abilities, you can watch and read more [here](https://m.youtube.com/watch?v=ODaHJzOyVCQ&embeds_referring_euri=https%3A%2F%2Fcointelegraph.com%2F&source_ve_path=MjM4NTE). \nYou can basically share your screen with the AI, allowing it to click around for you if you are using their API. Meaning that code that it wrote? It can put it into action, your average consumer doesn’t need to know how to do that anymore. Now picture this in 6 months to a year, given how much we’ve moved forward in that same time period. \n\nTL;DR: Fiverr, Appian, SaaS companies are going to lose revenue.\n\n\nEdit 2: Since I’ve got you all here: The [White House](https://www.whitehouse.gov/briefing-room/presidential-actions/2024/10/24/memorandum-on-advancing-the-united-states-leadership-in-artificial-intelligence-harnessing-artificial-intelligence-to-fulfill-national-security-objectives-and-fostering-the-safety-security/) just put out a statement that they’re going all in on AI too, which I think is pretty neat\n\nEdit 3: Okay, thank you all. Maybe Fiverr as of 10/24/2024 isn’t the play, but it will be some day ",
  "link_flair_text": "Discussion",
  "id": "1gb5c9e",
  "num_comments": 473,
  "created_utc": 1729783662,
  "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/",
  "comments": [
    {
      "id": "ltiyfyt",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 463 | **Previous Best DD** | \n**Account Age** | 11 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltiyfyt/",
      "created": 1729783667,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltiyyfv",
      "score": 447,
      "body": "Because Fiverr is not based on hiring freelancers to do coding. There are many verticals on there, and many are far from being replicable with AI.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltiyyfv/",
      "created": 1729783820,
      "depth": 0,
      "replies": [
        {
          "id": "ltk9mmv",
          "score": 78,
          "body": "Also, AI might exist but only very small number of ppl actually know how to use it as a tool. Most of the time you have to manually modify what it produces,",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltk9mmv/",
          "created": 1729797709,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltmmyaq",
          "score": 1,
          "body": "Curious, can you share a few use cases that are \"far from being replica le with AI\"?",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmmyaq/",
          "created": 1729827148,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltj3iua",
      "score": 316,
      "body": "My bosses can’t open .pdfs, so I think they will pay freelancers to “do ai” for them.\n\nI think you greatly underestimate just how out of touch rich middle management is.\n\nJust like there are people running “social media” by watching Twitter pages and making Facebook posts.  Yes it’s insane, but there they are anyway.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj3iua/",
      "created": 1729785181,
      "depth": 0,
      "replies": [
        {
          "id": "ltk2b65",
          "score": 35,
          "body": "So, true. So many middle managers nowadays have admin assistants that do most of their work. These managers just sit in meetings and blah blah and blah. When it comes to getting some work done; oh, please send it to Suzy the admin assistant. When upper management questions why they need admin assistants; they would say, oh, too much work, need some help.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltk2b65/",
          "created": 1729795517,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltl2u92",
          "score": 1,
          "body": "yes but these types of services can all be consolidated. Instead of a bunch of tech savvy freelancers scamming the client, a single platform can provide those services as an all in one tailored service.\n\nDentsu Japan(massive Japanese ad company) for example is now offering clients 50% discount if they use AI for their campaigns, once it's becomes common place they'll just reduce their workforce.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltl2u92/",
          "created": 1729806653,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltoa5pm",
          "score": 1,
          "body": "> I think you greatly underestimate just how out of touch rich middle management is.\n\nThis. And middle management works with the funding/CAPEX committees, knows their processes and controls.\n\nThey will happily burn $1M of the shareholders' money to hit their $35k bonus.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltoa5pm/",
          "created": 1729859902,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltiypea",
      "score": 666,
      "body": "- _\"I was afraid AI would take my job, until I remembered how my clients communicate their requirements\"_\n\nThe general public's ability to communicate what they want/need is abysmal. A human needs to talk/explain/negotiate/clarify things before giving a very simple prompt to any AI. \n\nEven my own job as Software Engineer, writing the code isn't even 50% of the job. I spend most of my time in meetings & design docs trying to figure out what everyone `ACTUALLY` wants.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltiypea/",
      "created": 1729783745,
      "depth": 0,
      "replies": [
        {
          "id": "ltiyyap",
          "score": 132,
          "body": "lol here is your answer.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltiyyap/",
          "created": 1729783819,
          "depth": 1,
          "replies": [
            {
              "id": "ltj7u93",
              "score": 90,
              "body": "Typing shit into GPT is just a higher level programming language...\n\nDid people really expect Python to be the most accessible programming was ever gonna get for the rest of time?\n\nIts like if in the 60s someone was like \"what is this BASIC?! Roll that shit BACK \"But muh job putting holes in punch cards!\"",
              "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj7u93/",
              "created": 1729786479,
              "depth": 2,
              "replies": [
                {
                  "id": "ltks5fz",
                  "score": 15,
                  "body": "but chatGPT is NOT going to wipe out coding as a profession, not yet anyway. \n\nits more of a high level coding assistant if anything. it can be extremely powerful in the hands of an intelligent software engineer, but my mom, who has little to no computer skill apart from microsoft word, is not about to just starting coding up shit.\n\nyou still need a decent analytical mind to take what chatgpt produces and manually modify certain aspects as well as provide good enough prompts for chatgpt itself to modify it to your liking, to make it all work",
                  "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltks5fz/",
                  "created": 1729803260,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltmmaw8",
                      "score": 2,
                      "body": "AaA",
                      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmmaw8/",
                      "created": 1729826870,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltmowec",
                          "score": 3,
                          "body": "I think your bot just broke.",
                          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmowec/",
                          "created": 1729827994,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ltlo9lv",
                      "score": 3,
                      "body": "Maybe not your mom but it does open up basic scripting and programming to people who can't program.",
                      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltlo9lv/",
                      "created": 1729814192,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltmua7f",
                          "score": 2,
                          "body": "This, im a very good complex problem solver and critical thinker but never could take the time to learn coding nor the want mostly, but with ai it not only expediates the coding to a non boring way but it also helps a ton to be able to use these problem solving skills and translate them to prompts etc",
                          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmua7f/",
                          "created": 1729830510,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ltoa54x",
                          "score": 2,
                          "body": "That's just the thing - most coding jobs veer far from basic scripting / programming.",
                          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltoa54x/",
                          "created": 1729859896,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltk931k",
              "score": 8,
              "body": "Not just that but you also have to put the time in. Everyone has ideas. Few people execute on these ideas. I was worried for a split second until I realized oh yeah, everyone I’ve talked to who “wishes they could do that” has never taken the time to follow my basic advice on how to do that. \n\nI’ve had coworkers in other areas of the business ask how to join my team. I offer them time out of my day to sit down with them and introduce them to Linux/code/Plex/Llama. None of them take me up on it. \n\nThey’re not going to take advantage of AI agents just like they never took advantage of me trying to help them. Realistically what is going to happen is that the people providing services now, will utilize this technology to continue providing services. \n\nAre YOU running Llama at home? No? Why not? There’s your answer. People are lazy.",
              "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltk931k/",
              "created": 1729797546,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltj4mof",
          "score": 52,
          "body": "Man I wanna go work there. My software engineer gig is 90% meetings and documentation",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj4mof/",
          "created": 1729785510,
          "depth": 1,
          "replies": [
            {
              "id": "ltj75vl",
              "score": 39,
              "body": "You should be thankful that it is. If you were just hired to be a code monkey you would’ve been laid off a while ago",
              "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj75vl/",
              "created": 1729786277,
              "depth": 2,
              "replies": [
                {
                  "id": "ltjaxel",
                  "score": 14,
                  "body": "I agree with this. I was an EM in my last job and now run my own company. And every time an engineer complains about needing to meet with the stakeholders to clarify requirements, I remind them that the value is not in coding. They didn’t like it very much. Typically engineering ego doesn’t see the need for “business stuff” and “management bullcrap” until it’s too late for them to realize that the coding is actually the easy part and their job went to AI or whatever low cost country.",
                  "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjaxel/",
                  "created": 1729787412,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltjfhay",
                      "score": 14,
                      "body": "Before AI there was Actually Indian and everytime companies try to offshore engineers quality dips a lot due to this",
                      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjfhay/",
                      "created": 1729788757,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltjiphh",
                          "score": 2,
                          "body": "There have been several \"AI\" companies that were Actually Indians, like Amazon's Just Walk Out tech.",
                          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjiphh/",
                          "created": 1729789708,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ltjxrhm",
                          "score": 2,
                          "body": "I agree quality is dogshit when outsourced most of the time but also exposes really bad requirements and specs too. And testing. Of course, many companies outsource all of those too, so you get dogshit work end to end far removed from stakeholders- and execs look at you like it’s your fault!",
                          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjxrhm/",
                          "created": 1729794154,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ltjs7x3",
                      "score": 2,
                      "body": "that's tech lead/architect work, not coder work. pay me tech lead salary if you want me to decipher what people making 5x my salary want.",
                      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjs7x3/",
                      "created": 1729792509,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ltjrn14",
                  "score": 4,
                  "body": "lmao yeah AI has probably \"replaced\" as many coders as the back to office push did. AI in current state is still at most a timesaver for coding, and not like \"I can do 2 peoples work\", more like \"I can spend 20 minutes less per day writing code\".",
                  "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjrn14/",
                  "created": 1729792339,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ltjh24q",
          "score": 14,
          "body": "the problem with AI written software is that the customer will get what they asked for. still it's not outside the bounds of possibility that AIs could build up enough domain specific knowledge to seriously threaten my job before i retire. hope not. it's out of my hands",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjh24q/",
          "created": 1729789216,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltjnal7",
          "score": 11,
          "body": ">writing the code isn't even 50% of the job\n\nYou forgot to mention architecture, cloud configuration, security, debugging, unit tests, researching new libraries, etc.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjnal7/",
          "created": 1729791064,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltj8k3e",
          "score": 9,
          "body": "Ha if I had a dollar every time I read the business requirements and went “ that ain’t right” I probably won’t  have to be in a his sub.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj8k3e/",
          "created": 1729786695,
          "depth": 1,
          "replies": [
            {
              "id": "ltk9w5p",
              "score": 7,
              "body": "Dude, all we do at the company that I work for is make a web app to help admin type people wrangle a bunch of users, get them to fill out some forms, and then gather and submit those forms. I mean there are other, less important features, but forms are like 85% of it. Should be dead simple. But they're constantly finding horrible new ways to over-complicate things.",
              "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltk9w5p/",
              "created": 1729797790,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltjkdw2",
          "score": 7,
          "body": "I'm a software engineer, I spent 7 hours in client meetings this week. The whole time is us clarifying what they actually want to do. After we implement exactly what they said we can then go back and they can  tell us \"That's not what I meant\".",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjkdw2/",
          "created": 1729790205,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltjekc7",
          "score": 6,
          "body": "I say 80/20 %. \n80 planing managing confirming. 20 actuall programing.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjekc7/",
          "created": 1729788490,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltkrqbp",
          "score": 5,
          "body": "This is extremely true...I can't tell you how many hours as a system engineer I have wasted along with software development's time creating code to what we believe is the customer's satisfaction, only to find out after it's already completed that they wanted something completely fucking different, mostly because they very poorly explained what it is that they actually wanted...",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltkrqbp/",
          "created": 1729803133,
          "depth": 1,
          "replies": [
            {
              "id": "ltkz8d4",
              "score": 2,
              "body": "This is so great to hear. I have spent ~10 years mastering the requirements process. The hat trick is having all the information at your fingertips and your boss still can't put Humpty Dumpty together without a fucking IKEA instruction manual. There is a standard process \"business analyst\" used to go through but over the years it seems like that has been lumped into the SWE's lap. \n\nI can spend just a few days studying the work and translate those details into functional and non-functional requirements very easily, it cuts out a lot of wasted time. \n\nIt sounds like you need to focus on a structured requirements gathering process.",
              "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltkz8d4/",
              "created": 1729805477,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltjlom8",
          "score": 3,
          "body": "I'm a people peron damnit.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjlom8/",
          "created": 1729790590,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltj373n",
          "score": 5,
          "body": "Don't get me started on hardware development, when the lan speed is on 10mbps and it should be gigabit and we are doing all kinds of speed test driver changes and them when you look at circuit and there is wrong resistor put on connection",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj373n/",
          "created": 1729785085,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltjnzym",
          "score": 2,
          "body": "Do you think someone on fiver spends that same amount of time for five bucks?",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjnzym/",
          "created": 1729791271,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltng5hz",
          "score": 2,
          "body": "Not to mention what people think they want is often different than what they actually need.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltng5hz/",
          "created": 1729843412,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltj3uvf",
          "score": 3,
          "body": "Sure but it's cheaper to hire someone who can write queries than hire a developer. That's the arbitrage that changes the job market.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj3uvf/",
          "created": 1729785280,
          "depth": 1,
          "replies": [
            {
              "id": "ltj97nd",
              "score": 19,
              "body": "SWEs aren't highly paid because they know how to code. They're highly paid for their role in interpreting user requirements into functional code, and their ability to innovate. AI is highly imperfect in both of these aspects, to the extent that the \"prompt engineer\" basically needs the skills of an SWE to achieve anything useful.",
              "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj97nd/",
              "created": 1729786895,
              "depth": 2,
              "replies": [
                {
                  "id": "ltjezox",
                  "score": 12,
                  "body": "Thinking that AI will do all the coding at some point, sounds kinda insane to me. Having security leaks in unstable systems gonna be daily business and then you have idiocrazy style people sweating in front of the command prompt hoping AI gonna fix stuff. And how do they check if it's fixed? Unit tests will be written from AI too so straight to production.",
                  "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjezox/",
                  "created": 1729788614,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ltjskml",
                  "score": 5,
                  "body": "oh AI is definitely not perfect in coding either.",
                  "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjskml/",
                  "created": 1729792613,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ltjseod",
              "score": 3,
              "body": "it's not enough to write queries, as soon as ANYTHING breaks you need technical knowledge.",
              "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjseod/",
              "created": 1729792564,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltmuqdp",
          "score": 1,
          "body": "50%? more like 10%, even at big tech.\n\nMost of your time is spent in meeting, design discussions, code reviews, meetings with product, and politics. Code is 10% of the job at most",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmuqdp/",
          "created": 1729830732,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltj4od2",
      "score": 41,
      "body": "Ask AI to build a website for you and go ahead and use it.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj4od2/",
      "created": 1729785524,
      "depth": 0,
      "replies": [
        {
          "id": "ltn4adg",
          "score": 3,
          "body": "I actually tried this.\n\nIt was surprisingly functional, and did its job as a portfolio website for a non existent artist at a glance. Until you tried to run it in *any resolution besides 1080p* and you realize the brilliant AI decided that the *IDEAL* website design made sure offsets were always correct by simply filling in every empty space with an invisible text box and an unknown Unicode character. Load it up in chrome at 1080p and everything is normal. Load it up at any vertical resolution (phones), or in Firefox and suddenly you have a wall of \"unknown symbol\" symbols, and an utterly unusable interface with between 4 and 5 characters per line, and buttons in truly fascinating spots.\n\nAnyway, I just decided it wasn't worth the effort and told my friend \"no dude, you're not going to be able to pull this off without some extremely basic coding experience, or using a website builder, or hiring someone to build it for you, and you can't afford even my rock bottom rates.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltn4adg/",
          "created": 1729835875,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltizvma",
      "score": 75,
      "body": "There's no way you believe Fiverr is solely for programming... they even have an AI category with jobs, good luck with them being replaced by agents",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltizvma/",
      "created": 1729784098,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjbjx0",
      "score": 10,
      "body": "AI is just really not that good yet. It’s still definitely more of a tool for workers than a full on substitute. If anything you’ll see a rise of jobs on fiver because all of those people can now work faster with the help of AI",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjbjx0/",
      "created": 1729787597,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltj8u29",
      "score": 18,
      "body": "Think you overestimate the capabilities of todays AI system. They always need guidance and detailed prompting of a human to produce meaningful results. They usually only provide parts of a solution. What will happen is that stuff gets cheaper on Fiverr as AI speeds up people's work.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj8u29/",
      "created": 1729786780,
      "depth": 0,
      "replies": [
        {
          "id": "ltk9gou",
          "score": 3,
          "body": "Also, results are limited to what’s fed to the LLM (I take that’s what OP refers to as AI). The fact that OP was able to create a script via just an AI prompt only means OP was looking for a solution that already exists. AI can’t code reliably, it just comes up with what’s statistically more likely to be seen in code, and you can’t trust that to be useable in all cases, let alone production-ready.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltk9gou/",
          "created": 1729797660,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltjd90j",
      "score": 9,
      "body": "Implementing 250 lines of code to do one of the most simple tasks on the internet isnt significant.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjd90j/",
      "created": 1729788101,
      "depth": 0,
      "replies": [
        {
          "id": "ltje1n2",
          "score": 1,
          "body": "Well the details of all of its functions isn’t relevant to my point, but it does more than just search for words lol.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltje1n2/",
          "created": 1729788337,
          "depth": 1,
          "replies": [
            {
              "id": "ltkbs1f",
              "score": 4,
              "body": "You’re not going to have LLM-based AI like Claude generate code for full-blown applications. Not today, not ever. At best, you’ll get something that is already out there, but with increased exposure to bugs and security risks.",
              "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltkbs1f/",
              "created": 1729798355,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltj3m6w",
      "score": 6,
      "body": "Ask someone on fiverr.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj3m6w/",
      "created": 1729785208,
      "depth": 0,
      "replies": [
        {
          "id": "ltkjzd6",
          "score": 1,
          "body": "only if he's got a a fiverr",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltkjzd6/",
          "created": 1729800809,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltjeyaf",
      "score": 6,
      "body": "You trusting a market to act rational in the most irrational decade ever. Godspeed",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjeyaf/",
      "created": 1729788602,
      "depth": 0,
      "replies": [
        {
          "id": "ltjggyb",
          "score": 3,
          "body": "![img](emote|t5_2th52|52627)",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjggyb/",
          "created": 1729789046,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltj1ny3",
      "score": 11,
      "body": "a lot of fiverr tasks are done by AI or copied",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj1ny3/",
      "created": 1729784633,
      "depth": 0,
      "replies": [
        {
          "id": "ltj2bs5",
          "score": 2,
          "body": "So if they’re already done by AI, then when it becomes easier to do for mainstream users, then why would they go to Fiverr?",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj2bs5/",
          "created": 1729784829,
          "depth": 1,
          "replies": [
            {
              "id": "ltj4u6a",
              "score": 18,
              "body": "Do you know how many people would rather have YOU use AI to code a simple solution for 100$ instead of having to use AI to code themselves? I don’t even understand how you wrote a reader to scan reddit comments. I mean sure you have code but what do you even do with code the code itself? How do you even run a code as a program?",
              "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj4u6a/",
              "created": 1729785572,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltj6tj8",
              "score": 3,
              "body": "AI is necessarily INCAPABLE of trustworthy output. For certain task the margin of error is clearly acceptable. For everything else, you still need people either directly or as an intermediary with the necessary expertise to un fuck the output of the spicy autocomplete.",
              "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj6tj8/",
              "created": 1729786174,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltj5gl0",
      "score": 6,
      "body": "I use claude every day. There's still nothing stopping it from hallucinating or creating junk code. It's a great assistant or starting point but it's not a real replacement.\n\nThe last mile will take a long time to cross.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj5gl0/",
      "created": 1729785760,
      "depth": 0,
      "replies": [
        {
          "id": "ltjmyar",
          "score": 1,
          "body": "Do you use the paid version? Because I ran into no coding issues that it couldn’t fix",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjmyar/",
          "created": 1729790964,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltjes03",
      "score": 7,
      "body": "The number of people asking you to share your reddit scanner is your answer. They're not doing anything wrong, they are trying to save 3 hours that you've put in to make it even though they can ask AI and get it tailor made. This convenience is why people will continue to go in Fiverr",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjes03/",
      "created": 1729788552,
      "depth": 0,
      "replies": [
        {
          "id": "ltjgddq",
          "score": 1,
          "body": "A good argument for sure. Don’t you think the difference between the two are a little bigger than what you make them out to be though? They didn’t know they wanted a scanner, but people who go to Fiverr already know what they want. Bit of a difference in my opinion.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjgddq/",
          "created": 1729789017,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltj6yzk",
      "score": 4,
      "body": "Because AI is acually kind of shit in a lot of ways.\n\nNo one told you before??\n\nOk, no problem. But now you know.\n\nDon't forget!",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj6yzk/",
      "created": 1729786219,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltj1waz",
      "score": 5,
      "body": "a lot of people on fiverr just use AI lol",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj1waz/",
      "created": 1729784702,
      "depth": 0,
      "replies": [
        {
          "id": "ltj2mga",
          "score": 1,
          "body": "So if a lot of tasks are already done by AI, then when it becomes easier for mainstream users to use AI in the same way, aka an Agent, then why would they go to Fiverr? Cut out the middle man",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj2mga/",
          "created": 1729784917,
          "depth": 1,
          "replies": [
            {
              "id": "ltjobo6",
              "score": 2,
              "body": "it's still tedious tho, you can let the people on fivver wrangle with the AI nonsense.",
              "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjobo6/",
              "created": 1729791368,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltjd5lz",
      "score": 5,
      "body": "Fiverr is already using the real AI... Actually Indians ![img](emote|t5_2th52|8882)",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjd5lz/",
      "created": 1729788073,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltj5fuq",
      "score": 3,
      "body": "Can you share your scanner? Been trying to do something similar with gpt, just can’t get it right.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj5fuq/",
      "created": 1729785755,
      "depth": 0,
      "replies": [
        {
          "id": "ltkvh2r",
          "score": 1,
          "body": "Home now! I'll share it... for a fiver ![img](emote|t5_2th52|4275)(or just DM me)",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltkvh2r/",
          "created": 1729804281,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltjimtj",
      "score": 3,
      "body": "i did something like fiver once, except i would get paid 10 dollars to tell people if their idea was fucking regarded or not and just gave them affirmation to their idea no matter how dumb it was. a guy once asked me if he should break up with his gf and date her mom after her dad dies and i just said \"sure sounds like a great idea\" got paid 15 bux and never heard from them again.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjimtj/",
      "created": 1729789687,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjmbyp",
      "score": 3,
      "body": ">It’s like 250 lines of code, and it was free. I have zero coding experience.\n\nI'm a software engineer and job listings for entry-level Python developers seem to be drying up. I think getting rid of senior developers will take longer. There's more to software than coding.\n\nSenior engineers have to: \n\n* Interpret incomplete/conflicting requirements from customers\n* Architect a system appropriate to the expected volume of data and user traffic. \n* Configure cloud (or other) platforms to optimize for expected volume of data/users while keeping costs in check\n* Address evolving security threats\n* Diagnose/fix bugs and performance problems\n* Rapidly and safely integrate and deploy new features/fixes\n* Write meaningful unit tests\n* Adapt to the restrictions of legacy code\n\n>Now picture this in 6 months to a year, given how much we’ve moved forward in that same time period.\n\nMaybe, but there is some evidence of diminishing returns for LLMs. Most of the high-quality coding documentation has probably already been trained on. The previous rate of improvement may be hard to replicate. We could be stuck with status quo for a while, but idk.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjmbyp/",
      "created": 1729790782,
      "depth": 0,
      "replies": [
        {
          "id": "ltjnz6m",
          "score": 2,
          "body": "I’m glad you agree on some parts of what I’m talking about, and thanks for taking the time to write all this up. I’m not sure I’ve seen the decrease in improvements that you’re mentioning, what are you referencing?",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjnz6m/",
          "created": 1729791264,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltjmqwz",
      "score": 3,
      "body": "They do more than code. I hire people there all the time for things AI can’t really do",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjmqwz/",
      "created": 1729790902,
      "depth": 0,
      "replies": [
        {
          "id": "ltjo6dq",
          "score": 2,
          "body": "What sort of things, if you don’t mind my asking?",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjo6dq/",
          "created": 1729791324,
          "depth": 1,
          "replies": [
            {
              "id": "ltjofrs",
              "score": 3,
              "body": "I run a super niche type of outbound sales. I need actual humans to really dig for me and find the contact information of the humans I target, because targeting very specific people is more than half the battle for what I do. I couldn’t outsource this to AI even if I wanted. I’ve been using guys in India for this for years!",
              "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjofrs/",
              "created": 1729791402,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltk9i1l",
      "score": 3,
      "body": "You're delusional. AI is shit, unreliable, unaccountable etc. fiverr might be worse, but the fact you but some basic script with it doesn't mean much.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltk9i1l/",
      "created": 1729797671,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltj2360",
      "score": 15,
      "body": "AI is a scam bubble and only good for making memes and getting altman rich",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj2360/",
      "created": 1729784758,
      "depth": 0,
      "replies": [
        {
          "id": "ltl5krt",
          "score": 1,
          "body": "Not a scam. I used it to generate a contract statement recently. I just described the contents. It saved me a lot of pointless adjustments and refinement. It is a waste of money for sure though. If you pay for access. I use Opera browser Aria and it is free. They also support local LLM but I am using their servers because it's free.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltl5krt/",
          "created": 1729807577,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltjbf8j",
      "score": 2,
      "body": "Newsflash: people who don't know how to use AI will be replaced by people who do, that's the real change coming. Not that AI agents will take all jobs. \n\nThose workers on Fiverr? Yeah, they're going to work more hours, more efficiently. That's what AI will bring them. \n\nThey can take solace in knowing they will keep their jobs, but like all efficiency gains, it will just mean they work more not less.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjbf8j/",
      "created": 1729787559,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjwm9o",
      "score": 2,
      "body": "I hired a fiver guy to make me a tik tok ad and he just put it into one of those AI ad generators and sent it to me. Had no idea those existed and gave him 5 stars. 6 months later I see the format he used on an AI website and was like darn",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjwm9o/",
      "created": 1729793808,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltk2w4h",
      "score": 2,
      "body": "Is an AI gonna paint my Warhammer miniatures?",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltk2w4h/",
      "created": 1729795691,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltj52ov",
      "score": 2,
      "body": "Fiverr is basically gig labor. I can have a concept relay it to a known sub(quality known, previous work); by the time I wake up I'll have several designs maybe one two edits.  Boom finished product. We own a lab and do marketing, pr, web design,  medical billing and work with political officials. I basically have a whole team i don't have to pay or give benefits.  Bonus they work hours most Americans are sleeping(odd hours don't matter). AI agents aren't replacing real people in many areas for a long time. ",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj52ov/",
      "created": 1729785644,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjuvkg",
      "score": 2,
      "body": "I think you have the right idea. But it might be a little too soon. Even if AI can replace most of the tasks. The average person won’t know how to use it properly or get the results they wanted. Given more time I can totally see it happening.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjuvkg/",
      "created": 1729793291,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltj44l5",
      "score": 1,
      "body": "Their market cap is nowhere near even a billy, this thinking is already priced in. You are right to target SaaS though",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj44l5/",
      "created": 1729785359,
      "depth": 0,
      "replies": [
        {
          "id": "ltj4fri",
          "score": 1,
          "body": "Yup! Also shorting SaaS companies that aren’t setup to be able to compete. Digital twins of software is the next big thing. Look at Mechanical Orchard for example, crazy stuff. \n\nBut you can still short it, 800MM to 200MM is doable. Also, Appian is a bigger platform",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj4fri/",
          "created": 1729785452,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltj59m8",
      "score": 1,
      "body": "Fiverr has other services but I would be interested seeing what the breakdown percentages are of what people use it for.\n\nI’ve been wanting to short it but I’ve never had luck shorting anything.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj59m8/",
      "created": 1729785702,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltj5m6b",
      "score": 1,
      "body": "I use it for things like beta reading. Never had issues. I use grammarly for editing but some stuff requires a human touch",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj5m6b/",
      "created": 1729785807,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltj6fxj",
      "score": 1,
      "body": "Have you actually clicked into Fivrr?",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj6fxj/",
      "created": 1729786058,
      "depth": 0,
      "replies": [
        {
          "id": "ltjn2p1",
          "score": 1,
          "body": "![img](emote|t5_2th52|4259)",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjn2p1/",
          "created": 1729790999,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltj6xpm",
      "score": 1,
      "body": "North Korea.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj6xpm/",
      "created": 1729786208,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltj80jp",
      "score": 1,
      "body": "because still need someone to turn an AI generated logo into a vector.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltj80jp/",
      "created": 1729786531,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjaatk",
      "score": 1,
      "body": "Have you looked at its stock chart? Over 300 to 22 tells you everything you need to know",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjaatk/",
      "created": 1729787224,
      "depth": 0,
      "replies": [
        {
          "id": "ltjatkk",
          "score": 1,
          "body": "It (along with a lot of other online services like it) skyrocketed with COVID, then returned to a realistic valuation. Nothing more really there to see, you’ll find the same pattern in a ton of these types of companies",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjatkk/",
          "created": 1729787380,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltjb4gf",
      "score": 1,
      "body": "What if Fiverrr pivots to meet the market and focuses on AI or ai developers? The current business model might be worth otm puts, but have you seen any forward guidance plans that suggest they aren't changing? I have no idea but I would suspect a company focusing on coding could adapt quickly.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjb4gf/",
      "created": 1729787470,
      "depth": 0,
      "replies": [
        {
          "id": "ltjbckw",
          "score": 1,
          "body": "I thought about that, but realistically how can they pivot in a way that would actually effectively combat this issue? How could Chegg have done anything differently? Their business models can’t change quick enough",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjbckw/",
          "created": 1729787538,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltjfjmw",
      "score": 1,
      "body": "Boomers I’m guessing",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjfjmw/",
      "created": 1729788776,
      "depth": 0,
      "replies": [
        {
          "id": "ltjgizp",
          "score": 1,
          "body": "They’ll be retired soon enough",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjgizp/",
          "created": 1729789062,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltjga37",
      "score": 1,
      "body": "Get back to me when AI can put together IKEA furniture",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjga37/",
      "created": 1729788990,
      "depth": 0,
      "replies": [
        {
          "id": "ltjgzuh",
          "score": 1,
          "body": "Calls on $TSLA?",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjgzuh/",
          "created": 1729789198,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltjgbzz",
      "score": 1,
      "body": "A bot that scrapes Reddit post is extremely easy and also published on GitHub\n\nVery likely it just used someone else’s code that they’ve uploaded to GitHub, in which case it would have taken less time to just download and use it for free",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjgbzz/",
      "created": 1729789005,
      "depth": 0,
      "replies": [
        {
          "id": "ltjgxtz",
          "score": 1,
          "body": "Good point. I did make it iteratively though, for what it’s worth, adding features as I went. I think if you look at their paper, their new model’s coding has something like a 92% 0-shot success rate with coding, which is pretty insane.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjgxtz/",
          "created": 1729789182,
          "depth": 1,
          "replies": [
            {
              "id": "ltm00ur",
              "score": 2,
              "body": "That is wild \n\nI’ve used it for a good bit, built some multi agent workflows recently \n\nI find it’s great on stuff that there is a lot of examples for but needs some manual tweaking for new frameworks or complex backend logic",
              "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltm00ur/",
              "created": 1729818459,
              "depth": 2,
              "replies": [
                {
                  "id": "ltmieb9",
                  "score": 2,
                  "body": "Glad others see its value, though idk about its implications in Fiverr’s downfall yet. \n\nAlso, wild thing that White House paper. Basically they’re saying they’re behind on AI compared to public and so they’re initiating a brain drain towards government AI program, like when the Space Race first started, after Sputnik was launched, basically initiating the AI race. Upload that memo to Claude and talk it out with it- be sure to ask about the small details it might think you’ll find interesting and you’ll find some gold nuggets.",
                  "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmieb9/",
                  "created": 1729825335,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ltjgv85",
      "score": 1,
      "body": "While I agree with you that there's a lot of potential for AI in this field.  At the moment Fiverr has an opportunity to use AI to it's advantage as well which might offset any big loses.  Right now LEAP Put options are expensive vs others that have a high potential to pay out in the next three months imo.  There are better opportunities out there than this low possibility.  \n\nFiverr is already taking advantage of freelance AI Services which will become huge in the coming years.   One issue Fiverr has that has yet to fix is allowing unqualified people on their platform.  It worked for them for a while because of cheap labor but now it has given them a bad name.  Fix this issue and they have a huge opportunity to change a lot of industries that are struggling right now because of corporate greed/politics/ prioritizing short term gains vs keeping experienced talent long term.  Companies don't see the value in keeping workers long term anymore so Fiverr can take advantage of that especially in the film and gaming industry.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjgv85/",
      "created": 1729789161,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjid5o",
      "score": 1,
      "body": "Explain how banks exist in a world with online banking. 🤔 Puts on banks.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjid5o/",
      "created": 1729789606,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjjc60",
      "score": 1,
      "body": "1. AI not ready for prime time. 2. Enshitification will occur before it’s ready. \n\nThere will also be a place for $3/hr projects.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjjc60/",
      "created": 1729789895,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjkirx",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjkirx/",
      "created": 1729790246,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjm3wp",
      "score": 1,
      "body": "If you cook a hot dog does it make you a chef? \n\nWhile AI can do amazing things, it's not there yet. It cannot fix code the same as a developer can. \n\nFuck man. It still cannot get speech to text correctly.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjm3wp/",
      "created": 1729790715,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjm586",
      "score": 1,
      "body": "AI isn’t a miracle pill to solve work. Human customers are too messy for that.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjm586/",
      "created": 1729790726,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjn0ns",
      "score": 1,
      "body": "Imagine a certain orange former leader of the free world trying to use AI instead of yelling at an assistant.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjn0ns/",
      "created": 1729790983,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjnb6z",
      "score": 1,
      "body": "You need to understand, that consultancy companies offer way more than just doing the job. They represent outsourcing of responsibility/accountability for the management - you can always say, that they were supposed to be the experts and if they couldn't do a good job, your own people likely couldn't, too. That's why they are so expensive (which also reinforces the notion, that they are more qualified, which may or may not be the case). AI used internally can't do that, since an internal employee using AI and all managers above them won't be able excuse any fuck ups as easily as they could blame it all on the consultants.![img](emote|t5_2th52|4271)",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjnb6z/",
      "created": 1729791069,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjozhl",
      "score": 1,
      "body": "So... YOLO on calls?",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjozhl/",
      "created": 1729791561,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjpo6m",
      "score": 1,
      "body": "A slight left turn but I can say for sure that for artwork / graphic design, images, covers for artistic projects, etc... A real person on Fiver would likely be much better.  I have Chat GPT4 DALL E and all that, and it's cool what it can do, but it just doesn't make it for specific requests.  It's more like an artist who constantly hallucinates and can't remember the last thing he did.  So I will likely end up going to Fiver, or finding someone on DeviantArt.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjpo6m/",
      "created": 1729791760,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjpvo6",
      "score": 1,
      "body": "Because people are too lazy to even ask AI and will pay for someone else to do it.\n\n\n/thread",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjpvo6/",
      "created": 1729791820,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjqu4f",
      "score": 1,
      "body": "I thought Fiverr is the website that lets you hire Indians to take your online courses.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjqu4f/",
      "created": 1729792103,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjqwcw",
      "score": 1,
      "body": "They could hire freelancers to tag the datasets that feed the AI?",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjqwcw/",
      "created": 1729792121,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjriu0",
      "score": 1,
      "body": "You overestimate ppl's abilities to communicate what they want, especially with AI prompts",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjriu0/",
      "created": 1729792305,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjtk9n",
      "score": 1,
      "body": "That was cool.\n\nBut there might be some other revenue models for these we cant anticipate right now. Evolve or die?",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjtk9n/",
      "created": 1729792901,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltju537",
      "score": 1,
      "body": "Fiverr does a whole lot more than just offering code for projects.  I typically use it for graphics and such. ",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltju537/",
      "created": 1729793072,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjujis",
      "score": 1,
      "body": "I ain’t using no dang ai agent but I’ll pay you a fiverr to feign not knowing that you’re using an ai agent",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjujis/",
      "created": 1729793191,
      "depth": 0,
      "replies": [
        {
          "id": "ltjviz3",
          "score": 2,
          "body": "I Accept.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjviz3/",
          "created": 1729793482,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltjv8iu",
      "score": 1,
      "body": "This is the same reason job recruiters exist. Why use them when you can upload your cv ? \n\nBecause believe it not, most companies and candidates need the soft touch. Conversations …convincing …selling ..etc.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjv8iu/",
      "created": 1729793396,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjvqnx",
      "score": 1,
      "body": "Upwork (just like Fiverr) has been having their freelancers clock their screen recording time which I believe is used to train their AI, which they also offer to some capacity. So, either they tank when it's discovered people are necessary, or other things are impacted by the discovery that this aspect of marketing is antiquated when done by human beings.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjvqnx/",
      "created": 1729793547,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjvt6r",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjvt6r/",
      "created": 1729793568,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjw9w3",
      "score": 1,
      "body": "You all are trying to act like AI NOW is going to take your job.  Let’s see how this thing is cooking in 10-20 years. The capex spending on AI is nothing we have seen in quite some time.  I think the Industrial Revolution is the only thing that comes close.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjw9w3/",
      "created": 1729793705,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjwrrw",
      "score": 1,
      "body": "Scripts are simple to write - what you wrote was a script.  Even before AI people could write and sell scripts - all AI is doing is allowing more people to write scripts who couldnt before and those who could write scripts can do so faster.\n\nWebsites that host Generic CSS templates for websites have existed since the 90s.   Its literally just a template but people pay hundreds of dollars a month to host their websites that are fully templatized.\n\nThis is nothing new.   If people on fiver are just asking easily solved scripts that anyone can plug into AI in 5 minutes then the value of these scripts will drop to nothing.\n\nThis is basically the low level understanding of programming - someone takes a class in college and goes \"i can code!  I can make 6 figures!\".   Except no one is paying you 6 figures because you know syntax.   They are paying you 6 figures because you bring in more than 6 figures in value to the company.  By using the syntax of coding to solve problems.   The value is knowing the prompt for the AI - not knowing the syntax,  AI is just saving you some typing time if you already knew what you were doing. \n\nAI can replace people whose job is simple scripts that AI can write.  The whole AI can replace work does replace these people,  I would hope that most people do more than this.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjwrrw/",
      "created": 1729793856,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjzvp0",
      "score": 1,
      "body": "Can you share your reddit scanner?",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltjzvp0/",
      "created": 1729794785,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltk09n3",
      "score": 1,
      "body": "That's find and dandy but try paying AI 5$ to stick a fruit up it's behind.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltk09n3/",
      "created": 1729794903,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltk2om2",
      "score": 1,
      "body": "Can this AI hang a TV on the wall for me? Haul junk away?",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltk2om2/",
      "created": 1729795629,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltk40qg",
      "score": 1,
      "body": "People who use fivver have the computer knowledge of a 5th grader…",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltk40qg/",
      "created": 1729796027,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltk5485",
      "score": 1,
      "body": "Fiverr is not mainly used for coding. Coding is outsourced to Asia.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltk5485/",
      "created": 1729796354,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltk5vca",
      "score": 1,
      "body": "Because I’m using a model with 10 billion dollars of training sunk into it and it can export an excel sheet about 1 in every 3 tries. If it’s hit or miss with that, how the fuck is anyone trusting it to code? It still lies and then when you call out the lies it goes “oh yeah, I guess that’s not right”.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltk5vca/",
      "created": 1729796580,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltk8gpm",
      "score": 1,
      "body": "Captcha is the correct answer",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltk8gpm/",
      "created": 1729797361,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltk94tw",
      "score": 1,
      "body": "It's because they are a people person, they got people skills...",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltk94tw/",
      "created": 1729797561,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltk9mg1",
      "score": 1,
      "body": "Fiverr is screwed, I used to go there to have pictures photoshopped (with varying degrees of success) and i don’t need them anymore",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltk9mg1/",
      "created": 1729797707,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltkaen8",
      "score": 1,
      "body": "Outsourcing cheap labor. AI solutions arent free sot its better to hire cheap labor elsewhere in the world than to source an AI that has to be trained to perform a specific task.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltkaen8/",
      "created": 1729797943,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltkbepy",
      "score": 1,
      "body": "Have you used AI to code anything?\n\n\nAt first glance, something\n\n\nAt second glance (as you try to use it to do more than simple tasks) the worst garbage code to have ever existed",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltkbepy/",
      "created": 1729798243,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltkc7lp",
      "score": 1,
      "body": "I use fiverr often , asset creation , coding as well",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltkc7lp/",
      "created": 1729798485,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltke31k",
      "score": 1,
      "body": "You summing up Fiver to only be a site for coding contract work shows you didn't even do the bearest amount of research. Did you download the app and poke around? They do a lot, most of which AI is in no position to replace anytime soon. Bad DD is bad and you should feel bad.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltke31k/",
      "created": 1729799044,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltkfmg8",
      "score": 1,
      "body": "I used the service last year and it was such a rip off. Everyone is charging different things between $5 and $200 for logo creation but the results are literally all the same. AI generated art. I would up getting my money back because the results were such incredible dogshit.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltkfmg8/",
      "created": 1729799504,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltkh8ov",
      "score": 1,
      "body": "AI can't code in any way that can functionally replace a human programmer.\n\nAI can generate snippets of code to do very specific things and algorithms.\n\nAI cannot build a complete app, build new features on existing codebases, or identify complex coding bugs.\n\nSoftware engineers do so much more than simply coding as well. Configuring hosting resources, spinning up databases, schema. Engineering things to be scalable. Is ChatGPT going to design and setup DynamoDb, your lambda functions, configure your firewall, register your hostnames and set up certificates?",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltkh8ov/",
      "created": 1729799984,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltki4v6",
      "score": 1,
      "body": "You can short any fucking thing you want. I don't like fivrr, but they don't hire out people. They charge a transaction fee. Even with ai agents, customers won't know how to get things done ( as simple as it could be). Fiverr has an opportunity to offer those services directly versus freelancers, they have an interface for that. It could be like Uber hiring out self driving taxis vs drivers",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltki4v6/",
      "created": 1729800254,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltkiv79",
      "score": 1,
      "body": "It’s cheaper and faster for a human to do one off tasks",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltkiv79/",
      "created": 1729800475,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltklqyh",
      "score": 1,
      "body": "Simple answer is things done by fiverr people are copywritable. Things made by AI cannot be copywritten as no human was involved in the creation. \n\nAI is fantastic for open source software- not all that useful for creating proprietary software on its own. \n\nRealistic view of the changes in the market would be small time code writers changing their game from writing simple code to stitching together AI code with simple code so that it’s got some kind of human touching the development.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltklqyh/",
      "created": 1729801335,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltku44q",
      "score": 1,
      "body": "huh? what on earth does AI have to do with Fiverr?",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltku44q/",
      "created": 1729803858,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltl200n",
      "score": 1,
      "body": "Fiverr does a lot more than coding.  I use them for everything from VA’s to Bookkeeping to take your pick.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltl200n/",
      "created": 1729806371,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltl28x6",
      "score": 1,
      "body": "Because AI sucks at coding. I do know programming, and I've played around with it. We are sooooo many years away from AI replacing jobs. AI will be another tool for actual developers, at best. \n\nSure, you can make a small program with Chat GPT that works (250 lines of code is a very small program), but if you try to build something large and scalable, you're going to run into issues that you're going to need a real developer to troubleshoot and fix.\n\nAlso, I just read an article yesterday about a company that insisted on moving to AI for all their tasks, and they decided to shelf the whole AI thing because it was actually causing their employees to be less productive.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltl28x6/",
      "created": 1729806452,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltl3k7s",
      "score": 1,
      "body": "An AI won't build me a dropshipping store for dirt cheap or build a actually nice and curated web page for my shop",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltl3k7s/",
      "created": 1729806894,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltl51ti",
      "score": 1,
      "body": "AI is really bad for tasks where there isn't 5 million internet articles on how to do it.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltl51ti/",
      "created": 1729807398,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltl91jw",
      "score": 1,
      "body": "Here's the thing.\n\nYou can have AI generate a logo for you. But it's not exactly \"new\" and based on billions of images it's processed. It may not have the right design elements or be as appealing as it should be. \n\nOr I can hire a pro who understands it, and get it done with no time of my own fucking around with prompts. \n\nIt's the same for most other things. Can it write code? Sure. Is it functional? Probably? Ish? Is it secure and free of bugs? Lol no.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltl91jw/",
      "created": 1729808781,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltla01l",
      "score": 1,
      "body": "If you have zero experience with code, how did you run the code the AI generated for you?",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltla01l/",
      "created": 1729809120,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltlh0sz",
      "score": 1,
      "body": "AI is a collaborator not a replacement. Anyone in code or graphics knows this. AI is limited when you get into the weeds. Fiverr’s most successful people will be the ones who harness AI and can actually do something with it.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltlh0sz/",
      "created": 1729811608,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltlhx52",
      "score": 1,
      "body": "Because of institutional inertia \n\nYou and I move much much faster than businesses and organizations",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltlhx52/",
      "created": 1729811928,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltli397",
      "score": 1,
      "body": "The stock is already cheap AF with sub-10 P/E, it also grew its revenue every single quarter since its IPO. \n\nAlso there are still things AI can't do, like buying social media exposure etc...",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltli397/",
      "created": 1729811987,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltllb6b",
      "score": 1,
      "body": "The “AI” bubble is about to pop, investors are already realizing that OpenAI and their competitors overpromised as their clients are forced to hire back the artists, programmers, and fast food cashiers they laid off.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltllb6b/",
      "created": 1729813138,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltlning",
      "score": 1,
      "body": "The point of hiring freelancers is to hire talent that can execute in project that you’re unable to do yourself. OR, if you can execute the project yourself, hiring a freelancer will free your time to focus on other things. \n\nUsing AI will not fill accomplish either of those two things. But freelancers that use AI will be able to get more gigs and achieve a quicker turnaround time on jobs than a freelancer not leveraging AI.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltlning/",
      "created": 1729813923,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltlobix",
      "score": 1,
      "body": "have you tried ai agents? you'll pay $25 in API costs to generate some basic HTML. thats why fiverr exists",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltlobix/",
      "created": 1729814211,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltlq2u7",
      "score": 1,
      "body": "The fact that Microsoft, Amazon and Google all announced in the last few weeks that they all need their own nuclear power plants for their energy needs for AI data centers should tell you where we are headed. Most ya all have no clue.  ANthropics demo today of their AGENTS shows how many jobs will disappear real soon.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltlq2u7/",
      "created": 1729814848,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltlqv1q",
      "score": 1,
      "body": "So here's the problem I was working on today. I had a table of values that I needed to add an effective date to. I'm looking at the UI, which just lists the values in a grid, and thinking after I add the effective date to the grid how do I allow the user to add a new line with values where they can just change the effective date and one or two of the values on the line. Finally decided I would get a pic of a calendar, shrink it down to an icon, stick that on the end of the grid next to the + icon that adds a blank line, so that when they click on the calendar it copies that line and adds it to the end of the grid, then I decided I'd fill in the effective date with today's date, put the focus on that, so that they'd get a line with all the values copied and be able to change the effective date first, and then go and edit the rest of the values as needed.\n\nSo an AI is going to be told to add an effective date and here's the UI. Figure it out. Somehow I don't see it coming up with a user-friendly solution. It would actually have to be a human with eyes and fingers to know to design the UI so that at a glance the user will know what to do. I could give the AI the task of writing the code to copy the line after the icon is pressed, but that's a trivial thing that takes me a minute to write. It's the figuring out how to present it to the user in a fashion they can understand that takes the time.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltlqv1q/",
      "created": 1729815130,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltlsju1",
      "score": 1,
      "body": "Is it possible that as AI becomes more widespread and accessible, freelancers on platforms like Fiverr could adopt AI tools to increase their productivity and even offer more sophisticated (e.g. diversified) services?   \n  \nThis could allow them to take on more jobs, complete tasks faster and provide higher-value offerings, helping Fiverr evolve into a marketplace that blends AI with human expertise.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltlsju1/",
      "created": 1729815742,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltlszdx",
      "score": 1,
      "body": "This is possibly a mistake. You don’t understand this space as well as you think.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltlszdx/",
      "created": 1729815898,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltm9v24",
      "score": 1,
      "body": "AI went to fiver to pay some dude to beat \"I am not a robot\" test for it.\n\nWhatever happens next, it's not gonna go down the way you think it is.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltm9v24/",
      "created": 1729822091,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltme3m3",
      "score": 1,
      "body": "I think pretty much any \"this company will be worthless soon due to AI\" DD is pointless.\n\nOnce AI starts replacing people en-masse, every company is fucked except a few. Society will change. Stock market probably won't even exist anymore.\n\nSo tldr: priced in",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltme3m3/",
      "created": 1729823684,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltmh1rq",
      "score": 1,
      "body": "You’re a little late.  It’s already down 93% from ath. I’m bullish on Fiverr.  Fiverr is a $800m company.  I think AI will enable Indians, Filipinos, etc. to enter the global workforce with language not nearly as much of a barrier as pre-Chat GPT.  It could easily be a 10-bagger just five years from now.  I think ai will have a hard time navigating computers the next 10 years, ie. excel.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmh1rq/",
      "created": 1729824805,
      "depth": 0,
      "replies": [
        {
          "id": "ltmj48z",
          "score": 2,
          "body": "It’s down to 800M, with plenty more room to fall. Hear me out and look into digital twin software companies like Mechanical Orchard. They make digital twins of software, so the AI doesn’t have to “learn” how to use the program, it just knows how it works through and through.",
          "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmj48z/",
          "created": 1729825610,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltmh4hl",
      "score": 1,
      "body": "r/im14andthisisdeep",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmh4hl/",
      "created": 1729824834,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltmmh8g",
      "score": 1,
      "body": "“Learn to machine code.”",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmmh8g/",
      "created": 1729826946,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltmmxco",
      "score": 1,
      "body": "250 lines of code is literally nothing",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmmxco/",
      "created": 1729827136,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltmn1je",
      "score": 1,
      "body": "AI= Actually India",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmn1je/",
      "created": 1729827186,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltmneqn",
      "score": 1,
      "body": "Fiver is for hiring people in 3rd world countries to do menial physical tasks for pennies on the dollar",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmneqn/",
      "created": 1729827346,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltmni7y",
      "score": 1,
      "body": "Central Americans will always find a way to be cheaper",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmni7y/",
      "created": 1729827389,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltmq9u4",
      "score": 1,
      "body": "Because they have Fiverr freelancers who do A.I",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmq9u4/",
      "created": 1729828607,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltmuheb",
      "score": 1,
      "body": "Because AI agents don't actually work well enough to do the overwhelming majority of real world tasks, it is unclear they will be able to do so on the timeframe some non-technical folks on reddit think they will be able to, and as a result their near term future is unclear.\n\nThere is a real possibility current generation AI models fall short of the automation potential people are expecting and we end up in a 10-15 year rut waiting for the next breakthrough. This has happened over and over again in this field and in technology more generally.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltmuheb/",
      "created": 1729830607,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltn3ewq",
      "score": 1,
      "body": "This is hilarious. Fucking do it, make sure to post the loss porn. \n\nAlso, do share your \"250 line reddit scanner\" to r/programmerhumor it will be a massive karma boost for you.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltn3ewq/",
      "created": 1729835369,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltn6nkr",
      "score": 1,
      "body": "what if they just replace the workers with AI agents lol",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltn6nkr/",
      "created": 1729837297,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltn895p",
      "score": 1,
      "body": "Got to have a place to hire your Anonymous Indians.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltn895p/",
      "created": 1729838289,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltnaw2u",
      "score": 1,
      "body": "Paying someone to figure out things will always be easier than figuring it out yourself. AI is not there yet where you can get the result with the same effort as you do on fiverr. At this point AI can help freelancers more than the buyer",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltnaw2u/",
      "created": 1729839945,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltnb08g",
      "score": 1,
      "body": "Because AI agents are pretty shit. They can at best assist you to do your work faster. They can't do your work if you know nothing about it.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltnb08g/",
      "created": 1729840019,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltnm95o",
      "score": 1,
      "body": "This is bait, right? Hurr durr I don't know anything about software engineering but I know enough to believe AI can do all of it for me in any consumer use case. 🤡",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltnm95o/",
      "created": 1729847469,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltnps9y",
      "score": 1,
      "body": "AI can't even generate a wine glass filled to the top with red wine",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltnps9y/",
      "created": 1729849769,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lto75hy",
      "score": 1,
      "body": "I would suggest some time for a better understanding of AIs capabilities and limits",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/lto75hy/",
      "created": 1729858678,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltoda5e",
      "score": 1,
      "body": "It's clear from your text that you don't know anything about software engineering",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltoda5e/",
      "created": 1729861107,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltoe4z4",
      "score": 1,
      "body": "Huh. Lol.  You think you can just ask chatgpt to code a full program with no issues?  Especially if you don't know how to use the language you need? \n\n\nThat's how, Bec AI isn't even close to the level right now.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltoe4z4/",
      "created": 1729861431,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltoekfz",
      "score": 1,
      "body": "That's a smart theory.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltoekfz/",
      "created": 1729861594,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltohwqb",
      "score": 1,
      "body": "Average person would rather pay a human $5 for something than $5 for a robot to do it wrong because they don't know how to prompt AI right.\n\nSo Fiverr will still be in business like it was. Those who can't be bothered to figure out how to do what the Fiver sellers can will simply pay for it. It does not matter if the Fiver seller is using an AI subscription and prompting right for the buyers desired results.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltohwqb/",
      "created": 1729862802,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltoiytd",
      "score": 1,
      "body": "lol. you probably don't even know if it works correctly if you have 0 coding experience.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltoiytd/",
      "created": 1729863178,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltov50f",
      "score": 1,
      "body": "You can train a human with a few notes and half assed details. AI is more meticulous to have something that actually produces at a professional level that you can trust to represent your business. Hallucinations are a real risk and liability to an actual business. Companies can be held liable for promises AI makes. Gen AI doesn’t have basic common sense, and requires more testing and tinkering to put in guard rails.\n\nAlso, there is regulation that works in favor of humans in some scenarios, like robocalls\n\nAnd if you want AI to do anything beyond generating content, you have to hook it up via APIs or more costly AI platforms that wrap around LLMs.\n\nThen to boot, the best models are pricy enough to mathematically cost more an hour than a human in  cases based on prompt and user message sizes.\n\nI can get a bank of offshore resources off and running in seconds doing something where they already manage their tech stack and software licenses, have them pivot approaches at a moments notice, and stay truer to brand without risk of hallucinations.\n\nIt’ll get there one day. It’s not there yet. But regulation might fight AI generated content (copyright) and AI based spam (robo laws) and who knows where that will go.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltov50f/",
      "created": 1729867231,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltrd1zk",
      "score": 1,
      "body": "Nah I know about this,  I have a subscription to Claude. It's still in beta.  I tried to use it yesterday. It's nerfed, but this one's gonna be a game changer. When AI begins to use AI...",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltrd1zk/",
      "created": 1729895607,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltsayd4",
      "score": 1,
      "body": "Your thought process is correct, but if many have your thought process, which I'm sure many do , and are buying puts, it will fool you, and it will go sideways and up for now.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltsayd4/",
      "created": 1729908479,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltse2pn",
      "score": 1,
      "body": "You are absolutely right. I had the same hypothesis about 6 mo ago coz I work for AI company. However, this change will be slow over the years. AND It's really hard to know WHEN this impact will be significant.",
      "permalink": "/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/ltse2pn/",
      "created": 1729909676,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The user questions Fiverr's current valuation in the face of mainstream AI adoption and discusses buying puts on companies like Fiverr, Appian, and consulting firms due to potential revenue loss to AI.",
    "companies": [
      "Fiverr",
      "Appian",
      "Chegg"
    ],
    "tickers": [
      "FVRR",
      "APPN",
      "CHGG"
    ],
    "main_ticker": [
      "FVRR"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The user discusses the impact of AI on Fiverr and similar companies, suggesting they aren't sustainable at their current valuations.",
    "stock_recommendations": "The user is recommending to sell or use put options on Fiverr, Appian, and similar SaaS companies.",
    "is_recommending_stock_buying_or_selling": true,
    "buy_or_sell": "sell",
    "sentiment_summary": "There is negative sentiment as the author believes companies like Fiverr will struggle due to advancements in AI, prompting them to invest in put options against these companies.",
    "sentiment": "negative"
  }
}