{
  "title": "U.S. Bond Market Braces for the ‘Trump Trade’ of Large Tariffs and Deficits",
  "score": 330,
  "selftext": "https://www.nytimes.com/2024/10/25/business/economy/trump-economy-markets-trade.html?unlocked_article_code=1.U04.Vli9.tD2qYGIXIvLk&smid=nytcore-ios-share&referringSource=articleShare\n\nAnd now we know why rates have risen since the Fed .5% rate cut. Does this not scare the hell out of you guys? So we make money on equities for a moment and then fiscal default really kicks in? ",
  "link_flair_text": null,
  "id": "1gbu5k6",
  "num_comments": 123,
  "created_utc": 1729862592,
  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/",
  "comments": [
    {
      "id": "ltohbkk",
      "score": 1,
      "body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltohbkk/",
      "created": 1729862592,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltorok1",
      "score": 314,
      "body": "Imagine looking at what Liz Truss did the UK and thinking \"Let's try it here, maybe it will work this time\"",
      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltorok1/",
      "created": 1729866122,
      "depth": 0,
      "replies": [
        {
          "id": "ltp1rqp",
          "score": 85,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp1rqp/",
          "created": 1729869283,
          "depth": 1,
          "replies": [
            {
              "id": "ltp6hzo",
              "score": 78,
              "body": "One person who worked with him last time said, if you go to him with a choice between something that's good for the nation or good for him, you won't even be able to get to the end of the sentence.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp6hzo/",
              "created": 1729870742,
              "depth": 2,
              "replies": [
                {
                  "id": "ltp78r2",
                  "score": 17,
                  "body": "We’re doomed",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp78r2/",
                  "created": 1729870966,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ltp2b4z",
          "score": 24,
          "body": "If Trump wins, I will leverage 100x into FX pairs against the US Dollar.\n\nFree money glitch. Retire early.",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp2b4z/",
          "created": 1729869454,
          "depth": 1,
          "replies": [
            {
              "id": "ltp2yd2",
              "score": 61,
              "body": "Retire early to Thunderdome or Gastown?",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp2yd2/",
              "created": 1729869653,
              "depth": 2,
              "replies": [
                {
                  "id": "ltp57s4",
                  "score": 9,
                  "body": "I don't live in the US so ...",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp57s4/",
                  "created": 1729870347,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ltoy1lo",
          "score": -21,
          "body": "Imagine letting the rest of the world traiff your goods, but being scared of any taxes cause it might hurt 2700 peoples wallets?",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoy1lo/",
          "created": 1729868128,
          "depth": 1,
          "replies": [
            {
              "id": "ltp7pik",
              "score": 11,
              "body": "Imagine there’s no heaven.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp7pik/",
              "created": 1729871106,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltp4l19",
      "score": 102,
      "body": "I think a lot of the people who actually know anything that are supporting Trump also assume that he won't do a lot of the things he says he will do (just like they try to claim that he doesn't actually believe some of the crazy stuff he says, like about eating pets.)  So they don't expect him to actually enact all these tariffs and tax cuts (at least to the middle/lower class) that will be wildly inflationary and really, really blow up the budget deficit (which high inflation will actually help fight, but regardless would create considerable turmoil everywhere.)  I suspect this is going to be a massive \"I didn't think the leopards would eat MY face\" situation for a lot of his supporters.\n\nPersonally I think Trump wants the tariff thing not only as a simplistic way to sell his economic \"plan\" (just like he used to say the economy was great because the stock market was so high whch of course he doesn't want to say that now) but also because he will hand out exemptions based on who supported him, grovel to him after elected, or bribe him.  It's an incredible potential racket: you basically make every company and industry that does business with/in the USA involving any kind of import/export (and even if only secondary effect) have to come to you hat in hand or with plain brown envelopes.  He can also use it to punish people or companies he doesn't like.  This is a corrupt leader's wet dream.\n\nAside from that how do I feel it will affect markets? The reality is that I don't know.  It will definitely create some instability, volatility, and unpredictability but to what degree we don't know because we don't know how far he will actually follow through with his promises.  But the fact that we don't know will roil markets and could make people flee to safety in alternative assets since neither stocks nor bonds would be safe anywhere.  I suspect that initially there will only be a few tariffs enacted as a warning to everyone else and then use the threat of more tariffs as blackmail against everyone else.  So they will be implemented more gradually but that will still create huge uncertainty because you don't know if your country or companies you invest in are going to get into the middle of an ugly trade war.\n\nEDIT: I forgot about his promise (and one his top advisor's lifelong dream and really, really wants to do) to deport millions of people.  It's not realistic, but if he even manages to deport a single million--including many who had more established lives in the US--it would cause disruption in the labor market and also be a blow to the overall economy.  But again that will take time to manifest and not be instant.  Basically some of Trump's plans will likely turn the US and global economy to shit in the long run if he actually goes through with it, but we won't see it right away.",
      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp4l19/",
      "created": 1729870152,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltokklc",
      "score": 103,
      "body": "The Fed only controls the short end of the yield curve. The market has just been playing nice but now they realize trumps policies will be worse than Kamala’s and are pricing accordingly. We may get our own Gilt moment.",
      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltokklc/",
      "created": 1729863744,
      "depth": 0,
      "replies": [
        {
          "id": "ltougge",
          "score": 93,
          "body": "Most people have no idea how damaging and harmful trump’s trade policies were to international trade. Highly disruptive and unproductive with no real benefit whatsoever. Only increasing cost to businesses as prices for the same goods increases and the end users ends up paying more. \n\nTariffs are always paid by the buyer…",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltougge/",
          "created": 1729867017,
          "depth": 1,
          "replies": [
            {
              "id": "ltp0hin",
              "score": 11,
              "body": "And it's sad, but you really can't go all that hard against it because of the rise of populism. \n\n\nKamala has tried a little, but it isn't that strong because if you go strong, you'll be hammered for it.\n\n\nTo make this not completely off topic, yeah, I do lean towards the move in the US10Y no longer being just about better economic data. I think fair for the US10Y right now is closer to around 4%, so we've ventured towards this move being politically related.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp0hin/",
              "created": 1729868884,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltot0zk",
          "score": 9,
          "body": "That’s not true at all. They control the long term yield curve based on the discount rate that they offer to the banks for things like mortgages and other long term debts and bonds. Do you think mortgages are only paid on in short term increments by the banks?",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltot0zk/",
          "created": 1729866559,
          "depth": 1,
          "replies": [
            {
              "id": "ltouxjb",
              "score": 7,
              "body": "Market forces are superior to the Fed control via discount rate though. If supply came in based on perceived risk from bond holder that their fixed income payment will suffer from severe inflation due to expanded deficits, more printing/borrowing, and lower taxes then they will seek deeper discounts vs new bonds at higher yields.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltouxjb/",
              "created": 1729867165,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltoyr4d",
          "score": -36,
          "body": "Both parties have highly inflationary policies and we have international adversaries that no longer support our financial hegemony. This will happen regardless of who gets elected.",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoyr4d/",
          "created": 1729868346,
          "depth": 1,
          "replies": [
            {
              "id": "ltp0xf1",
              "score": 40,
              "body": "Buddy, the current admin just brought down inflation that was caused by the mishandling of the pandemic. Inflation that was seen in almost every other country at higher levels and we brought it down the fastest.\n\nWhat an embarrassing comment.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp0xf1/",
              "created": 1729869023,
              "depth": 2,
              "replies": [
                {
                  "id": "ltp1c7t",
                  "score": -34,
                  "body": "MMW we will have a lost decade or inflation will rip your fucking face off",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp1c7t/",
                  "created": 1729869150,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ltoz64d",
              "score": 16,
              "body": "Sure but the point the article is making as will as the market’s pricing is we need higher taxes not lower taxes to ride this out. A deficit is fine for the country that’s the global reserve currency but rapid expansion of it isn’t.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoz64d/",
              "created": 1729868475,
              "depth": 2,
              "replies": [
                {
                  "id": "ltoz9s3",
                  "score": -22,
                  "body": "We are losing reserve status as we speak",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoz9s3/",
                  "created": 1729868507,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltozgof",
                      "score": 15,
                      "body": "No we aren’t. Countries are looking for anyway to not have to use USD specifically because they need it to back local currencies. Nothing more, nothing less. But tariffs on everything would certainly be a step in that direction. After all, when goods don’t cross borders, armies do.",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltozgof/",
                      "created": 1729868566,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltp0p5d",
                          "score": -5,
                          "body": "Idk if you have observed the same thing I'm seeing as we speak, but armies are crossing borders everywhere. Russia in Ukraine, Iran causing chaos in the ME, China inevitably invading Taiwan in short order. They are challenging this whole US cowboy cop concept and indirectly weakening the Dollar in its wake. They fucking hate the US living off the back of the rest of the world just with a claim that they can kick everyone's ass. That's what makes the US dollar so good right? The fact that we can kick everyone's ass? They're calling our bluff.",
                          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp0p5d/",
                          "created": 1729868951,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltp29jc",
                              "score": 14,
                              "body": "Yeah I’m aware of all that. I’m also aware that they can’t even agree on what currency to trade in and have switched to exchanged goods for goods rather than goods for currency in some cases while just not trading in other cases. They are free to build a system of commodity exchange while also devaluing their own currencies. We have a lot of commodities ourselves and are more than insulated from it should we have to reshuffle supply lines again. \n\nIn other words, let them buy up gold and trade in it, the US has more than anyone else even if that’s not enough to back the whole system.\n\nAnd FYI it is a requirement of the reserve currency country to be a net exporter of capital thus net importer on the current account. In other wards, it’s required they run a deficit and I don’t see any other country in the world stepping up for that.",
                              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp29jc/",
                              "created": 1729869440,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltp39d9",
              "score": -10,
              "body": "Agree, Trump would just have us on the faster track.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp39d9/",
              "created": 1729869747,
              "depth": 2,
              "replies": [
                {
                  "id": "ltp97wq",
                  "score": 14,
                  "body": "Too bad he's insane and a wants to play dictator.",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp97wq/",
                  "created": 1729871563,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ltop176",
          "score": -58,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltop176/",
          "created": 1729865244,
          "depth": 1,
          "replies": [
            {
              "id": "ltotxzz",
              "score": 22,
              "body": "Hey say what you want but anybody that votes for a 10% tariff  on all imported goods to fund a tax cut for billionaires are just fucking crazy.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltotxzz/",
              "created": 1729866854,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltopldc",
              "score": 21,
              "body": "I’m not delusional at all. Yeah both sides will inflate it. The difference is the bond market cares about high deficits and low taxes in relation to the bond market way more than it cares high deficits and high taxes. The long term bond yield controls everything else in the market place. To not understand this is ignorance.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltopldc/",
              "created": 1729865431,
              "depth": 2,
              "replies": [
                {
                  "id": "ltot6md",
                  "score": 0,
                  "body": "To not understand that long term bond prices are not based on the current discount rate of the federal reserve is ignorance.",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltot6md/",
                  "created": 1729866609,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltotxcf",
                      "score": 8,
                      "body": "Long term bond prices are much more reliant on supply and demand given the Fed is continuing QT. When the bond holders start to feel like repayment is more risky from inflation, they will seek deeper discounts themselves to liquidate and move into higher yields. This will create a feedback loop until demand equalizes. The Fed has zero control over that.",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltotxcf/",
                      "created": 1729866848,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ltova0y",
                      "score": 3,
                      "body": "Fed guides, can’t necessarily set in stone the rates. That’s what we’re looking at right now and I’ve honestly been smoked by it over the past couple weeks with a large bond position.\n\nRight, but eventually the Fed can lose guiding control if there’s no buyers of our debt. The 20 year bond auction the other day went poorly. China has stopped buying our debt and thankfully Japan stepped in to fill that roll.",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltova0y/",
                      "created": 1729867274,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ltovvvx",
                      "score": 2,
                      "body": "Further, it’s the treasury that control supply not the Fed. QT thus further narrows their control since they’ve given that entirely to the Treasury. Any wonder why most of the issuance so far has been bills? I wonder how the market would react if it had been bonds instead",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltovvvx/",
                      "created": 1729867464,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltozh65",
                          "score": -1,
                          "body": "Current borrowing affects market. And market affects long term. It has way more affect in long term yields then being given credit for.",
                          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltozh65/",
                          "created": 1729868571,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltp0x7e",
                              "score": 5,
                              "body": "No arguments there. It’s in line with my argument that market force will over rule the Fed should they ever feel the need to such as right now when long term rates are rising while the Fed is cutting based perceived future policy changes.",
                              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp0x7e/",
                              "created": 1729869021,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltotzhf",
              "score": 14,
              "body": ">Edit: oh look, the **emotional amoeba** are out in force\n\nBro literally starts crying after the first answer challenging his post.\n\nFunny how the \"Facts don't care about feelings\" - brigade is always the first to bitch about everything while providing facts for nothing.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltotzhf/",
              "created": 1729866867,
              "depth": 2,
              "replies": [
                {
                  "id": "ltounc7",
                  "score": -26,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltounc7/",
                  "created": 1729867076,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltovlwu",
                      "score": 13,
                      "body": "I didn't gloss over it because you obviously don't understand how the process works.\n\n[https://www.brookings.edu/articles/how-did-kamala-harris-wrap-up-the-democratic-nomination-in-32-hours/](https://www.brookings.edu/articles/how-did-kamala-harris-wrap-up-the-democratic-nomination-in-32-hours/)",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltovlwu/",
                      "created": 1729867378,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ltp3xra",
                      "score": 6,
                      "body": "She didn’t appear out of thin air, she’s the fucking vice president *right now*. Her name was literally printed on the general election ballot in 2020.",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp3xra/",
                      "created": 1729869954,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltosqrn",
              "score": 11,
              "body": "Deprogram bro, you're supporting what will go down as the worlds most successful con man. So he got you. It's ok, happened to millions of people.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltosqrn/",
              "created": 1729866468,
              "depth": 2,
              "replies": [
                {
                  "id": "ltou05t",
                  "score": -22,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltou05t/",
                  "created": 1729866873,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltovk7y",
                      "score": 12,
                      "body": "Wtf are you smoking. Primaries are not elections and are not required under any law. You've been suckered in to right wing propaganda even AFTER they spent months calling for biden to drop out. Once he dropped, they cooked up the bullshit you're vomiting here. Get real man. Nobody is buying your crap.",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltovk7y/",
                      "created": 1729867363,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltoywv9",
                          "score": 7,
                          "body": "Exactly. I just wanted to hear this \"Non Trump voter\" actually say it. Not surprised he wont.",
                          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoywv9/",
                          "created": 1729868394,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ltovl90",
                      "score": 3,
                      "body": "Care to elaborate on that, old man?",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltovl90/",
                      "created": 1729867372,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ltoz5rv",
                      "score": -3,
                      "body": "You're spot on man. Fuck Trump. Fuck Harris. Fuck Biden.",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoz5rv/",
                      "created": 1729868472,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ltojk9w",
      "score": 33,
      "body": "> Does this not scare the hell out of you guys?\n\n\nNope. When other people panic is when I make money.",
      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltojk9w/",
      "created": 1729863389,
      "depth": 0,
      "replies": [
        {
          "id": "ltoklhh",
          "score": 11,
          "body": "But how long can you make money before the house of cards comes down?",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoklhh/",
          "created": 1729863753,
          "depth": 1,
          "replies": [
            {
              "id": "ltp10t7",
              "score": 16,
              "body": "People that 20 year or 30 year treasuries when yields blew past 5% last year are doing very well.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp10t7/",
              "created": 1729869052,
              "depth": 2,
              "replies": [
                {
                  "id": "ltp29ei",
                  "score": 0,
                  "body": "I added to tlt in the mid 80’s, but my dca is higher than the spot.",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp29ei/",
                  "created": 1729869439,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ltomjr7",
              "score": 29,
              "body": "I’m genuinely curious what “the house of cards comes down” means and looks like to you?",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltomjr7/",
              "created": 1729864416,
              "depth": 2,
              "replies": [
                {
                  "id": "ltp7q5o",
                  "score": 23,
                  "body": "If Trump wins, he will absolutely ratfck Europe and NATO - and that directly leads to China blockading then invading Taiwan with a few years. \n\nYou'll find out what it looks like then.",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp7q5o/",
                  "created": 1729871112,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ltooqon",
                  "score": -12,
                  "body": "We’d have to look at other countries that have gone off fiscal cliffs and I haven’t studied up on that yet, honestly thought we had more time. If there are no buyers of our debt we have to spend much less, obviously our GDP would decline. \n\nRay Dalio has a great book on the subject, but I stopped reading it a couple years ago because it’s easier to be a perma bull. It might be time to revisit.\n\n\n\nhttps://en.wikipedia.org/wiki/European_debt_crisis",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltooqon/",
                  "created": 1729865146,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltor0et",
                      "score": 27,
                      "body": "Dalio sucks at investing. His funds underperform.\n\nIf you want to have the wrong analysis then look at the EU debt crisis for individual countries who cannot print their own currency. That is an entirely different scenario.\n\nIf you want a better idea of US dollar based securities then look at the stock markets in debt spiral countries that print their own money. In local currency, the assets crash up and melt up. The crash is a crash up in rising prices of stocks in local currency.",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltor0et/",
                      "created": 1729865901,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ltoqow5",
                      "score": 11,
                      "body": "Like another user mentioned, we may have a Gilt moment like the UK did. This in no way indicates the \"house of cards comes down.\" \n\nLast time I checked the UK is still there and doing fine.",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoqow5/",
                      "created": 1729865796,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltorj3x",
                          "score": -1,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltorj3x/",
                          "created": 1729866073,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltottba",
                              "score": 5,
                              "body": "Agreed. No one person or their policies is the country. Maybe I’m just an optimist, but I think there are too many good people in this country to let the country just collapse. People will find a way to come together and help take care of each other. Look at the response after 9/11 honestly.",
                              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltottba/",
                              "created": 1729866812,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ltp1f6k",
                          "score": -4,
                          "body": "UK didn't have a fascist crisis like we are about to.",
                          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp1f6k/",
                          "created": 1729869175,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ltothz9",
                      "score": 2,
                      "body": "I’m curious on your comment that bears don’t make money. Can you expand on that what you mean? I disagree but before I comment, I’m curious more on what you meant by that.",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltothz9/",
                      "created": 1729866711,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltouc83",
                          "score": 5,
                          "body": "I’m not a short seller except volatility, Tesla a few mins ago. Bears can make money, but at the point I flipped to a perma bull buying dips more than a decade ago it’s all been easier.",
                          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltouc83/",
                          "created": 1729866980,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltovlqc",
                              "score": 4,
                              "body": "You understand though you don’t get big bills without the bear though right? Because the. You don’t have the dips to buy either. I don’t want a world where it’s all bull or all bear. Bears make you money in the fact you can buy the dips alone.",
                              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltovlqc/",
                              "created": 1729867377,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ltowkz8",
                                  "score": 1,
                                  "body": "I’m not hating on bears, short sellers sniff out fraud and are mostly a positive for society. Now when we were all shorting the banks in 07 it wasn’t necessarily great for mankind.",
                                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltowkz8/",
                                  "created": 1729867680,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltoy9tu",
              "score": 3,
              "body": "I can and will make money year over year. What does \"the house of cards comes down\" mean? Do you think the entire market is going to just collapse?\n\n\n\nThe world will keep on turning regardless who wins. Just like it always has. People will still consume. Tech will still advance. Banks will still want to make money - so they'll lend money. Ships will sail. Planes will fly. \n\n\nThere is always an industry making gains.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoy9tu/",
              "created": 1729868198,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltourgx",
              "score": -5,
              "body": "Trump won't win.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltourgx/",
              "created": 1729867112,
              "depth": 2,
              "replies": [
                {
                  "id": "ltov1mc",
                  "score": 16,
                  "body": "They said that in 2016",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltov1mc/",
                  "created": 1729867201,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltovhea",
                      "score": 7,
                      "body": "Well, now they are say exactly the other thing, aren't they?\n\nNo Democrat or independent will be complacent and not voting because they know how terrible Trump is.",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltovhea/",
                      "created": 1729867339,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltozbxl",
                          "score": 13,
                          "body": "Maybe. But he's gaining in demographics he didn't have his first two elections.  I think this will be closer than the Joe Biden election.",
                          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltozbxl/",
                          "created": 1729868526,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltoznmn",
                              "score": 1,
                              "body": "That is a thing we need to see.\n\nThe polls are too ilogical for me to belive.\n\nAmericans are not that stupid.",
                              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoznmn/",
                              "created": 1729868627,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ltp4sr6",
                                  "score": 22,
                                  "body": "\"Americans are not that stupid.\"\n\n  \nI used to believe this about 20 years ago, but I've lost all faith in us since then. Hope you're right.",
                                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp4sr6/",
                                  "created": 1729870218,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ltopxjk",
      "score": 22,
      "body": "Ah yes, because we are being so prudent about the deficit currently. It's not like deficits are going up by a trillion $ every quarter already.",
      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltopxjk/",
      "created": 1729865543,
      "depth": 0,
      "replies": [
        {
          "id": "ltp56oh",
          "score": 41,
          "body": "Hitting the wall at 40 mph is bad enough.  You certainly don't want to hit it at 80 mph instead.",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp56oh/",
          "created": 1729870337,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltp7f4q",
          "score": 10,
          "body": "The deficit is extremely high by design, it’s a way to filter public money into the hands of rich debt holders in the private sector through bond payments.",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp7f4q/",
          "created": 1729871019,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltoutlg",
      "score": -5,
      "body": "Yeah let’s pretend like we don’t have a debt and deficit issue already lmao. Gotta love the media spin!",
      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoutlg/",
      "created": 1729867130,
      "depth": 0,
      "replies": [
        {
          "id": "ltp5bfs",
          "score": 27,
          "body": "Doesn't mean Trump won't make it even worse. Do you want the deficit to be a little fucked, or super fucked?",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp5bfs/",
          "created": 1729870378,
          "depth": 1,
          "replies": [
            {
              "id": "ltp74gc",
              "score": -32,
              "body": "I quite frankly don’t believe these estimates as they are really just looking at revenue streams rather than expense control. \n\nJD Vance has already proposed a few simple ways we can slash hundreds of billions from the federal budget. Kamala has provided no such solutions, other than to increase revenue.\n\nWe have a spending issue at the federal level and multiple agencies need to be shrunk or defunded. Kamala isn’t talking about any of that.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp74gc/",
              "created": 1729870930,
              "depth": 2,
              "replies": [
                {
                  "id": "ltp7q6h",
                  "score": 38,
                  "body": "Historically, including under Trump, Democrat administrations have lower deficits: https://www.politifact.com/factchecks/2019/jul/29/tweets/republican-presidents-democrats-contribute-deficit/",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp7q6h/",
                  "created": 1729871112,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltp8bxs",
                      "score": -34,
                      "body": "I understand that, because Trump cut revenue and didn’t do anything about spending. This time around he is talking about cutting spending. We will see if he actually does it (assuming he wins)",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp8bxs/",
                      "created": 1729871294,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltp9hhj",
                          "score": 40,
                          "body": "Most economists have stated that Trump's economic plan will be worse for the deficit than Harris, and the WSJ has an article detailing why his plans could increase the deficit twice as much as Harris: https://www.wsj.com/politics/elections/trump-plan-boosts-budget-deficits-by-7-5-trillion-double-harris-proposal-526effd2",
                          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp9hhj/",
                          "created": 1729871643,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ltomfxl",
      "score": -36,
      "body": "Weren’t these the same economists who told us that Biden spending wouldn’t add to inflation?",
      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltomfxl/",
      "created": 1729864380,
      "depth": 0,
      "replies": [
        {
          "id": "ltoxah7",
          "score": 21,
          "body": "How could Biden do this to us? \n\nhttps://cdn.cnn.com/cnnnext/dam/assets/200420095159-stimulus-check-large-169.jpg",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoxah7/",
          "created": 1729867897,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltonuqy",
          "score": 32,
          "body": "The inflation was caused by worldwide supply chain disruptions along with an increase in money supply. Which wasn’t just Biden. Trump added $7.8 Billion during his presidency, including a deficit of $3.1 Trillion in 2020 alone. You can’t just blame Biden for inflation. ",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltonuqy/",
          "created": 1729864850,
          "depth": 1,
          "replies": [
            {
              "id": "ltp0bc9",
              "score": -23,
              "body": "Biden, like other world “leaders” kept things shut down much longer than they needed to be.  Trump actually opposed shutting everything down but agreed reluctantly to a three month shutdown to “flatten the curve” so as not to overwhelm hospitals.  But Biden and Democrats kept changing the goal posts.  They shut everything down for so long that basic goods were in short supply.  It was clear very early that Covid was not a health threat to young healthy people.  But the Biden administration colluded with CDC and media to obscure that fact and keep the hysteria going.  Thank Trump for getting the vaccine fast tracked.  He gambled and spent government money to mass produce vaccines that were showing promising results.  Normally mass production would have followed month of further evaluations because it is expensive to ramp production if you aren’t 100% certain you can ship a drug.  Trump had that testing going in parallel to cut the time line.  Trump also got ridiculed as a racist when he said he wanted to block travel from China where Covid originated.  But that was also a sensible approach in the early stages of the pandemic.  The Democrats locking down all travel later after the virus had gone worldwide made no sense.  \n\nIn short, Trump did a much better job handling Covid than the Democrats did after he left office.  There would not be the level of inflation we experienced if Trump had been elected in 2020.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp0bc9/",
              "created": 1729868831,
              "depth": 2,
              "replies": [
                {
                  "id": "ltp0vcz",
                  "score": 21,
                  "body": "Trump did not do better handling Covid. Hundreds of thousands of people died. He sent masks to Putin when they were needed in the US. He often tried to hide the numbers of how bad covid was.  He “joked” about injecting bleach to cure covid. He suggested using horse dewormer to cure it. Both were very dangerous lies. ",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp0vcz/",
                  "created": 1729869005,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ltp20bh",
              "score": -10,
              "body": "> The inflation was caused by worldwide supply chain disruptions along with an increase in money supply. \n\nAren't you ignoring the demand impact of fiscal policy? Trillions of dollars were spent on stimulus programs which increased demand, which pushed supply chains to their limit.\n\nOther developed countries with similar monetary policy didn't experience the same levels of inflation as we did.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp20bh/",
              "created": 1729869359,
              "depth": 2,
              "replies": [
                {
                  "id": "ltp2qa7",
                  "score": 11,
                  "body": "Yes there was a large demand impact too, but that was the result of people getting a lot more money. All things considered, we still fared better than most countries.",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp2qa7/",
                  "created": 1729869584,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltp3wnv",
                      "score": -4,
                      "body": "I think that is only true if you include developing countries with historically unstable currencies. When you take into context the US dollar's historical strength, what happened the past few years is an absolute failure. We had not seen inflation that bad since the 70's.\n\nThe main issue was fiscal policy went too far. The third round of stimulus was entirely unnecessary as the economy was already recovering quickly.\n\nMoney supply is not the only factor in inflation, velocity of money is another factor. Stimulus programs significantly increase the velocity of money.\n\n\nThen there is the \"inflation reduction act\" which was an absolute genius marketing ploy. The net effect of the inflation reduction act was to add to inflation, because it increased demand with its spending and incentives for private entities to spend on things like renewable energy. But because inflation was already trending down due to stimulus programs expiring, it created the perception that the \"inflation reduction act\" actually reduced inflation.",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp3wnv/",
                      "created": 1729869945,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltp4ebb",
                          "score": 8,
                          "body": "The inflation reduction act was a dumb name. But it also didn’t *increase* inflation ",
                          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp4ebb/",
                          "created": 1729870095,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ltp3t54",
                  "score": -3,
                  "body": "That was a secondary effect.  Supply chains were disrupted by the prolonged shutdown.  The government printed money to help the people it put out of work and all the small businesses it destroyed.  The lockdown lasted 10x longer than it needed to, that was the primary problem.",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp3t54/",
                  "created": 1729869915,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ltonww4",
          "score": 28,
          "body": "In his 4 years, Trump added more to the deficit than any other President. \n\n\nBiden wasn't in office long enough to cause the inflation that began to hit in 2021/2022. It's almost like the effects of the previous 4 years began to appear.\n\n\nNow it's 2024 and the U.S. has cooled inflation and gotten itself to a better position economically that most of the rest of the world in the post-covid era.",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltonww4/",
          "created": 1729864870,
          "depth": 1,
          "replies": [
            {
              "id": "ltoot2c",
              "score": 15,
              "body": "I remember the stimulus package Trump gave, it seemed like he was buying votes. It was at a time while the economy was hot and it seemed like we should have been paying down the national debt because it was only going to go up when a recession came.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoot2c/",
              "created": 1729865169,
              "depth": 2,
              "replies": [
                {
                  "id": "ltoshav",
                  "score": 16,
                  "body": "He absolutely was. He insisted on mailing out symbolic checks with his signature prominently displayed, even though physical checks didn't need to be mailed for the vast majority of Americans.",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoshav/",
                  "created": 1729866381,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lton8q2",
          "score": 17,
          "body": "It didn’t, or at least not as much as other countries saw. The US did very well compared to most others, thanks to Biden.",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/lton8q2/",
          "created": 1729864646,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltomoi9",
          "score": 29,
          "body": "Inflation was worldwide except a few select countries because of Covid helicopter money. One could argue the infrastructure package added to inflation, but it wasn’t the primary catalyst.",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltomoi9/",
          "created": 1729864460,
          "depth": 1,
          "replies": [
            {
              "id": "lton19d",
              "score": -55,
              "body": "So tired of this BS argument because it’s not true. This gaslighting is exactly why Trump is gaining in the polls and will likely win.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/lton19d/",
              "created": 1729864576,
              "depth": 2,
              "replies": [
                {
                  "id": "ltonlel",
                  "score": 42,
                  "body": "Trumps government ran a larger single year deficit than Biden and trump increased the deficit every year he was in office (increasing it from Obama levels). How is bidens spending the only problem? Trump also negotiated a deal with OPEC in 2020 to raise oil prices resulting in the highest oil prices ever causing the spike in energy costs. But somehow it's bidens fault?",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltonlel/",
                  "created": 1729864765,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ltoxcpf",
                  "score": 17,
                  "body": "Why isn’t it true? Because Trump and the republicans told you so?",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoxcpf/",
                  "created": 1729867917,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ltoi6nw",
      "score": -23,
      "body": "Why ?  He’ll never win !",
      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoi6nw/",
      "created": 1729862900,
      "depth": 0,
      "replies": [
        {
          "id": "ltonqo7",
          "score": 8,
          "body": "The numbers unfortunately are pointing to him winning right now. That’s why there’s been so much activity happening with rates and bonds.",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltonqo7/",
          "created": 1729864813,
          "depth": 1,
          "replies": [
            {
              "id": "ltov61d",
              "score": 5,
              "body": "Not necessarily.\n\nSo many partisan polls flood the zone cannot change some facts about his terrible campaign and mental decline.\n\nAlso, it is very unlikely for the incumbent part to lose with a strong economy and job market.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltov61d/",
              "created": 1729867239,
              "depth": 2,
              "replies": [
                {
                  "id": "ltp1mhh",
                  "score": -10,
                  "body": "Betting markets have him at a 65% probability of winning- if you are certain why not bet on it? You nearly 3x your money if you are right.\n\nThe economy is one of the Harris' campaign weak points. It's one of the only things keeping Trump in the race. The other is spreading fear about crime/immigration. We just dealt with 3 years of massive inflation, and prices haven't come down, but unemployment is now rising. \n\nIf Trump wasn't such an unlikeable person(past allegations, divisive statements, etc), he would win in a landslide.",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp1mhh/",
                  "created": 1729869237,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltp2u0i",
                      "score": 13,
                      "body": "I did.\n\nVery safe bets when considering some of the swing states.\n\nThe economy is strong, man. Don't BS us here.\n\nInflation is back at prepandemic levels, and the \"massive inflation\" lasted only one quarter in 2022.\n\nYou should also understand that PRICES NEVER GO DOWN unless there is a crisis. Prices went up under Trump and only during a couple months during the pandemic prices went down.\n\nSo, people might say the economy is not good. But most of them are due partisan or ideology influence.\n\nIf you thought Trump economy from 2017 to 2019 was good, and use the same criteria, Biden economy was even better all the away.",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp2u0i/",
                      "created": 1729869616,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltp4wl7",
                          "score": 8,
                          "body": "Every aspect of the economy is better than it was the day Biden took over. Took a long time to fix Trumps damage. This dumbass tariff plan is going to restart Trumpflation all over again.",
                          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp4wl7/",
                          "created": 1729870251,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ltp4pt7",
                          "score": -7,
                          "body": "> The economy is strong, man. Don't BS us here.\n\n1. When it comes to an election, what matters isn't how strong the economy is, but voter's perceptions about the economy. Most voters polled believe the economy is in a bad state.\n\n2. I would disagree that the economy is in a good state. Prices have risen substantially faster than median incomes, and now unemployment has been increasing. But the biggest issue is that most of the inflation has been in areas of necessities like housing. People aren't going to feel good about the economy when they have to pay 50% more on rent just because a bunch of junk they don't need is cheaper.\n\nReally, the only good thing about the US economy right now is the stock market. Investors in large tech companies, the  NASDAQ , or S&P500 have made a ton of money. But if you are a worker that isn't an investor, the economy doesn't feel very good.",
                          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp4pt7/",
                          "created": 1729870193,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltp55ui",
                              "score": 10,
                              "body": "House prices went down during the great recession of 2008-2009.\n\nDo you think the economy was strong back then and people felt happy seeing their most valuable asset losing value?",
                              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp55ui/",
                              "created": 1729870330,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ltp67aq",
                                  "score": -6,
                                  "body": "Housing  should not be an investment. The fact that homeowners collude to limit the supply of housing in their local area to inflate their property values significantly hinders economic growth and prosperity.\n\nWhat goes on with homes would be like if car owners decided they wanted limits on how many cars can be produced or imported, so that the value of their cars would increase rather than decrease.\n\nIn the case of 2008-2009, the issue wasn't homes losing value. The issue was that a surge in foreclosures combined with declining property values caused banks to fail, resulting in a substantial reduction in availability of credit, and consequently, a huge surge in unemployment.",
                                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp67aq/",
                                  "created": 1729870650,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ltp168w",
          "score": 0,
          "body": "Betting markets have him at a 65% probability of winning. If you are certain he will lose, there is a big opportunity there.",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp168w/",
          "created": 1729869098,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltoid77",
          "score": -34,
          "body": "That’s what they said the first time :-)",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoid77/",
          "created": 1729862965,
          "depth": 1,
          "replies": [
            {
              "id": "ltoijo5",
              "score": 66,
              "body": "He lost last time",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoijo5/",
              "created": 1729863027,
              "depth": 2,
              "replies": [
                {
                  "id": "ltoizz9",
                  "score": 29,
                  "body": "Apparently this'll be his 3rd term.  He runs the US from the orange house in Florida.",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoizz9/",
                  "created": 1729863190,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltoj752",
                      "score": 5,
                      "body": "Just for some half baked Republicans turned MAGA traitors",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoj752/",
                      "created": 1729863261,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ltotxxt",
                  "score": -12,
                  "body": "I’m pretty sure they were talking about 2016 which he did win.\n\nIf you are saying he didn’t in 2016, then you are as bad as he is saying he won 2020.",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltotxxt/",
                  "created": 1729866853,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltoxga9",
                      "score": 12,
                      "body": "They might have been thinking about 2016 but that's not what they said.",
                      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoxga9/",
                      "created": 1729867948,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltp00sm",
                          "score": -5,
                          "body": "I might be wrong, but I don’t think in 2020 they were saying he would never win. He was the president. In 2016 is when they were saying “he would never win”. So saying that’s not what he said I don’t think is true. I think he was responding honestly to the last time they were saying “he would never win”. So really it is what he was saying. \n\nHe didn’t said the last time he ran. He said last time they were saying people were saying he will never win.",
                          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp00sm/",
                          "created": 1729868741,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltp7t13",
                              "score": 6,
                              "body": "Okay whatever, this is a silly argument.",
                              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltp7t13/",
                              "created": 1729871136,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ltoile5",
      "score": -55,
      "body": "lol he’s gonna win … bigly \nIt’s gonna be the most beautiful win that you’ve ever seen!",
      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoile5/",
      "created": 1729863045,
      "depth": 0,
      "replies": [
        {
          "id": "ltoneft",
          "score": 21,
          "body": "How can he win if you claim everything is rigged?",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoneft/",
          "created": 1729864699,
          "depth": 1,
          "replies": [
            {
              "id": "ltougs4",
              "score": 8,
              "body": "Pretty sure he was joking using sarcasm and saying it like Trump would.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltougs4/",
              "created": 1729867019,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltoj1is",
          "score": 11,
          "body": "Doubt.",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoj1is/",
          "created": 1729863206,
          "depth": 1,
          "replies": [
            {
              "id": "lton9zt",
              "score": 15,
              "body": "Vote.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/lton9zt/",
              "created": 1729864658,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltorcmq",
              "score": -4,
              "body": "lol damn people can’t take a joke … must be a sensitive subject 😂",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltorcmq/",
              "created": 1729866013,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltowbu3",
          "score": 0,
          "body": "Is delusion fun?",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltowbu3/",
          "created": 1729867602,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltosamo",
      "score": -3,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltosamo/",
      "created": 1729866321,
      "depth": 0,
      "replies": [
        {
          "id": "ltoua4d",
          "score": 8,
          "body": "The first one will affect everyone in the country. The second will only affect those who are worth $100 million or more.",
          "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoua4d/",
          "created": 1729866961,
          "depth": 1,
          "replies": [
            {
              "id": "ltoun1s",
              "score": 3,
              "body": "And Congress would never pass legislation on the second one. Cuban even told her that’s dumb, she didn’t understand the repercussions.",
              "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltoun1s/",
              "created": 1729867073,
              "depth": 2,
              "replies": [
                {
                  "id": "ltow6gq",
                  "score": 2,
                  "body": "It's unfeasible and the rich will just find other loopholes to use",
                  "permalink": "/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/ltow6gq/",
                  "created": 1729867556,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}