{
  "title": "Texas Roadhouse, Inc. Announces Third Quarter 2024 Results",
  "score": 114,
  "selftext": "Results for the 13 weeks ended September 24, 2024, as compared to the prior year as applicable, included the following:\n\nComparable restaurant sales increased 8.5% at company restaurants and increased 7.2% at domestic franchise restaurants\n\nAverage weekly sales at company restaurants were $149,176 of which $18,914 were to-go sales as compared to average weekly sales of $138,668 of which $17,058 were to-go sales in the prior year\n\nRestaurant margin dollars increased 24.1% to $202.1 million from $162.8 million in the prior year primarily due to higher sales. Restaurant margin, as a percentage of restaurant and other sales, increased to 16.0% from 14.6% in the prior year driven primarily by higher sales. The benefit of a higher average guest check and improved labor productivity more than offset wage and other labor inflation of 4.7% and commodity inflation of 1.3%\n\nDiluted earnings per share increased 32.5% primarily driven by higher restaurant margin dollars partially offset by higher general and administrative expenses and higher depreciation and amortization expenses\n\nSeven company restaurants and three franchise restaurants were opened\n\nCapital allocation spend included capital expenditures of $91.1 million, dividends of $40.7 million, and repurchases of common stock of $9.6 million.\n\nJerry Morgan, Chief Executive Officer of Texas Roadhouse, Inc. commented, “We are extremely pleased in such a competitive environment to report another quarter of continued traffic growth at each of our brands. This is a credit to the hard work of our operators who create an environment where Roadies want to work and guests want to dine.”\n\nMorgan continued, “Looking ahead to 2025, we once again have a strong development pipeline and as of today already have 10 of our new company restaurants under construction. We remain confident that this new store growth along with our planned franchise acquisition and overall capital allocation strategy will allow us to continue to generate long-term shareholder value.”\n\nThe Company has tentatively agreed to acquire 13 domestic franchise restaurants with a targeted close date as of the beginning of our 2025 fiscal year. These acquisitions are subject to the completion of customary negotiations and due diligence.\n\nhttps://finance.yahoo.com/news/texas-roadhouse-inc-announces-third-200300244.html",
  "link_flair_text": "Company News",
  "id": "1gc7yhd",
  "num_comments": 56,
  "created_utc": 1729899454,
  "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/",
  "comments": [
    {
      "id": "ltskdyr",
      "score": 55,
      "body": "I don’t think you can get a better steak at that price point.",
      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltskdyr/",
      "created": 1729912122,
      "depth": 0,
      "replies": [
        {
          "id": "lttg9qr",
          "score": 13,
          "body": "I can make it better at home easy for half the cost.",
          "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/lttg9qr/",
          "created": 1729928370,
          "depth": 1,
          "replies": [
            {
              "id": "ltu6l15",
              "score": 14,
              "body": "Downvotes?\n\n1. Buy $45-55 steak from quality butcher or grocery store. Not bullshit “choice wagyu” but a nicely marbled steak.\n\n2. Heavily salt and pepper and leave uncovered in the fridge for 2-4 hours.\n\n3. Take out of fridge and let come to room temperature for an hour.\n\n4. Bake in oven as low as your oven will go, like 240F and place steak on wire rack and bake until it hits an internal temp of 125-135 (personal preference and cut dependent)\n\n5. Take out of oven and put cask iron on stove top, get it ripping hot…  and then sear each side of steak for 60 seconds… the pan should be hot enough that the steak browns, not grays.\n\n6. Let rest 10min, may add finishing salt.\n\nLearn how to properly season a steak and the reverse sear method for cooking and then spend $50 on the steak instead of $50-75 at a restaurant and the difference will be mind blowing… home cooked will win 100% of the time.",
              "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltu6l15/",
              "created": 1729944191,
              "depth": 2,
              "replies": [
                {
                  "id": "ltuav2n",
                  "score": 45,
                  "body": "Or for $35 I can get a nice quality steak, two sides, and some rolls with cinnamon butter.",
                  "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltuav2n/",
                  "created": 1729946140,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltvmj0n",
                      "score": 2,
                      "body": "Does that include tips and taxes?",
                      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltvmj0n/",
                      "created": 1729963015,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "luj8xnv",
                          "score": 1,
                          "body": "Unless their prices have changed since I went last year, yes.",
                          "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/luj8xnv/",
                          "created": 1730301488,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lu39sm0",
                          "score": -5,
                          "body": "just don't tip?",
                          "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/lu39sm0/",
                          "created": 1730070747,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lu5zy57",
                              "score": 2,
                              "body": "I wish so badly that tipping culture in the US dried up and died.",
                              "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/lu5zy57/",
                              "created": 1730119022,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lu82hku",
                                  "score": 2,
                                  "body": "Maybe you should tell that to companies who complain about having to pay their tipped staff even 7.25 lol",
                                  "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/lu82hku/",
                                  "created": 1730142607,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lu8a6i9",
                                      "score": 1,
                                      "body": "Tips as wages is such a ridiculous scam and all those laws should be undone",
                                      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/lu8a6i9/",
                                      "created": 1730144924,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ltvc4j0",
                      "score": -2,
                      "body": "I’m not trying to be a jerk but Texas Roadhouse isn’t what I’d call “nice” steak.\n\nIt’s edible, it’s not slop, but it’s not top tier or anything.",
                      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltvc4j0/",
                      "created": 1729959618,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ltudbmf",
                      "score": -12,
                      "body": "For $35, you are paying $10 for 8oz of choice steak, $5 for potatoes and asparagus, $1 for flour and cinnamon butter, and then $19 for labor, operating expenses, and margin…\n\nI am not trying to knock Texas Roadhouse, but the idea that you can get a better steak at a restaurant than you can make at home for the same price is simply ridiculous because of basic economics…Less than half of what you are spending at a restaurant generally goes to food cost… you can spend the same amount on a higher quality steak and cook at home.\n\nIf its not convenient, if you lack the technical cookery.. both are very valid reasons to go to a restaurant and order a steak… I did earlier this month! But don’t kid yourself that its the best steak that can be had at that price point.\n\nEdit: would any of the downvoters like to explain why I am wrong?",
                      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltudbmf/",
                      "created": 1729947185,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltuoch5",
                          "score": 4,
                          "body": "I don’t know if the price varies based on your location which could be the case. However based on the downvotes and my location the prices you’re mentioning are just wrong. I am on the Texas Roadhouse app. I can get a 14oz Fort Worth Ribeye, a side fries, a side of green beans, and bag of rolls with cinnamon butter for $29.44 right now. That doesn’t include tip though but assuming around a $5.00-$7.00 tip its about at the price of what I said before.\n\nSo I would say all things included thats really good value for a good quality steak meal.",
                          "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltuoch5/",
                          "created": 1729951466,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltv1g7q",
                              "score": 1,
                              "body": "I don’t disagree with the value proposition.. i was replying to a comment chain that started with the notion that you couldn’t get a better steak at that price point… just saying reverse sear is easy to learn and will produce a better steak at the same price point as going to a restaurant. Its not commentary on Texas Roadhouse…",
                              "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltv1g7q/",
                              "created": 1729956086,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ltv8398",
                                  "score": 3,
                                  "body": "I don’t think thats the problem and more so the way you’re communicating it. Everybody knows you can go to your local butcher and buy a $40-$50 steak and it’s going to be better quality. It’s the fact that I can just go to Texas Roadhouse and get a full blown steak meal for way cheaper than that. The steak there is not bad quality at all either.  Is it as good as a home cooked one on the grill? Obviously not but it’s cheap and it’s still good quality. Thats the point. \n\nAlso you were arguing the value point cause you said you can do better for cheaper than proceeded to say you can go to a local butcher and buy a steak for $45-$55 which is not even close to being cheaper than Texas Roadhouse.",
                                  "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltv8398/",
                                  "created": 1729958285,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ltvxxyw",
                  "score": 4,
                  "body": "you don't need a 50 dollar steak to enjoy steak.",
                  "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltvxxyw/",
                  "created": 1729966762,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ltujf9o",
                  "score": 5,
                  "body": "125-135 to pull from.oven will lead to medium+ - med well\n\n\nAlso you don't need to let them rest for long since you cooked at a low temp ",
                  "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltujf9o/",
                  "created": 1729949572,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltumkvz",
                      "score": 2,
                      "body": "Pull at 125, and you should end up with medium rare, or a final internal temp of about 130 after carry over and searing unless you are trying to sear the steak on a 325 degree cast iron and it takes 2min a side on your already cooked steak to get a crust… or if you take it out of the oven and put it straight into the cask iron without it resting or cooling a bit in between.",
                      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltumkvz/",
                      "created": 1729950793,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltutdom",
                          "score": 1,
                          "body": "Cast. It's a CAST iron pan.",
                          "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltutdom/",
                          "created": 1729953307,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ltvjyxi",
                  "score": 1,
                  "body": "Try sous vide. Much easier",
                  "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltvjyxi/",
                  "created": 1729962178,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltwid0w",
                      "score": 2,
                      "body": "Plus you can buy cheaper cuts and still have a pretty good end product.  Seasoned tri-tip at 132 for 3 hours followed by an ice bath and quick sear is a household fave.",
                      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltwid0w/",
                      "created": 1729973471,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ltxex12",
                      "score": 1,
                      "body": "I own an immersion circulator and am a big fan of cooking sous vide…\n\nFor steak, I believe that reverse searing is superior to sous vide because the hot oven dries the outside of steak, resulting in an amazing sear… sous vide, steaks end up soaking in their juices and i find it generally harder to get a good sear and maintain good seasoning because drying the steak before searing with paper towel messes with the seasoning.",
                      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltxex12/",
                      "created": 1729984821,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltxi7ag",
                          "score": 1,
                          "body": "Fair, I do find that point valid. Since after the releasing it from the vacuum bag it is very moist and have to either (wait) or (pat it dry) which does mess up with that seasoning.",
                          "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltxi7ag/",
                          "created": 1729986056,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltxjsmc",
                              "score": 1,
                              "body": "Sous vide is my favorite method for pork loin and other leaner meats like venison.",
                              "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltxjsmc/",
                              "created": 1729986651,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ltxvgl8",
                      "score": 1,
                      "body": "You can even get crappy steaks to taste good with this.",
                      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltxvgl8/",
                      "created": 1729991144,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ltu91hv",
                  "score": -5,
                  "body": "Thank you. Clearly this place is filled with Texas Roadhouse fanboys.",
                  "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltu91hv/",
                  "created": 1729945328,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltubuax",
                      "score": -9,
                      "body": "I like beef, but it is terrible from an energy efficiency perspective and pretty terrible for the environment.\n\nEat less red meat. Eat better quality red meat when you do indulge.\n\nA properly cooked chicken thigh or pork loin will be better than an unmarbled choice steak from a speed grown 23 month old cow anyway…\n\nI also think butcher cuts are generally underrated by Americans. A well executed skirt or flank steak can be just as enjoyable as a prime new york strip for 1/3 the price… and when it comes to choice grade steaks from mass market cattle farms, the butcher cuts are usually genuinely better than the choice grade premium cuts.",
                      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltubuax/",
                      "created": 1729946561,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltugbah",
                          "score": 1,
                          "body": "I’ve had some damn fine skirt steak when cooked properly",
                          "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltugbah/",
                          "created": 1729948391,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ltvcc7q",
                  "score": -1,
                  "body": "People that own a few hundred bucks worth of shares in Texas Roadhouse got upset because they felt like their investment decision was being insulted. It’s an ego thing.",
                  "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltvcc7q/",
                  "created": 1729959689,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ltvo80l",
                  "score": -1,
                  "body": "I think you under estimate how stupid and lazy most people are about cooking",
                  "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltvo80l/",
                  "created": 1729963567,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ltxu6sk",
          "score": 1,
          "body": "No way. Ate there three times, always have to send my steak back. Sent my potatoe soup back cause was literally cold, get it back with x3 the cheese when already had cheese like a mean joke. Wasn't good experience wouldn't go back given too many chances.",
          "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltxu6sk/",
          "created": 1729990647,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltrsp8z",
      "score": 48,
      "body": "joseph carlson 12/25",
      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltrsp8z/",
      "created": 1729901479,
      "depth": 0,
      "replies": [
        {
          "id": "lts79e1",
          "score": 21,
          "body": "He actually showed off his portfolio on screen once and I had to make sure I was reading it right. He underperforms the S&P 500.",
          "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/lts79e1/",
          "created": 1729907048,
          "depth": 1,
          "replies": [
            {
              "id": "lttbo8i",
              "score": 12,
              "body": "Nah he is crushing the market on the two portfolios he shows. He underperformed in the tech one for long mainly due to NFLX tanking but he is outperforming now that it has fully recovered.\n\nHe has had incredible timing on some of his buys like BKNG lately or CMG last year. I am glad to have followed him on TXRH.\n\nI feel like he overpays for some companies sometimes but only time will tell if he was overpaying or not",
              "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/lttbo8i/",
              "created": 1729925493,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lts8orn",
              "score": 2,
              "body": "I thought majority of his portfolio was in Mag 7 though. Unless he changed portfolio the joke on him was his portfolio was just the biggest names in the index.",
              "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/lts8orn/",
              "created": 1729907599,
              "depth": 2,
              "replies": [
                {
                  "id": "ltsn8o8",
                  "score": 7,
                  "body": "He has two portfolios. His \"Story fund\" is basically Mag 7 minus Tesla and Nvidia plus one other one. He shows that one on his after hours channel.\n\nHis passive income portfolio is the other one on the main channel that he shows every time that has TXRH in it.\n\nHe sold CMG a few months and is contemplating getting back in.",
                  "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltsn8o8/",
                  "created": 1729913295,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ltslqp1",
                  "score": -2,
                  "body": "His September portfolio overview video is what I was looking at, starting around 37:19. 32% all-time return. Conveniently, he cut off the time frame, but it's definitely more than 1 year. Looks like most of it is big tech, with some \"eclectic\" large cap industrials and consumer discretionary mixed in. I really don't get his whole spiel.",
                  "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltslqp1/",
                  "created": 1729912674,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ltus5j6",
              "score": 1,
              "body": "Not true",
              "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltus5j6/",
              "created": 1729952868,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltzf8pq",
              "score": 1,
              "body": "I think you are mistaken, I remember he was underperforming SP500 during 2022 but came out swinging since.",
              "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltzf8pq/",
              "created": 1730020321,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltst1uq",
          "score": 6,
          "body": "Dude is a mediocre investor, smooth talker tho",
          "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltst1uq/",
          "created": 1729915691,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltsneip",
          "score": 3,
          "body": "Netflix is his 12/25 too.",
          "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltsneip/",
          "created": 1729913364,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltsbyio",
      "score": 31,
      "body": "Roadhouse",
      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltsbyio/",
      "created": 1729908865,
      "depth": 0,
      "replies": [
        {
          "id": "ltsfqm8",
          "score": 8,
          "body": "Ghost",
          "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltsfqm8/",
          "created": 1729910302,
          "depth": 1,
          "replies": [
            {
              "id": "ltsjs2f",
              "score": 6,
              "body": "To Wong Foo, Thanks for Everything!",
              "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltsjs2f/",
              "created": 1729911875,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltsfdyg",
      "score": 15,
      "body": "The next chipotle ? Better metrics than cava",
      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltsfdyg/",
      "created": 1729910168,
      "depth": 0,
      "replies": [
        {
          "id": "ltsgo5f",
          "score": 12,
          "body": "If youre going with Texas sized expectations, you will be disappointed. However, it is an actually good steak for wicked cheap.\n\nI don't know if chipotle is a great comparison because steak doesnt do super great for carry out. But they're definitely up and coming and good cheap steak is a winning formula",
          "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltsgo5f/",
          "created": 1729910657,
          "depth": 1,
          "replies": [
            {
              "id": "ltuaq6l",
              "score": 1,
              "body": "I do carryout from there all the time and its completely fine.",
              "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltuaq6l/",
              "created": 1729946079,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltt35c8",
          "score": 5,
          "body": "Better imo.  This is like probably the only chain steakhouse place that refuses DD/Uber because they are too busy to take any more orders.  Even high-end steakhouses with their $150 steak allow delivery service.\n\nIIRC, they even wrote on their website that they don't need your stinking online delivery order even during COVID, and go get the food yourself.",
          "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltt35c8/",
          "created": 1729920612,
          "depth": 1,
          "replies": [
            {
              "id": "lttf8qc",
              "score": 1,
              "body": "Place near me does delivery. \nRogue franchise?",
              "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/lttf8qc/",
              "created": 1729927721,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltslbj3",
      "score": 12,
      "body": "Their bone-in Dallas-Ft Worth Ribeye is one of the great deals in chain restaurant menus. Buy.",
      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltslbj3/",
      "created": 1729912502,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltsqnz2",
      "score": 5,
      "body": "Their new fast food joint, Jaggers, has a few locations in Louisville, and it's damn good. Burger meals are around $10 - $14 and it's way better than most places at that price point.",
      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltsqnz2/",
      "created": 1729914658,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltuu55a",
      "score": 1,
      "body": "They have genuinely good steaks for how relatively cheap they are. The only reason I have friends who go anywhere else for cheap steak is because they hate the dumb birthday yeehaw thing and the line dancing.",
      "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/ltuu55a/",
      "created": 1729953579,
      "depth": 0,
      "replies": [
        {
          "id": "lty9i7s",
          "score": 1,
          "body": "We never encounter the line dancing. The birthday we sometimes see but as long as it’s not happening to us we don’t care",
          "permalink": "/r/stocks/comments/1gc7yhd/texas_roadhouse_inc_announces_third_quarter_2024/lty9i7s/",
          "created": 1729996705,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}