{
  "title": "Do you ever look back at old r/stocks topics and wonder what people decided to do? Or how they feel about their takes ending up being right.",
  "score": 61,
  "selftext": "Or if the hot take was wrong? The reddit upvote system tends to favor saying what is popular that day. So a lot of threads become time capsules into a different area of thinking. One example were all those shorting NVDA threads on this sub in mid 2023 like this thread\n\n[https://www.reddit.com/r/stocks/comments/13lki8i/is\\_there\\_potential\\_to\\_short\\_nvda/](https://www.reddit.com/r/stocks/comments/13lki8i/is_there_potential_to_short_nvda/)\n\nStock was at $31 split adjusted back then and people were saying time to short. Wonder how they feel with stock being higher.",
  "link_flair_text": null,
  "id": "1gcndoc",
  "num_comments": 44,
  "created_utc": 1729955927,
  "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/",
  "comments": [
    {
      "id": "ltv2vit",
      "score": 73,
      "body": "This sub is a horrible place to be during a bear market. The 2022 bear market had so many great buying opportunities META at 90. PLTR at 7. CVNA in the 5-10 range. There was so many chances to make life changing money but if a stock is down 40-80% off its all time high the negativity increases. It becomes hard to try discussing it as a buying oppurtunity. It isnt until stocks are ATH does it become more accepted to say you bought in the dark times.  \n\nThen there are those random stock threads where it is like if they held they probably millionaires or at least had life changing money. Like this [SHOP thread](https://www.reddit.com/r/stocks/comments/6ak1am/i_did_it_finally_broke_even/) from May 2017. That Redditor was stressing over breaking even on SHOP at $9. Shop went up to the 160s in 2021. Even in 2024 at time of the post stock is at $79.",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltv2vit/",
      "created": 1729956564,
      "depth": 0,
      "replies": [
        {
          "id": "ltvmycg",
          "score": 25,
          "body": "Some companies never recover. Just look at FUBO, UPST, ARKK, etc.",
          "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltvmycg/",
          "created": 1729963154,
          "depth": 1,
          "replies": [
            {
              "id": "ltvukla",
              "score": 16,
              "body": "2021 was the peak of a speculative bubble brought about by government stimulus and resurgent optimism once people realized COVID didn't signal the end of the world. A lot of trash companies with no revenues and no earnings shot to the stratosphere, and those never recovered once the top was in. But the decline brought down a ton of great companies temporarily too.",
              "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltvukla/",
              "created": 1729965639,
              "depth": 2,
              "replies": [
                {
                  "id": "ltvw3zq",
                  "score": 6,
                  "body": "EV and weed was the vibe in 21..and meme stocks unfortunately",
                  "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltvw3zq/",
                  "created": 1729966154,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltvwq9k",
                      "score": 9,
                      "body": "There was also the SPAC boom, fin tech and speculative small cap tech ventures.",
                      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltvwq9k/",
                      "created": 1729966360,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lty0bjn",
                          "score": 3,
                          "body": "Spac boom was actually fun..for a little there it seemed like a no brainer move with how many were merging",
                          "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/lty0bjn/",
                          "created": 1729993040,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltwn659",
              "score": 3,
              "body": "I wouldn't be so quick to rule UPST out.",
              "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltwn659/",
              "created": 1729975036,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltvqib3",
          "score": 19,
          "body": "This sub is also horrible during bull markets",
          "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltvqib3/",
          "created": 1729964305,
          "depth": 1,
          "replies": [
            {
              "id": "ltwj09r",
              "score": 3,
              "body": "Well it makes for a good litmus test",
              "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltwj09r/",
              "created": 1729973681,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltwa5cy",
          "score": 3,
          "body": "Great comment and totally right. I'm just hoping that the next time we get bearish I have the wisdom to do a bit more research and maybe take a bit more risks while everyone's fearful.",
          "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltwa5cy/",
          "created": 1729970787,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltvv46o",
          "score": 2,
          "body": "CVNA was a bad investment back then. It only started to become sustainably profitable near the end of 2023, which required a complete overhaul of its operational blueprint.",
          "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltvv46o/",
          "created": 1729965823,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltwyzm8",
          "score": 2,
          "body": "I also find myself not in a position to buy more shares in a bear market. I get laid off or just don't have any extra income.",
          "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltwyzm8/",
          "created": 1729978948,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltvgss4",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltvgss4/",
          "created": 1729961151,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltvbz33",
      "score": 23,
      "body": "I think about this sub saying $META was done for at $90 a lot. The only use for this sub is inverse the most confident posters and commenters bc they are all dumb af and clueless.",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltvbz33/",
      "created": 1729959567,
      "depth": 0,
      "replies": [
        {
          "id": "ltwjdfl",
          "score": 7,
          "body": "At the time Meta was burning 10s of billions on VR that was very far from its core business and it didn’t show any signs of shifting that course even changing its name. Made sense that there would be a pullback. Went back up when they shifted course. I bought some on Monesh”s call that it was an easy double. Wish I bought more now but at the time it didn’t seem that obvious.",
          "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltwjdfl/",
          "created": 1729973796,
          "depth": 1,
          "replies": [
            {
              "id": "ltxx1du",
              "score": 4,
              "body": "Even with that, it was still worth way above $90. At the time, the PE was 8, which is what you'd expect from XOM or another oil company.",
              "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltxx1du/",
              "created": 1729991749,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltv24rk",
      "score": 12,
      "body": "Err, the vast majority of predictions are pretty off in retrospect. Reddit is not an exception. Statistically, it makes sense because there are far more possible outcomes than events that people predict.",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltv24rk/",
      "created": 1729956316,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltvk12b",
      "score": 10,
      "body": "The one that gets me was when Netflix was $200 per share. Now it’s $754. It wasn’t even that long ago either, only a couple years. Seeing things like that really gives me hope to choose well and hold.\n\nEveryone probably has one they saw win big, or maybe someone invested $1,000 and it went well. They know if they invested $10,000 it would have gone even better. It’s all exciting and you’re right it would be good to follow up on a few of them.",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltvk12b/",
      "created": 1729962197,
      "depth": 0,
      "replies": [
        {
          "id": "lu0kd0a",
          "score": 2,
          "body": "Tbf Netflix was screwing everyone over at the time with their password sharing and subscription model changes, which led to a sharp decline in the short term. I know a friend who stressed hard because they had bought right at the peak at the time at around $680. \nIt wouldn’t be until a couple of months ago that they would break even if they just held and didn’t DCA.",
          "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/lu0kd0a/",
          "created": 1730040600,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltxbats",
      "score": 7,
      "body": "I think context matters a lot. You weren't 'wrong' if you thought META spending 10's of billions on the metaverse was bad business and decided not to buy it at ~$90. The backlash was so bad that they ended up announcing a few months later that they were changing their approach. It's entirely possible that same person thought META was a buy after they changed course.\n\nMy own opinion on SOFI has changed over the years. I thought it was highly likely that they were going bankrupt prior to their bank charter and ongoing moratorium on student loans. They were ~$20 at the time. They had a rough time for a while, but managed to stay afloat. \n\nAfter some time, the end of the moratorium was in sight, their banking platform was showing good growth, and they outlined a reasonable path to profitability. I averaged into it at ~$5.\n\nIt's now looking possible that they could hit over $1 per share profit a year by 2030. 10 years from now, the people who bought at $20 might even look justified if the growth continues. Or maybe defaults spike and they still go bankrupt, making us all look dumb.",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltxbats/",
      "created": 1729983451,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltv4w49",
      "score": 6,
      "body": "It's even funnier because they called it the market being irrational - they couldn't understand or imagine a step-change in earnings occurring, despite the obvious step-change in technology.\n\n\nFools.",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltv4w49/",
      "created": 1729957234,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltvufa3",
      "score": 6,
      "body": "I think RIVN will be one of those stocks that I'll look back at and think \"damn that was a clear buy\"",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltvufa3/",
      "created": 1729965589,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltvkcr5",
      "score": 4,
      "body": "It’s crazy to look at that post and read the comments from a year ago about Nvidia, then look at Reddit now and see how everyone did a turnaround.",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltvkcr5/",
      "created": 1729962303,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltw00dm",
      "score": 4,
      "body": "I can't back this up with numbers, but i think doing the opposite of what people say on Reddit is quite profitable.",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltw00dm/",
      "created": 1729967446,
      "depth": 0,
      "replies": [
        {
          "id": "ltymoh6",
          "score": 2,
          "body": "If Reddit says no and Nancy Pelosi says yes, go all in.",
          "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltymoh6/",
          "created": 1730002547,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lty3w1q",
      "score": 5,
      "body": "Sites like this where people are anonymous, no one is ever held accountable for really bad takes, which lowers the value of what they’re saying",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/lty3w1q/",
      "created": 1729994454,
      "depth": 0,
      "replies": [
        {
          "id": "lu7q4e6",
          "score": 2,
          "body": "To be fair even in the named analysts writing for big banks, the social influencers using their real name, and the tv pundits, there is a large percentage than has a full career in it despite having terrible record and some very bad hot takes.\n\n\nI think It's an issue in the investing field in general. Guys who make one good prediciton that one time can have a 20 year career just saying nonsense after that.\nOur team reccomended Nvidia in ye olde year 1865! But they also reccomended a total of 90 tickers over just that year and 89 did poorly.\nThen the guys who timed a market crash perfectly, become celebrities despite predicting 15 other crashes that never happened and bleeding more money on those than they made on the one they did.",
          "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/lu7q4e6/",
          "created": 1730138915,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltxj2fy",
      "score": 3,
      "body": "Yeah I have the receipts of how I was supporting NVDA when they were having a hard time on reddit.\n\nhttps://www.reddit.com/r/stocks/comments/11kyoue/nvidia_growth_in_the_future/\n\nEarly March 2023, NVDA was $23 and people were concerned about it being overvalued.\n\nI told reddit that it is speculative but when you have these conditions it's better to be an optimist than worry about valuations, that all winning companies have skeptics as they climb.\n\nI told them I'm holding because 1. All tech companies have their best returns when run under founder 2. Biggest returns come when futures are not certain, and valuations look insane and 3. Investing in mega cap companies is not too late.\n\nNVDA rallied over 500% since then. People thought NVDA was too expensive at 600B market cap.",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltxj2fy/",
      "created": 1729986378,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltvxeit",
      "score": 2,
      "body": "Im seeing this sub getting a lot of flack here but this sub was the only reason why I invested in Cloudflare (NET) in 2018",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltvxeit/",
      "created": 1729966585,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltw17u2",
      "score": 2,
      "body": "So there was this post where OP wanted to strongly convince his father to sell all his TSLA at $110 before it crashes. I remember leaving a comment saying that if it keeps going down, that's good, but he has to keep in mind of the risk of ruining both their relationship and his father's money in case it bounces back. Soon after, it rallied close to $300. I wonder what he decided to do.",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltw17u2/",
      "created": 1729967836,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwnxu3",
      "score": 2,
      "body": "Yeah, sometimes I search Reddit for stocks I'm thinking about, just to see what people were saying about it in the past.   \n  \nI did that with Roblox, but then I didn't buy it and I still haven't.",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltwnxu3/",
      "created": 1729975283,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltvu0du",
      "score": 5,
      "body": "I’ve never seen anyone actually be *right*. People get lucky and people lose a lot on conviction. They have hopeful wishes and some come true, but there’s been not a person who can look at a stock and accurately predict its behavior. So many people in that post were wrong. They think they’re smarter than everyone, but they get it wrong. People talk about P/E, balance sheets, MACD, and other indicators of stocks yet the market acts inversely. \n\nTSLA has made a lot of people rich and it’s possibly caused people to lose everything on shorting. A stock could have a 150 P/E and historical data would say it would trend down, but today’s market is not the market of the ‘80s and ‘90s. It’s just a different time and investors have different sentiment toward the numbers. \n\nNews and action matters more today, it seems, along with revenue. I remember a speculative stock, BBIG, that people were so high on. They were calling it the next TikTok and all that, but it had no real strategy or catalysts that made it worth buying. It went up to $10. This was coming off of the AMC/GME hype. There was absolutely nothing the stock was doing. I warned people about it. It’s now worth $.0004 per share. I have no doubts someone took that elevator all the way down. But I could have also been wrong and they could have profited. NVDA actually has everything people want in a tech stock. It sets the pace for everyone else. \n\nNobody knows the market the way they think they do.",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltvu0du/",
      "created": 1729965452,
      "depth": 0,
      "replies": [
        {
          "id": "ltxix6e",
          "score": 3,
          "body": "What a great comment this is.  What a shame that most will not admit it to themselves.",
          "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltxix6e/",
          "created": 1729986324,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltvp2y3",
      "score": 3,
      "body": "Right now everyone on Reddit seems to be sucking off Google and shitting on Tesla",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltvp2y3/",
      "created": 1729963847,
      "depth": 0,
      "replies": [
        {
          "id": "ltvsz2t",
          "score": 2,
          "body": "Doesn’t matter still gonna hold my TSLA. Redditors are idiots.",
          "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltvsz2t/",
          "created": 1729965108,
          "depth": 1,
          "replies": [
            {
              "id": "ltyr9dm",
              "score": 2,
              "body": "I dont believe in Tesla but that's ok.  Hope you do well at it.  I\"m not taking a swing at it and that's ok.\n\nI mean if you bought Disney then I'd just laugh at you.  A lot.",
              "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltyr9dm/",
              "created": 1730004911,
              "depth": 2,
              "replies": [
                {
                  "id": "luaojhg",
                  "score": 0,
                  "body": "If I bought it at March 2020 prices, or Peltz proxy war prices, I'd be laughing at YOU.",
                  "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/luaojhg/",
                  "created": 1730173548,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "luau2tk",
                      "score": 1,
                      "body": "Coulda shoulda woulda.  \n\nBut ya didn't.",
                      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/luau2tk/",
                      "created": 1730176078,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lub1cze",
                          "score": 0,
                          "body": "Fair enough. But I'm learning a lot from this forum, even if some of my questions are dumb. \n\nWe all have to start somewhere, right? \n\nSo if these question are so repetitive, why give replies? Why not say nothing, and let the thread sink? Or just down-vote the thread?\n\nCoulda shoulda woulda, but people here don't.",
                          "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/lub1cze/",
                          "created": 1730180027,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "luconn1",
                              "score": 1,
                              "body": "You're just one of thousands here who pop in and pop out after they lose it all.  \n\nWere mid bull run, theres something to google and not ask on a reddit forum.  Or buy high and sell low.  \n\nThe days of easy money are OVER.",
                              "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/luconn1/",
                              "created": 1730211369,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lu7e2c0",
      "score": 1,
      "body": "I've gone back to thank people that made suggestions that I rannwith.\n\nAAOI for example, very nice return",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/lu7e2c0/",
      "created": 1730135336,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltv3diq",
      "score": -4,
      "body": "No need to wonder on some. You will always hear about the ones that ended up being right because they always come back and angrily insult the sub or brag to everyone that they were smarter(lucky) than everyone else.\n\n\nPeople cant be quietly happy these days, always have to brag to strangers.",
      "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltv3diq/",
      "created": 1729956731,
      "depth": 0,
      "replies": [
        {
          "id": "ltv87ke",
          "score": -4,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltv87ke/",
          "created": 1729958324,
          "depth": 1,
          "replies": [
            {
              "id": "ltva2is",
              "score": 0,
              "body": "Rofl. You want company over there? No thanks. Ironically insulting your own sub people is a weird flex. \n\n\n \"Lol, the arrogant loser mentality is strong with this one. Not everybody buys high and sells low like you. \"   \n\n\n-we all know what \"assuming\" does. \n\n\n Im quite happy with where Im at and my investments, but if assuming Im doing worse than you, or that you're a better investor than I am,  gives you some sense of joy, have at it. Im always glad to see miserable people smile once in a while.",
              "permalink": "/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/ltva2is/",
              "created": 1729958931,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}