{
  "title": "The absolute madness of Tesla",
  "score": 3864,
  "selftext": "https://preview.redd.it/51seuul3t5xd1.png?width=661&format=png&auto=webp&s=5a39dd7589604d09f90ae935399ac1160fa49ebc\n\nJust the sheer madness, i know its just a multiple and future growth and all that. Still, you gotta take a moment to contemplate this.\n\nThe funny thing is that Elon has outright lied/being wrong with predictions like dates for models and stuff, most recently the shenanigans with the robot at his events.\n\n\nBUT 2 weeks later he says 20-30 revenue growth next year and everyone believes him lol.\n\n\nThanks god im not a bear",
  "link_flair_text": "Discussion",
  "id": "1gcu0ih",
  "num_comments": 843,
  "created_utc": 1729974165,
  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/",
  "comments": [
    {
      "id": "ltwkk78",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 3020 | **Previous Best DD** | \n**Account Age** | 9 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwkk78/",
      "created": 1729974179,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwoah1",
      "score": 3656,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwoah1/",
      "created": 1729975400,
      "depth": 0,
      "replies": [
        {
          "id": "ltwot81",
          "score": 528,
          "body": "Hahahaha lol this is good",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwot81/",
          "created": 1729975566,
          "depth": 1,
          "replies": [
            {
              "id": "ltwuus6",
              "score": 158,
              "body": "Crypto folks are very familiar with this one.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwuus6/",
              "created": 1729977525,
              "depth": 2,
              "replies": [
                {
                  "id": "ltzrkeg",
                  "score": 12,
                  "body": "The god candle!!",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltzrkeg/",
                  "created": 1730028180,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lu0scng",
                  "score": 4,
                  "body": "Not me😭",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu0scng/",
                  "created": 1730043260,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ltwtiig",
              "score": 45,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwtiig/",
              "created": 1729977072,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltwvrt9",
              "score": 56,
              "body": "If it helps you come to terms with it, check out FCF vs debt, and have a gander at what kind of interest most big legacy auto mfgs are paying on their debt.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwvrt9/",
              "created": 1729977832,
              "depth": 2,
              "replies": [
                {
                  "id": "ltwzngb",
                  "score": 68,
                  "body": "Isn’t the majority of that debt being paid by consumers as car loans or leasing? So they’re actually profiting off that debt, or using it to incentivize car sales?",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwzngb/",
                  "created": 1729979176,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltx1ka4",
                      "score": 88,
                      "body": "Certainly the majority - I think that of fords 150 billion in debt, credit/financing accounts for something like 125b of it. They’re still running 5x the debt load Tesla is and the money they profit from with credit/financing goes towards paying shit they need to or their FCF so it’s already baked in. \n\nThrow in risks associated with shit like financial downturns and delinquencies thougg and tesla looks even stronger as their margins are good enough they had plenty of room to adapt pricing without getting hosed. \n\nI donno. Tesla is a wild and wacky stock/company and I’m not buying any at this price, but pretending there aren’t good reasons why it’s valued highly when it’s as profitable as it is and positioned as well as it is seems crazy to me. I get that it’s easy to hate musk, but like, it’s pretty easy to hate most of these fuckhead billionaire owners and I’m still buying stock in their companies despite that so…",
                      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx1ka4/",
                      "created": 1729979851,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltx3kae",
                          "score": 35,
                          "body": "> …but pretending there aren’t good reasons why it’s valued highly when it’s as profitable as it is….  \n\n\nIs it really that profitable?",
                          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx3kae/",
                          "created": 1729980577,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lu0lepj",
                              "score": 27,
                              "body": "Regarding its EVs, yes exceptionally so. It's one of the only EV makers making a profit.\n\nHere's some charts/\n\nCashflows: [https://x.com/alojoh/status/1849199873012174934](https://x.com/alojoh/status/1849199873012174934)\n\nMargins (notice the EV companies highlighted in green at the bottom): [https://x.com/alojoh/status/1826151946056515600](https://x.com/alojoh/status/1826151946056515600)\n\nAnalysis compared to BYD: [https://x.com/alojoh/status/1712014850946166978](https://x.com/alojoh/status/1712014850946166978)\n\nWhat id like to see is a similar chart for the BESS business. I suspect it's similar. There are, of course, other big players in utility scale BESS but Tesla is likely best in class, margins are massive (up to 30% now), and the business is growing fast.\n\nThen there's the Semi trucks which we know little about for now but the volume production factory is under construction. From my own research i suspect the Tesla Semi will be the highest margin vehicle in their car lineup and the demand will be absolutely insane. Exactly how profitable it will be will depend on a couple of as yet unknown key pieces of information. But imo, i think that a single Semi truck coiuld be as profitable as 10 Model 3s/Ys (nominal value, not margin). So 150,000-250,000 Semi truck sales annually, could be equivelant to 1.5m-2.5m Model 3/Ys in terms of earnings. Of course other companies also offer EV Semis, none of them offer anything remotely as performant as Tesla's Semi. So Tesla's semi looks exceptionally promising.\n\nAnd really, Tesla is only going to get more profitable over time across the current lineup. There are still a number of projects Tesla is working on which have yet to come online which will further reduce costs within their supply chain. For example Tesla is building its own a Lithium refinery in Texas. Still under construction but alot of progress made so far. Tesla is also extremely capital efficient when you look at things like OpEx/R&D ratios compared to other autos.\n\nSo Tesla is really exceptional as an automaker and an EV maker. The biggest thing going against Tesla right now is high interest rates. It's such a problem that Tesla is offering low financing on its own dime. But interest rates are on their way back down and its not clear what happens to demand when they're 1-2% lower a year+ from now. Either way as rates drop the cost to Tesla will lower so margins will improve. If demand rockets back up then Tesla may also be able to raise prices.\n\nBut despite high rates, Tesla is still growing sales. YoY the Q3 numbers were +6% which is better than alot of other automakers right now and speaks to the strong demand for Teslas: [https://finance.yahoo.com/news/mixed-us-car-sales-q3-181757286.html](https://finance.yahoo.com/news/mixed-us-car-sales-q3-181757286.html) This article only mentions a few companies but most of the industry is struggling right now. Some more than others, eg. VW is particularly troubled. And while Tesla has been able to juice sales by dropping prices or offering low interest financing, much of Tesla's competition does not have the luxury of being able to do that as they are already deep in the red. \n\nRight now it looks highly likey that Rivian, LCID, Nio, Xpeng, Zeekr, Polestar, and some others will inevitably end up failing. And some of these are high volume sellers in China, so if they exit the market that will leave a moderate void which i think Tesla is well positioned to capture. But as i said before, it's also possible they get acquired and many of the legacy car companies appear to be positioning themselves for such a takeover (but seeing as they're all also struggling to make EVs profitable i doubt it will actually help them). [https://x.com/Curious44315542/status/1847716558979645477](https://x.com/Curious44315542/status/1847716558979645477)\n\nNeedless to say the next 3-5 years will be interesting. Lots of tailwinds for Tesla. Lower rates, lower manufacturing costs, new products, not to mention the massive potential of FSD, Robotaxi, Optimus, etc (which i wont get into). It's also likely we will witness a number of other EV companies continue to struggle, possibly go bankrupt, or get acquired in some desperate merger (not that that will help).",
                              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu0lepj/",
                              "created": 1730040949,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "ltx5q5x",
                              "score": 76,
                              "body": "deleted",
                              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx5q5x/",
                              "created": 1729981367,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ltxjimm",
                                  "score": 18,
                                  "body": "Wasn't Bill Gates been shorting it for a while? I think Elon had a public winge about it lol, validates your statement atleast a little bit.",
                                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxjimm/",
                                  "created": 1729986546,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ltxrsa8",
                                      "score": 13,
                                      "body": "I think he extra shorted when it went over 1000 so he prolly made out like a bandit.",
                                      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxrsa8/",
                                      "created": 1729989713,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "ltxrzeq",
                                  "score": 15,
                                  "body": "My opinion, this accounts for a Substantial portion of why TSLA is valued the way it is. It’s a bet on Musk’s showmanship or salesmanship or notoriety or etc.",
                                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxrzeq/",
                                  "created": 1729989788,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "lu03bvz",
                                  "score": 4,
                                  "body": "I think it is still overvalued even if all the belief in the company is justified, which I don't believe for a second. ",
                                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu03bvz/",
                                  "created": 1730034077,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "ltybgfk",
                                  "score": 7,
                                  "body": "JAZZ HANDS ROFLCOPTER",
                                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltybgfk/",
                                  "created": 1729997499,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ltxgjo6",
                          "score": 36,
                          "body": "I’ve owned 4 of their top of the line model s, going back to 2016 and my current that delivered a month ago. The prices went: $160k, $150k, $130k, $107k. This is with every feature you can purchase including FSD all the way back in 2016. The features have continually improved and unsupervised FSD, actually does. \n\nAny manufacturer that can do that to their products while turning in this kind of margin should be absolutely feared.",
                          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxgjo6/",
                          "created": 1729985437,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltykara",
                              "score": 14,
                              "body": "I’m conflicted.  I agree on the overall continuous improvement and value due to dropping prices, but how can they STILL not have proper auto-sensing wipers?  It still shows as being “in Beta”, and hasn’t improved in 6 years!  You don’t need AI improvements  here (although they’d be appreciated if materialized), but the Audi I own has it mastered with basic sensors.",
                              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltykara/",
                              "created": 1730001374,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ltymtzi",
                                  "score": 19,
                                  "body": "So your only issue with Tesla is auto sensing wipers? 🙃",
                                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltymtzi/",
                                  "created": 1730002624,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "ltyo9al",
                                  "score": 5,
                                  "body": "To be fair, after recent update(s) they have improved quite a bit IMHO. What pisses me off the most is phantom braking for cars that are stopped in a traffic island between lanes. My car (M3) will shit itself even if the car is METRES behind the white line and my car has the lane markings clearly identified. This is on autopilot as we don't have FSD in Australia.",
                                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltyo9al/",
                                  "created": 1730003343,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ltxdn6q",
          "score": 38,
          "body": "How I fell after selling 5 $230cc expiry weekly for a meager $1500, lost out on $15k profit.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxdn6q/",
          "created": 1729984339,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltwxx1t",
          "score": 26,
          "body": "When anyone buys puts on Tesla on earnings call.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwxx1t/",
          "created": 1729978576,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltwl8pl",
      "score": 772,
      "body": "Even if you double that number i will still lose money if i buy puts",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwl8pl/",
      "created": 1729974401,
      "depth": 0,
      "replies": [
        {
          "id": "ltyj8ri",
          "score": 118,
          "body": "People even lost money when its P/E was over 9000\n\nLOL",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltyj8ri/",
          "created": 1730000873,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltye13q",
          "score": 52,
          "body": "That's because of the time value expiration. Nobody knows exactly when TSLA will fall.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltye13q/",
          "created": 1729998571,
          "depth": 1,
          "replies": [
            {
              "id": "lu00tgr",
              "score": 7,
              "body": "I ve taken the ride up, from $160 to $260 plus three times.  Did not take it last week because of if I list faith!\nWho cares about his futuristic self during cars, Google has them in many major cities right noses, TSLA is out of step!",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu00tgr/",
              "created": 1730032954,
              "depth": 2,
              "replies": [
                {
                  "id": "lu2a0nl",
                  "score": 6,
                  "body": "They have them in 3 cities and they’re geofenced. Waymo doesn’t have this massive lead everyone thinks they do.",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu2a0nl/",
                  "created": 1730059418,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ltyze20",
          "score": 24,
          "body": "Never short a bubble, let a alone a 'tech' (I am using this term generously in the context of Tesla) bubble.\n\nJust walk away.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltyze20/",
          "created": 1730009718,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltwn3kb",
      "score": 2426,
      "body": "TSLA made me realize what a pile of lies the entire stock market is.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwn3kb/",
      "created": 1729975011,
      "depth": 0,
      "replies": [
        {
          "id": "ltwqlpg",
          "score": 824,
          "body": "Tesla is more reliant on lies and “puffery” than almost any other stock besides maybe DJT",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwqlpg/",
          "created": 1729976124,
          "depth": 1,
          "replies": [
            {
              "id": "ltxji0b",
              "score": 111,
              "body": "DJT stock doesn't rely on puffery, everyone knows it's shit, and it just accepts that and continues to exist in defiance of logic. There are two questions I have about DJT stock:\n\n1) Why was it allowed to exist in the first place\n\n2) How long before it's gone",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxji0b/",
              "created": 1729986540,
              "depth": 2,
              "replies": [
                {
                  "id": "ltymvsi",
                  "score": 114,
                  "body": "1. It exists as a way to launder money through the stock market.\n\n2. It will be essentially gone when he looses.",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltymvsi/",
                  "created": 1730002649,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ltwrtt4",
              "score": 102,
              "body": "By their powers combined they can make lies officially the truth though, so who's the lying then?",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwrtt4/",
              "created": 1729976517,
              "depth": 2,
              "replies": [
                {
                  "id": "ltwvjp6",
                  "score": 104,
                  "body": "Them. Just because everyone believes a lie doesn’t make it true it just makes everyone morons, but like… didn’t we know that already?",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwvjp6/",
                  "created": 1729977756,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltwwyso",
                      "score": 41,
                      "body": "The emperor wears no clothes",
                      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwwyso/",
                      "created": 1729978242,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltxgq1p",
                          "score": 30,
                          "body": "Reminds me of the whole \"sub prime\" loan market leading up to the 2008 crash. A ton of people were like \"this isn't real, it's all going to collapse!\" and being completely ignored by the markets as a whole.\n\nOr Enron.",
                          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxgq1p/",
                          "created": 1729985505,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltydz8m",
                              "score": 10,
                              "body": "It always gets me when talking heads say nobody saw 2008 crash coming. I worked in the industry and I did. People on some now dead discussion forums did. The shit brokerages was selling was crazy.",
                              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltydz8m/",
                              "created": 1729998551,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltyk6si",
              "score": 23,
              "body": "Robinhood’s easy access to options turned the stock market into gambling.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltyk6si/",
              "created": 1730001321,
              "depth": 2,
              "replies": [
                {
                  "id": "lu0jy2e",
                  "score": 26,
                  "body": "The market was always a casino way before Robinhood, they just opened it up to all ages. Can't wait until futures trading is turned on.",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu0jy2e/",
                  "created": 1730040461,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lu265j7",
                      "score": 5,
                      "body": "Inb4 “there’s 50 oil trucks on my street asking where the tank is. I don’t want the oil. What do I do here, wsb?”",
                      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu265j7/",
                      "created": 1730058257,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltwtxfz",
              "score": 65,
              "body": "Musk is the only guy in China who 100% owns his own business. State has no % interest.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwtxfz/",
              "created": 1729977210,
              "depth": 2,
              "replies": [
                {
                  "id": "ltwviu1",
                  "score": 135,
                  "body": "Yeah tbf he got a good deal in the process of showing the Chinese how to build a Tesla, which they now do except better and for half the price",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwviu1/",
                  "created": 1729977747,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltxg143",
                      "score": 32,
                      "body": "That’s every company that does business in China.",
                      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxg143/",
                      "created": 1729985243,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ltx00vh",
                      "score": 34,
                      "body": "I mean it's not rocket science once the battery is good enough.\n\nPeople have been programming robots with wheels to avoid obstacles since the 80s.",
                      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx00vh/",
                      "created": 1729979305,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lty4o72",
                          "score": 19,
                          "body": "Nah, China is advancing the tech in leaps and bounds. BYD's e-axle contains all the components but the battery, right in the axle itself. This makes it incredibly easy to integrate into any vehicle. They're following Tesla's lead of vertical integration, so they can move a lot faster than the legacy auto-makers. The\n\nChina is also copying Tesla's model where the factory is the product. This will be huge when they start offshoring production in a big way. Western auto makers are being left in the dust.",
                          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lty4o72/",
                          "created": 1729994763,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltyv9s3",
                              "score": 12,
                              "body": "I agreed if BYD is allowed to enter North America market it will destroyed Tesla with their affordable EV, and even Elon know that, maybe he calculated risk and be on trump side for safety",
                              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltyv9s3/",
                              "created": 1730007184,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ltzoi36",
                                  "score": 3,
                                  "body": "Like how people can buy a Chinese phone for a fraction of the cost but still stick with Apple? Is that how it works?",
                                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltzoi36/",
                                  "created": 1730026308,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "ltyybiy",
                                  "score": 7,
                                  "body": "Musk has said that he thinks in 10 years Tesla will be the only US auto manufacturer left, and that China will dominate. Tesla has fat margins now, so they can probably absorb more pain than other US auto-makers. They also led the way with leveraging vertical integration, so they'll be nimble in a way others will have difficulty matching. \n\nWe know the US car industry won't be allowed to die, but China has already started building factories in Mexico where they'll enjoy duty-free access to the US. It will be difficult for Washington to get the kind of voluntary export restraints they got from Japan in 1980 when Americans can drive back from Mexico with a new car. \n\nAnd what does it say for capitalism if China dominates the global auto market?",
                                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltyybiy/",
                                  "created": 1730009038,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ltwx0ag",
                  "score": 22,
                  "body": "The funniest part of this is you think that's a a strength, and not a giant *liability*.",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwx0ag/",
                  "created": 1729978257,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ltwv7es",
                  "score": 32,
                  "body": "The biggest issue there will be China stealing their IP and poaching their staff.\nSuddenly China is selling their own \"Telsa\" Models 5, E, H, and J or something",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwv7es/",
                  "created": 1729977642,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltww1f5",
                      "score": 103,
                      "body": "Tesra",
                      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltww1f5/",
                      "created": 1729977923,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltx02pg",
                          "score": 34,
                          "body": "Sounds kinda racist. Like as if Sum Ting Wong with your statement.",
                          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx02pg/",
                          "created": 1729979323,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltx44hn",
                              "score": 22,
                              "body": "Ho Lee Fuk. 🤣",
                              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx44hn/",
                              "created": 1729980783,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ltwvw3b",
                      "score": 17,
                      "body": "China has Nio, BYD, Hesai  already. Not certain of their quality. US won’t allow Chinese FSD technology (hardware and software) into US and visa-versa .",
                      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwvw3b/",
                      "created": 1729977873,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltwx4dd",
                          "score": 11,
                          "body": "it won't matter as FSD is going to be super regional anyway.",
                          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwx4dd/",
                          "created": 1729978297,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ltxnbxl",
                          "score": 15,
                          "body": "We have these car brands in Australia, they are rubbish quality",
                          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxnbxl/",
                          "created": 1729988005,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ltwxdui",
                          "score": 20,
                          "body": "Just my anecdotal experience; I've driven a BYD and a Tesla, the only EVs I've driven, and I liked the BYD a lot more.",
                          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwxdui/",
                          "created": 1729978389,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ltx1dcp",
                              "score": 6,
                              "body": "You don’t have to respond, I also have driven both, I had a BYD seal for test driven for a month and have a Tesla model Y. What makes you like the BYD more than Tesla?",
                              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx1dcp/",
                              "created": 1729979781,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ltx2s6n",
                                  "score": 22,
                                  "body": "I found the acceleration to be a lot smoother. It had a better turning circle. The internal felt more solid and not half as plasticy as I found the Tesla to feel. \n\nUltimately I choose neither though. I got a Toyota hybrid instead.",
                                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx2s6n/",
                                  "created": 1729980292,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lu04m9s",
                                      "score": 3,
                                      "body": "I think a lot of people are doing that... but it also seems like none of those people want to invest in Toyota.  Realistically... fully electric cars are actually a lot simpler... if the market were truly there for them, it would be pretty easy for the big automakers to go all in.  I don't know... if someone would hesitate to put their money in Toyota, I feel like they're batshit insane to think Tesla will do better as a company in the long term.",
                                      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu04m9s/",
                                      "created": 1730034634,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ltxyg4d",
                      "score": 8,
                      "body": "How do you “poach” open source ip?  Tesla has opened patents since 2014.",
                      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxyg4d/",
                      "created": 1729992300,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ltxlny1",
              "score": 41,
              "body": "Well DJT is just a way for foreign entities to “donate”. Also, his supporters are morons dumping life savings into that garbage pit.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxlny1/",
              "created": 1729987363,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltx9sj2",
              "score": 6,
              "body": "Given Elons' numerous ties to Russian and Saudi money, I would say Tesla is just as reliant on lies and puffery.\n\nCause, regardless of how many fumbles and misteps both Elon and Tesla have, they always seem to surge in value at convenient times.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx9sj2/",
              "created": 1729982883,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltwsp9j",
          "score": 81,
          "body": "Early COVID was my realization. People were dying in the streets in China and the markets were pumping.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwsp9j/",
          "created": 1729976802,
          "depth": 1,
          "replies": [
            {
              "id": "ltxfnem",
              "score": 19,
              "body": "Market predicted the future pretty well then…",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxfnem/",
              "created": 1729985100,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltx2k0n",
              "score": 29,
              "body": "The markets were pumping because they expected stimulus",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx2k0n/",
              "created": 1729980208,
              "depth": 2,
              "replies": [
                {
                  "id": "ltxfrpy",
                  "score": 9,
                  "body": "And worst case scenario a bunch of elderly and sick people dying is bullish",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxfrpy/",
                  "created": 1729985145,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lu0f10g",
              "score": 5,
              "body": "The markets pumped because we pumped them lmao. The Fed literally showered our nation and the world in free money via ZIRP and QE. Where else would smart money put it outside of assets?\n\nThe real kicker is how concentrated all the holdings are becoming across the board. I wonder if we'll see true value again before the war pops off?",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu0f10g/",
              "created": 1730038755,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltx8n2n",
          "score": 18,
          "body": "My old man is a veteran executive of the trading world, 50 years experience. Says the exact same thing. It's gambling, full stop. And I'm here for it.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx8n2n/",
          "created": 1729982450,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltwrjmg",
          "score": 69,
          "body": "Guessing you weren’t alive when Enron was around.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwrjmg/",
          "created": 1729976425,
          "depth": 1,
          "replies": [
            {
              "id": "ltx070k",
              "score": 50,
              "body": "Enron failed when they were found out.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx070k/",
              "created": 1729979365,
              "depth": 2,
              "replies": [
                {
                  "id": "lty51vd",
                  "score": 28,
                  "body": "We now live in the age of open fraud and corruption.",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lty51vd/",
                  "created": 1729994915,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ltwtowq",
              "score": 22,
              "body": "ah, the good old days, along with Worldcom MCI.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwtowq/",
              "created": 1729977130,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltwtln1",
              "score": 21,
              "body": "There are people in their 40s on this sub? I feel like back in those days 18/20 year olds couldn't easily setup broker account and start trading, so it might even be people in their 50s.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwtln1/",
              "created": 1729977100,
              "depth": 2,
              "replies": [
                {
                  "id": "ltwu7do",
                  "score": 34,
                  "body": "I mean us old people also learned how to use the internet and low cost brokers too. I use a boomer company called Schwab.",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwu7do/",
                  "created": 1729977305,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltxg769",
                      "score": 10,
                      "body": "Yeah, I thought I got away from them too, then they bought TD Ameritrade and now I'm back again.",
                      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxg769/",
                      "created": 1729985306,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lty2hve",
                          "score": 7,
                          "body": "I went from Scottrade to Ameritrade to Schwab.",
                          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lty2hve/",
                          "created": 1729993904,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ltwsj4g",
          "score": 8,
          "body": "Time to short! Again",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwsj4g/",
          "created": 1729976747,
          "depth": 1,
          "replies": [
            {
              "id": "ltx2r19",
              "score": 15,
              "body": "Portfolio destruction imminent",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx2r19/",
              "created": 1729980280,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltwtiox",
          "score": 8,
          "body": "It usually doesnt matter if something is true. All that matters is if people think its true.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwtiox/",
          "created": 1729977073,
          "depth": 1,
          "replies": [
            {
              "id": "ltzs5xc",
              "score": 4,
              "body": "True in trading. \n\n\nIn engineering, science, farming, building, medicine and almost everything else? \n\n\nTruth can be kinda important...",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltzs5xc/",
              "created": 1730028526,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltwwyio",
          "score": 5,
          "body": "I held MODG for like 2 years and every quarter they would beat on earnings and the stock would tank because they would only talk about how bad they expected the next quarter to be. They had the lying part all wrong.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwwyio/",
          "created": 1729978239,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltwq4gx",
          "score": 23,
          "body": "You must be new to the stock market lol",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwq4gx/",
          "created": 1729975975,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltxakvw",
          "score": 4,
          "body": "You got that right. As long as the rest of the crowd believes it, green for days. The minute they don't, you're holding the bag.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxakvw/",
          "created": 1729983180,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltwvaqo",
          "score": 6,
          "body": "I hate ur pfp I thought it was an eyelash",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwvaqo/",
          "created": 1729977672,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltwr7nk",
          "score": 24,
          "body": "$NFLX up 15% after earnings because... reasons.\n\nSeptember 11th, 2024, whole market flash-crahses with the bank ETF down 3%... $NVDA CEO says \"AI demand is still high\" and the S&P does a 3% intraday reversal. \n\nTell me how Jerome Powell is not the most reckless Fed chair in history.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwr7nk/",
          "created": 1729976317,
          "depth": 1,
          "replies": [
            {
              "id": "ltwwxv8",
              "score": 35,
              "body": "What does Jerome Powell have to do with any of that?",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwwxv8/",
              "created": 1729978233,
              "depth": 2,
              "replies": [
                {
                  "id": "ltwx3qs",
                  "score": 8,
                  "body": "Financial conditions are as loose as 2021, according to Bloomberg Financial conditions index.",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwx3qs/",
                  "created": 1729978291,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltxhvts",
                      "score": 9,
                      "body": "At that point monetary policy was the most restrictive in 23 years...",
                      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxhvts/",
                      "created": 1729985937,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lty3u96",
              "score": 5,
              "body": "The SPX price action that morning was nuts. It was like bulls completely capitulated and there was no resistance on any candle. Then boom, strong institutional buying without stop through close.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lty3u96/",
              "created": 1729994434,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltwnp3y",
          "score": 10,
          "body": "This",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwnp3y/",
          "created": 1729975203,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltwqsco",
          "score": 13,
          "body": "It's all made believe",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwqsco/",
          "created": 1729976181,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltwqh9z",
          "score": 28,
          "body": "The price of stocks is now governed by the dictates of the wealthy. They have gained such vast hordes of capital since the Reagan tax changes and are now able to control so much of the cash flow from the Federal Reserve that prices securities simply follow their dictates. If TSLA is up, it's because the oligarchs have decided that it suits them for it to be. They may also be glad for the power and influence that gives to their front man.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwqh9z/",
          "created": 1729976085,
          "depth": 1,
          "replies": [
            {
              "id": "ltwr8fm",
              "score": 39,
              "body": "When has the price of a stock not been dictated by the wealthy? It’s like you think you sound profound without actually saying anything.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwr8fm/",
              "created": 1729976324,
              "depth": 2,
              "replies": [
                {
                  "id": "ltx1hiy",
                  "score": 11,
                  "body": "Exactly, in fact for the older heads, it is mind blowing how much power retail can have, this sub alone has achieved something that was unthinkable 20 years ago..",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx1hiy/",
                  "created": 1729979823,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ltwtd09",
                  "score": 9,
                  "body": "Wealthy people bad",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwtd09/",
                  "created": 1729977020,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ltwppns",
      "score": 615,
      "body": "https://preview.redd.it/gw0kn1ndy5xd1.png?width=720&format=png&auto=webp&s=255c27f3982ff353ebb47ae48d2d774f48b5cce8",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwppns/",
      "created": 1729975845,
      "depth": 0,
      "replies": [
        {
          "id": "ltwtl4n",
          "score": 162,
          "body": "Lol. After a rich, lavish existence for some of thes big liars.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwtl4n/",
          "created": 1729977095,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltx1kb0",
          "score": 111,
          "body": "No one says the liars pay the debt. Just eventually SOMEONE does. In that case it was the city of Pripyat.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx1kb0/",
          "created": 1729979851,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltx4bi6",
          "score": 87,
          "body": "What episode of trailer park boys is this?",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx4bi6/",
          "created": 1729980855,
          "depth": 1,
          "replies": [
            {
              "id": "ltxc5k7",
              "score": 74,
              "body": "The one where the boys learn how an RBMK reactor explodes",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxc5k7/",
              "created": 1729983776,
              "depth": 2,
              "replies": [
                {
                  "id": "lu341b8",
                  "score": 3,
                  "body": "Comrade, an RBMK Reactor Core cannot explode!",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu341b8/",
                  "created": 1730068804,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ltx6vfc",
              "score": 19,
              "body": "The one where Bubbles opens a trading account and invests it all in CAT.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx6vfc/",
              "created": 1729981789,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lty5jy0",
          "score": 4,
          "body": "Maybe in some fantasy lala land. In real life Lies and deceit gets the powerful through everything and everytime. If it was not people like kissinger, george bush, dick cheney would all be paying their price for their deceits and war crimes. But they wont",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lty5jy0/",
          "created": 1729995119,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltx53iw",
          "score": 3,
          "body": "The house of cards will eventually experience a bug gust of wind. It's only a matter of time.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx53iw/",
          "created": 1729981140,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltwytlg",
          "score": 7,
          "body": "The lies are literally to cover his debt. Lies and debt all the way down. Truth not a concern.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwytlg/",
          "created": 1729978891,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltwxlnj",
          "score": 5,
          "body": "the balance sheet always balances",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwxlnj/",
          "created": 1729978464,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltwpxdm",
      "score": 256,
      "body": "Current valuation is 2-3 higher than tech companies, but 15x higher than car companies.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwpxdm/",
      "created": 1729975912,
      "depth": 0,
      "replies": [
        {
          "id": "ltwqjlm",
          "score": 50,
          "body": "That’s what I liked about the graph, the sutil inclusion of car peers at the bottom",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwqjlm/",
          "created": 1729976105,
          "depth": 1,
          "replies": [
            {
              "id": "ltww47v",
              "score": 70,
              "body": "It’s… subtle…",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltww47v/",
              "created": 1729977949,
              "depth": 2,
              "replies": [
                {
                  "id": "ltwy353",
                  "score": 43,
                  "body": "My man is hooked on fonnix",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwy353/",
                  "created": 1729978636,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ltwmyas",
      "score": 461,
      "body": "this chart is just showing that NVDA AMZN MSFT AAPL META GOOGL are all undervalued",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwmyas/",
      "created": 1729974961,
      "depth": 0,
      "replies": [
        {
          "id": "ltwn3uf",
          "score": 187,
          "body": "That’s one way to view things",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwn3uf/",
          "created": 1729975014,
          "depth": 1,
          "replies": [
            {
              "id": "ltwq9lt",
              "score": 28,
              "body": "They gotta catch up to Tesla. After banger earnings NVDA will be up +100% by next year 🤣",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwq9lt/",
              "created": 1729976019,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ltwqjy4",
          "score": 44,
          "body": "I honestly feel like Google may be undervalued a bit compared to others in the space.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwqjy4/",
          "created": 1729976108,
          "depth": 1,
          "replies": [
            {
              "id": "ltwtofy",
              "score": 7,
              "body": "I'm loading LEAPS 200C on GOOGL before ER next week, their PE is around 20 is extremely cheap.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwtofy/",
              "created": 1729977125,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ltww04s",
              "score": 19,
              "body": "Google will always trade at a discount because the company is run by engineers who don’t care that much about profitability. That’s never going to change.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltww04s/",
              "created": 1729977911,
              "depth": 2,
              "replies": [
                {
                  "id": "ltx08z8",
                  "score": 24,
                  "body": "I know this is wallstreetbets and not investing but a company with that outlook seems better for a long term hold. Especially if you want to protect some money in a possible downturn. \n\nI'm big in google and Microsoft. However google has more value (to me anyway) as it's flat to the peak they were in 2021.",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx08z8/",
                  "created": 1729979384,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ltx61v1",
                      "score": 10,
                      "body": "It’s ok but not great for long-term, which is reflected in the multiple. Better than having only finance/consultant types running the company, but not as good as AAPL/MSFT where they have a great blend of level headed operators and engineers in charge.",
                      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx61v1/",
                      "created": 1729981486,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltxiqji",
                          "score": 11,
                          "body": "The CEO is an ex-McKinsey consultant though? I know he has his degree in metallurgical engineering, but afaik he has never been a practicing engineer",
                          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxiqji/",
                          "created": 1729986255,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ltxtd5r",
                  "score": 12,
                  "body": "> who don’t care that much about profitability\n\nWas possibly true at one time. Is not true now. \nFor fy2023, revenues of 307B , net income of 74B. That does not happen by accident. There is a massive apparatus inside the company that cares about profit. The company is a profit driven engine.",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxtd5r/",
                  "created": 1729990327,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ltwu7bm",
              "score": 8,
              "body": "Probably because it will most likely be broken up. Parts are more valuable than the whole.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwu7bm/",
              "created": 1729977305,
              "depth": 2,
              "replies": [
                {
                  "id": "ltwz8g4",
                  "score": 20,
                  "body": "Also its bad tendency to occasionally take a product line and just shooting in the fucking face, to shake things up a little.",
                  "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwz8g4/",
                  "created": 1729979032,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ltwz1e4",
      "score": 187,
      "body": "The problem with Tesla is that it's the most irrational stock. It's up over 20% on the sort of growth that it should have been delivering at the price. You have a P/E of 70? 6% growth in sales is below where you should be.\n\nAnd probably $300bn of its value is based on proper, actual FSD or Robotaxis for which they haven't even demonstrated anything.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwz1e4/",
      "created": 1729978964,
      "depth": 0,
      "replies": [
        {
          "id": "ltxq7pk",
          "score": 90,
          "body": "PE multiples are usually determined by next year’s earnings growth. Musk forecasted 20-30% growth, which could justify a 40-60 PE. The problem is, he forecasted 20% growth for this quarter too, but only delivered 8% growth. He’s disappointing regularly now. Tesla has lost half their future customers because Musk has gone full corrupt Trump funder. And he keeps lying about self driving cars.  The stock price is totally divorced from reality. So many other companies are actually delivering 20% growth. Tesla’s stock price is only riding on the momentum of amateur gamblers who aren’t anchored in facts.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxq7pk/",
          "created": 1729989112,
          "depth": 1,
          "replies": [
            {
              "id": "ltzmiyc",
              "score": 15,
              "body": "What Musk is doing is borderline fraud against the investors and customere. He is contantly lying about targets, when new stuff is coming out etc. Im actually suprised it took this long for his lawyers to make him say \"assisted fsd\". At this rate people will have moved on to different cars without actually getting fsd which they paid for.\n\nSo if Musk says he projects 20% growth, divide it by at least 2, 3. If Musk says something is coming Next year, add like 5 years or so.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltzmiyc/",
              "created": 1730025022,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lu0rc81",
          "score": 6,
          "body": "You regards need to learn something, P/E is not the end-all, be-all of valuations.\n\nStudy these charts, look at the historic PE multiple of these companies, look how its trended, and look at what has happened to their stock price over the last 15 years.\n\n[https://www.macrotrends.net/stocks/charts/NFLX/netflix/pe-ratio](https://www.macrotrends.net/stocks/charts/NFLX/netflix/pe-ratio)\n\n[https://www.macrotrends.net/stocks/charts/AMZN/amazon/pe-ratio](https://www.macrotrends.net/stocks/charts/AMZN/amazon/pe-ratio)\n\nAs you can see, for many years Netflix and Amazon had absurdly high PE's, much higher than Tesla's PE today, and in spite of that fact, their stock prices marched ever upward. Over that same period of time the PE multiple has fallen dramatically to a much more \"reasonable\" number today, but the stocks are at or near record highs. See if you can figure out for yourself how that happened.\n\nYou might have used the PE argument to short AMZN and NFLX in 2010, and if you did, you would have had your back blown out multiple times as a train was run on you. You might have called investors that were bullish on these companies \"irrational\", but maybe they just saw something you didn't (like reality).",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu0rc81/",
          "created": 1730042931,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltwqg56",
      "score": 45,
      "body": "How is meta 25x at $500ish, when it was priced at $100 just 18 months ago. Are you telling me meta was trading at 5x forward earnings? That's more amazing to me than teslacoin or whatever it's called.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwqg56/",
      "created": 1729976076,
      "depth": 0,
      "replies": [
        {
          "id": "ltzdmu3",
          "score": 23,
          "body": "Earnings have gone up a lot since then, but yeah it was stupidly cheap. I was going to load up but then my gf who is a professional meta ad buyer told me that the product sucks (she is probably right, but they don’t have to be good they just have to be better than alternatives)",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltzdmu3/",
          "created": 1730019207,
          "depth": 1,
          "replies": [
            {
              "id": "lu0hb2t",
              "score": 8,
              "body": "They all suck. Google ads, meta, major DSPs, it's allllll smoke and mirrors baby and they create their own reporting metrics to fix the ROI on client end.\n\nI place millions per year through TTD and refuse to own their stock because I'm convinced it's a fraudulent industry.",
              "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu0hb2t/",
              "created": 1730039564,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ltwrlyb",
      "score": 17,
      "body": "TSLA is the casino.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwrlyb/",
      "created": 1729976446,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltxr42i",
      "score": 38,
      "body": "I spent eight years telling people that Tesla market cap was going to be the highest among all the car manufacturers. They laughed. I laughed as I sold most of it when it did. Then it went higher than the top three combined… Then I realized I wasn’t smart, there’s just a lot of stupider people out there…",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxr42i/",
      "created": 1729989455,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltx1dab",
      "score": 38,
      "body": ">go to /r/wallstreetbets\n\n>ctrl+f tesla\n\n>have a laugh\n\n>leave\n\nhttps://www.youtube.com/watch?v=3KquFZYi6L0",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx1dab/",
      "created": 1729979780,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwrgg2",
      "score": 177,
      "body": "Never bet against a cult.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwrgg2/",
      "created": 1729976396,
      "depth": 0,
      "replies": [
        {
          "id": "ltxb475",
          "score": 17,
          "body": "and yet it seems to be very profitable to bet against the wsb cult",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxb475/",
          "created": 1729983381,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltwvyc4",
          "score": 26,
          "body": "When collective suicide pact?",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwvyc4/",
          "created": 1729977894,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltxhka8",
          "score": 3,
          "body": "Betting against a cult is actually probably a 50/50 win rate, only a few make it after the founder is inevitable gutted",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxhka8/",
          "created": 1729985818,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltwqmqo",
      "score": 53,
      "body": "Let it continue. I keep slowly offloading the shares I bought at 26$",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwqmqo/",
      "created": 1729976133,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltxpuw3",
      "score": 8,
      "body": "I hope Tesla succeeds long term. But I have to admit they are starting to feel like Theranos... they have not cracked fully autonomous driving but are announcing products that require it.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxpuw3/",
      "created": 1729988977,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwpcpi",
      "score": 48,
      "body": "I agree but you do sound like a gay bear",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwpcpi/",
      "created": 1729975729,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwzvyi",
      "score": 22,
      "body": "Fucking meme stock is all it is",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwzvyi/",
      "created": 1729979258,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltxacrr",
      "score": 21,
      "body": "This is a good lesson in \"irrational exuberance\". This is a \"growth stock\" because the people looking for a growth stock want it to be one. It doesn't really matter what Elon says, because there are thousands upon thousands of growth stock investors out there that will to spin and regurgitate and explain away what **he *really* meant**. \n\nThen it all comes falling down. \n\nPeople work this way. People have a collective ego, a collective hubris and they will deny and lie and spin things to make those dreams come true. \n\nHave fun while it lasts, just don't be there when it all comes falling down. \n\nCue up the true believers in the reply box below.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxacrr/",
      "created": 1729983096,
      "depth": 0,
      "replies": [
        {
          "id": "lu0fzek",
          "score": 2,
          "body": "some French dude wrote about this a while back in 1920's or something.    \n\n[https://www.amazon.com/Crowd-Popular-seminal-masterpiece-psychology/dp/B09Q5W3W1D/ref=sr\\_1\\_1?dib=eyJ2IjoiMSJ9.81A37kcH7T2ho\\_SFXgVdb\\_13-5yO\\_IIH21\\_ZaGQeu0EoxAr1duVEo20G63skp0S2J83ZrNTupufZFaRn3TepXltqqJIoje1wziOF96eL6hS2lfkf8eXeEKa3IKT4ai8D01VXRqH34m2jEhQp4nGwD\\_6Q4rckFemiHkdQG-8U2VTU\\_8sQEViGeOUviTMERF4su-nJYXycwSH9noLqXODR9I0pAJ05VzhrV-65Ar06xEs.tuK3EOfF7w\\_G55hvFKUDPEf-SSATRPgydvhAMZlBtrM&dib\\_tag=se&qid=1730039075&refinements=p\\_27%3AGustave+Le+Bon&s=books&sr=1-1&text=Gustave+Le+Bon](https://www.amazon.com/Crowd-Popular-seminal-masterpiece-psychology/dp/B09Q5W3W1D/ref=sr_1_1?dib=eyJ2IjoiMSJ9.81A37kcH7T2ho_SFXgVdb_13-5yO_IIH21_ZaGQeu0EoxAr1duVEo20G63skp0S2J83ZrNTupufZFaRn3TepXltqqJIoje1wziOF96eL6hS2lfkf8eXeEKa3IKT4ai8D01VXRqH34m2jEhQp4nGwD_6Q4rckFemiHkdQG-8U2VTU_8sQEViGeOUviTMERF4su-nJYXycwSH9noLqXODR9I0pAJ05VzhrV-65Ar06xEs.tuK3EOfF7w_G55hvFKUDPEf-SSATRPgydvhAMZlBtrM&dib_tag=se&qid=1730039075&refinements=p_27%3AGustave+Le+Bon&s=books&sr=1-1&text=Gustave+Le+Bon)",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu0fzek/",
          "created": 1730039098,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltwm8xl",
      "score": 134,
      "body": "Cults are no joke. ItZ nOt a C@r cOmPani Its a TechNoloGy ComPaNy>",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwm8xl/",
      "created": 1729974726,
      "depth": 0,
      "replies": [
        {
          "id": "ltwuw8a",
          "score": 16,
          "body": "They’re waiting to finally get some optimussy",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwuw8a/",
          "created": 1729977539,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltwmqha",
          "score": 10,
          "body": "Everytime I read that I think about FSD.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwmqha/",
          "created": 1729974887,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltwot8k",
      "score": 39,
      "body": "Thats why i dont do Tesla. Musk is just to unpredictable. Bordering on batshit crazy the last fef months/years",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwot8k/",
      "created": 1729975566,
      "depth": 0,
      "replies": [
        {
          "id": "ltyqghh",
          "score": 3,
          "body": "I will buy puts if musk’s candidate loses election. I think dominos will fall then.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltyqghh/",
          "created": 1730004483,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltwx4a2",
      "score": 14,
      "body": "I'm not a Tesla bull, but they engineer, design, produce and sell (with no marketing) real world, technology first products.  There are very few other companies doing that so shares trade at a big (Elon) premium.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwx4a2/",
      "created": 1729978296,
      "depth": 0,
      "replies": [
        {
          "id": "lu2c6u3",
          "score": 4,
          "body": "WSB mouths the headlines to clickbait, not understanding that Tesla refuses to pay to play on CNBC and Bloomberg. \n\nMedia loves GM and F, because their ads pay for the program to be on the air. \n\nThe largest financial contributor to Consumer Reports is the Ford Foundation. \n\nFor a sub full of conspiracy theorists - they really can't handle the truth.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu2c6u3/",
          "created": 1730060050,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltxfaau",
      "score": 5,
      "body": "I felt like I was going crazy when I read he said 20-30 growth and the stock is blowing up because of that lmao. \n\nIt’s amazing how he’s able to talk his way out of a stock slump. Still like 30% from its ATH though",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxfaau/",
      "created": 1729984961,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwoxmv",
      "score": 9,
      "body": "What happen to the long Tesla puts guy who post multiple DD and early celebration on his gain of his king puts Jan 17, 2025 position ? Hope he  is still fine.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwoxmv/",
      "created": 1729975603,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwwiuy",
      "score": 4,
      "body": "If I could raise capital based off of 100X my forward earnings I would probably do pretty alright.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwwiuy/",
      "created": 1729978088,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwxgz3",
      "score": 3,
      "body": "Big boys need exit liquidity",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwxgz3/",
      "created": 1729978419,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwzc4o",
      "score": 5,
      "body": ">The funny thing is that Elon has outright lied/being wrong with predictions like dates for models and stuff, most recently the shenanigans with the robot at his events.\n\nYou are SO close to being too intelligent for this sub lol...",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwzc4o/",
      "created": 1729979067,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwr106",
      "score": 20,
      "body": "He's a lying fuck but ride the gravy train and scalp some fucking money.....",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwr106/",
      "created": 1729976257,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltxkud4",
      "score": 27,
      "body": "You guys have very VERY short term memories.\n\nWhen $TSLA was $50b market cap everyone said it was overvalued because they ONLY produced a couple thousand cars a year. Well it was valued with the idea that in 5-8 years they would be selling millions.\n\nNow it's at 800b market cap and everyone is saying its overvalued because they ONLY produced a couple million cars a year...\n\n\nBears never learn. That's why you guys are so poor.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxkud4/",
      "created": 1729987048,
      "depth": 0,
      "replies": [
        {
          "id": "lu058uo",
          "score": 2,
          "body": "Before the whole meme stock fiasco these gay bears would get downvoted into oblivion",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu058uo/",
          "created": 1730034903,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltx6d9i",
      "score": 13,
      "body": "Telsa is the best case study against the Efficient Market Hypothesis.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx6d9i/",
      "created": 1729981601,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwtaow",
      "score": 29,
      "body": "This is the right time to start shorting it. Analysts have not significantly hiked the price targets, which is an extremely bearish signal. E.g. Wedbush has aways been extremely bullish about Tesla and they maintained their $300 price target. They didn't throw a party and hiked it to $400. JP Morgan increased the price target from $130 to $135, so they were negative to begin with and nothing they saw now changed their minds. \n\nAt the current stock price, investors don't earn anything from Tesla, they only earn from each other. Trading Tesla stock is then a zero-sum game. And in a zero-sum game making the same sort of moves most other people are making, won't yield good results. When the stock price is going up rapidly, you should sell or short, because then most people are buying, and you should then do the opposite of what most people are doing. When the stock price goes down fast then it's time to buy or to close short positions.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwtaow/",
      "created": 1729976998,
      "depth": 0,
      "replies": [
        {
          "id": "ltx14fa",
          "score": 16,
          "body": "Yea… trust the uh…Anal lists. Good plan my dude",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx14fa/",
          "created": 1729979694,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltwwheg",
          "score": 27,
          "body": "It is never the right time to short TSLA lol",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwwheg/",
          "created": 1729978075,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lu13shc",
          "score": 2,
          "body": "Dan Ives is one of the stupidest analysts I’ve ever heard talk about a company.\n\nStupider than that guy who pretended his zoom call froze ",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu13shc/",
          "created": 1730046865,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lu29myp",
          "score": 2,
          "body": "You should short the stock. In a big way.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu29myp/",
          "created": 1730059306,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltww3sz",
      "score": 3,
      "body": "A fellow MM subscriber I see",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltww3sz/",
      "created": 1729977945,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwt1nb",
      "score": 15,
      "body": "So many ppl in this sub celebrate TSLA downfall but when the market prices the company the way it does they cry.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwt1nb/",
      "created": 1729976916,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltws8cq",
      "score": 6,
      "body": "TSLA results are impressive with an 18% increase, but is it truly great? There are some highlights—better car margins, free cash flow exceeding expectations, and a strong energy biz (check the stock prices of ENPH and SEDG). That said, revenue fell short, and with the recent rise, the 2024 PE is nearly 100x, over 70x for next year. Definitely worth some thinking.\n\nAlso, Elon mentioned a 20-30% growth in vehicle sales expected next year, plus that affordable vehicle we thought was shelved is set to launch in the first half, which could help boost revenue.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltws8cq/",
      "created": 1729976648,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwwqug",
      "score": 9,
      "body": "Funny, everyone was licking his nuts just a couple years ago, now everyone just talks shit lmao",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwwqug/",
      "created": 1729978165,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltws3a3",
      "score": 14,
      "body": "Elon derangement syndrome is strong amongst the mentally ill",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltws3a3/",
      "created": 1729976602,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwpuff",
      "score": 16,
      "body": "Redditor in shambles for the 22% up 🤡\nGet over it 😂",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwpuff/",
      "created": 1729975887,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltxwlg9",
      "score": 7,
      "body": "You kids still don't  understand this company is taking over the world.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxwlg9/",
      "created": 1729991580,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltxhfux",
      "score": 9,
      "body": "Keep coping lol. Everyone will continually tell elon he is dumb. And yet, he will continually keep making more money and more successful companies. It's like you regards are in a self regarded loop",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxhfux/",
      "created": 1729985774,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwq6ho",
      "score": 4,
      "body": "I think that entire ER was lie after lie after lie",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwq6ho/",
      "created": 1729975993,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwoy61",
      "score": 8,
      "body": "Did everyone see that “the $25,000 model is silly and not needed” now? Elon really just saying whatever he wants to get those investors",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwoy61/",
      "created": 1729975607,
      "depth": 0,
      "replies": [
        {
          "id": "ltwsprw",
          "score": 15,
          "body": "TBF we have had a lot of inflation since that goal was set. Inflation adjusted, a model 3 is almost already there.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwsprw/",
          "created": 1729976807,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltx1l8d",
          "score": 2,
          "body": "Now now, GM needs to stay alive with their Bolt.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx1l8d/",
          "created": 1729979860,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltwsjyl",
      "score": 7,
      "body": "too late.  everyone has swallowed the Tesla kool-aid.  it's all bullshit.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwsjyl/",
      "created": 1729976754,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwus8e",
      "score": 6,
      "body": "It’ll never get old watching people refuse to understand something simple and then get mad and frustrated that they don’t understand it.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwus8e/",
      "created": 1729977501,
      "depth": 0,
      "replies": [
        {
          "id": "lu2ei2r",
          "score": 3,
          "body": "They literally publish their roadmap online.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu2ei2r/",
          "created": 1730060725,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltwtb81",
      "score": 10,
      "body": "TDS is strong here. 😆",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwtb81/",
      "created": 1729977003,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltwnmrk",
      "score": 14,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwnmrk/",
      "created": 1729975181,
      "depth": 0,
      "replies": [
        {
          "id": "ltwoih2",
          "score": 22,
          "body": "OK but capex isn't a factor in price to forward earnings ratios",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwoih2/",
          "created": 1729975473,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ltwrj6j",
          "score": 3,
          "body": "They're *not* spending some kind of multiple of what most other automakers are on capex, though...",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwrj6j/",
          "created": 1729976421,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltwq8kr",
      "score": 12,
      "body": "TSLA now operates just like DJT.  Its cult like behavior sprinkled with FOMO that just self perpetuates itself. There is nothing else to justify the value of the stocks.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltwq8kr/",
      "created": 1729976010,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltx8zg2",
      "score": 2,
      "body": "My take away from this chart.  Google is really, really cheap.\n\nGoogle so far in 2024 has made more money than Apple and Microsoft and yet has a P/E of 23 versus Apple 35 and Microsoft 36.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx8zg2/",
      "created": 1729982578,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltx9eps",
      "score": 2,
      "body": "Google looks like a really good deal right now… if they don’t get broken up.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltx9eps/",
      "created": 1729982737,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltxuf2z",
      "score": 2,
      "body": "I can't wait to see what happens when the merger with General Motors gets government sign off",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltxuf2z/",
      "created": 1729990737,
      "depth": 0,
      "replies": [
        {
          "id": "lu2evm4",
          "score": 2,
          "body": "The only thing left of GM will be empty buildings and some copper recycling.",
          "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu2evm4/",
          "created": 1730060834,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltyrp6z",
      "score": 2,
      "body": "I don’t think you’re understanding why he makes public pronouncements of new product launch dates.  He’s putting markers out there that he knows aren’t attainable and pushing his teams publicly to speed development up to hit earlier product development cycles.  He’s been a master at this because he’s still turning out new revolutionary products at an impressive rate even if he’s missing his launch date by months or even years.  It doesn’t matter as much with new products as long as they’re industry changing.  You get a much bigger pass on those launch delays from investors if they’re still a hit when they launch.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltyrp6z/",
      "created": 1730005149,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltyvyqw",
      "score": 2,
      "body": "I find it amazing how rational wsb is when discussing Tesla and its valuation.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltyvyqw/",
      "created": 1730007598,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltywsrj",
      "score": 2,
      "body": "just wait until starlink goes public",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltywsrj/",
      "created": 1730008098,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltywxh3",
      "score": 2,
      "body": "You can't discount the potential of Optimus.  I know there are people that are betting on thar alone.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltywxh3/",
      "created": 1730008178,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltyysu8",
      "score": 2,
      "body": "You people need to learn how zoom out on a graph.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltyysu8/",
      "created": 1730009345,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltzib6e",
      "score": 2,
      "body": "More surprising is at how \"little\" of a ratio Nvidia is priced. They actually have the business to back up their valuation.\n\n\nTesla has anything between being a second rate automotive company with a bit of stationary storage business and a bit of humanoid robotics R&D to burn cash to being one of the most valuable companies of all times covering many essential economic sectors between energy, transportation, labour, mobility and disrupting and dominating most of them.\n\n\nYou either win big or lose with Tesla in the coming 10-15 years. There is no in-between.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltzib6e/",
      "created": 1730022181,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltzx98l",
      "score": 2,
      "body": "short sellers was not happy when it jumped from $215 to $265..",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/ltzx98l/",
      "created": 1730031246,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu0pffa",
      "score": 2,
      "body": "That’s the reaction you get when you present fully fabricated numbers…which he had to do especially now during this crucial time trying to win the other fight (which btw I can’t write out loud without getting a warning? Wtf Reddit?",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu0pffa/",
      "created": 1730042304,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu1a1ut",
      "score": 2,
      "body": "So you're saying buy NVDA?",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu1a1ut/",
      "created": 1730048801,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu1e3f0",
      "score": 2,
      "body": "And FOMO starts, carrying TESLA higher.",
      "permalink": "/r/wallstreetbets/comments/1gcu0ih/the_absolute_madness_of_tesla/lu1e3f0/",
      "created": 1730049999,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The post discusses the erratic nature of Tesla's market reputation and Elon Musk's predictions.",
    "companies": [
      "Tesla"
    ],
    "tickers": [
      "TSLA"
    ],
    "main_ticker": [
      "TSLA"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The author expresses amazement at Tesla's market behavior and commentary on Elon's predictions.",
    "stock_recommendations": "The user is not explicitly recommending buying or selling any stocks.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "The sentiment appears neutral as the post is discussing Tesla's management and stock behavior without specific investment advice.",
    "sentiment": "neutral"
  }
}