{
  "title": "[MSOS/TLRY/CGC] As the DEA ponders rescheduling cannabis, a record number of banks are starting to work with cannabis companies.",
  "score": 60,
  "selftext": "https://www.marijuanamoment.net/a-record-number-of-banks-are-working-with-marijuana-businesses-as-rescheduling-looms-new-federal-data-shows/\n\n\"A record number of banks are now reporting that they’re working with state-legal marijuana businesses amid increased pressure on Congress to enact broader protections for financial institutions interested in servicing the cannabis industry and as the Biden administration’s rescheduling proposal advances, new federal data shows.\n\nThe Financial Crimes Enforcement Network (FinCEN) has been tracking cannabis banking trends for the past decade, and its latest report for the second quarter of 2024 shows a record high, with 831 banks and credit unions reporting their active involvement with marijuana companies.\n\nThat’s up from 815 in the first quarter of 2024 and 799 in the prior quarter.\n\nThere are several possible factors that could help explain the increase in banks working with cannabis businesses, including the expansion of state marijuana markets as more legalization laws have taken effect over time. It’s also possible financial institutions are more willing to navigate the space as congressional lawmakers across the aisle continue to discuss their shared interest in advancing codified protections for banks under the Secure and Fair Enforcement Regulation (SAFER) Banking Act.\n\nThat legislation cleared a Senate committee last year, but it’s still pending floor action. With limited time left this session—and competing legislative priorities during an election year—the chances that it moves through the Senate and GOP-controlled House this year are unclear at best, however.\"\n\nIt's an interesting development to see now that there are banking institutions willing to work with cannabis companies, even though SAFER hasn't been passed through Congress yet, it tells us that some banks are willing to take the risk of working with these companies even though cannabis remains federally illegal, maybe it could be a sign that banks are seeing the sector favorably to make businesses with in the future.\n\nPositions: 1000 shares of MSOS @ 7.69 average, I really want to see how the sector will look like after this election is over.\n\nNot Financial Advice. ",
  "link_flair_text": "News",
  "id": "1ge5qjx",
  "num_comments": 14,
  "created_utc": 1730131349,
  "permalink": "/r/wallstreetbets/comments/1ge5qjx/msostlrycgc_as_the_dea_ponders_rescheduling/",
  "comments": [
    {
      "id": "lu70tdu",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 6 months ago\n**Total Comments** | 184 | **Previous Best DD** | \n**Account Age** | 6 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1ge5qjx/msostlrycgc_as_the_dea_ponders_rescheduling/lu70tdu/",
      "created": 1730131355,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu9wdl8",
      "score": 7,
      "body": "I’ve been an investor in cannabis stocks for many years. I want to believe but damn have a been hurt too many times in this industry",
      "permalink": "/r/wallstreetbets/comments/1ge5qjx/msostlrycgc_as_the_dea_ponders_rescheduling/lu9wdl8/",
      "created": 1730163539,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lubfgla",
      "score": 4,
      "body": "I played all these, I think MSOS is the best for right now.",
      "permalink": "/r/wallstreetbets/comments/1ge5qjx/msostlrycgc_as_the_dea_ponders_rescheduling/lubfgla/",
      "created": 1730189440,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu80l4w",
      "score": 5,
      "body": "I agree with your assessment and think MSOS will be one of the better performing stocks in my portfolio in a 12-24 month horizon.  I also like GTBIF in this sector",
      "permalink": "/r/wallstreetbets/comments/1ge5qjx/msostlrycgc_as_the_dea_ponders_rescheduling/lu80l4w/",
      "created": 1730142030,
      "depth": 0,
      "replies": [
        {
          "id": "lu8aahk",
          "score": 3,
          "body": "I maintain optimism, but with a lot of caution this time.\n\n\nHave to see what will come out of Florida's voting and what the next presidential cabinet is gonna look in regards to cannabis.\n\n\nTruth to be told, I honestly think I should have taken profits back in May, but didn't because I thought that the DEA wouldn't be so slow to move with this, so now I won't take my chances if I see signs of trouble.",
          "permalink": "/r/wallstreetbets/comments/1ge5qjx/msostlrycgc_as_the_dea_ponders_rescheduling/lu8aahk/",
          "created": 1730144957,
          "depth": 1,
          "replies": [
            {
              "id": "lu8gka6",
              "score": 3,
              "body": "I live in Florida. The amount of money spent on Amendment 3 (pro-legalization) ads is impressive.  From what I hear, it is likely to pass.\n\nI think the weed boom will be fairly short-lived, though, as it relates to stock prices.  Maybe one or two good years.",
              "permalink": "/r/wallstreetbets/comments/1ge5qjx/msostlrycgc_as_the_dea_ponders_rescheduling/lu8gka6/",
              "created": 1730146827,
              "depth": 2,
              "replies": [
                {
                  "id": "lu8knk4",
                  "score": 1,
                  "body": "Any idea what the early votes are looking like for A3?",
                  "permalink": "/r/wallstreetbets/comments/1ge5qjx/msostlrycgc_as_the_dea_ponders_rescheduling/lu8knk4/",
                  "created": 1730148044,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lu8n4qq",
                      "score": 4,
                      "body": "66% support reported by Forbes via a UNF poll.  These are not exit poll numbers, just eligible voters.  I haven't dug into the meat of the data. Obviously, numbers will be skewed pro-weed if they are just asking college kids",
                      "permalink": "/r/wallstreetbets/comments/1ge5qjx/msostlrycgc_as_the_dea_ponders_rescheduling/lu8n4qq/",
                      "created": 1730148782,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lu8n7zy",
                          "score": 1,
                          "body": "I forgot to mention 60% needed to pass",
                          "permalink": "/r/wallstreetbets/comments/1ge5qjx/msostlrycgc_as_the_dea_ponders_rescheduling/lu8n7zy/",
                          "created": 1730148810,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lu8oncm",
                              "score": 1,
                              "body": "To much of a tight margin if you ask me. And polls aren't that much reliable anyway.\n\n\nBut I suppose we will have an better idea of what the voting will look like around Thursday and Friday.",
                              "permalink": "/r/wallstreetbets/comments/1ge5qjx/msostlrycgc_as_the_dea_ponders_rescheduling/lu8oncm/",
                              "created": 1730149240,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}