{
  "title": "CVS Stock - owned 20 years; hold forever or sell?",
  "score": 49,
  "selftext": "I purchased CVS stock when I was an employee 20 years ago; their ESPP let me set aside part of my pay and buy the stock at a discount. I didn't have many other investments 20 years ago and other than letting the dividend drip over time, i never purchased anymore. My cost basis is around $22 per share.  It currently is 2% of my taxable brokerage account and under 1% of my total networth in CVS stock.  However it has been a dog the last few years and it is getting hammered.  \n\nAt such small exposure in my portfolio would you just leave it alone as a \"lifetime\" stock, or cash out at some point ant move on? It's not enough money to get crazy about and there is some interest in owning it for another 20 years too. ",
  "link_flair_text": null,
  "id": "1ge7wo2",
  "num_comments": 89,
  "created_utc": 1730136585,
  "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/",
  "comments": [
    {
      "id": "lu7klaq",
      "score": 137,
      "body": "You're going to find fewer and fewer sympathetic ears to hearing about the notion of 'forever stocks' - with the speed of technological advances, market changes, geopolitical changes there is no such thing as a forever stock and no stock should ever be treated as one. You buy and hold a stock until the thesis doesn't hold any longer, then you part with it. Whether that's 1 week, 1 year or 2 decades doesn't matter. What matters is that you aren't keeping ahold of dead weight. \n\nToo few people think of opportunity cost. For several years CVS has done miserably. Your losses don't amount merely to where you are now relative to when the stock began doing poorly. Your losses include all the potential income/capital appreciation you would have incurred had you sold earlier and invested in something profitable.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7klaq/",
      "created": 1730137274,
      "depth": 0,
      "replies": [
        {
          "id": "lu8tov0",
          "score": 4,
          "body": "Learnt opportunity cost early but it's important. It's easy to go with the mindset that's it's not losing too much or it's just idling along so you leave it. You invest/trade to let your money work for you, not waste your time, letting something sit that's dead weight is costing you in a sense. Also I don't know cvs that well but I know it's a large pharmacy and would need to do something special to grow a large amount from here, odds of that are pretty small.",
          "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu8tov0/",
          "created": 1730150801,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lu7tkhj",
          "score": 5,
          "body": "You are correct; there is an opportunity cost to consider but that really is in hindsight.  My cost basis even with years and years of dividend reinvestment is only around $20. So at current $57 I am still ahead, but not like at $80...years ago. Good point.",
          "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7tkhj/",
          "created": 1730139941,
          "depth": 1,
          "replies": [
            {
              "id": "lu846tm",
              "score": 14,
              "body": "Think you have answered your question. Stock which is trading twice your cost basis. Stock which may not have upside. \n\nOr it could moon the day you sell .",
              "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu846tm/",
              "created": 1730143126,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lua6mao",
              "score": 3,
              "body": "I'm pretty sure the losses recently have been caused by health insurance market difficulties with Aetna. So it might turn around in the next year. I've been looking at CVS personally but I'm waiting for it to bottom out",
              "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lua6mao/",
              "created": 1730166969,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lu8cbl6",
      "score": 29,
      "body": "So a more measured analysis. \n\nCVS had a P/S ratio of 0.64 in 2015. That dropped from there and peaked again at 0.43 in 2021. It is currently at its lowest point in 10 years now, at about 0.20. It has steadily increasing revenues over the last 10 years, including during the pandemic, and revenues have doubled since 2016. So this is growing at about a 9%? rate, revenue-wise. It has almost quadrupled since 2009.\n\nWell then, what gives with the stock price?\n\nWell, earnings have slightly more than doubled in the same amount of time. The company is making a consistent profit, and the ratios ...\n\nP/E around 10, near lows for CVS. P/S around 0.20, below lows for CVS.\n\nThat is STRONG value territory, even though they are a mediocre company. \n\nAnd to be honest, it if were me, I would look at cost cutting and efficiency. A good announcement from management and the stock price could double over night. \n\nThe high point here is that you are unlikely to lose your shirt on CVS. It is performing in a way that says, at least from the numbers, that it is still a going concern. Margins may continue to be squeezed, but small growth is still growth, and some changes by management, if they bring someone in who knows what they are doing, could result in some upside surprises. \n\nI see nothing wrong in holding this in a portfolio at this stage, as long as you realize it is part of the value side of the portfolio. It looks like a pretty good stalwart to me.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu8cbl6/",
      "created": 1730145557,
      "depth": 0,
      "replies": [
        {
          "id": "lu8wtll",
          "score": 6,
          "body": "Thank you for the more data based analytical side !",
          "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu8wtll/",
          "created": 1730151778,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lua8c7s",
          "score": -7,
          "body": "This is not a good analysis at all. You really think the stock could double overnight with an announcement… lmao",
          "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lua8c7s/",
          "created": 1730167551,
          "depth": 1,
          "replies": [
            {
              "id": "luamgn6",
              "score": 1,
              "body": "If it does it won’t sustain that and OP won’t be ready to sell to take advantage. \n\nMaybe consider a couple levels (my own, more technical than anything): \n\nBelow $43 would be surprising, cataclysm of some sort perhaps, bankrupt etc. Below $43 id sell just to be ahead, full stop loss for a month close under $$43\n\n$50 is prob the number you want to always hold this stock (imo). Hold comfortably as long as it’s above $50. Enter at $50 would be good R:R imo. Yearly TL retest level, psych level, ema level (ie confluence). Not a good volume shelf though tbh.\n\nStart selling anything above $75. Offload 70% at $75 keep the rest as runners to $80/$90/$100.\n\nHaving said all this agree with the basic sentiments, I don’t like the company future outlook and don’t think your money is great sitting here vs other places. Unless we see a hold of $50 and some upside trend in the next 3-5y I’d cash out or sell sell calls perhaps against the position.",
              "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/luamgn6/",
              "created": 1730172687,
              "depth": 2,
              "replies": [
                {
                  "id": "luazbgn",
                  "score": 0,
                  "body": "If you say their money shouldn't be sitting in CVS, then why not sell now? It's not like the entry price changes anything.",
                  "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/luazbgn/",
                  "created": 1730178836,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lubmnoq",
                      "score": 1,
                      "body": "Also an option. However since it’s beat down and close to $50 if it holds there and turns then a 3-5y more year hold is worth the oppty for returns.\n\nSelling now would essentially be selling an entry point and we want to optimally sell high. \n\nOp interested in a life hold and doesn’t necessarily see another place for this money atm so was giving structure to a bullish case, and a trigger to stop loss.",
                      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lubmnoq/",
                      "created": 1730194428,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lu7s4np",
      "score": 26,
      "body": "Sell. Far better opportunities. They’ve many challenges ahead.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7s4np/",
      "created": 1730139512,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu7px7s",
      "score": 6,
      "body": "The dividend is fairly good if you need the income.  Growth isn’t there, so capital gains will probably lag the S&P 500 by a significant amount.\n\nWhen I am undecided about a stock, I sometimes sell enough to recoup my cost basis and keep the remaining “free” shares.  CVS is cheap right now, so holding for a better price is also an option.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7px7s/",
      "created": 1730138855,
      "depth": 0,
      "replies": [
        {
          "id": "lu7u59d",
          "score": 3,
          "body": "My cost basis, even with DRIP, is only around $20.  I could sell off my cost basis and just leave the rest in a little corner somewhere.  \n\nWe are talking like $10K worth in a taxable account that is around 430-440 range",
          "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7u59d/",
          "created": 1730140112,
          "depth": 1,
          "replies": [
            {
              "id": "lubdr37",
              "score": 2,
              "body": "$430 a year, or per quarter? If that's quarterly you're taking in over $1,700 annually. $10k divided by your $20 cost basis puts you at 500 shares, they currently pay out $0.665 per share quarterly, that puts you at $332.50 per quarter $1330.00 Annually. \n\nSo if you sell, will you out perform by 13-17%, every year for the next however many years?",
              "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lubdr37/",
              "created": 1730188245,
              "depth": 2,
              "replies": [
                {
                  "id": "lubsruh",
                  "score": 4,
                  "body": "No, $10K of CVS stock in a taxable portfolio that is worth $430-440K overall.  CVS is 2% of my taxable portfolio and a bit under 1% of total net worth",
                  "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lubsruh/",
                  "created": 1730198190,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lua2t9m",
      "score": 5,
      "body": "Use the dividends to buy something growthier",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lua2t9m/",
      "created": 1730165709,
      "depth": 0,
      "replies": [
        {
          "id": "lua5wlk",
          "score": 2,
          "body": "Could do that. However, somewhat enamored to see what it could become on its own.  Maybe not the best stock ever, but seeing what it has become in 40 years from $3000-ish set aside as a kid has some allure.",
          "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lua5wlk/",
          "created": 1730166731,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lu9uxib",
      "score": 3,
      "body": "Agreed on some other analysis below. The PS is relevant. I’d expect they do have some additional difficulties ahead, and the recent replacement of the CEO indicates managements concern, too. They have been talking about doing a better job with Medicare 2025 assessments. They misstepped for 2024 and ended up paying out more than they underwrote. They have substantial debt but also bring in tons of revenue with decent cash flow. I’d hope they could allocate appropriately if things get dicey with the debt. Another risk is they get outcompeted by Amazon or cost plus drugs. Their vertical integration should help them continue to operate even if competition starts biting into one of their operating segments. There is real regulatory risk as well. A split government would likely be beneficial in the long run. If one party takes house, senate, and presidency, they are likely to get broken up. If they do, they may lose an advantage. They do pay a dividend, too. Disclaimer: they are definitely deep value right know, and they’re still in a downtrend.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu9uxib/",
      "created": 1730163058,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lubxzp3",
      "score": 3,
      "body": "Just ride it out. Your cost basis is low and that stock is marginally small in your account. Yes, it’s not performing well. But you’re fine.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lubxzp3/",
      "created": 1730200951,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu7k6ez",
      "score": 9,
      "body": "You have a nice gain but the opportunity cost is significant. Over that 20 years you missed out significantly. The opportunity cost will remain and over the next 20 years you will miss out significantly. You have to ask yourself, would you buy the company today? The answer seems to be no. I’d sell.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7k6ez/",
      "created": 1730137152,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu7mylr",
      "score": 6,
      "body": "Honestly sell. While i am a believer in forever stocks the same stock isn't the same if the landscape adjusts. \nFor example I like logistics (they will be forever plays until targeted teleportation exists) and when it does the large logistics or tech that I'm holding will probably buy it anyways.\n\nFor CVS, their MOAT is drying up. Too many competitors in mobile and online pharmacy like HIMS etc.\n\nWalmart is excelling in the medicine home delivery phase. And I'm not saying CVS won't make money any other ways but, when you dent the main weapon usually they have only 2nd best options. Rarely does a company that established shift course really well. And with the advent of business adjusting solutions to become your own self competitor like PLTR business solutions in data. The less nimble companies will die.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7mylr/",
      "created": 1730137977,
      "depth": 0,
      "replies": [
        {
          "id": "lu7owdf",
          "score": 5,
          "body": "The CVS value proposition is that it if its open 24 hours, and you're barfing in the middle of the night, you can get your pepto bismal. Also some people want/demand face to face interaction with real pharmacist.",
          "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7owdf/",
          "created": 1730138549,
          "depth": 1,
          "replies": [
            {
              "id": "lu7qvrs",
              "score": 10,
              "body": "I haven't seen any stores open 24 hours since before covid. Most CVS locations by me are only open until 9 or 10pm with pharmacies closing at 6 or 7pm.\n\n\nRite-aid, CVS, and walgreens are all overpriced convenience stores and they've lost most of their convenience factor.",
              "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7qvrs/",
              "created": 1730139142,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lu7t6z7",
              "score": 3,
              "body": "Very, very few CVS are 24-hours. Less than 1%. \n\nAnd for those that are, you can rest assured that they aren't wracking that profit up at 1AM.\n\nWalmart once again is an answer, and even many of those never returned to being 24/7 after Covid.",
              "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7t6z7/",
              "created": 1730139830,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lu7ppaz",
              "score": 5,
              "body": "I mean if you're frequently sick and have any common sense you usually keep the needed medicine at your house. \n\nNot downplaying that it wouldn't be useful. But, ima be real. That's not a MOAT, it's at best a nonperdiodic convenience.",
              "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7ppaz/",
              "created": 1730138789,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lua6pch",
              "score": 2,
              "body": "I'm in a mid-size metro area and I can't find any 24 hour pharmacies and like 2 24 hours stores at all.",
              "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lua6pch/",
              "created": 1730166997,
              "depth": 2,
              "replies": [
                {
                  "id": "lufucd7",
                  "score": 2,
                  "body": "I lived in the south Bay Area for a couple years, recently moved. They were closing all the CVS stores outside of a single (awful) 24-hour CVS. Meanwhile, in Reno they are a bit cleaner and more common.\n\nThat said, less than 10% of CVS' revenue comes from things sold in their stores ex-pharmacy. \n\nRemember, CVS is an *insurance company* and pharmacy company. Their problems have stemmed from trying to integrate the two (and now actual urgent cares they've been buying up).",
                  "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lufucd7/",
                  "created": 1730246590,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lu8dh8n",
      "score": 2,
      "body": "Not many CVS stores near me are open 24 Hrs.  They also expanded their footprint too quickly.  I have 3 CVS stores near me within a mile, forget even the other pharmacies…. CVS is going to need to offload some costs to rebound, which will likely mean closing stores…",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu8dh8n/",
      "created": 1730145903,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu7th82",
      "score": 4,
      "body": "CVS minute clinic is super nice, and lots of often times booked. \n\nSuper easy to go an get birth control shots for my GF. Company makes $121 dollars or whatever insurance pays for it",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7th82/",
      "created": 1730139913,
      "depth": 0,
      "replies": [
        {
          "id": "lu7ushv",
          "score": 5,
          "body": "I do like the minute clinics; I see value in those, as well as their partnership with Target.   \nThey have huge challenges and management has been a bunch of pocketstuffing shits.  I usually try to invest with logic....but at around 2% of my taxable account do I just let it do its thing as an emotional play?  I could easily take back my cost basis of around $20 I suppose and let the rest all ride.",
          "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7ushv/",
          "created": 1730140304,
          "depth": 1,
          "replies": [
            {
              "id": "lu82od4",
              "score": 1,
              "body": "2% isn’t that much I blew 90% of my portfolio on spirit airlines and sold the bottom at 1.41 so don’t listen to me. \n\nIf your willing to lose 20k sure why not, all cvs need to do is announce its selling compounded glp1 or offering this services in the minute clinic then it rockets. \n\nNo more gym membership going to go to cvs weekly to lose weight",
              "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu82od4/",
              "created": 1730142665,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lu894jm",
          "score": 3,
          "body": "Since its only 2% of your taxable account, keep it if you’re sentimental about it but that would be the only reason.",
          "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu894jm/",
          "created": 1730144612,
          "depth": 1,
          "replies": [
            {
              "id": "lu8x9ov",
              "score": 1,
              "body": "I do admit I am kind of sentimental about it. It was one of the first stocks I owned, and one of the few handful of individual company stocks I still do own. I had a manager when I was new that said buy up all of this you can, it's a great deal.  Well, having just started in the working world I couldn't set aside much but overall am glad I did and always remember that advice in my head.",
              "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu8x9ov/",
              "created": 1730151917,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lu84vyr",
      "score": 4,
      "body": "You can always split the difference.  Sell half.  If it moons the next minute, you still gain.  If is tanks, you don’t lose nearly as much",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu84vyr/",
      "created": 1730143339,
      "depth": 0,
      "replies": [
        {
          "id": "luasafs",
          "score": 1,
          "body": "This.  It isn’t binary.  You can reinvest profits and let initial investment ride CVS is still the best pharmacy company.",
          "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/luasafs/",
          "created": 1730175223,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lu8vssn",
      "score": 4,
      "body": "Sell and move on. It is a terrible industry.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu8vssn/",
      "created": 1730151460,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu7vnyw",
      "score": 1,
      "body": "I made more in NVDA in 2 years than you did in 20 years with CVS. Why invest in bad companies?",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7vnyw/",
      "created": 1730140565,
      "depth": 0,
      "replies": [
        {
          "id": "lu7zvqw",
          "score": 7,
          "body": "Haha NVDA is like the best stock besides AAPL or MSFT but CVS isn’t bad. It’s good to diversify.",
          "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7zvqw/",
          "created": 1730141821,
          "depth": 1,
          "replies": [
            {
              "id": "lu8cwj6",
              "score": 3,
              "body": "CVS has a 10 year return of -33% 😂",
              "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu8cwj6/",
              "created": 1730145730,
              "depth": 2,
              "replies": [
                {
                  "id": "lua65sy",
                  "score": 2,
                  "body": "Yes, but I have owned for 20 years, not 10. My return is closer to 160% even with the depressed prices of the past 3 years.",
                  "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lua65sy/",
                  "created": 1730166816,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lu8katm",
                  "score": 1,
                  "body": "My portfolio is basically an ETF. Composed of 23 different assets. I’m looking to add two more companies. Just the way I’ve decided to invest. So far it’s been going well and quite fun.",
                  "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu8katm/",
                  "created": 1730147940,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lu8ffie",
      "score": 1,
      "body": "I’m at a loss with CVS, but then again it’s not an important part of my portfolio. Right now I’ll probably just stay and then get out of it if it hits 70. I think there are far better stocks out there and just even selling CVS and buying a tech stock like MSFT or even V on a pullback will get you further ahead.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu8ffie/",
      "created": 1730146489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu8pgqx",
      "score": 1,
      "body": "My grandparent's company was bought out by CVS many many years ago....RUN from that business. Buy some Berkshire B's during the next dip.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu8pgqx/",
      "created": 1730149495,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu8q390",
      "score": 1,
      "body": "Your dividend yield at $22 per share is 12% a year, personally I’d consider turning off the reinvestment and use the dividends to fund moving into a new position (whether that’s a stock or a fund). Even more frankly I’d consider keeping it turned on, the dividend seems pretty safe and the stock is already beaten down.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu8q390/",
      "created": 1730149687,
      "depth": 0,
      "replies": [
        {
          "id": "lu8yp6w",
          "score": 2,
          "body": "Yeah kind of where my head is.  I've never bought more since leaving the company like...19 years ago. I've never taken the dividend; just let it DRIP.  I was a teenager and at the time it was a great deal. I certainly have never hated it.",
          "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu8yp6w/",
          "created": 1730152362,
          "depth": 1,
          "replies": [
            {
              "id": "lu903yu",
              "score": 1,
              "body": "What were they doing for the espp plan at the time, did they do share matching or a price break? I always enjoy reading stories of people who did smart stuff with stocks at a young age, that was definitely not my path but hoping to impart it with my own kids.",
              "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu903yu/",
              "created": 1730152802,
              "depth": 2,
              "replies": [
                {
                  "id": "lua7o9x",
                  "score": 2,
                  "body": "It was a discount; I don't recall exactly if it was the lowest point in a 6 month range, or just a discount off the beginning or end date.  \n\nYou know when old Biff goes back to young Biff with the Sports Almanac? I envision myself going back to my teenage years saying \"No butthead, buy 5 times that much!\"\n\nYes, I would have made a lot more money if I sold it 3 years ago and bought Nvidia....but I'm not that savvy to spot stuff like that. I could imagine owning this for 40 years and teaching my own kid or grandchildren a lesson about starting young and even if you don't know much...know when there's a good deal to take.",
                  "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lua7o9x/",
                  "created": 1730167325,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lu9iisn",
      "score": 1,
      "body": "There’s no such thing as a forever stock.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu9iisn/",
      "created": 1730158923,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu9kkmx",
      "score": 1,
      "body": "If you’re holding it for the sake of holding it, then it’s not an investment, it’s an heirloom \n\nThe question to ask yourself…if I had X dollars to day would I invest in CVS? If NO, then cash out and invest in something you would. If YES then keep the position. \n\nI sense you’re emotionally tired to this investment. Stop. Look at it objectively. It really doesn’t matter how long you’ve held it for.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu9kkmx/",
      "created": 1730159617,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu9ocmi",
      "score": 1,
      "body": "If ya got a decent position. Sell options against it",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu9ocmi/",
      "created": 1730160878,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu9q6sl",
      "score": 1,
      "body": "sell",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu9q6sl/",
      "created": 1730161489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu9qn7r",
      "score": 1,
      "body": "I just listened to this Motley Fool Podcast that featured CVS stock.  I think you will find it very interesting.\nhttps://www.fool.com/podcasts/motley-fool-money/2024-09-30-cvs-gets-an-activist-check-up/",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu9qn7r/",
      "created": 1730161637,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu9qqr0",
      "score": 1,
      "body": "CVS is going to go down more and more. People are going in and stealing left and right.  Pressure from mail-in scripts and Amazon and others.  Look at all the closures for CVS and Walgreens and Rite-aids.  Sell ASAP",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu9qqr0/",
      "created": 1730161670,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu9ri6b",
      "score": 1,
      "body": "I dumped most of it a few years back at $80. I don’t really get an overarching sense of competence from them.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu9ri6b/",
      "created": 1730161926,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu9vn8z",
      "score": 1,
      "body": "Nooone ever goes cvs , they only have the pharmacy . Sell it and buy something important",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu9vn8z/",
      "created": 1730163294,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu9wwvj",
      "score": 1,
      "body": "There are better places for your money.  Industry is getting eroded by Amazon and other direct pharmacies.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu9wwvj/",
      "created": 1730163719,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lua4jyd",
      "score": 1,
      "body": "I was putting some money in like 6 years ago when I first started working then stopped a year after and sold it all. Bad future. “Do it all” tech is the way to go",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lua4jyd/",
      "created": 1730166292,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luakcqp",
      "score": 1,
      "body": "From a simple technical analysis standpoint, it is at a resistance level that it has bounced off of multiple times recently, so there’s that",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/luakcqp/",
      "created": 1730171849,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luar1gw",
      "score": 1,
      "body": "When mark cuban got into the pharmacy game was your clue that the traditional way of doing business was going to be losing market share asap",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/luar1gw/",
      "created": 1730174644,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luau7t8",
      "score": 1,
      "body": "20 years is crazy bro",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/luau7t8/",
      "created": 1730176145,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luaxs6x",
      "score": 1,
      "body": "You held it this long. Filled the dividend wait for it to go to 85 and then sell it.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/luaxs6x/",
      "created": 1730177975,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lub7q3i",
      "score": 1,
      "body": " Personally I would hold to avoid ltcg. But I understand if you see it as a dog. ",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lub7q3i/",
      "created": 1730184094,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luboi55",
      "score": 1,
      "body": "You need money sell. Don’t need, hold.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/luboi55/",
      "created": 1730195634,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lubw7g0",
      "score": 1,
      "body": "Here's my obligatory skeptical and bearish opinion to boost the stock for you.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lubw7g0/",
      "created": 1730200047,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lucrrsv",
      "score": 1,
      "body": "1% of your total networth is not enough to worry about. you should sell CC and let it go if assigned",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lucrrsv/",
      "created": 1730212384,
      "depth": 0,
      "replies": [
        {
          "id": "lufieqf",
          "score": 1,
          "body": "When you sell a CC can you pick any sale price you want?",
          "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lufieqf/",
          "created": 1730242580,
          "depth": 1,
          "replies": [
            {
              "id": "luimj7j",
              "score": 1,
              "body": "no it depends on the option chain and strikes , monthly option chains are in the increment of 1$ or some times 0.5$ or 5$ .",
              "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/luimj7j/",
              "created": 1730294389,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lujvpnx",
      "score": 1,
      "body": "Great comments. I feel that a company with a lot of debt will always struggle. Karen Lynch mismanaged acquisitions and ran up a huge bill while overpaying for Oak Street and Signify. She was getting paid 21 million dollars and she probably get a huge severance. Competition is tough and they are on treacherous ground in a rough industry.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lujvpnx/",
      "created": 1730308299,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luto3mp",
      "score": 1,
      "body": "There is very strong support at the 55 and 52 dollar levels. We did have a minor dip below 55 recently, but this was a buying opportunity as far as I'm concerned. The last time the stock was below 55 (other than earlier this year) was in 2019. The last time the stock closed below 51.70 was in 2013. \n\nMy average cost is around 54. If I see a close below 51.70 I will be 100% out of my position and looking to go short if we get a single close below 50. There is very little support below 50 and I am looking to target the 30 dollar range. \n\nSo, in my opinion, this is the wrong time to be selling shares and you might as well wait unless you desperately need the money. Assuming you put a stop somewhere around 50 \\~ 52 (which I highly advise), you are only risking a few dollars per share from the current price. However, the potential upside is upwards of 100%.\n\nIf this thing breaks support though it's going into freefall and I imagine the chart will end up looking something like WBA. So please sell and take your profits in this case.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/luto3mp/",
      "created": 1730446134,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu7mr2x",
      "score": 0,
      "body": "You could do both?  Sell half and reinvest in market index. Hold half because you think you understand CVS better than wall street analysts or whatever.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7mr2x/",
      "created": 1730137916,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu93bqc",
      "score": 0,
      "body": "Gsat stock 📍",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu93bqc/",
      "created": 1730153845,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luavzei",
      "score": 0,
      "body": "Omg sell they’re fucked",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/luavzei/",
      "created": 1730177023,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luawabf",
      "score": 0,
      "body": "I dumped it",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/luawabf/",
      "created": 1730177180,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu7rzga",
      "score": -1,
      "body": "If you want to take profit at least sell for profit.  In my case i am underwater.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7rzga/",
      "created": 1730139469,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu7vbmo",
      "score": -1,
      "body": "I’m sorry",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7vbmo/",
      "created": 1730140461,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu7x6bh",
      "score": -1,
      "body": "i do not follow cvs, but the whole mess smells funny. i know someone who is REALLY good as a manager, that they foolishly let go a year ago.  they really could use her right now!",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7x6bh/",
      "created": 1730141015,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu7khw5",
      "score": -5,
      "body": "Hold.",
      "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7khw5/",
      "created": 1730137246,
      "depth": 0,
      "replies": [
        {
          "id": "lu7s1ge",
          "score": 2,
          "body": "CVS is the only pharmacy that will survive. WMT, AMZN, COST will take over. I understand this but CVS will be the final pharmacy imo.",
          "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7s1ge/",
          "created": 1730139486,
          "depth": 1,
          "replies": [
            {
              "id": "lu7tgbf",
              "score": 0,
              "body": "The final company of a dying industry isn't a hold. It, like the industry whose era it is bringing to a close, is a sell.",
              "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7tgbf/",
              "created": 1730139906,
              "depth": 2,
              "replies": [
                {
                  "id": "lua9qr9",
                  "score": 2,
                  "body": "Walgreens and Rite Aid were failing to keep customers bc customers were going to CVS. This was before the added pressure of Walmart, Amazon, and Costco. CVS also has minute clinic and they bought Aetna, so they're not going down without a fight. They definitely need to figure out Aetna, but I'd call it a decent hold",
                  "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lua9qr9/",
                  "created": 1730168027,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lu7u9bg",
                  "score": 1,
                  "body": "I don’t agree with your valuation.",
                  "permalink": "/r/stocks/comments/1ge7wo2/cvs_stock_owned_20_years_hold_forever_or_sell/lu7u9bg/",
                  "created": 1730140146,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}