{
  "title": "Doubling down on RIVN",
  "score": 101,
  "selftext": "I've always been bullish on RIVN but after getting a car, it's clear to me they know how to make an absolutely impressive product and as price drops (with the release of R2 & R3 lines), they'll win market share.\n\n  \nA few things that stand out to me:\n\n1. RIV is currently trading around 11BN market cap w/ $7+bn cash on hand as of Q2\n\n2. Investment in VW, the subsequent launch of Scout (which looks to be a lot of Riv tech) an the closing of VW Germany shows me that RIV could be a huge piece of VW's play (currently $50BN market cap)\n\n3. Growing # of F500's using RIV truck as fleet, not a lot of competition here\n\n4. TSLA added $150BN+ of market cap last week due to an amazing quarter amongst other things. That market swing is 15x Rivians total market cap. Shows me a LOT of potential for RIVN\n\n  \nAnything else I'm missing on the pros side? Any major cons to have a healthy debate?",
  "link_flair_text": "Discussion",
  "id": "1ge9hl2",
  "num_comments": 80,
  "created_utc": 1730140413,
  "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/",
  "comments": [
    {
      "id": "lu7v61r",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu7v61r/",
      "created": 1730140416,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu99t4a",
      "score": 41,
      "body": "I’m loaded to the tits on rivn. Unfortunately it’s causing them to be very saggy lately.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu99t4a/",
      "created": 1730156006,
      "depth": 0,
      "replies": [
        {
          "id": "lu9yozs",
          "score": 9,
          "body": "Hahhahahahahaah",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu9yozs/",
          "created": 1730164330,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lu7xelk",
      "score": 74,
      "body": "It’s gonna be a long ride but I hope you’re right",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu7xelk/",
      "created": 1730141083,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu8fvpj",
      "score": 34,
      "body": "Let me preface this by stating that I have liked every RIVN I have seen and I genuinely hope they do well.\n\nWith that being said, you are sacrificing investing in other companies that are far safer and who also offer significant growth potential vs a company losing money on every vehicle they sell in an industry where China is sinking billions into supporting their manufacturers. BYD and the other Chinese manufacturers are going to crater prices globally. You are betting on Europe and the US essentially protecting RIVN from China and then they also need to beat out every other car company that does business in the US and Europe. The risk to reward is just not there for investing in RIVN.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu8fvpj/",
      "created": 1730146623,
      "depth": 0,
      "replies": [
        {
          "id": "lu9ixn9",
          "score": 3,
          "body": "EU already has tariffs out on Chinese steel and EVs. I can’t believe you’d even question if our next mango shade of president would protect the American Company Rivian from Chinese EVs",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu9ixn9/",
          "created": 1730159061,
          "depth": 1,
          "replies": [
            {
              "id": "lua3qmi",
              "score": 14,
              "body": "He wouldn’t because Elon would be in office and he will bleed rivian dry. \n\nThere will be 0 govt support if Trump wins",
              "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lua3qmi/",
              "created": 1730166021,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lu80sq5",
      "score": 13,
      "body": "There was unusual call option activity today",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu80sq5/",
      "created": 1730142093,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu86rzy",
      "score": 9,
      "body": "Definitely still in on RIVN on my side. ",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu86rzy/",
      "created": 1730143910,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu811ts",
      "score": 23,
      "body": "Pros I'd add they have a standing 100,000 van order with Amazon that's still in progress. That's steady sales for at least another year.\n\nThe con is they've missed delivery numbers and lose money on every car they sell so far. They're supposed to be gross positive by the end of the year with changes they've made, but we'll see next week what the progress is there. I think it's going to be ugly, but there are a lot of people who disagree, so I'd be happy to be wrong.\n\nI'm there with you, their stuff is great, but the last quarter or so has been really disappointing when they keep adjusting guidance down because of avoidable issues (they under-ordered motor parts)... and it feels like someone got the word out they were going to miss numbers before their official announcement. (high volume drop with no news, until there was)\n\nI'm in with you long term, and hope they have something coming with the VW announcement. I think it's going to be a great long-term play, if they can get to the R2 and beyond without losing consumer confidence.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu811ts/",
      "created": 1730142170,
      "depth": 0,
      "replies": [
        {
          "id": "lu8ssvu",
          "score": 4,
          "body": "I assume you mean steady sales until 2029 with Amazon",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu8ssvu/",
          "created": 1730150527,
          "depth": 1,
          "replies": [
            {
              "id": "lu8znqq",
              "score": 4,
              "body": "Pretty sure Amazon takes exactly as many vans and Amazon wants to take at this point. It has been a slower rollout than expected when they agreed.\n\nIf I remember right, they have to give something like 2 months notice and pay for actual costs incurred up to that point to end the deal.. but the contract is pretty friendly to both sides.\n\nIt's still on the books though, so definitely a plus.",
              "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu8znqq/",
              "created": 1730152661,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lu8kbmz",
      "score": 6,
      "body": "Same boat, I think a lot of the downside is already priced in and could be a positive earnings gross profit wise",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu8kbmz/",
      "created": 1730147946,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu999od",
      "score": 6,
      "body": "Rivian makes good cars that for sure, I think it will grow slowly.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu999od/",
      "created": 1730155828,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lualisi",
      "score": 6,
      "body": "Everyday I see more and more Rivians on the road in my home state. Bullish af",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lualisi/",
      "created": 1730172310,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu7wg2f",
      "score": 7,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu7wg2f/",
      "created": 1730140799,
      "depth": 0,
      "replies": [
        {
          "id": "lu8m3pm",
          "score": 7,
          "body": "This is false Scout is not based on Rivian the plan is for it to use some of tech like OTA updates from Rivian in Scout but they are not related in any way",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu8m3pm/",
          "created": 1730148475,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lu7zf1u",
          "score": 1,
          "body": "Glad I'm not the only one on this.\n\nI'm hoping this points to a deeper partnership than what's been announced so far... but who knows. They may have just invested to not get sued.",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu7zf1u/",
          "created": 1730141682,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lu7y618",
      "score": 8,
      "body": ">TSLA added $150BN+ of market cap last week due to an amazing quarter amongst other things. That market swing is 15x Rivians total market cap.\n\n>Shows me a LOT of potential for RIVN\n\nhow? much of that was not purely because of EVs but because a large cap, heavily held stock had stronger financials — irregardless of income stream.\n\nTesla is held in large part now purely due to its size\n\nand in small part to other possible assets or future income streams\n\nand it’s just as easily bearish showing Tesla took more market share *away* from rivals\n\nit’s no more bullish for Rivian than if Nvidia had a huge swing and you said it was bullish for C3.AI  ![img](emote|t5_2th52|53057)",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu7y618/",
      "created": 1730141309,
      "depth": 0,
      "replies": [
        {
          "id": "lu814k6",
          "score": 3,
          "body": "I guess my main point is I'm bullish on RIVN being able tot take some of that market share away with the launches of the R2, R3, expanding corporate fleet & VW partnership, show it shows a much greater TAM available",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu814k6/",
          "created": 1730142194,
          "depth": 1,
          "replies": [
            {
              "id": "lu86qfv",
              "score": -7,
              "body": "The Tesla cybertruck already easily outsells rivians truck, despite only selling the stupidly pricey foundation edition. And the cybertruck is now gross margin profitable, within a year.\nThere is no comparison.\nWhen the CT production ramps, its BAD news for rivian, not good.",
              "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu86qfv/",
              "created": 1730143897,
              "depth": 2,
              "replies": [
                {
                  "id": "lu8862j",
                  "score": 10,
                  "body": "I hear you, but (respectfully) disagree. The more i read into the cybertruck orders, the less bullish I am on it. \n\nOriginal estimates of 1-2MM pre-orders with \\~11K delivered in Q1 & Q2. Cybertrucks can now be bought and delivered almost immediately. Long ways away from the original demand.\n\n  \nI'd never bet against Elon (in general) because he has a way of making impossible happen, but I don't see the Cybertruck as a serious comepetitor in the long-term pickup space. To me, its an incredible novelty, showpiece but not something I see people using for work, offroading, serious hauling etc",
                  "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu8862j/",
                  "created": 1730144326,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lu90ilk",
                      "score": 2,
                      "body": "Cybertruck sales are growing each week as TSLA is ramping up production lines for cyber truck. During first recall of cybertruck there were \\~2K cars recalled and few months later most recent recall had \\~12k cars. Its  a 6x increase in matter of few months.\n\nRIVN total car sales are not experiencing the same growth as most recent TSLA Cybertruck sales. No other EV company is profitable and are still not showing signs of improvement while Tesla started to show quarter on quarter increase in sales.\n\nTSLA is taking lion share of EV sales in US and TSLA and chinese EV's taking share globally. The ony hope for RIVN and LUCID(American EV's) seems to be reduction in federal interest rates. This would increase their total sales but still TSLA would still take most of growth numbers.",
                      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu90ilk/",
                      "created": 1730152932,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lu91ank",
                          "score": 2,
                          "body": "Interesting, I wasn't tracking MoM cybertruck sales. Good data point",
                          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu91ank/",
                          "created": 1730153184,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lu8jn1r",
          "score": 7,
          "body": "Stopped reading at \"irregardless\"",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu8jn1r/",
          "created": 1730147741,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lucscet",
      "score": 4,
      "body": "I’m in a HCOL area and all the rich people are buying Rivians. Nobody wants to own a Tesla anymore, the sheen has worn off badly. I predict Rivian is going to take a huge bite of the luxury car market in the coming years and I’m bullish on this upcoming earnings.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lucscet/",
      "created": 1730212570,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu86iiu",
      "score": 11,
      "body": "I saw my first one on the interstate a few weeks ago. Decided to race it. HOLY FUCK DID THAT THING TAKE OFF.\n\nI've NEVER seen an ev with that kind of power. I was highly impressed.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu86iiu/",
      "created": 1730143831,
      "depth": 0,
      "replies": [
        {
          "id": "lua6g23",
          "score": 6,
          "body": "I test drove the dual motor R1T a couple weeks ago. They just gave us the keys, set the nearby park on the GPS to drive to, and told us to be back in like 20 minutes. Interior looks great, acceleration was fantastic, and the comfortability is crazy. I drove over a railroad crossing at like 50mph to test the suspension and barely felt it. I wish they had the quad motor out so I could test drive it.\n\nIm probably getting the cheaper R2 when they release in 2026. Can't afford the R1S yet.",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lua6g23/",
          "created": 1730166911,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lu8s8rd",
          "score": 7,
          "body": "I’ve owned a Tesla X P90 since 2017 and got an R1S beginning of 2024.\n\nThe Rivian I have does not have the acceleration of the Tesla. It does have an insane amount of acceleration, and could beat almost any other EV.\n\nHowever The R1S does have a massive and accurate battery. 270 miles means 270 miles, or maybe a little more. On the Tesla, it will say 150 miles and I drive 60 miles and have 35 left. It wasn’t always as bad as this (it has gotten worse with age) but it was always an overestimate.\n\nHaving an accurate battery is a god send. Its the only car we use for long trips now",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu8s8rd/",
          "created": 1730150354,
          "depth": 1,
          "replies": [
            {
              "id": "luaz7r7",
              "score": 3,
              "body": "Agree with mileage reporting. When my friend with a Model Y drives on a 2 hour road trip and back, he has so much range anxiety that he is constantly looking to recharge during the weekend. I don't even need to charge my R1S for the entire weekend. ",
              "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/luaz7r7/",
              "created": 1730178777,
              "depth": 2,
              "replies": [
                {
                  "id": "luazmpm",
                  "score": 3,
                  "body": "Exactly this. Tesla range anxiety is massive- always thinking about where / when to charge. Rivian I don’t think about it at all. I just drive and charge when I need to.",
                  "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/luazmpm/",
                  "created": 1730179015,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "luc1gyq",
          "score": 2,
          "body": "All EVs can take off. In engineering school, they showed us plots of electric engines vs ICE. Electric engine just crushes that off an ICE. I believe it was a plot of power and speed or acceleration? Can't quite remember it was like 10 years ago. It just stood out in my mind.\n\nI just think you probably have not seen mny EVs floor it because they can all do that.",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/luc1gyq/",
          "created": 1730202592,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lubj3oj",
      "score": 2,
      "body": "I’ve been bullish on RIVN from the start. Got one and I am so stoked.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lubj3oj/",
      "created": 1730192003,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu80hn8",
      "score": 5,
      "body": "RIV losses money on each car. \nAnd only 7B on hand. \nIf the market cap is 11B, it sounds like it needs to drop by 4B before buying in. \n\nHave you seen when their road map says they’ll make a profitable vehicle? I think it was way out. Or possibly never? But I stopped following them a few billion market cap ago.  Has this changed?",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu80hn8/",
      "created": 1730142002,
      "depth": 0,
      "replies": [
        {
          "id": "lu99os0",
          "score": 8,
          "body": "Gross margin positive by end of year.",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu99os0/",
          "created": 1730155967,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lu86fcg",
      "score": 1,
      "body": "They lose a staggering amlunt of money and the company is hardly new. They show no signs of being able to turn it around. They clearly make great vehicles that customers love. They should love them, they are paying way way below the production cost for them.\nThe VW deal will never amount to anything, VW are in enough trouble, they do not have the culture, or the time or the required management to make anything work between the two companies.\nI would not pay $1 for RIVN right now.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu86fcg/",
      "created": 1730143804,
      "depth": 0,
      "replies": [
        {
          "id": "lu88jhq",
          "score": 3,
          "body": "Does reddit have a built in reminder feature? Gentleman/womans bet for price target in November of 2026?",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu88jhq/",
          "created": 1730144438,
          "depth": 1,
          "replies": [
            {
              "id": "lu9j8zt",
              "score": 2,
              "body": "!remindMe November 2026",
              "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu9j8zt/",
              "created": 1730159167,
              "depth": 2,
              "replies": [
                {
                  "id": "lu9jd6z",
                  "score": 1,
                  "body": "I will be messaging you in 2 years on [**2026-11-28 00:00:00 UTC**](http://www.wolframalpha.com/input/?i=2026-11-28%2000:00:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu9j8zt/?context=3)\n\n[**8 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1ge9hl2%2Fdoubling_down_on_rivn%2Flu9j8zt%2F%5D%0A%0ARemindMe%21%202026-11-28%2000%3A00%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201ge9hl2)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                  "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu9jd6z/",
                  "created": 1730159208,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lu985be",
      "score": 2,
      "body": "Cash on hand:  ~7 bn. \nDebt:   ~ 7 bn.\n\nBurn rate per quarter:  ~1.5 bn.\n\n\n\nMSRP:  ~71 k.  \nLoss per unit: ~33k. \n\nLoss per unit percentage:  ~46%\n\n\n\nEven if the R2/R3 have half the margins you're still looking at a loss per unit of ~23%.\n\n\nBest this company can hope for is to get bought out by someone who wants the IP.   Unfortunately the IP isn't significantly better than what the majors already have.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu985be/",
      "created": 1730155455,
      "depth": 0,
      "replies": [
        {
          "id": "luda3th",
          "score": 1,
          "body": "loss per unit is mainly due to fixed operation costs. This will go down as they are able to increase production (they have supply chain issues/get more orders.)",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/luda3th/",
          "created": 1730218108,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lu82mlc",
      "score": 1,
      "body": "What are your thoughts on the scout? You don’t think is gonna take all of rivians market since it looks alike for cheaper?",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu82mlc/",
      "created": 1730142650,
      "depth": 0,
      "replies": [
        {
          "id": "lu85tg8",
          "score": 3,
          "body": "My quick **opinions** below while at work, based on limited research (so take it with a grain of salt) --\n\nI think it's an impressive demo they've shown and some promise. I have a feeling that there is a larger RIVN play here that will be revealed over time; it's not a coincidence that a few months after a massive investment, they release two cars that are near identical, but focus on a slightly different user base. \n\n**On Scout Delivery Timeline Feasibility:**\n\nI think 2027 is not possible unless they are paying RIVN to fully make the car and change the style to fit Scout. In this case, RIVN takes the win IMO because they will get paid for two sku's (their R1 line and the Scout line). If VW plans on using RIVN body and tech but do it on their own, I would put a late 2028 timeline for first deliveries for Scout.  \n\n  \nTo compare - Chevy, Ram and Ford took \\~1-2 years from announcement to first customer deliveries. This is extremely impressive, and would credit some of that to having existing pickup data, production lines etc. It took Tesla 4 years from announcement to delivery (and around the time they announced the Cybertruck - late 2019 - their market cap was comparable to VW's today). \n\n**On Price:**  \nFor similar reasons above, I think if VW are running the production line, it's definitely over the $60K purchase target. If they're working on a JV with RIVN where RIVN produces the cars, the price target can & will be beat, but I worry that route would affect delivery timelines for Rivians core line.",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu85tg8/",
          "created": 1730143621,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lu86jw4",
          "score": 2,
          "body": "It looks like the Scout is the R1T without a lot of the additional stuff.  So this is like a GMC/Chevrolet situation.  If they are able to move more units through VW without lowering the price of R1T, then they could possibly absorb some of the costs into higher production numbers and maybe get some profit from people up-scaling to the R1T.",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu86jw4/",
          "created": 1730143842,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lu8b9p0",
      "score": 1,
      "body": "Still loosing money per car produced. Can’t scale while this happens. Probably don’t double down until you see signs of this improving.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu8b9p0/",
      "created": 1730145246,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu8n36t",
      "score": 1,
      "body": "At some point cash flow has to be positive for the company to continue to exist.\n\nThis one will end in bankruptcy with the assets split among senior tier lien holders.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu8n36t/",
      "created": 1730148769,
      "depth": 0,
      "replies": [
        {
          "id": "lu9jln6",
          "score": 1,
          "body": "See that’s where you’re wrong. Especially when the American taxpayers are subsidizing the cost!",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu9jln6/",
          "created": 1730159288,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lu9a8qp",
      "score": 1,
      "body": "As they are probably going to invest all that cash, I would not give much importance to it and focus on the other factors. Maybe try to estimate future market size and profitability?",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu9a8qp/",
      "created": 1730156149,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu9k0nq",
      "score": 1,
      "body": "Have you taken it in for service yet?",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu9k0nq/",
      "created": 1730159430,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu9usur",
      "score": 1,
      "body": "You're not wrong,  but it's going to take years. So if you can have that money tied up that long,  you be gucci.\n\n3xcept the part of VW, you're very wrong there.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu9usur/",
      "created": 1730163015,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lua0ufn",
      "score": 1,
      "body": "I own some. More than I really planned to. I’m below my average ($14.37) but I feel like it’s bottomed. I recently sold calls out through 12/20 (14’s and 15’s), so if by some miracle it explodes by then I’ll let it be called away, if not I’ll keep the premium and repeat quarterly throughout ‘25.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lua0ufn/",
      "created": 1730165042,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luaetx4",
      "score": 1,
      "body": "No doubt Rivian makes great vehicles, but they’re also losing $30k on every vehicle sold. Can they maintain quality while they turn this around? \n\nhttps://www.motortrend.com/news/rivian-loss-per-vehicle/",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/luaetx4/",
      "created": 1730169791,
      "depth": 0,
      "replies": [
        {
          "id": "lulip0l",
          "score": 1,
          "body": "The (multi) billion dollar question. I think it’s not a matter of if, but when. And the “if” comes in regarding their cash to survive that journey",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lulip0l/",
          "created": 1730325681,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "luaqm16",
      "score": 1,
      "body": "Tesla's growth in market cap wasn't because of their car sales. It was from their growth in higher margin products: charging/storage products and services. That was signal of more to come hence the upswing. Auto sales were only up 2% and on razer thin margins. \n\nI like Rivian a lot and while services will grow for them, they do not have a licensed out charging network or solar company to get margin dollars from, like Tesla, to buoy them (and more or less the same friendly capital markets where money was free for 10 years). I think they can and will excist in the long-run but a lot has to go right and they NEED to be the infrastructure for a lot of cars (like planned with VW and assumedly with Scout) to make up the difference.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/luaqm16/",
      "created": 1730174450,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lub6ry1",
      "score": 1,
      "body": "Damn new VWs are almost exact copies of Rivian 😂",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lub6ry1/",
      "created": 1730183471,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lubgyfg",
      "score": 1,
      "body": "I hold rivn 400 units but man vw make bad cars",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lubgyfg/",
      "created": 1730190485,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lubo29a",
      "score": 1,
      "body": "Big Con:  \nRivian is losing a shit ton of money for each car produced, they have an amazing product I agree but if they loose 30.000 USD with every car sold that's VERY bad. Making profit with the more affordable car is gonna be even more difficult. \n\nTesla went almost Bankrupt with the Launch of the Model 3 and I see Tesla executing way more efficient than Rivian.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lubo29a/",
      "created": 1730195349,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lubsuh8",
      "score": 2,
      "body": "I'm gonna predict vw buys them for like 20 bucks a share and calls it a day. They clearly are on thr path. This dupe model they made with rivian dna tells me that",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lubsuh8/",
      "created": 1730198231,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lubzobu",
      "score": 1,
      "body": "I said I would invest when it was below $10, as a man of my word, an it like 90 cents away from that, I will buy a share next month, when it will probably be below $9 dollars and below $5 next year lol. I have got heavily burnt on electrical vehicles shares in the past.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lubzobu/",
      "created": 1730201759,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lud3r8x",
      "score": 1,
      "body": "What's your price target?",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lud3r8x/",
      "created": 1730216171,
      "depth": 0,
      "replies": [
        {
          "id": "lulidul",
          "score": 1,
          "body": "What time horizon?",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lulidul/",
          "created": 1730325584,
          "depth": 1,
          "replies": [
            {
              "id": "lum8x41",
              "score": 1,
              "body": "Five years out",
              "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lum8x41/",
              "created": 1730334401,
              "depth": 2,
              "replies": [
                {
                  "id": "lumu4vq",
                  "score": 1,
                  "body": "Base case - Assuming they survive cash issues, get profitability in place and aren’t bought out in the interim - $220BN market cap. \n\nP/S: 5-7\nRevenue 33-38BN\nProfitability first achieved: late 2027\nAverage sale price: 54-57.5k\nYoY revenue growth peaks in 2027 from r2 and r3 demand, slows down as they gain market share \nRivian becomes the Tesla brand pre Elons public blowup. It’s regarded as luxury, futuristic and something middle and upper class folks are excited to show their “lifestyle”",
                  "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lumu4vq/",
                  "created": 1730341632,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lumwsp1",
                      "score": 1,
                      "body": "!remindMe 5 years",
                      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lumwsp1/",
                      "created": 1730342588,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lu7xl9d",
      "score": 1,
      "body": "Well they have 7Billion in cash and 7 billion in debt... not that impressive",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu7xl9d/",
      "created": 1730141138,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu8g6bc",
      "score": 1,
      "body": "What about the con that they don’t make money? What about the concept of not putting good money to bad? Would you still have this thesis if you weren’t already invested or are you emotional because you are wrong? It is ok to be wrong. It is part of investing/trading.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu8g6bc/",
      "created": 1730146712,
      "depth": 0,
      "replies": [
        {
          "id": "lu945ns",
          "score": 3,
          "body": "I think part of starting this thread was to weed out your question :) Wanted to hear both sides. Defining doubling down as \"wrong\" means there is an objective answer. \n\nStock is currently where it's at (IMO) becuase of the setbacks to reach this plan. \n\nMy thesis is that with the VW money, new lines coming out, and continued demand for commercial vehicles, they will get unit economics to profitable. If they can do that, we're having a totally different conversation. But with behemoths behind you like AMZN, VW etc, they have time to get the economics to where they want.",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu945ns/",
          "created": 1730154121,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lu9r2yo",
      "score": 0,
      "body": "Their factory caught on fire and was called a death trap for workers. The former is bearish but the latter is extremely bullish. I bought calls.",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu9r2yo/",
      "created": 1730161784,
      "depth": 0,
      "replies": [
        {
          "id": "lubd2ge",
          "score": 1,
          "body": "The factory did not. Some cars in a storage lot did. Just proves OP's point more to see dumb bears like you parroting misinformation.",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lubd2ge/",
          "created": 1730187766,
          "depth": 1,
          "replies": [
            {
              "id": "lucetvh",
              "score": 2,
              "body": "*scratches head* i have calls?",
              "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lucetvh/",
              "created": 1730207993,
              "depth": 2,
              "replies": [
                {
                  "id": "luclosl",
                  "score": 1,
                  "body": "Yeah he said you were a dumb bear",
                  "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/luclosl/",
                  "created": 1730210373,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lucw3nt",
                      "score": 2,
                      "body": "That tracks",
                      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lucw3nt/",
                      "created": 1730213774,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lu8asz3",
      "score": -6,
      "body": "Rivn will be dead in less than 5 years",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu8asz3/",
      "created": 1730145109,
      "depth": 0,
      "replies": [
        {
          "id": "luaq519",
          "score": 1,
          "body": "Even if it is I’ll still have the memories of going 0-60 in less than 3 seconds in my 7 seat R1s. \n\nIt’s an amazing vehicle and worth every penny.",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/luaq519/",
          "created": 1730174238,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lu9jk1a",
      "score": 0,
      "body": "Is there a world where you would consider doubling down on deez?",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu9jk1a/",
      "created": 1730159273,
      "depth": 0,
      "replies": [
        {
          "id": "lubyhub",
          "score": 3,
          "body": "deez what?",
          "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lubyhub/",
          "created": 1730201199,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lu9p6dr",
      "score": -5,
      "body": "I currently work in corporate strategy for commercial auto and wouldn't go there myself.  Some large headwinds...\n\n1.  They're getting their ass torn apart by OSHA and if they'd grown big enough for the unwashed masses to know who they are the CSR scandals alone would break them.  I smell class actions and heavy fall out still on its way.\n\n2.  In that note, when workers are vomiting your paint colors because you are too cheap to even get them a respirator your cost of goods isn't accurate, so the bulk of your balance sheet is a sham.  The balance sheet also doesn't show liquidity needed to fix that level of problem without affecting their credit rating.\n\n3.  BYD is going to destroy them.  My guess is an announcement of a strategic partnership with a legacy nameplate that is backed into a corner like Mercedes will be coming, especially if repubs win and start a tariff war.  Rivian won't have established the clout to compete with it. \n\n4.  Economic and auto factors don't favor luxury EV right now.  Substantial trends towards lease and Rivian has a small network for that.  If you believe in them long term wheel it and get a discount when it finally bottoms. \n\n5.  Scout isn't a partner to Rivian.  Rivian is hoping for some sweet IP from that investment, but Scout already has given a giant middle finger to VWAG by announcing plans for direct to consumer sales.  Pair that with the struggles across VWAG as a whole, and you don't get the tailwind you imagine. \n\n6.  Rivian is the least likely nameplate to fit VWAG current strategy.  If they continue to devolve the cheese will stand alone.  \n\nI wheel Ford for nostalgia and if I was going to go deep I MIGHT sniff around a qualitative assessment of Toyota, but overall it's the worst possible time to jump into the auto industry",
      "permalink": "/r/wallstreetbets/comments/1ge9hl2/doubling_down_on_rivn/lu9p6dr/",
      "created": 1730161155,
      "depth": 0,
      "replies": []
    }
  ]
}