{
  "title": "PayPal Q3 2024 Earnings",
  "score": 55,
  "selftext": "[CNBC: PayPal shares fall premarket on revenue miss](https://www.cnbc.com/amp/2024/10/29/paypal-pypl-q3-2024-earnings.html)\n\n* PayPal reported better-than-expected third-quarter earnings on Tuesday, but revenue came in slightly below expectations.\n* It's the first earnings report for CEO Alex Chriss since he hit his one-year anniversary at the company last month.\n* PayPal shares have gained 36% this year\n\n\n**Earnings per share**: \n* 1.20, adjusted vs. $1.07 expected\n\n**Revenue**: \n* $7.85 billion vs. $7.89 billion expected.\n* Revenue increased about 6% in the quarter from $7.42 billion in the same period a year ago. \n\n**Net Income**:\n* PayPal reported net income of $1.01 billion, or 99 cents per share, compared to $1.02 billion, or 93 cents per share, a year earlier.\n\n**Total payment volume**\n* rose 9% from a year earlier to $422.6 billion for the quarter ended Sept. 30, and came in just above the average analyst estimate of $422.5 billion\n\n**Operating margin** \n* came in at 18.8%, beating the StreetAccount estimate of 17.4%. \n\n**Active Accounts**\n* PayPal reported total active accounts of 432 million, up 1% from a year earlier, and beating the average estimate of 430.5 million.\n\n**Transaction Margin**\n* PayPal's take rate slipped to 1.86% from 1.91% a year earlier\n* transaction margin, which is how the company gauges the profitability of its core business, rose to 46.6% from 45.4%.\n* Venmo's total payment volume rose 8% in the quarter from a year earlier. DoorDash, Starbucks and Ticketmaster are among businesses now accepting Venmo as one way that consumers can pay.\n\n**Guidance**\n* For the fourth quarter, PayPal is calling for \"low single-digit growth.\" Analysts were expecting growth of 5.4% to $8.46 billion. The investor deck says guidance reflects a \"price-to-value strategy and prioritization of profitable growth.\" \n* The company expects adjusted earnings per share of $1.07 to $1.11, versus the average analyst estimate of $1.10",
  "link_flair_text": "Company News",
  "id": "1getrh3",
  "num_comments": 34,
  "created_utc": 1730206080,
  "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/",
  "comments": [
    {
      "id": "lucd2pt",
      "score": 49,
      "body": "Anybody who doesn't understand why lots of people say \"don't trade earnings\" should look at the PYPL premarket chart for today. They've been -$5.50ish and +$0.10 this morning.\n\nI dunno, these aren't the earnings you want to see from, like, NVDA, but PYPL's Forward P/E is ~18.5, meaningfully below that of the Nasdaq 100 and S&P 500, so I say this is pretty decent news.",
      "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/lucd2pt/",
      "created": 1730207345,
      "depth": 0,
      "replies": [
        {
          "id": "lucga2e",
          "score": 13,
          "body": "What beats me is why there's clear trend reversal, pre and post earnings. Seeing (not just PayPal, but with many other stocks), that stock goes up pre-event sharply and then falls after announcement, or other way (e.g. Tesla).\n\n\nOption trades getting squeezed could be? I don't know much about that topic, TBH. ",
          "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/lucga2e/",
          "created": 1730208514,
          "depth": 1,
          "replies": [
            {
              "id": "lud0ldq",
              "score": 9,
              "body": "Isn’t the easiest explanation that big firms want to be holding just in case they deliver 100% and then, when they deliver 65%, they get the hell out quickly?",
              "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/lud0ldq/",
              "created": 1730215191,
              "depth": 2,
              "replies": [
                {
                  "id": "ludljrg",
                  "score": 2,
                  "body": "Big firms don't dump shares. The SEC limits their buying/selling activity as unfettered volume would destroy price discovery.",
                  "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/ludljrg/",
                  "created": 1730221583,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ludbqm5",
              "score": 3,
              "body": "Carrot on a stick and then IV crush to murder the options gamblers.",
              "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/ludbqm5/",
              "created": 1730218611,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luca99s",
      "score": 30,
      "body": "Looking to me like PayPal is out of their hyper growth phase but still has plenty of modest growth with improving margins. That’s a pretty solid outlook to me especially with a 20 p/e",
      "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/luca99s/",
      "created": 1730206267,
      "depth": 0,
      "replies": [
        {
          "id": "lucc5gm",
          "score": 24,
          "body": "why 20 p/e is ok for low single digit growth?",
          "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/lucc5gm/",
          "created": 1730206993,
          "depth": 1,
          "replies": [
            {
              "id": "luccshf",
              "score": 15,
              "body": "Mid single digits isn’t bad growth for $30B/year, and sharpening margins at that level is a powerful value builder. Pypl is valued somewhere between a bank in the 10- 15 pe range and a cc company in the 25 -35 pe space. Seems pretty reasonable to me",
              "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/luccshf/",
              "created": 1730207238,
              "depth": 2,
              "replies": [
                {
                  "id": "ludp0hm",
                  "score": 3,
                  "body": "Payment network companies* visa and MasterCard are not credit card companies aka banks",
                  "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/ludp0hm/",
                  "created": 1730222618,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ludp7gh",
                      "score": 1,
                      "body": "That’s an absolutely ridiculous claim. They are credit card issuers. When a bank issues you a credit card, it is almost always a visa or Mastercard",
                      "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/ludp7gh/",
                      "created": 1730222675,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ludpedq",
                          "score": 4,
                          "body": "Yes but the service they offer is a payment processing platform. They have no liability of the unsecure debt",
                          "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/ludpedq/",
                          "created": 1730222732,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ludq9z6",
                              "score": 2,
                              "body": "Oh ok you’re saying they don’t hold all of their card spend as liabilities, which is fair. I didn’t realize that’s what you meant",
                              "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/ludq9z6/",
                              "created": 1730222989,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "luce1qj",
              "score": 9,
              "body": "Its not that crazy. Paypal with 6% revenue growth with eps increasing at 12% at a 19 p/e is pretty tame. AAPL had less than 1% revenue from the last report but holds a 35 p/e. Coke was even worse with negative revenue growth with a 24 p/e. I'm sure theres more examples out there",
              "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/luce1qj/",
              "created": 1730207707,
              "depth": 2,
              "replies": [
                {
                  "id": "lue752l",
                  "score": 1,
                  "body": "I hope u are joking\n\nApple has a huge business moat. Paypal is just a payment processor lol",
                  "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/lue752l/",
                  "created": 1730227995,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lue7tf9",
                      "score": 1,
                      "body": "You misread that as me saying Apple isnt a sustainable business. I was pointing out that the metrics OP was referring to aren't really telling the story he thinks",
                      "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/lue7tf9/",
                      "created": 1730228197,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ludqw3q",
      "score": 17,
      "body": "Will continue to hold on to the shares I bought at $60.\n\nEvery time I see PayPal mentioned here, everyone overcomplicates it. \n\nStill actively GROWING users and transactions despite EVERYONE claiming these numbers are SHRINKING?  Check.  Focusing on profitable growth?  Check.  Improving margins?  Check.  Still buying back crazy amounts of stock?  Check.  Proving “omg but the competition is so much better” doubters wrong?  Check. \n\nAs long as the company continues to drop $2B in buybacks every quarter, I’ll continue buying with them.  They like the stock, I like the stock.  I was hoping for a more meaningful dip today, but didn’t get it. \n\nThis will be well into the $100-$120 range in H1 next year, IMO.  Profits, profits, profits.  Cash cow.  Growth ain’t gonna be crazy in a giant like this.  If the stock price doesn’t appreciate, the company will buy it all back.  It is forced to go up.  \n\nKeep it simple folks.  Thank you, next.",
      "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/ludqw3q/",
      "created": 1730223174,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luce30e",
      "score": 11,
      "body": "Besides, I think, it could give a serious competition to Visa, MasterCard moats, with mobile payments becoming new (as of 2010) trend. At least in Europe, I'm seeing more and more \"PayPal\" logos in shops. And, PayPal does work without linking any card to it - direct debit from bank.\n\n\nAny American who has traveled abroad to different continents, knows how Amex is virtually unknown and absent, once you cross the ocean. Yes, that's not the case for Visa/ MasterCard (yet). PayPal could be an excellent alternative especially because there's no physical device to install. \n\n\nSo the PE argument is valid, if we look at Visa and MA's PE. ",
      "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/luce30e/",
      "created": 1730207720,
      "depth": 0,
      "replies": [
        {
          "id": "lucj96d",
          "score": 11,
          "body": "EU requires banks to offer instant transfers. No need for paypal anymore here.",
          "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/lucj96d/",
          "created": 1730209555,
          "depth": 1,
          "replies": [
            {
              "id": "lucku44",
              "score": 4,
              "body": "You still use cards right? My point is, that could soon fall out of fashion. There are hefty fees from card issuers, invisible to end consumer.",
              "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/lucku44/",
              "created": 1730210087,
              "depth": 2,
              "replies": [
                {
                  "id": "luclwkm",
                  "score": 2,
                  "body": "Doesn't depend on cards. Just instant transactions from individual checking accounts.",
                  "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/luclwkm/",
                  "created": 1730210446,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lucnggy",
                      "score": 8,
                      "body": "Thanks 👍  👍  As often happens in EU, totally missing the point, bcoz of some false ego. We're not talking about P2P transfers, but merchants. I've never seen anyone doing a bank transfer at a shop in 20 years, probably only in Italy where they still pay with cheque.",
                      "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/lucnggy/",
                      "created": 1730210970,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lud4qf2",
              "score": 0,
              "body": "We have Zelle now so essentially the same system (American banks are around 30 years behind European banks in this regard). But PayPal still has use cases that interbank transfers can’t solve for",
              "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/lud4qf2/",
              "created": 1730216471,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ludcbm7",
              "score": 0,
              "body": "Instant transfers have a significant cost. And are not really an alternative to pay at a merchant. I fail to see how that can be competition for Paypal",
              "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/ludcbm7/",
              "created": 1730218792,
              "depth": 2,
              "replies": [
                {
                  "id": "ludjaav",
                  "score": 1,
                  "body": "They are to be priced competitively. I don't see how merchants won't use it.",
                  "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/ludjaav/",
                  "created": 1730220909,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lue7kal",
                      "score": 2,
                      "body": "It is already avail and free in my country for local banks btw and we are using it instead of paypal",
                      "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/lue7kal/",
                      "created": 1730228121,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ludpcwx",
                      "score": 0,
                      "body": "LoL.. can you share what you're smoking??",
                      "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/ludpcwx/",
                      "created": 1730222720,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ludbnl6",
          "score": 0,
          "body": "International TPV is up 8% YoY from their own Financials, which is Lower than the US TPV.\n\nAMEX revenues from International Card Services and Global Merchant is about 4x PayPal’s assuming 25% of revenues comes from international sales. \n\nAMEX is not obscure internationally. It is mostly accepted at larger well known places rather than boutique places\n\nThere are dozens of Apps in Europe and beyond for P2P and other services like Wise. \n\nStop spreading ignorance; it would have taken you less than 15 mins to realize everything you are writing is bullshit.",
          "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/ludbnl6/",
          "created": 1730218586,
          "depth": 1,
          "replies": [
            {
              "id": "ludocmh",
              "score": 1,
              "body": "OK. Didn't know you were long on Amex, sorry. Good luck with your investments, football hooliganism and anger management classes. So touchy! \n\n\nGo around the world with an Amex and try buying a coffee outside an airport.",
              "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/ludocmh/",
              "created": 1730222421,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lud4gyu",
      "score": 2,
      "body": "Been bagholding this for a while. I thought this AM was going to be the turning point especially after yeterdays AH moves up.",
      "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/lud4gyu/",
      "created": 1730216391,
      "depth": 0,
      "replies": [
        {
          "id": "ludasn8",
          "score": 3,
          "body": "It's rough . . . not complaining about the recent increases, but always wondering when it will get keep genuine momentum and I can get that bag off my shoulder. Thought it was going to be getting closer to dropping it this morning too. Guess a lot of others did as well. One day . . . just need patience.",
          "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/ludasn8/",
          "created": 1730218321,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luemfpz",
          "score": 1,
          "body": "What's your average that you are bagholding this? It has been very cheap, as cheap as $50 the last year. Was a great deal anywhere from $50 to $60.",
          "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/luemfpz/",
          "created": 1730232587,
          "depth": 1,
          "replies": [
            {
              "id": "luf0qmr",
              "score": 1,
              "body": "I am in the green now by a couple thousand. Average is in the high 70s. I also bought some Dec expiry $65 calls which have made up for the general disappointment of pypl.\n\nReally, there are lots of great deals when looking back. Wish i had that crystal ball at the beginning of the year.",
              "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/luf0qmr/",
              "created": 1730236853,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lucnpmb",
      "score": 1,
      "body": "Earnings weakness.  \n\nIt was a nice run up, I'd hang in there.  \n\nCongrats to all those who bought low and are at this point now.",
      "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/lucnpmb/",
      "created": 1730211054,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luc9th9",
      "score": 0,
      "body": "It looks like OP posted an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.cnbc.com/2024/10/29/paypal-pypl-q3-2024-earnings.html](https://www.cnbc.com/2024/10/29/paypal-pypl-q3-2024-earnings.html)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
      "permalink": "/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/luc9th9/",
      "created": 1730206095,
      "depth": 0,
      "replies": []
    }
  ]
}