{
  "title": "McDonald's reverses U.S. same-store sales declines in Q3; E. coli fallout looms",
  "score": 98,
  "selftext": "McDonald’s on Tuesday reported quarterly earnings and revenue that beat analysts’ expectations as its U.S. restaurants reversed last quarter’s same-store sales decline.\n\nHowever, investors are worried about another dent to U.S. sales fueled by a recent E. coli outbreak across 13 states linked to McDonald’s Quarter Pounder burgers. As of Friday, 75 health cases have been tied to the outbreak, including one death of an older adult.\n\nHealth authorities have honed in on the burger’s slivered onions as the likely source, and McDonald’s has suspended its relationship with the supplier. Quarter Pounder burgers will return to affected restaurants on a rolling basis this week, sans slivered onions.\n\n“While the situation appears to be contained, and though it didn’t affect Q3 numbers, it’s certainly an important development, which I know is on many of your minds,” CEO Chris Kempczinski told investors on the company’s earnings call, adding that McDonald’s was sorry and is committed to “making this right.”\n\nShares of the company fell more than 1% in premarket trading.\n\nHere’s what the company reported for the period ended Sept. 30, compared with what Wall Street was expecting, based on a survey of analysts by LSEG:\n\nEarnings per share: $3.23 adjusted vs. $3.20 expected\n\nRevenue: $6.87 billion vs. $6.82 billion expected\n\nMcDonald’s posted third-quarter net income of $2.26 billion, or $3.13 per share, down from $2.32 billion, or $3.17 per share, a year earlier.\n\nExcluding certain items, the fast-food giant earned $3.23 per share.\n\nNet sales rose 3% to $6.87 billion.\n\nThe chain’s global same-store sales fell 1.5%, a more drastic decline than the 0.6% that Wall Street was expecting, according to StreetAccount estimates, and was weighed down by the company’s international markets. It’s the second straight quarter that the company’s same-store sales have fallen.\n\n“While we anticipated a challenging environment in 2024, our performance this year has fallen short of our expectations,” Kempczinski said.\n\nU.S. same-store sales rose 0.3%, reversing last quarter’s same-store sales declines but still slightly weaker than the 0.5% increase predicted by StreetAccount estimates. Traffic to its U.S. restaurants was slightly negative, but the company credited its marketing and a $5 value meal launched in late June for the increase in sales.\n\nDiners have pulled back their restaurant spending, leading McDonald’s and its rivals to lean into discounts and other marketing tricks to bring customers back to their restaurants. For example, in August, McDonald’s launched limited-time “Collector’s Edition” cups.\n\nThe company’s two international divisions both reported steeper declines in same-store sales compared with the prior quarter. The international operated markets segment, which includes France, Germany and Australia, saw same-store sales shrink 2.1%. The international developmental licensed markets division reported same-store sales declines of 3.5%, driven by weak demand in the Middle East and China.\n\nLooking ahead to the fourth quarter, it’s unclear how the E. coli outbreak might affect U.S. sales, particularly as consumers have grown more picky about how to spend their money and where.\n\nMcDonald’s executives have taken steps to reassure customers that the company’s menu items are safe to eat, including pulling Quarter Pounder burgers from menus in the affected areas until its beef patties were cleared as the culprit.\n\nStill, foot traffic to U.S. locations fell roughly 10% in the three days immediately following the Centers for Disease Control and Prevention announcement last Tuesday of the E. coli outbreak tied to McDonald’s, according to a research note from Gordon Haskett Research Advisors.\n\nSource: https://www.cnbc.com/2024/10/29/mcdonalds-mcd-earnings-q3-2024.html",
  "link_flair_text": null,
  "id": "1geu345",
  "num_comments": 35,
  "created_utc": 1730206999,
  "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/",
  "comments": [
    {
      "id": "ludbkrj",
      "score": 35,
      "body": "McDonalds is a tough one.  On one hand I think they'll do fine long term, but on the other hand, it costs too much to eat there.  If they can find ways to get their meals back down to $5 or less, they'll see traffic increase.  But why would I ever spend $50 for me and my kids to eat McDonalds???",
      "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludbkrj/",
      "created": 1730218562,
      "depth": 0,
      "replies": [
        {
          "id": "ludh7zn",
          "score": 5,
          "body": "McDonald’s was running a five dollar meal deal promo during this period. I think the fact that sales declined anyway is perhaps an ominous sign",
          "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludh7zn/",
          "created": 1730220284,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ludc0z9",
          "score": 10,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludc0z9/",
          "created": 1730218701,
          "depth": 1,
          "replies": [
            {
              "id": "ludmu1f",
              "score": 24,
              "body": "25 years ago, McDonalds used to have a decent value proposition - it was maybe 60% the cost of a decent restaurant, but it was consistent, fast, and there were other benefits -- like a kids play room, the happy meal toys, extra condiments were given for free, your \"large fries\" was always full, etc...\n\nNow there are ZERO peripheral benefits -- the kids play centres are gone, the condiments are locked up **and **charged for, the food is less consistent, the portions are _never_ generous, the service sucks... **and**, crucially, _it's like 85-90% of the cost of a decent restaurant_. \n\nMcDonalds is no longer competing against other fast food joints; they're now also competing with restaurants. Their \"value\" proposition was their strength and now it's gone. 21 years ago a large fries cost $2.00... With inflation that is $3.27 today... They're actually charging $5.25.\n\nMcDonalds decided \"we aren't going to compete on value\" anymore, and I don't think they realize how much that's going to hurt them now going forward.",
              "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludmu1f/",
              "created": 1730221969,
              "depth": 2,
              "replies": [
                {
                  "id": "ludqb8u",
                  "score": 6,
                  "body": "Yep!  Denny's and IHOP are going through the same issues.  Their niche was cheap food that was just OK.  Now they're prices compete with nice restaurants, but their food is still just ok.",
                  "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludqb8u/",
                  "created": 1730223000,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "luehuxr",
                  "score": 2,
                  "body": "This. My family rarely if ever eats fast food now because the price is damn near the same as a sit down restaurant. I'll pay the 5-10% premium to get much better food and service.",
                  "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/luehuxr/",
                  "created": 1730231235,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ludcusv",
              "score": 2,
              "body": "Because it seems like a winning strategy?",
              "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludcusv/",
              "created": 1730218957,
              "depth": 2,
              "replies": [
                {
                  "id": "luddqq0",
                  "score": 3,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/luddqq0/",
                  "created": 1730219226,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ludh5hg",
                      "score": 6,
                      "body": "Not sure if you've been out of the loop, but McDonalds had been struggling. So, you recommending they change nothing is not a winning strategy",
                      "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludh5hg/",
                      "created": 1730220264,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ludlsbu",
                          "score": -1,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludlsbu/",
                          "created": 1730221655,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ludxgr5",
                              "score": 1,
                              "body": "E-coli outbreak, falling sales. Up q/q but trending down",
                              "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludxgr5/",
                              "created": 1730225127,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ludeqfp",
          "score": 3,
          "body": "Yeah I dumped it very luckily right before the quarter pounder recall and made adequate profit.\n\nAt this point I\"m not buying into it again unless it drops into range.  I'm uncertain if it will break out and the fundamentals worry me.  Again, if  a stock breaks out it needs to prove it to me or I\"m not holding it at the top.  Period.\n\nIt was not a good forward looking guidance moment.",
          "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludeqfp/",
          "created": 1730219527,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ludofyc",
          "score": 2,
          "body": "Hey now if you download their datamining app you get slight discounts.",
          "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludofyc/",
          "created": 1730222449,
          "depth": 1,
          "replies": [
            {
              "id": "lue077z",
              "score": 0,
              "body": "I went to download it once a few years ago, but it required such an absurd number of permissions that I noped right out of it. It literally felt like the developer just checked all the boxes for what permissions the app would ask for.",
              "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/lue077z/",
              "created": 1730225937,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ludnunh",
          "score": 0,
          "body": "I think you're forgetting the fact that the McDonalds Corporation is in the property business, not the fast food business",
          "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludnunh/",
          "created": 1730222270,
          "depth": 1,
          "replies": [
            {
              "id": "ludy2fm",
              "score": 7,
              "body": "The value of the properties depends pretty much directly on the fast food profits that happen on that property. Franchises pay rents that are calculated using formulas that directly incorporate sales/revenues as a variable.",
              "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludy2fm/",
              "created": 1730225309,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ludm0fm",
      "score": 6,
      "body": "I already know of 3 people who said they wouldn't be eating at McDonald's anytime soon because they don't want any added risk of getting sick/dying. Some people take this kind of thing extremely seriously.   \n\n\nI know this subreddit can have some bull and/or holder bias, but everyone should consider the possibilities here.",
      "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludm0fm/",
      "created": 1730221723,
      "depth": 0,
      "replies": [
        {
          "id": "ludqi88",
          "score": 10,
          "body": "tbh, the SAFEST time to eat is after the outbreak because everything is inspected, tested and cleaned then tested again. \n\nThe entire stock of food is purged in that process too.",
          "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludqi88/",
          "created": 1730223058,
          "depth": 1,
          "replies": [
            {
              "id": "ludtx1k",
              "score": 1,
              "body": "Maybe. Moms out there just thinking about their children won't care though. After the 90s Jack in the Box incident my mom didn't go back there for a decade. My sister already said she won't be letting her kids have McDs for the foreseeable future.",
              "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludtx1k/",
              "created": 1730224071,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luf2uui",
      "score": 1,
      "body": "More fallout incoming",
      "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/luf2uui/",
      "created": 1730237505,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lugqrn4",
      "score": 1,
      "body": "I will be buying the dip ;))))",
      "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/lugqrn4/",
      "created": 1730257726,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lucltxk",
      "score": -12,
      "body": "The idea that health conserns are important for $MCD clients is a bit silly for reasons left to the reader as an exercise.",
      "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/lucltxk/",
      "created": 1730210421,
      "depth": 0,
      "replies": [
        {
          "id": "ludm7zu",
          "score": 5,
          "body": "You're lumping junk food concerns in with dying and severe organ damage concerns. ",
          "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludm7zu/",
          "created": 1730221786,
          "depth": 1,
          "replies": [
            {
              "id": "lueyw9s",
              "score": -1,
              "body": "Dir sir or madam, eating ultra-processed food will shorten your lifespan even if Mrs. E. coli will never show up. So yeah, clients of MCD and PM by definition are paying money to live less.",
              "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/lueyw9s/",
              "created": 1730236287,
              "depth": 2,
              "replies": [
                {
                  "id": "lug1qwb",
                  "score": 1,
                  "body": "Yeah, long term accumulative complications versus very acute severe medical complications. People have different considerations and thought processes towards the two. Stop being so obtuse...sir or madam...",
                  "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/lug1qwb/",
                  "created": 1730248992,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lucnyjh",
          "score": 8,
          "body": "....what?",
          "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/lucnyjh/",
          "created": 1730211136,
          "depth": 1,
          "replies": [
            {
              "id": "lucuipk",
              "score": 9,
              "body": "Theyre saying that McDonald's customers don't care about health concerns when making purchases, and implying that the e coli outbreak wont seriously affect their revenue because of this. Not sure if that's true will see",
              "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/lucuipk/",
              "created": 1730213274,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lud263e",
      "score": -10,
      "body": "Additionally, the Trump visit was another reason for some Democrats to boycott.\n\nEdit: down voting doesn't change the fact that it's true as I've read it several times in various Reddit communities.",
      "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/lud263e/",
      "created": 1730215680,
      "depth": 0,
      "replies": [
        {
          "id": "ludomid",
          "score": 6,
          "body": "People overestimate how much goofy terminally online shit like this actually effects business.",
          "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludomid/",
          "created": 1730222503,
          "depth": 1,
          "replies": [
            {
              "id": "luf691y",
              "score": 0,
              "body": "Oh really? Tell that to Bud Light.",
              "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/luf691y/",
              "created": 1730238567,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lude2wc",
          "score": -6,
          "body": "it was a fake show it wasnt a visit.",
          "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/lude2wc/",
          "created": 1730219329,
          "depth": 1,
          "replies": [
            {
              "id": "ludmh1c",
              "score": 3,
              "body": "It was an implicit endorsement by McDs corporate. Given the political climate in this country that could cause some people to boycott.",
              "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludmh1c/",
              "created": 1730221861,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ludf7m1",
              "score": -1,
              "body": "Visit\n\nan act of going or coming to see a person or place socially, as a tourist, or for some other purpose.",
              "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/ludf7m1/",
              "created": 1730219674,
              "depth": 2,
              "replies": [
                {
                  "id": "lugm52o",
                  "score": 0,
                  "body": "bro. the store was shut down to the public lmao\n\nyall seriously live in a fairytale world",
                  "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/lugm52o/",
                  "created": 1730255956,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "luccy4n",
      "score": -13,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/luccy4n/",
      "created": 1730207297,
      "depth": 0,
      "replies": [
        {
          "id": "luczk77",
          "score": 3,
          "body": "Bag holder spotted",
          "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/luczk77/",
          "created": 1730214869,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lucjmnc",
          "score": 4,
          "body": "ok lol",
          "permalink": "/r/stocks/comments/1geu345/mcdonalds_reverses_us_samestore_sales_declines_in/lucjmnc/",
          "created": 1730209681,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}