{
  "title": "Microsoft's GitHub goes beyond OpenAI, welcomes AI models from Anthropic, Google",
  "score": 85,
  "selftext": "Microsoft has a very expensive and very public relationship with artificial intelligence startup OpenAI. But one of Microsoft’s most successful AI products, GitHub Copilot, is now going beyond OpenAI to give developers more choice in what models they want to use.\n\nGitHub, which Microsoft acquired in 2018, said in a blog post on Tuesday that developers will be able to power the GitHub Copilot Chat feature with Anthropic’s Claude 3.5 Sonnet model or Google’s Gemini 1.5 Pro model, as alternatives to OpenAI’s GPT-4o, if they choose.\n\n“There is no one model to rule every scenario, and developers expect the agency to build with the models that work best for them,” GitHub CEO Thomas Dohmke said in the post. “It is clear the next phase of AI code generation will not only be defined by multi-model functionality, but by multi-model choice. Today, we deliver just that.”\n\nMicrosoft introduced GitHub Copilot in 2021, offering source code suggestions to software developers. Copilot relies on models from OpenAI, which has received billions of dollars in funding from Microsoft and has exploded in popularity since releasing ChatGPT in late 2022.\n\nOpenAI’s o1-preview and o1-mini, which are meant to reason over difficult problems, will also be available in the Copilot Chat on GitHub’s website and in the open-source Visual Studio Code text editor. They’re currently available in a public preview. Google’s model will be released in public preview in the next few weeks, a spokesperson said.\n\nThe arrival of the o1 models from OpenAI in September led GitHub to look at adding a dropdown menu for Copilot to provide more options, Dohmke said in an interview with CNBC last week. At that point, it felt like “the right time” to add models from Anthropic and Google, Dohmke said.\n\nDevelopers will be able to see which model works best for a given programming language or employ the one that adheres to corporate requirements, he added.\n\nMany other Microsoft products, including Teams and Windows, use OpenAI models. And Microsoft continues to provide computing power to OpenAI, which is now valued at $157 billion. But the relationship between the two companies has frayed in the past year, following the sudden ouster and reinstatement of OpenAI CEO Sam Altman in November. The dramatic incident reportedly angered Microsoft CEO Satya Nadella.\n\nIn February, Microsoft announced a partnership with early-stage AI model developer Mistral. The following month, Microsoft said it was hiring former DeepMind co-founder Mustafa Suleyman and employees of his startup, Inflection, whose Pi assistant competed with OpenAI’s popular ChatGPT. Over the summer, Microsoft named OpenAI as a competitor in a regulatory filing.\n\nIn the past month, GitHub has collaborated with engineering teams from Anthropic and Google on the safety, security and scalability of their models, Dohmke said.\n\n“We are planning on extending that list in the future but have no partnerships to announce at this point,” he said, adding that GitHub wouldn’t want to overwhelm developers with too many choices.\n\nAlso on Tuesday, GitHub announced that its Copilot will gain the ability to perform speedy automated reviews of code updates through a public preview.\n\nAnd GitHub showed a technical preview of a feature named Spark that can compose app prototypes based on text input and refine the designs with a few clicks. Developers will be able to modify the underlying code for the prototypes. Those interested in trying Spark can join a waiting list.\n\nOnce they receive access, people using Spark will be able to choose between GPT-4o and Anthropic’s Claude 3.5 Sonnet model, a GitHub spokesperson said.\n\nSource: https://www.cnbc.com/2024/10/29/microsoft-github-copilot-goes-past-openai-opens-to-anthropic-google.html",
  "link_flair_text": null,
  "id": "1gf1bg5",
  "num_comments": 5,
  "created_utc": 1730225541,
  "permalink": "/r/stocks/comments/1gf1bg5/microsofts_github_goes_beyond_openai_welcomes_ai/",
  "comments": [
    {
      "id": "lue0q95",
      "score": 28,
      "body": "Maybe I am biased but the GitHub copilot Is mostly used within VSC and there users have the choice to use  other copilots. Google Gemini is free and codium as well.\n\nGiving users the ability to choose the model behind GitHub copilot is just staying competitive",
      "permalink": "/r/stocks/comments/1gf1bg5/microsofts_github_goes_beyond_openai_welcomes_ai/lue0q95/",
      "created": 1730226091,
      "depth": 0,
      "replies": [
        {
          "id": "lue8wi0",
          "score": 5,
          "body": "I don't even use gh copilot because Claude is superior\n\nI will have to try it out again now if they allow claude\n\nThis is probably the reason they have been forced to do this, openai is the wrong horse to back imo",
          "permalink": "/r/stocks/comments/1gf1bg5/microsofts_github_goes_beyond_openai_welcomes_ai/lue8wi0/",
          "created": 1730228523,
          "depth": 1,
          "replies": [
            {
              "id": "luf11cs",
              "score": 4,
              "body": "Is there a Claude plugin already?",
              "permalink": "/r/stocks/comments/1gf1bg5/microsofts_github_goes_beyond_openai_welcomes_ai/luf11cs/",
              "created": 1730236944,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luegqnq",
      "score": 9,
      "body": "There are a 100 competitors to co-pilot allowing the user to select from pretty much any of the major models using your own API keys, and some of them are substantially more advanced than co-pilot. This really feels like a reaction to tools like Cline, Cursor, Aider, etc.",
      "permalink": "/r/stocks/comments/1gf1bg5/microsofts_github_goes_beyond_openai_welcomes_ai/luegqnq/",
      "created": 1730230901,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luegevz",
      "score": 4,
      "body": "Allowing Claude makes sense because it's arguably the best coding AI for the cost. But allowing Gemini is surprising, doesn't Gemini exclusively run on Google's TPU hardware? Microsoft and Google are in a pretty fierce battle over who can build up the most compute infrastructure.",
      "permalink": "/r/stocks/comments/1gf1bg5/microsofts_github_goes_beyond_openai_welcomes_ai/luegevz/",
      "created": 1730230803,
      "depth": 0,
      "replies": []
    }
  ]
}