{
  "title": "Apple announces new and smaller Mac Mini with first redesign since 2010",
  "score": 83,
  "selftext": "Apple announced on Tuesday new Mac Mini models, featuring the first major redesign since 2010 that makes the desktop computer significantly smaller.\n\nAside from a redesign that shrunk the case and reduced the computer’s volume in half, the main upgrade on these new computers is that they include Apple’s latest chip, either the M4, or a more powerful version called the M4 Pro.\n\nThe Mac Mini is Apple’s least-expensive Mac, starting at $599, and does not include a display, which is sold separately. When the product line was first introduced in 2008, it was marketed as a computer for people switching from Microsoft Windows who could simply plug their existing keyboard, mouse and monitor into their new silver box.\n\nThe Mac Mini is not one of Apple’s highest-volume computers in terms of sales, but it is an important slot in Apple’s lineup, especially for people who make apps for iPhones and other Apple platforms. Many iPhone developers like to run a Mac Mini as a personal development server for coordinating uploads and code.\n\nOne improvement in the new design is that all of the ports are USB-C ports, the same more modern offering found on Apple’s laptops. There are three USB-C ports on the rear and two on the front, a new addition that will make it easier to plug or unplug accessories while the computer rests on a desk.\n\nApple said in a press release that the M4 is a significant improvement over the M2 chip in the previous version released in 2022. Graphics and games are more than twice as fast, and the M4 can support up to 14 CPU cores and 20 GPU cores, an increase over the past generation. Apple first introduced the M4 in May in Apple’s iPad Pro.\n\nApple is framing the new Mac Minis, like all of its new products announced this year, as built for Apple Intelligence, the company’s artificial intelligence system released this week. Apple has said a forthcoming integration of ChatGPT into writing fields inside apps such as Word will allow users to generate and rewrite text and emails using the system.\n\nHowever, unlike on the iPhone, where only phones released in the past two years will support Apple Intelligence, all of Apple’s computers with the M1 chip and newer since 2020 can run the company’s AI. \n\nApple’s Mac family remains a large business segment even though it is less important to the company than the iPhone. In the June quarter, Apple reported $7 billion in Mac sales, up about 2% on an annual basis.\n\nApple’s chief marketer previously teased a “week of announcements.” The company unveiled new iMac computers on Monday, so it seems plausible more is coming. This week’s new Macs are likely Apple’s last major hardware announcements for the year.\n\nSource: https://www.cnbc.com/2024/10/29/apple-mac-mini-2024-price-release-specs.html",
  "link_flair_text": null,
  "id": "1gf1aat",
  "num_comments": 15,
  "created_utc": 1730225462,
  "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/",
  "comments": [
    {
      "id": "luepohb",
      "score": 42,
      "body": "I'm a fan of mini PCs and this is nifty.",
      "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/luepohb/",
      "created": 1730233544,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lue9hlj",
      "score": 3,
      "body": "Kinda worried about the thermal headroom given the smaller footprint and passive cooling.",
      "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/lue9hlj/",
      "created": 1730228700,
      "depth": 0,
      "replies": [
        {
          "id": "lueibkk",
          "score": 37,
          "body": "Eh it's basically powered by a supercharged mobile chip. Heating won't be a concern.",
          "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/lueibkk/",
          "created": 1730231371,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luez0au",
          "score": 17,
          "body": "if an ipad pro can run it then a mac mini with a fan can too",
          "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/luez0au/",
          "created": 1730236321,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luf5933",
          "score": 11,
          "body": "The M chips are insanely efficient, there's a reason they did the Mac Studio and the Mac Pro is barely worth looking at anymore",
          "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/luf5933/",
          "created": 1730238253,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "luhw0tc",
      "score": 1,
      "body": "So MacBook and Mac Pro & Studio releases should be coming too",
      "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/luhw0tc/",
      "created": 1730282181,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lufb98x",
      "score": -16,
      "body": "Undoubtedly over priced",
      "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/lufb98x/",
      "created": 1730240185,
      "depth": 0,
      "replies": [
        {
          "id": "lughmaj",
          "score": 3,
          "body": "Mate, you couldn't even make it to the third paragraph?",
          "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/lughmaj/",
          "created": 1730254316,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lueevz0",
      "score": -27,
      "body": "We’re still innovating! Look over here at our new silver box while we decide what decades old features we are going to steal and rename from Android.",
      "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/lueevz0/",
      "created": 1730230343,
      "depth": 0,
      "replies": [
        {
          "id": "lughw9m",
          "score": 2,
          "body": "As an android maxi I've never been upset about a Mac mini.",
          "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/lughw9m/",
          "created": 1730254414,
          "depth": 1,
          "replies": [
            {
              "id": "lugiv26",
              "score": -2,
              "body": "Idk what Maxi means and who is upset? That’s literally what’s happening here. Sorry if that bothers you?",
              "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/lugiv26/",
              "created": 1730254758,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lue0fie",
      "score": -33,
      "body": "We still do have anything new!! Buy our mini!!!!",
      "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/lue0fie/",
      "created": 1730226004,
      "depth": 0,
      "replies": [
        {
          "id": "lue7697",
          "score": 15,
          "body": "They have a new Mac Mini. Didn’t you see all those words up there? 👆",
          "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/lue7697/",
          "created": 1730228005,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lue8ba1",
          "score": 1,
          "body": "If you have an entire market for a product that sells boxcars year after year, do you actually NEED anything new?",
          "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/lue8ba1/",
          "created": 1730228347,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lugswh8",
          "score": 0,
          "body": "Learn to spell.",
          "permalink": "/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/lugswh8/",
          "created": 1730258581,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}