{
  "title": "Visa earnings: $9.6B revenue, $5.3 GAAP net income, 13% dividend hike",
  "score": 98,
  "selftext": "Visa (NYSE:V)reported fourth-quarter earnings that surpassed analyst estimates, driven by robust revenue growth across its business segments. The company's shares rose 2% in after-hours trading following the announcement.\n\nThe global payments technology company reported adjusted earnings per share (EPS) of $2.71 for the quarter ended September 30, 2024, beating the analyst consensus of $2.58. Revenue for the quarter came in at $9.6 billion, exceeding the expected $9.49 billion and representing a 12% increase YoY on both a nominal and constant-dollar basis.\n\nVisa's strong performance was underpinned by stable growth in key metrics. Payments volume for the three months ended September 30, 2024, increased 8% YoY on a constant-dollar basis. Cross-border volume, excluding transactions within Europe, rose 13% on a constant-dollar basis. Total processed transactions reached 61.5 billion, a 10% increase over the prior year.\n\nRyan McInerney, Chief Executive Officer of Visa, commented on the results: \"Visa had a robust fourth quarter to finish a very strong fiscal year. In the fourth quarter, net revenue and GAAP EPS grew by 12% and 17%, respectively, driven by relatively stable growth in payments volume, cross-border volume and processed transactions plus strong momentum across new flows and value added services.\"\n\nThe company's board of directors approved a 13% increase in Visa's quarterly cash dividend to $0.590 per share, reflecting confidence in the company's financial position and future prospects.\n\nFor the full fiscal year 2024, Visa reported net revenue of $35.9 billion, a 10% increase on both a nominal and constant-dollar basis. The company's GAAP net income for the year was $19.7 billion, or $9.73 per share, while non-GAAP net income reached $20.4 billion, or $10.05 per share.\n\nhttps://www.investing.com/news/stock-market-news/visa-beats-q4-expectations-shares-rise-on-strong-revenue-growth-3689289",
  "link_flair_text": "Company News",
  "id": "1gf6zpa",
  "num_comments": 2,
  "created_utc": 1730239810,
  "permalink": "/r/stocks/comments/1gf6zpa/visa_earnings_96b_revenue_53_gaap_net_income_13/",
  "comments": [
    {
      "id": "luhcqoy",
      "score": 10,
      "body": "Visa killing it in Q4 with EPS beating estimates and solid revenue growth across the board. That 13% dividend hike shows they're feeling bullish about what's next.",
      "permalink": "/r/stocks/comments/1gf6zpa/visa_earnings_96b_revenue_53_gaap_net_income_13/luhcqoy/",
      "created": 1730269001,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luz95fn",
      "score": 1,
      "body": "I wanted to open a position for years now. Shame on me. Better late than never I guess",
      "permalink": "/r/stocks/comments/1gf6zpa/visa_earnings_96b_revenue_53_gaap_net_income_13/luz95fn/",
      "created": 1730526329,
      "depth": 0,
      "replies": []
    }
  ]
}