{
  "title": "[MSOS/TLRY/CGC] The DEA begins calling witnesses for cannabis rescheduling ALJ hearing: Stakeholders and prohibitionists are invited so far.",
  "score": 39,
  "selftext": "https://www.marijuanamoment.net/dea-begins-selecting-witnesses-for-marijuana-rescheduling-hearing-inviting-industry-stakeholders-and-prohibitionists-to-testify/\n\n\"The Drug Enforcement Administration (DEA) has started selecting witnesses to participate in a much-anticipated hearing on the Biden administration’s proposal to federally reschedule marijuana that’s scheduled for December, Marijuana Moment has learned.\"\n\n\"This comes about seven months after the Justice Department formally proposed moving cannabis from Schedule I to Schedule III of the Controlled Substances Act (CSA) following a scientific review. After a public comment period, which saw tens of thousands of people weigh in on the issue, a hearing was set for December 2 to gather additional expert input.\"\n\n**\"The National Cannabis Industry Association (NCIA) is among those that received a notice from DEA this week that their request to participate in the hearing has been granted.\"**\n\n**\"A source familiar with the administrative proceedings told Marijuana Moment that anti-cannabis groups Smart Approaches to Marijuana (SAM), Community Anti-Drug Coalitions of America (CADCA) and National Drug & Alcohol Screening Association (NDASA) have also received notices granting their requests.\"**\n\n\"It’s not clear how many witnesses DEA selected of the many who submitted requests ahead of the hearing, nor it is apparent whether the agency plans to continue granting requests on a rolling basis in the coming weeks. Representatives of major pro-marijuana organizations such as NORML and the Marijuana Policy Project (MPP) said they have not yet received a response on their requests to participate as of Tuesday afternoon.\"\n\nSo the presence of two major anti-marijuana groups were already expected, the DEA will have to hear both sides of the aisle in the matter, but it feels odd that they invited anti-marijuana groups but so far, did not invited any pro-marijuana group besides major stakeholders in the industry.\n\nRegardless, out of all the comments that were sent to the DEA a month ago, the amount of positive comments to rescheduling the plant completely dwarfed the negatives, and the invitation process is just beginning anyway, so I can assume that more people and groups will be invited.\n\nEither way, I do not expect this rescheduling process to be over this year, given that the ALJ will only happen in December, even if it, it would only be  in efeect in 2025 anyway.\n\nPositions: 1000 shares of MSOS @ $7.69 average.\n\nI'm holding through the elections, so far the polls are looking favorable for Florida's Amendment 3 passing which will be great for the tier 1 MSOs, but I'm also keeping an eye out on who is going to be elected in November, and what the cabinet is gonna look like.\n\nThe sector went up last week, but now it's further down than before, if you're on this ride then expect lots of volatility and market dumps in the coming days. Weedstocks are not for the faint of heart.\n\nNot Financial Advice, invest at your own discretion.",
  "link_flair_text": "News",
  "id": "1gfjqx5",
  "num_comments": 5,
  "created_utc": 1730285797,
  "permalink": "/r/wallstreetbets/comments/1gfjqx5/msostlrycgc_the_dea_begins_calling_witnesses_for/",
  "comments": [
    {
      "id": "lui2e5b",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 6 months ago\n**Total Comments** | 194 | **Previous Best DD** | \n**Account Age** | 6 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1gfjqx5/msostlrycgc_the_dea_begins_calling_witnesses_for/lui2e5b/",
      "created": 1730285800,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luiazet",
      "score": 9,
      "body": "This shit moves at a snails pace.",
      "permalink": "/r/wallstreetbets/comments/1gfjqx5/msostlrycgc_the_dea_begins_calling_witnesses_for/luiazet/",
      "created": 1730289917,
      "depth": 0,
      "replies": [
        {
          "id": "luignkp",
          "score": 4,
          "body": "Current rumors says its because there is quite a bunch of old heads at the DEA that do not want to reschedule the drug, even though there's tons of scientific evidence pointing towards the fact that the plant has no business being in Schedule 1.\n\n\nSo they postponed the rescheduling process until next year because by then there would be another presidential cabinet in the white house that could influence the process.\n\n\nThe slowness of the whole process is very likely to be proposital.",
          "permalink": "/r/wallstreetbets/comments/1gfjqx5/msostlrycgc_the_dea_begins_calling_witnesses_for/luignkp/",
          "created": 1730292229,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lui3a41",
      "score": 5,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1gfjqx5/msostlrycgc_the_dea_begins_calling_witnesses_for/lui3a41/",
      "created": 1730286266,
      "depth": 0,
      "replies": [
        {
          "id": "luoaz4h",
          "score": 1,
          "body": "Tilray is the biggest POS dumpster fire of a company. They used to be called Aphria, and were called out on spending $300,000,000 on a couple of tiny weed farms / licenses in Latin America. That’s a lot of cash that they gave to their buddies that flipped the licenses for an insane profit. Like a 20 bagger or more. \n\nWeed bros still love it though. Some are bagholders, but I’ve always thought, you’re just better off taking the loss and moving on.",
          "permalink": "/r/wallstreetbets/comments/1gfjqx5/msostlrycgc_the_dea_begins_calling_witnesses_for/luoaz4h/",
          "created": 1730371175,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lumyh7x",
      "score": 2,
      "body": "DEA cucks will continue hamstringing legalization until they finally get the boot, or just die of old age. Fucking pathetic.",
      "permalink": "/r/wallstreetbets/comments/1gfjqx5/msostlrycgc_the_dea_begins_calling_witnesses_for/lumyh7x/",
      "created": 1730343205,
      "depth": 0,
      "replies": []
    }
  ]
}