{
  "title": "Volkswagen profit plunges 42% in third quarter amid sweeping overhaul plans",
  "score": 181,
  "selftext": "German automaker Volkswagen on Wednesday reported a 42% drop in operating profit in the third quarter.\n\nOperating profit fell to 2.86 billion euros ($3.1 billion), while third quarter sales revenues slipped 0.5% year on year to around 78.5 billion euros.\n\nVehicle sales fell 8.3% in the third quarter of 2024 compared to the same time period a year earlier, Volkswagen said.\n\nNet liquidity across the Volkswagen Group stood at negative 160.6 billion euros at the end of September 2024, it said. The company’s net liquidity stood at negative 147.4 billion euros at the end of 2023.\n\nVolkswagen on Wednesday said that its results across the first three quarters of the year were impacted by higher fixed costs and restructuring efforts. Operating profit between January and September of this year was 21% lower on an annual basis.\n\nVolkswagen shares were were last 1.8% higher at 8:19 a.m. London time.\n\nArno Antlitz, chief financial officer and chief operating officer at Volkswagen Group, said the performance reflected a “challenging market environment” and highlighted the importance of ongoing performance programs across the company.\n\nThe third quarter results come after Volkswagen last month cut its 2024 annual outlook for the second time in just a few months. At the time, the car maker said it was expecting a profit margin of around 5.6% for the year, along with a 0.7% drop in sales to 320 billion euros. Those figures were left unchanged on Wednesday.\n\nVolkswagen has been in hot water in recent months, warning of potential plant closures in Germany and scrapping a slew of labor agreements with local workers in September. The company also said it would end its employment protection agreement, which has been in place for its German workforce since 1994.\n\nOn Monday, the Volkswagen works council said the company’s management was planning widespread pay cuts and layoffs, as well as the closure or size reduction of all of its German plants.\n\nIn response, Volkswagen reiterated the need for restructuring and said that it would present plans for work cost cuts during a round of negotiations about the labor agreements, which is also taking place on Wednesday.\n\n“Ahead of the negotiations today, we need to state: the situation is getting more serious,” Volkswagen’s chief negotiator Arne Meiswinkel said on Wednesday according to a CNBC translation.\n\nHe added that current developments in the auto industry in Europe and especially in Germany were concerning, as shown by the latest figures from both the company and its competitors.\n\nMeiswinkel reiterated that Volkswagen needed to lower costs and increase its efficiency to be in a position that allows it to invest in its future.\n\nSource: https://www.cnbc.com/2024/10/30/volkswagen-q3-2024-results.html",
  "link_flair_text": null,
  "id": "1gfm8o3",
  "num_comments": 61,
  "created_utc": 1730294105,
  "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/",
  "comments": [
    {
      "id": "luipj22",
      "score": 160,
      "body": "Weird what happens when you stop making products that your dedicated customer base wants to buy.",
      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luipj22/",
      "created": 1730295416,
      "depth": 0,
      "replies": [
        {
          "id": "luje7uf",
          "score": 36,
          "body": "I know sedans are not the hottest topic right now but I remember reading something from one of their bosses when they stopped making the Passat Sedan that the new generation would be Wagon only because the Variant outsold the Sedan 2:1.\n\nI read that I thought \"well, the Sedan sells a lot less but isn't 30% of your model sales a lot to throw away?\".\n\nI don't even make start to talk about the ID range.",
          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luje7uf/",
          "created": 1730303073,
          "depth": 1,
          "replies": [
            {
              "id": "lumsak0",
              "score": 5,
              "body": "yes yes and yes. overly simple strategy’s often fail miserably.",
              "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lumsak0/",
              "created": 1730340978,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lum7s13",
          "score": 12,
          "body": "Weird how it also happens when you out price your customers of the cars they want as well.",
          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lum7s13/",
          "created": 1730334024,
          "depth": 1,
          "replies": [
            {
              "id": "lum8438",
              "score": 13,
              "body": "VW: \"look at this insane concept revival of [cool retro model everybody wants]!\"\n\nCustomers: \"hell yeah\"\n\nVW: \"it'll be on sale in four years. It'll be EV-only and cost $65,000.\"",
              "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lum8438/",
              "created": 1730334132,
              "depth": 2,
              "replies": [
                {
                  "id": "luojwkg",
                  "score": 3,
                  "body": "They still don’t have an electric beetle which is just wild to me. It’s their most iconic car! Plenty of people are still driving the last model released around here, and that’s over 20 years old",
                  "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luojwkg/",
                  "created": 1730375718,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "luj2kis",
          "score": 8,
          "body": "For example? (Honest question)",
          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luj2kis/",
          "created": 1730299561,
          "depth": 1,
          "replies": [
            {
              "id": "lujtmji",
              "score": 26,
              "body": "Bring back normal buttons. This is a deal breaker for me.",
              "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lujtmji/",
              "created": 1730307677,
              "depth": 2,
              "replies": []
            },
            {
              "id": "luj8z7e",
              "score": 10,
              "body": "Affordable cars. Under 15k$",
              "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luj8z7e/",
              "created": 1730301501,
              "depth": 2,
              "replies": [
                {
                  "id": "lujgihj",
                  "score": 20,
                  "body": "That only solves the problem for the consumer, no? 15k cars have virtually no margin for the seller.",
                  "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lujgihj/",
                  "created": 1730303751,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lukxmrl",
                      "score": -19,
                      "body": "Operating leverage. One extra dollar is 1 dollar.\n\nSo what it's low margin would you have an extra 100 bucks at low margin of 0 bucks",
                      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lukxmrl/",
                      "created": 1730319389,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "luncpqb",
                          "score": 10,
                          "body": "I feel like many of my brain cells died reading this comment",
                          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luncpqb/",
                          "created": 1730349089,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lum5klq",
                  "score": 5,
                  "body": "impossible to build in Germany for that price. They couldn’t do it even if the car was literally just the metal frame with a steering wheel",
                  "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lum5klq/",
                  "created": 1730333283,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lupbe8a",
                      "score": 0,
                      "body": "Then i won't buy it and I'll keep driving my 10+ old car. Simple as that. \n\nI am not car fanatic.",
                      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lupbe8a/",
                      "created": 1730385747,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lukitz2",
          "score": 6,
          "body": "Loyal customer base are all boomers, almost on verge of getting driving license cancelled. Gen-Z city dwellers too broke to buy cars. Gen-Y is their client base, who already bought cars in COVID time, and are now holding back on an upgrade because of recession fears.\n\n\nBut as they say, be greedy when others are fearful. I'm loading up 🤤",
          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lukitz2/",
          "created": 1730315057,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luo1bl5",
          "score": 0,
          "body": "IDK, people seem to like Audi and Porsche just fine.\n\nTheir sales have not gone down, just their profit. Which is to be expected. Same with the massive employee cuts. \n\nThey are making a massive shift to electric, their sales are solid, and less profit and head count cuts are to be expected.\n\nIt may still go down a bit short term, but I think this stock will 3x in the next 3 years, easily.",
          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luo1bl5/",
          "created": 1730364950,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lujyw7d",
      "score": 11,
      "body": "Time to bring VW Polo to the North American market.",
      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lujyw7d/",
      "created": 1730309231,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luiza7j",
      "score": 20,
      "body": "Will reach about an $18bn in earnings this year and the company right now is valued at $47bn. Valuation can't go much lower unless there are major, major things happening. They are having a tough time right now, sure, but it is not catastrophic. I'm sure things will look better in a few years time. VW Group is almost the epitome of too big to fail. \n\nI'd wait this one out. It's not like car's are going away anytime soon and neither are European or American car companies, despite the newcomers on the market. Japan disrupted the world back in the 70's, China are doing the same right now, doesn't mean VW, Merc, BMW, Ford, GM, Volvo, Stellantis, etcetera, won't exist in 10 years time. If you don't like the risk, do not invest in automotive stocks. However, the industry is a whole is beginning to become attractive with regards to their valuations just going down the drain. There are some returns to be made once economies start turning around around the globe with regards to high cost items like vehicles.",
      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luiza7j/",
      "created": 1730298545,
      "depth": 0,
      "replies": [
        {
          "id": "lukktnb",
          "score": 13,
          "body": "Their sales haven’t really changed much either. And I think they will pick up again in the next year now that the ECB has started cutting interest rates.\n\nOn top of that, they have a 10% dividend (though it will fall).\n\nOh, and everyone in all the stock comments I read forget that VW owns: Audi, Bentley, Lamborghini, Porsche, Skoda, and others.\n\nAnd their latest electric cars look great and I think will do well.\n\nI think it’s a solid buy at the moment",
          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lukktnb/",
          "created": 1730315656,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luk8kqp",
          "score": 9,
          "body": "I imagine this is somewhat what horse sellers sounded like right before the car arrived. The only two American automakers who haven’t gone bankrupt are Tesla and Ford. Just cause your to big to fail and get bailed out doesn’t make you a good investment. The reality is VW can’t compete with Tesla and Chinese automakers",
          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luk8kqp/",
          "created": 1730312047,
          "depth": 1,
          "replies": [
            {
              "id": "luk9i5w",
              "score": 9,
              "body": "I get your point. And I agree to some extent. Difference though, is that horses were vastly different from automobiles. VW sure knows how to build cars, and EV’s ain’t that different. What I am saying, is I think they’ll figure it out eventually. \n\nI think the automobile industry is facing a lot of doom and gloom talk right now, a bit more than I think is necessary. Now, that doesn’t mean automobile stocks are good investments. I’m not saying that, I’m just saying that their valuations are beginning to look interesting - if you’re into this type of stuff.",
              "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luk9i5w/",
              "created": 1730312320,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "luo09u9",
          "score": 2,
          "body": "When the company has so much debt as VW you can't just look at the market cap and say it is cheap. Their short + long term debt is 194b, market cap is 45b. If they make 18b their EV / Net income is 13, which is not that cheap. And debt is inherent in their business model, so they will never get high multiple like Tesla due high leverage.",
          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luo09u9/",
          "created": 1730364203,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luj2opv",
          "score": 8,
          "body": "VW will be fine, but it appears to me that German manufacturing is on its death bed. \n\nMany developing nations now possess the capability to manufacture product with usable quality that can replace expensive product of German-origin, and rampant inflation kills off appetite for such product in the first place. Germany has managed to resist the outsource of manufacturing throughtout Western nations thus far, but now when VW closes down all its German plan, it signals the end of the line for German manufacturing prowess.",
          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luj2opv/",
          "created": 1730299596,
          "depth": 1,
          "replies": [
            {
              "id": "luj505l",
              "score": 25,
              "body": "They are not closing \"all of their German plants\". Please do some research. VW Group has built too much capacity. Say they have capacity to build 20 million vehicles per year, and the demand is only 12 million, why should they have 8 million in capacity just sitting there, costing money? They are not closing down entire operations, they are getting rid of fat. They are thus looking at closing some of their plants, absolutely not all of them. \n\nGerman manufacturing is not on its death bed. German manufacturing is in a transitionary phase, one that smaller countries like Sweden have already gone through successfully. Sweden for instance switched from making generic products that anyone across the world could make, to making the most advanced, high end products that require high level of engineering and R&D. Think of companies like Atlas Copco, AB Volvo, Sandvik, ABB. These businesses still manufacture stuff, but instead of, for instance manufacturing regular steel alloys that any company can make - they focus on making advanced steel alloys such as ultra-high strength steel and what not. Or, in the case of ABB, instead of focusing on making some fuses and basic electrical equipment - they make industrial robots and automation systems. \n\nThere's a reason why Chinese manufacturing still rely on western equipment. Go to a car plant in China and you can see robotics from Swedish/Swiss ABB, or from for instance Japan (Fanuc). Go to Shanghai, as I did last year, and you'll see their fire department is using Scania trucks. Why don't they use their own trucks? They're not good enough yet for critical applications like emergency services. \n\nWestern manufacturing is not dead. However, western manufacturing companies can not compete with generic, basic products - and thus they should focus on the higher end market. This'll inherently lead to downsizing, but the industries will not die, as long as these companies handle these transitions good enough.",
              "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luj505l/",
              "created": 1730300300,
              "depth": 2,
              "replies": [
                {
                  "id": "lum677m",
                  "score": 3,
                  "body": "Mercedes switched to only premium high end cars 2 years ago. Their net income almost halved.",
                  "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lum677m/",
                  "created": 1730333492,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "luky0cu",
          "score": 1,
          "body": "Nah they're fucked, their cars are priced way too high.\n\nThey need to pump out 25-35k models again",
          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luky0cu/",
          "created": 1730319500,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "luob6gc",
      "score": 2,
      "body": "A challenging market environment.  Umm, yeah.  Challenging for the consumer to pay jacked up prices.",
      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luob6gc/",
      "created": 1730371292,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luohfej",
      "score": 2,
      "body": "Welcome to the UK car industry decline.\n\nSoon your cars will also be manufactured in Slovenia",
      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luohfej/",
      "created": 1730374563,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luqmv56",
      "score": 2,
      "body": "Some golf versions are nearly 100k in Ireland now, VW seem to be pricing themselves out of their core customers price",
      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luqmv56/",
      "created": 1730400631,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luoxhld",
      "score": 1,
      "body": "After changing everything to cheap plastic composite parts they still are not making profit?? Who the fuck uses a plastic oil pan?! Did y’all not meet with how many oil pans get cracked from factory on your golf’s and jettas??",
      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luoxhld/",
      "created": 1730381052,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luj72si",
      "score": -2,
      "body": "VW is cooked",
      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luj72si/",
      "created": 1730300928,
      "depth": 0,
      "replies": [
        {
          "id": "lv76k7o",
          "score": 1,
          "body": "Germany is cooked, it is turning into a third world country.",
          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lv76k7o/",
          "created": 1730651257,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "luimdqy",
      "score": -25,
      "body": "HA! Fuck VW",
      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luimdqy/",
      "created": 1730294335,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luinwqa",
      "score": -46,
      "body": "The long dick of Tesla is coming for all",
      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luinwqa/",
      "created": 1730294863,
      "depth": 0,
      "replies": [
        {
          "id": "luip2d6",
          "score": 27,
          "body": "More like Chinese cars. Yes...like xiaomi, byd and more.  tesla no way.",
          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luip2d6/",
          "created": 1730295259,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luirb1t",
          "score": 3,
          "body": "You can't compare a golf to a Tesla. Completely different customer base.",
          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luirb1t/",
          "created": 1730296006,
          "depth": 1,
          "replies": [
            {
              "id": "luizb65",
              "score": 5,
              "body": "Take a long and hard look at the Scandinavian market.\n\nWe used to buy VW and Skoda. Now it’s Tesla…",
              "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luizb65/",
              "created": 1730298553,
              "depth": 2,
              "replies": [
                {
                  "id": "luizu1s",
                  "score": -4,
                  "body": "My point is, if you can barely afford a gold, you most definitely can't afford a tesla.",
                  "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luizu1s/",
                  "created": 1730298717,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "luj1ggw",
                      "score": 5,
                      "body": "Golf Style is 35.000 euro in Germany while the Tesla model 3 starts at 40.000 euro. With the current price of gasoline you don’t have to drive a lot for the Tesla to become the cheapest choice of those two options…",
                      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luj1ggw/",
                      "created": 1730299219,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "luj3pvn",
                          "score": 5,
                          "body": "Style is not the cheapest golf model. It's golf start. It's ~21K eur in Hungary.",
                          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luj3pvn/",
                          "created": 1730299911,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lujbbth",
                              "score": 1,
                              "body": "Even with a cheaper version, it has been declining sales since 2015 (~534k golfs units sold) and in 2022 sold only ~176k units. Not even a decade later, Golf sales units dropped +50%.\n\nCheaper cars don't mean much when consumers aren't buying them. \n\nhttps://www.goodcarbadcar.net/volkswagen-golf-sales-figures/",
                              "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lujbbth/",
                              "created": 1730302209,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "luj3oam",
                          "score": -5,
                          "body": "And the electric energy is free? \n\n€/kWh aint cheap. Last time i checked gas per km is cheper then kWh per km.",
                          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luj3oam/",
                          "created": 1730299897,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lujfw04",
                              "score": 3,
                              "body": "In most European countries you get much better €/milage with electricity than gas or diesel.\n\nIn our household the fuel budget was cut in half transitioning to EV’s. When you do the total cost of ownership estimate? It’s a no-brainer.",
                              "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lujfw04/",
                              "created": 1730303566,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "luiz47u",
          "score": -1,
          "body": "All your downvotes (and the comments below) show why VW and the rest of the German auto industry is fucked.\n\nUtter and complete denial.\n\nTesla alone sold more than 350.000 EV’s in the EU last year. And they are raking in profits. \n\nSlamming tariffs on Chinese imports will only delay the inevitability for a few more years.\n\nIgnoring the fact that Tesla offer extreme value for money? That’s also stupid denial.\n\nAdapt or die…",
          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luiz47u/",
          "created": 1730298494,
          "depth": 1,
          "replies": [
            {
              "id": "luizwg8",
              "score": 9,
              "body": "People get hooked on \"Elon bad\" and can't confront reality anymore.\n\n\nPeople need to be able to hold two thoughts at once \"Elon is annoying but he directed his companies well to capitalize on lazy encumbants\"\n\n\nOutrageously common reasoning deficiency.",
              "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luizwg8/",
              "created": 1730298738,
              "depth": 2,
              "replies": [
                {
                  "id": "luj37s3",
                  "score": 3,
                  "body": "Black and white thinking is a sign of low IQ. Absolutely no room for nuance with these morons.\n\nElon is a drama addicted asshole = true\n\nElon is an incredible leader of engineers and has achieved incredible things with his companies = also true.\n\nLove the username btw. I did not miss NVDA :D",
                  "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luj37s3/",
                  "created": 1730299757,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "luj661t",
                      "score": 2,
                      "body": "😉 \n\nThe best part about the username is I made the account when I knew there was still more to go, so I'd have timestamped proof of my correct, continued conviction.\n\nIt's up like 200% since my cake day, a day when many loud and highly upvoted commenters said \"buying here is delusional\"",
                      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luj661t/",
                      "created": 1730300655,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "luj7vgd",
                          "score": 1,
                          "body": "Genius hahaha",
                          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luj7vgd/",
                          "created": 1730301167,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lujqbh1",
                  "score": -1,
                  "body": "Lol, the guy with the TSLA username is telling us to keep perspective.\n\nYou can't make this shit up.",
                  "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lujqbh1/",
                  "created": 1730306706,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lukn3ed",
                      "score": 2,
                      "body": "TSLA username?",
                      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lukn3ed/",
                      "created": 1730316335,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lukt3dl",
                          "score": -2,
                          "body": "Lol you're right. So cultish that I mix the two up.\n\nMy point still stands",
                          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lukt3dl/",
                          "created": 1730318107,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lukt7lm",
                              "score": 3,
                              "body": "What's your point exactly?",
                              "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lukt7lm/",
                              "created": 1730318142,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "luktjqx",
                                  "score": -2,
                                  "body": "Someone that is so biased as to have a specific ticker in their username telling us we are the ones being biased",
                                  "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luktjqx/",
                                  "created": 1730318241,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lukuaut",
                                      "score": 3,
                                      "body": "Is it wrong to have conviction?\n\nStocks up 200% since account creation, and I had the insight to own it well before then too.\n\n\nAnd we're not talking about NVDA.\n\n\nMaybe you should step back and think about what you're trying to say - you seem to have way more bias than I do here.\n\n\nAre we wrong? Does tesla not hold top 3 EV sales spots in NA? Are legacy OEMs not struggling to pull off EVs?\n\n\n\nOr are you just complaining that people have differing opinions than yours?",
                                      "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lukuaut/",
                                      "created": 1730318460,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lukumn1",
                                          "score": 0,
                                          "body": "Feel free to have conviction.\n\nJust don't tell other people they are \"denying reality\" if they have conviction in a direction you disagree with",
                                          "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lukumn1/",
                                          "created": 1730318551,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lujpnu6",
              "score": 1,
              "body": "Can you tell me who made more money last quarter?",
              "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lujpnu6/",
              "created": 1730306512,
              "depth": 2,
              "replies": [
                {
                  "id": "luk3qns",
                  "score": 4,
                  "body": "Tesla $25.18B revenue, earnings $2.17B\n\nVW $83.34B revenue, earnings $3.27B\n\nAbsolute and relative numbers can be a challenge for people stuck in the past.",
                  "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/luk3qns/",
                  "created": 1730310637,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lujcjrd",
              "score": -3,
              "body": "Talking about denial while Tesla makes garbage. Value for money? Lmao 😂",
              "permalink": "/r/stocks/comments/1gfm8o3/volkswagen_profit_plunges_42_in_third_quarter/lujcjrd/",
              "created": 1730302578,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}