{
  "title": "SoFi's development and Progress made as noted in Q3 Earnings Call",
  "score": 40,
  "selftext": "* **Adjusted Net Revenue:** $689 million, up 30% year-over-year.\n* **Financial Services Revenue:** $238 million, up 102% year-over-year.\n* **Tech Platform Revenue:** Nearly $103 million, up 14% year-over-year.\n* **New Members Added:** 756,000, up 35% year-over-year, totaling 9.4 million members.\n* **Loan Volume:** $6.3 billion, with $392 million in adjusted net revenue, up 14% year-over-year.\n* **GAAP Net Income:** Nearly $61 million, a $327 million improvement year-over-year.\n* **Adjusted EBITDA:** $186 million, up 90% year-over-year.\n* **Personal Loan Originations:** $4.9 billion, up 26% year-over-year.\n* **Home Loan Volume:** $490 million, up 38% year-over-year.\n* **Student Loan Volume:** $944 million, up 3% year-over-year.\n* **Member Deposits:** Grew by nearly $2.4 billion to nearly $23 billion.\n* **Total Capital Ratio:** 16.3%, Well above regulatory minimums.\n* **In Q3, tangible book value increased $236 million** to a total of $4.4 billion. \n\nCEO: \"This is why you often hear me say, it's a matter of when, but not if we'll become a Top 10 institution\"\n\n* I could not be prouder of how we've scaled this segment over the past five years since launching these products through a tumultuous and unpredictable environment to now be a $1 billion annualized revenue business growing over 100% with strong and improving profitability. And frankly, it's still day one.\n* We continue to see a strong pipeline of potential partners that are striving to modernize their platforms.\n* Our one-stop shop continues to attract great cross-buying behavior by our members. In fact, 32% of new products were opened by existing SoFi members and 20% of our new members opened a second product in their first 30 days. This is the power of the flywheel we have developed.\n* Overall, we're making incredible progress in our shift towards more fee-based, capital-light and lower-risk revenue sources. Combined, fee-based revenue made up $174 million or a quarter of our adjusted net revenue in Q3. This revenue grew by 65% year-over-year. On an annualized basis, that's nearly $700 million in revenue.\n* We've achieved 17 of 19 quarters of record revenue through a recession, a pandemic, 150 basis point rate drop, damage to our largest and most profitable business, student lender finance only to face a 500 basis point increase in rates and the collapse of venerable financial institutions in our neighborhood.\n* Our performance in the hard times is what gives me the strong confidence in our future. Today, we faced fewer headwinds than any point in our history. We're heading into 2025 with the most favorable conditions of the last seven years with declining rates and a stable economy.\n* We continue to establish SoFi as a trusted household name. We ended Q3 with our highest average unaided brand awareness of all time, up nearly 40% year-over-year to 7%. \n* We continue to innovate so people find unique value when they use our products. \n* We also launched our new directed share program, which offers a modern and streamlined approach to equity programs for companies looking to raise capital through IPOs.\n* SoFi Plus, our premium membership tier and our beta testing a new fee-based subscription option in the coming months.\n* In credit cards, we officially launched the everyday cash rewards and the essential credit cards, enabling SoFi to serve more people spending and borrowing needs,\n* We shift towards even more fee-based, capital-light, and lower-risk sources of revenue.\n* We also signed our first two direct insurance carriers for SoFi Protect, complementing our comprehensive financial services offering we've built over the last five years.\n* Home refinancing volume was the highest we've seen since the second quarter of 2022.\n* In our tech platform, we signed several new partnerships, including processing deals with two charter banks in Mexico and a deployment of Galileo's Cyber Bancorp for SoFi's new commercial payment services sponsored bank program.\n* We launched additional fraud prevention solutions, the Galileo instant verification engine, which we call GIVE as well as transaction risk GScore, both of which help clients enhance their security and operational efficiency. Our new secured credit with dynamic funding offering promotes greater financial inclusion and enables clients to help their customers build stronger credit.\n* We launched programs with clients signed in prior quarters, spanning cross-border payments, global payouts, financial literacy, and scalable payment solutions.\n* Delinquencies peaked in March of 2024. Since then, we've continued to see improvements quarter-over-quarter.\n* In closing, I couldn't be more proud of what we've accomplished not just for Q3, but for delivering a steady and consistent record of durable growth, incredible brand building and product innovation that help our members and clients and strong improving returns for our shareholders. The future is bright, and I am fired up for what in store.\n* We reduced our brokered deposits by $445 million as we continue to use our consumer deposits to replace higher cost parts of the funding stack.\n* SoFi Money continues to resonate well, maintaining market share and ranking in API. We saw over $2 billion in member deposit growth in the quarter, with spending levels on par or better than historical levels. Direct deposit customers are more engaged, with higher product adoption, contributing to our competitive advantage.\n* We declined between 70% and 80% of the personal loan applicants to SoFi. And so there's a lot of potential\n* His closing statement: We now face hopefully, the most advantageous environment that we've seen since I joined the company, and we began the relentless march to be a one-stop shop. Today, we are no longer just a lending company. Today, we are a force to be reckoned with. It is truly our time as we have more products, more members, more capital and more diverse revenue streams than ever before. We are undeniably the absolute best patient company to capture the massive opportunities still ahead of us because of the same thing that got us here, our people. Our people are great at heart. Thank you, everyone, for your time today, and we hope you have a great end to 2024.\n\nCFO:\n\n* Loan Platform Deals: CFO: This is a fee-based and capital-light revenue source for us. We generate cash fees upfront at the time of transfer or referral without taking balance sheet risk. Importantly, there are no financing commitments or loss share agreements associated with these deals.\n* There is a 220 basis points difference between the interest we pay on deposits and the interest we pay on warehouse lines, which translates to more than $500 million in annualized interest expense savings given the size of our deposit base.\n* We expect modest growth in balance sheet originations year-over-year. We are happy with the current size of our balance sheet and the net interest income generated. Excess demand from borrowers and loan investors is being fulfilled through our loan platform business. We expect growth in student loan refinancing and home loans in a lower rate environment.\n* Recent (loan) vintages are projected to produce higher returns, with ROEs above 30%. This is driven by lower expected life of loan loss rates, higher pricing beta, funding cost efficiencies, and origination fees.\n* We expect continued strong growth in the loan platform business, with commitments from Fortress and other partners. Demand is strong, and we are fulfilling it through the loan platform business.\n* For the full year 2024, we now expect to deliver adjusted net revenue of $2.535 billion to $2.550 billion, which is $85 million higher than our prior guidance range of $2.425 billion to $2.465 billion. This implies 22% to 23% annual growth versus 17% to 19% previously. This guidance assumes lending revenue will be at least 100% of 2023 levels.\n* Financial Services will grow more than 80% year-over-year and tech platform will grow low to upper teens percent year-over-year.\n* GAAP EPS of $0.11 to $0.12 per share above prior guidance of $0.09 to $0.10 per share.\n\n[https://finance.yahoo.com/news/q3-2024-sofi-technologies-inc-051725199.html](https://finance.yahoo.com/news/q3-2024-sofi-technologies-inc-051725199.html)",
  "link_flair_text": "Company News",
  "id": "1gfnmju",
  "num_comments": 0,
  "created_utc": 1730297935,
  "permalink": "/r/stocks/comments/1gfnmju/sofis_development_and_progress_made_as_noted_in/",
  "comments": []
}