{
  "title": "Discovered stock purchase certificate of 200 shares of Biofield Corp from 2004 in deceased aunt's desk.",
  "score": 43,
  "selftext": "Aunt recently passed away and we are getting her home and finances squared away.  In her desk we discovered a Certificate or Stock Purchase confirmation (have no idea what to call it) for 200 shares of a company that looks like it either went out of business or was taken over by McKay Life Sciences in 2009.  The stock was purchased through Paine Webber.  Any idea of how to see if this has any value?\n\n  \nThanks in advance",
  "link_flair_text": "Advice Request",
  "id": "1gfulii",
  "num_comments": 4,
  "created_utc": 1730315419,
  "permalink": "/r/stocks/comments/1gfulii/discovered_stock_purchase_certificate_of_200/",
  "comments": [
    {
      "id": "lune3gw",
      "score": 39,
      "body": "\n1. Confirm Company Status: Biofield Corp. went through changes, and, as you mentioned, it may have been taken over or gone out of business. You can start by searching online for the company’s history or mergers. Websites like Yahoo Finance or Bloomberg sometimes archive older financial information.\n\n\n2. Contact Paine Webber (now UBS): Since the shares were purchased through Paine Webber, which merged with UBS, reach out to UBS’s customer service. They may be able to track down historical information about the stock purchase or point you to relevant resources.\n\n\n3. Check with Transfer Agents: If the company was acquired or merged, its records might be managed by a transfer agent. The primary U.S. transfer agents are Computershare, American Stock Transfer & Trust Company (AST), and Equiniti. They can tell you if there’s any record of those shares.\n\n\n4. Check Unclaimed Property Databases: Sometimes, unclaimed stocks or dividends from defunct or merged companies end up with state unclaimed property offices. Use resources like the National Association of Unclaimed Property Administrators (NAUPA) or check your aunt’s state unclaimed property database.\n\n\n5. Consult a Financial Advisor or Estate Attorney: If you're unable to find information on your own, an advisor or attorney experienced with estates and unclaimed assets can help research the history and possible value of these shares.",
      "permalink": "/r/stocks/comments/1gfulii/discovered_stock_purchase_certificate_of_200/lune3gw/",
      "created": 1730349773,
      "depth": 0,
      "replies": [
        {
          "id": "lunny6u",
          "score": 10,
          "body": "Thank you!",
          "permalink": "/r/stocks/comments/1gfulii/discovered_stock_purchase_certificate_of_200/lunny6u/",
          "created": 1730355538,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lumau13",
      "score": -80,
      "body": "tbh this is a question thats never been asked before on this sub, so you may as well throw them in the trash. There is no answer.",
      "permalink": "/r/stocks/comments/1gfulii/discovered_stock_purchase_certificate_of_200/lumau13/",
      "created": 1730335033,
      "depth": 0,
      "replies": []
    }
  ]
}