{
  "title": "Starbucks CEO pledges to fundamentally change strategy as sales fall for third straight quarter",
  "score": 426,
  "selftext": "Starbucks on Wednesday reported quarterly earnings and revenue that missed analysts’ expectations as sales in the U.S. and China, its two biggest markets, disappointed.\n\nThe company previously released a preliminary report of its quarterly results on Oct. 22 and announced it was suspending its fiscal 2025 outlook. \n\nThis report marks the first under CEO Brian Niccol, who joined the company on Sept. 9 to revive the floundering business. \n\n“It is clear we need to fundamentally change our strategy to win back customers,” CEO Brian Niccol said in a statement. “We have a clear plan and are moving quickly to return Starbucks to growth.”\n\nInvestors are expecting that Niccol will share more details about his turnaround strategy during the company’s conference call, scheduled for 5 p.m. ET.\n\nShares of the company fell 1% in extended trading on Wednesday.\n\nHere’s what the company reported compared with what Wall Street was expecting, based on a survey of analysts by LSEG:\n\nEarnings per share: 80 cents vs. $1.03 expected\n\nRevenue: $9.07 billion vs. $9.36 billion expected\n\nStarbucks reported fiscal fourth-quarter net income attributable to the company of $909.3 million, or 80 cents per share, down from $1.22 billion, or $1.06 per share, a year earlier.\n\nNet sales dropped 3% to $9.07 billion. \n\nThe company’s global same-store sales fell 7%, fueled by weak demand in the U.S. and China. Traffic to its stores worldwide fell 8% during the quarter.\n\nThe company’s U.S. restaurants reported same-store sales declines of 6%, fueled by a 10% tumble in traffic.\n\nIn China, the company’s same-store sales plummeted 14% as both traffic and average ticket fell. Starbucks has been facing greater competition from local rivals, like Luckin Coffee, which can undercut the company’s prices.\n\nSource: https://www.cnbc.com/2024/10/30/starbucks-sbux-q4-2024-earnings.html",
  "link_flair_text": null,
  "id": "1gfw9p6",
  "num_comments": 328,
  "created_utc": 1730319673,
  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/",
  "comments": [
    {
      "id": "lul352l",
      "score": 186,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul352l/",
      "created": 1730320976,
      "depth": 0,
      "replies": [
        {
          "id": "lul5kk8",
          "score": 73,
          "body": "I feel like a big drop is coming. They were at $75 a few months ago and rebounded on the new ceo news. Unless someone big changes I gotta believe they are heading back that way",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul5kk8/",
          "created": 1730321690,
          "depth": 1,
          "replies": [
            {
              "id": "lul9mkl",
              "score": 58,
              "body": "The CEO is believed to be some superstar. Investors largely attributed Chipotles massive success to him. Mostly his nickel and diming obsession on prices and portion sizes. Yet to be seen if he can pull it off again. \n\nPeople have so much faith in him that the companies like “yeah, we don’t even care if you come to work. Fly your plane here whenever you feel like it I guess”.",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul9mkl/",
              "created": 1730322901,
              "depth": 2,
              "replies": [
                {
                  "id": "lule0w5",
                  "score": 44,
                  "body": "Is this the CEO that put an end to remote work but he himself works remotely two states away? I forgot what company that was from",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lule0w5/",
                  "created": 1730324236,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lumpxr8",
                      "score": 12,
                      "body": "Mine",
                      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumpxr8/",
                      "created": 1730340151,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "luldfme",
                  "score": 58,
                  "body": "Lol which is ludicrous because it's a liquid not food\n\nDo you know how easy it is to make your own coffee vs an entire Mexican lunch?\n\nYeah. Puts.",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luldfme/",
                  "created": 1730324056,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lulj4ky",
                      "score": 23,
                      "body": "There's also so many more options now with the boom of small and independent coffee chains, which have much better coffee for better prices, and a better overall environment, including better drive thru lines.",
                      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulj4ky/",
                      "created": 1730325820,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lulql7g",
                          "score": 12,
                          "body": "Right most coffee snobs want the small town homely cafe vibe \n\nDef not Starbucks\n\nStarbucks is good for corporate and setting up shop for a day",
                          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulql7g/",
                          "created": 1730328266,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "luow4so",
                              "score": 3,
                              "body": "Starbucks isn't for coffee snobs, it's for \"basic bitches\" and there will always definitely be more of those",
                              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luow4so/",
                              "created": 1730380560,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "luqnj7z",
                                  "score": 3,
                                  "body": "I get Starbucks when I have a gift card from work or friends and I'm in the mood for the equivalent of a hot chocolate.",
                                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luqnj7z/",
                                  "created": 1730400842,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lunzm80",
                              "score": 4,
                              "body": "I believe Starbucks would be better off trying to become a fast food company. Their product sucks if your a coffee snob, but it's probably fine if all you care about is a cup with a Starbucks logo.  Just make fancy cups that the \"target demographic\" can carry around and fill them with cheap bullshit.  Also sell pretzels and donuts.",
                              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lunzm80/",
                              "created": 1730363719,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lupid94",
                          "score": 3,
                          "body": "That plus during Covid many started making their own espresso and other coffee type drinks at home which resulted in an explosion of new semi and super automatic machines and grinders.  \n  \nStarbucks literally has to survive on the experience and that isn't what has been great for some time.",
                          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lupid94/",
                          "created": 1730387972,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lun206t",
                      "score": 3,
                      "body": "Drink costs half the lunch",
                      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lun206t/",
                      "created": 1730344558,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lum90mr",
                      "score": 3,
                      "body": "Yep, for the price of two coffees at Starbucks I can get a pound of coffee beans and make them how I want.",
                      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lum90mr/",
                      "created": 1730334433,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lul9ui7",
                  "score": 3,
                  "body": "Sounds like a recipe for disaster to me but I guess we shall see",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul9ui7/",
                  "created": 1730322968,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lulq6xy",
                      "score": 2,
                      "body": "Beans water heat",
                      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulq6xy/",
                      "created": 1730328136,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "luqt807",
                  "score": 2,
                  "body": "I don’t get why. “Cut portion sizes to save money” is the most surface level approach to things it could only come from a consulting firm",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luqt807/",
                  "created": 1730402634,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lumnjfd",
          "score": 22,
          "body": "They really should have dropped Atleast 15 percent, people are really buying way to much into this new CEO. His plan to reverse course after 3 consecutive quarters of sales declines is to “get faster orders and new decor”. Increasing efficiencies to sell a product people don’t really want anymore isn’t going to work. The Starbucks craze is over",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumnjfd/",
          "created": 1730339335,
          "depth": 1,
          "replies": [
            {
              "id": "luru3wt",
              "score": 6,
              "body": "I was very lonely in critiquing this guy on hiring day.\n\nYes, CMG stock went parabolic while he was there, but people forget it was down massively from all their E. coli deaths.\n\nHe’s supposed to be this operations guru, but last few years as Chipotle operations have been challenged, he has flopped.  Consumer impressions of Chipotle have fallen off the cliff.  Taste, value, cleanliness, value are all in the toilet.\n\nHe did a disastrous response to the widespread observation of rip-off portion sizes and bowls missing ingredients.  He said the food was still bigger than your head, and that customers get a small portion should glance at the server and try to browbeat them into getting a bit more.  That’s how this guy thinks?\n\nI listed some good ideas for how Starbucks could bounce back.\n\nHis ideas seem minimal.  He’s ending promotions and plans to find superficial ways to justify the current high prices.  Like sprucing up the interior and letting people pour their own creamer again.\n\nFor the efficiency problems it sounds like he wants to squeeze the staff to work smarter and faster.  Great plan /s\n\nZero talk of addressing the pervasive low regard for Starbucks actual coffee taste and quality.\n\nHis big idea is bringing back the thing where servers jot a name on the cup.  Today he seemed to suggest they were having trouble sourcing 200,000 sharpie markers to do that.  Really?  Whether it’s a big turnaround idea or not, getting a few markers into each store should not be that hard operationally.   And 200,000 isn’t really that big of a number when we’re talking about pens.  \n\nIt’s an operation with a supply chain funneling tens of millions of cups and lids and stir sticks and dairy products daily, but he can’t get 0.2 million pens out any time soon?\n\nI still say there’s some imposter thing happening here.  But I won’t be surprised in the least if at some point Wall Street buys into it.  Self fulfilling prophecy and all.",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luru3wt/",
              "created": 1730415209,
              "depth": 2,
              "replies": []
            },
            {
              "id": "luscpt1",
              "score": 5,
              "body": "4 minutes makes no difference if the product is shit. The only way Starbucks can survive is to begin making good coffee again.",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luscpt1/",
              "created": 1730422355,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lulj2kp",
          "score": 4,
          "body": "This is an obvious short not next q but q1. So will probably go up 30%",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulj2kp/",
          "created": 1730325802,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lukzrys",
      "score": 628,
      "body": "Increase prices and devalue rewards, common sense it wouldn’t work",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lukzrys/",
      "created": 1730320006,
      "depth": 0,
      "replies": [
        {
          "id": "luld3ux",
          "score": 159,
          "body": "The change in the rewards program was the dumbest thing Starbucks ever did. Prices and seating in the place are certainly not great, but I don’t think it hurt them as much as the change in the rewards program. Horrible decision.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luld3ux/",
          "created": 1730323955,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lulhfzp",
          "score": 119,
          "body": "Im not going to ever go back to SBUX until the coffee they make that costs \\~$5 tastes BETTER than the \\~$.25 - $.50 cents coffee I can make at home. They should be able to achieve that simply with fresher (more turnover), better beans (volume purchase and supply chain dominance), and higher end commercial machinery, etc. but for some reason they have either forgotten or for whatever reason cant leverage any of those advantages to deliver an actual consistently better drink.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulhfzp/",
          "created": 1730325288,
          "depth": 1,
          "replies": [
            {
              "id": "lultpzs",
              "score": 78,
              "body": "I don't think people going to Starbucks are getting a simple drip coffee. Most of them are getting the fancier coffees like a cold brew or frappuccino and things of that sort.",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lultpzs/",
              "created": 1730329307,
              "depth": 2,
              "replies": [
                {
                  "id": "lulxoqu",
                  "score": 59,
                  "body": "Aka caffeinated sugar bombs.",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulxoqu/",
                  "created": 1730330641,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lun43qk",
                      "score": 24,
                      "body": "lmao - sometimes i think this sub is full of boomers,\n\nTheir nitro cold brew is really good and cant be replicated at home., \n\nthe kids do love em fraps, and they’re  addictive yes.\n\n  \nI honestly think their nitro cold brew is great - no sugar in there.\n\nThe yoga mums can’t get enough of their PSL…. \n\nSbux is not SMCI, it’s a consumer staple and is here to stay…",
                      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lun43qk/",
                      "created": 1730345393,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "luoqpx9",
                          "score": 7,
                          "body": "They are here to stay but it is time to change the idea that SBUX is a growth stock. Their key market is saturated.  Adding new stores isn't going to make much of a difference on such a large base, they can tweak the product and rewards program to get a little lift but what are they going to do next year? They can make some accretive acquisitions of lower P/E companies but that has its limitations. \n\nUltimately they are suffering the fate of all companies eventually. They move from \"star\" to \"cow\".",
                          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luoqpx9/",
                          "created": 1730378508,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "luov875",
                          "score": 5,
                          "body": "You can definitely make your own nitro cold brew. It's actually pretty easy, and cheap if you keep it simple.",
                          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luov875/",
                          "created": 1730380228,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lulxnxb",
                  "score": 34,
                  "body": "Well yeah. I’m not going to Starbucks because that’s exactly what I want. A plain black coffee and I can make that at home very easily. Additionally, a cold brew is not fancy. It’s as simple as placing coarse ground coffee in a fine mesh and soaking it chilled over night. But for some reason it costs $6 or more at Starbucks. I can make 30cups at home with a premium bag of beans. What’s worse is I get to watch a dozen mobile orders get made before my cup of bean water gets poured into a cup.",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulxnxb/",
                  "created": 1730330633,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lunn5or",
                      "score": 10,
                      "body": "If all you want from your coffee is drip, Starbucks is a horrendous value and it will almost certainly be worse than stuff you can buy. I would've if more people wised up to this fact.",
                      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lunn5or/",
                      "created": 1730355018,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lum4f04",
                  "score": 12,
                  "body": "Most people can't afford them anymore since they keep going up\n\nThe only time I got them was from accumulating points enough to cash in on them",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lum4f04/",
                  "created": 1730332894,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lumb6xx",
              "score": 19,
              "body": "Regionally, why would I go to Starbucks when we have a chain that serves actually good coffee (Caribou) for a lower price and can essentially do all the dumb milkshakes that Starbucks does?",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumb6xx/",
              "created": 1730335151,
              "depth": 2,
              "replies": []
            },
            {
              "id": "luljv5e",
              "score": 42,
              "body": "This is an excellent point. I find that the black coffee at *Dunkin* is typically better, for Pete's sake!\n\nThey are all in on their espresso sugar flavor amalgamations, and for good reason, since those have big profit margins and got so many people in the door in the first place.  But I get a sense there is a growing counter cultural reaction against those kind of drinks in the US.",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luljv5e/",
              "created": 1730326056,
              "depth": 2,
              "replies": [
                {
                  "id": "lulxrmr",
                  "score": 20,
                  "body": "there's tons of research coming out now that Sugar is the root cause or directly linked to the root cause for most health issues. Including many health issues not just diabetes - many cancers, alzheimers/dementia, etc.",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulxrmr/",
                  "created": 1730330667,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lulyg0v",
                      "score": 11,
                      "body": "It's as addictive as caffeine, and Starbucks knows it.",
                      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulyg0v/",
                      "created": 1730330892,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "luoalp0",
                      "score": 3,
                      "body": "Fat suppresses appetite. Sugar increases appetite, and suppresses the effects of fat.\n\nAmericans are not overweight because of \"glandular problems\". Americans are overweight largely due to consumption of sugar.",
                      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luoalp0/",
                      "created": 1730370962,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lulumx4",
              "score": 10,
              "body": "Okay, but you're not the target customer",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulumx4/",
              "created": 1730329613,
              "depth": 2,
              "replies": []
            },
            {
              "id": "luluh8z",
              "score": 9,
              "body": "What are you making at home that beats Starbucks? I'm lazy and use a Keurig and just store bought sweetener, but that doesn't come close.",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luluh8z/",
              "created": 1730329561,
              "depth": 2,
              "replies": [
                {
                  "id": "lunz7vr",
                  "score": 8,
                  "body": "Any drip coffee made at home with decent beans will be better.  Starbucks uses a dark roast because it's similar and simple and repeats well, but they lack flavor.  A medium or light roast (and NOT arabica beans) will stomp anything you get from Starbucks.",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lunz7vr/",
                  "created": 1730363429,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lulx9vp",
                  "score": 7,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulx9vp/",
                  "created": 1730330500,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "luni859",
                      "score": 3,
                      "body": "Even a french press will do the trick.",
                      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luni859/",
                      "created": 1730351991,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lulya57",
                      "score": 2,
                      "body": "how long does that usually take per morning?",
                      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulya57/",
                      "created": 1730330837,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lumfkge",
                          "score": 3,
                          "body": "Boil water, pour it over the grounds, it drips into a cup or pitcher. That's it. Get a water boiler, so you just click a button. When it's done pour it over the grounds. Takes less than ten minutes, you're only actively involved for maybe 2.",
                          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumfkge/",
                          "created": 1730336627,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lunp377",
                          "score": 2,
                          "body": "I bought an $80 kettle with either Bluetooth/wifi. I click the button on my phone to preheat the kettle to my specified temperature while brushing my teeth. Once I get downstairs, the pourover process takes 3 minutes. Super fast.",
                          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lunp377/",
                          "created": 1730356296,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "luo3ge3",
                          "score": 2,
                          "body": "With a aeropress and a kettle , 3-4 min boil and simultaneously setup the pour and grind (1-2min), seep for 3 -4 min , add creamer or drink straight \n\nSo 8-9 minutes but it’s like 2-3 min of activity while the rest is waiting/make breakfast at the same time\n\nWhile seeping , you do another water boil so you do can another cup right after",
                          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luo3ge3/",
                          "created": 1730366430,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lunsmaf",
              "score": 2,
              "body": "they realized they can charge you extra for every ounce of sugar they can add. their entire business model relied on diluting their coffee",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lunsmaf/",
              "created": 1730358708,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lulvr8u",
              "score": 2,
              "body": "Agree. \n\nI know we also hate nestle here but I bought a refurbished nespresso for like $100 a decade ago and that thing has had to pay for itself 50 times over \n\nMy drink is typically just decent flavor of coffee and a splash of oat milk so I don’t need to pay a barista $7 to make that",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulvr8u/",
              "created": 1730329990,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "luog9vg",
          "score": 7,
          "body": "Seriously they let their arrogance get in their way. Their product isn't good enough to sell on its own without the rewards.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luog9vg/",
          "created": 1730373990,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lulpzm9",
          "score": 14,
          "body": "All my wife’s friends are making their own pumpkin spice lattes \n\nPUTS on Starbucks",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulpzm9/",
          "created": 1730328066,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lulxb9v",
          "score": 7,
          "body": "Burnt coffee doesn’t work for me.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulxb9v/",
          "created": 1730330513,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lunb0wx",
          "score": 3,
          "body": "Also make the food items half the size and increase the price. That’s some deep fucking value",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lunb0wx/",
          "created": 1730348288,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lul63pk",
      "score": 168,
      "body": "Starbucks basically doesnt let you sit in the shop at all. mine got rid of all the chairs and tables. literally every single one theres a 2 person bench and thats it.\n\nlike wtf? its a coffee shop. is this the MBA wet dream of firing every worker and having robots run a drivethrough? \n\nmaybe people also like sitting down and drinking their coffee while reading or catching up on emails. maybe people also spend more money that way. \n\ncurious to see what this strategy is. the move to kick everyone out of the store and push online orders and pickups didnt work.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul63pk/",
      "created": 1730321846,
      "depth": 0,
      "replies": [
        {
          "id": "lulhckh",
          "score": 110,
          "body": "I guarantee some MBA looked at the cost of a customer sitting in, and the cost of take away and basically recommended chairs be removed to save money. They probably never factored the cost of loosing the 'vibe' of a coffee shop.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulhckh/",
          "created": 1730325258,
          "depth": 1,
          "replies": [
            {
              "id": "luo38oz",
              "score": 14,
              "body": "I feel like times have changed. Starbucks had its heyday when there weren't heaps of other better options around. At the time, they offered an elevated café experience at scale compared to everything else.\n\nIt's different now though, people have much higher expectations of a high end coffee shop. I feel like the public perception of their business and the field has changed so much that it's basically impossible to return to that position in the market again. It would be akin to Pizza Hut getting the homely/family vibe that they had in the 90s back, it's just not happening. \n\nThis is probably exacerbated by the fact that they're making little money from the people that study and work there, slowly sipping on their coffee for an hour. Their moneymaker is clearly the specialty drinks, and by large that's something people take to go. So it feels as if they have two core offerings at odds with each other, and they've run the numbers and doubling down on the profitable one.",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luo38oz/",
              "created": 1730366283,
              "depth": 2,
              "replies": [
                {
                  "id": "luoxlhq",
                  "score": 2,
                  "body": "Third wave coffee has been steadily cutting into second wave profits. Third wave is simply higher quality, often a great atmosphere at the shop. Second wave is turning into the foldgers of today. ",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luoxlhq/",
                  "created": 1730381091,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lunjphc",
              "score": 2,
              "body": "Like going to a bar owned by someone who doesn't drink at bars.",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lunjphc/",
              "created": 1730352874,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lulhaq7",
          "score": 29,
          "body": "When I arrive too early for dr appointments I sit in the lobby of the Dunkin near the office and order a drink. But I hate their coffee so usually something fruity. When I was a teen and needed a place to sit for a bit I'd go buy a coffee at Starbucks. There's not a single place in my town these days to bring a laptop or a book to sit and drink coffee. The only small business coffee shop closed down within a year because for whatever reason they wouldn't open the shop until *after* everyone was already at work and school. Between chasing customers out to small businesses that *do* offer seating and pissing off a bunch of customers with their anti union shenanigans I wonder if they'll even be able to win customers back. But if they have a CEO that will just nickle and dime customers to increase profits then it won't happen. ",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulhaq7/",
          "created": 1730325242,
          "depth": 1,
          "replies": [
            {
              "id": "lumbcty",
              "score": 7,
              "body": "there are several coffee shops by me that have a line out the door and they all have tables and chairs and people work there, study, etc. i go to a coffee shop to get out of the house because i wfh so it just makes sense to me to be able to sit down there and chill",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumbcty/",
              "created": 1730335205,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lulu23a",
          "score": 21,
          "body": "I'm probably in the minority but in my Starbucks they always play music loud and I hate it. I'd like the coffee shop vibe if there was no music... Or just very light, soft music.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulu23a/",
          "created": 1730329420,
          "depth": 1,
          "replies": [
            {
              "id": "lumaoep",
              "score": 8,
              "body": "their music is insufferable i can't argue with that",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumaoep/",
              "created": 1730334982,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lumpo8n",
          "score": 18,
          "body": "I thought maybe it was a local thing to curb homeless people and others just loitering around inside. I went to one in our downtown area that used to be packed full of people and had seating only to find out that all of that was removed. It was literally a drive thru line. Like they didn’t really even seem to want to help us people that just want to walk in. Felt so bizarre. Really driving away customers with that move. People love coffee shops to work or study at. Idk wtf they were thinking. They’ve literally told customers to fuck off and are confused why their business is failing lol.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumpo8n/",
          "created": 1730340058,
          "depth": 1,
          "replies": [
            {
              "id": "lumuqqw",
              "score": 6,
              "body": "thats where im at. thought it was to get rid of homeless but i guess its just to get rid of their customers. its such a hostile approach to serving coffee. \"buy our coffee and then immediately fuck off\"",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumuqqw/",
              "created": 1730341848,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lumdxpq",
          "score": 18,
          "body": "You know, those standing room only cafes used to be super cheap and the whole reason anyone ever paid $5 for a Starbucks latte was so you could hang out and do work, read a book, chat with a friend.\n\n\nBye bye Starbucks you will not be missed",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumdxpq/",
          "created": 1730336069,
          "depth": 1,
          "replies": [
            {
              "id": "lumekdb",
              "score": 3,
              "body": "no i can't see who wants or needs starbucks anymore. maybe that's shortsighted of me, but that's just my opinion as someone who used to go there to drink coffee, eat food, and get work done",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumekdb/",
              "created": 1730336284,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lun9eq8",
          "score": 4,
          "body": "The genius at SBUX and outside consultants worked almost 2 years during the term of last CEO, and they concluded all reasons for stagnant sales, but admitting it's the high price issue. So yeah, it's another shit show of corporate culture under which people are not allowed to tell the ugly truth.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lun9eq8/",
          "created": 1730347563,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luozjti",
          "score": 6,
          "body": "This is what Howard Schulz hated and why be ousted the old CEO. I listened to him talk for 3 hrs on the Acquired podcast and he is obsessed with European cafe culture and originally tried to bring a slice of that to the US with Starbucks. He said he hates what mobile ordering has done and hates how the stores look now because people don't hang out in them. He says cafes are for hanging out and socializing.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luozjti/",
          "created": 1730381786,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lunjkjg",
          "score": 4,
          "body": "I wonder if this is regional, because every Starbucks in my area is the exact opposite and has a variety of ample seating. The newest one that opened post-covid has this natural wood rainforest vibe.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lunjkjg/",
          "created": 1730352791,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lulnxeu",
          "score": 3,
          "body": "The Pizza Hut strategy was incredibly short sighted",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulnxeu/",
          "created": 1730327378,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lum9zat",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lum9zat/",
          "created": 1730334753,
          "depth": 1,
          "replies": [
            {
              "id": "lume8ht",
              "score": 3,
              "body": "This guy was lucky in some way to make chipotle a hit. Let’s see how he can sell 6$ coffee",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lume8ht/",
              "created": 1730336171,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lumr1ko",
          "score": 2,
          "body": "Wait until they get a load of this AI stuff…",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumr1ko/",
          "created": 1730340540,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lul82zk",
      "score": 69,
      "body": "Had a coffee at a Starbucks for the first time in ages in Singapore a couple of months ago.\n\n$8 for a regular size, and utterly terrible. Quite literally the worst coffee I’ve ever had.\n\nIt’s not a strategy issue; it’s an everything issue.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul82zk/",
      "created": 1730322438,
      "depth": 0,
      "replies": [
        {
          "id": "lulam5a",
          "score": 14,
          "body": "Their coffee really does taste horrible.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulam5a/",
          "created": 1730323200,
          "depth": 1,
          "replies": [
            {
              "id": "lulmu3e",
              "score": 4,
              "body": "I'm from Melbourne, so perhaps I'm spoiled – but even so... I could not believe how weak and terrible it was.\n\nNever again.",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulmu3e/",
              "created": 1730327015,
              "depth": 2,
              "replies": [
                {
                  "id": "lunb2hl",
                  "score": 3,
                  "body": "Yes if you are from Melbourne you are indeed spoiled with good coffee LOL but jokes aside there’s good coffee in Singapore, but really only at independent cafes.",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lunb2hl/",
                  "created": 1730348308,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lusdlix",
                  "score": 2,
                  "body": "Melbourne has great coffee",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lusdlix/",
                  "created": 1730422701,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lulit2c",
      "score": 64,
      "body": "I used to go to Starbucks almost every day.  The stores no longer keep milk out for the coffee, straws, stirrers, or any sweeteners.  Trying to get the attention of a barista that hates her life and is backed up 20 orders just became too unpleasant and I go to local coffee shops now.  Plus the snacks they sell have not changed in a decade.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulit2c/",
      "created": 1730325717,
      "depth": 0,
      "replies": [
        {
          "id": "lunbpmd",
          "score": 8,
          "body": "I used to like their little snack boxes but those are like $10 where I am which is insane",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lunbpmd/",
          "created": 1730348609,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lungxxx",
          "score": 7,
          "body": "Wait thats a chain wide thing? I went a few weeks ago and no straws or sugar were out either but i was in a rush so i just left... why would they go that route. The coffee rasted fucking awful too so i coulda used so milk or sugar. Starbucks is outta their minds.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lungxxx/",
          "created": 1730351264,
          "depth": 1,
          "replies": [
            {
              "id": "lus5l14",
              "score": 2,
              "body": "They took out all the creamer, sugar, straws, ect when Covid hit and they never put them back out.",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lus5l14/",
              "created": 1730419616,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lul0hw1",
      "score": 98,
      "body": "Always surprised a competitor never came along offering cheaper coffee, smaller premises, smaller menu, etc....\n\nLot of people out there just want a cheap coffee before work or whatever",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul0hw1/",
      "created": 1730320213,
      "depth": 0,
      "replies": [
        {
          "id": "lul340p",
          "score": 66,
          "body": "I feel like most competition is much, much smaller. Either actual local cafes or smaller chains. Starbucks and dunkin largely seem to own the mass coffee distribution system",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul340p/",
          "created": 1730320968,
          "depth": 1,
          "replies": [
            {
              "id": "lul5iel",
              "score": 40,
              "body": "Not that many people be liking mass coffee chains anymore. Times have changed",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul5iel/",
              "created": 1730321673,
              "depth": 2,
              "replies": [
                {
                  "id": "lul5ulr",
                  "score": 23,
                  "body": "I think it’s great too. I love local coffee shops that actually often have really good coffee",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul5ulr/",
                  "created": 1730321771,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lul7990",
                      "score": 15,
                      "body": "Starbucks is largely selling sugar, not just coffee. Either way you’d think a corporation that sells drugs would always be doing well.",
                      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul7990/",
                      "created": 1730322190,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lulb1hm",
                          "score": 11,
                          "body": "That's an understatement.  The amount of pure sugar pumps they add to drinks is criminal.  If people actually looked at the sugar content im sure they'd pass on ordering anything from SB.",
                          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulb1hm/",
                          "created": 1730323329,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lul6s04",
                      "score": 3,
                      "body": "Yes! I think its better for society imo. Less sugar too 😂 the new generations dont like large chains anymore.",
                      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul6s04/",
                      "created": 1730322047,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lul9454",
              "score": 17,
              "body": "Local cafes are priced either the same or more.",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul9454/",
              "created": 1730322747,
              "depth": 2,
              "replies": [
                {
                  "id": "lul9a0s",
                  "score": 4,
                  "body": "Agreed, Starbucks has economies of scale so while pricey they are often cheaper than an independent cafe",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul9a0s/",
                  "created": 1730322795,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lul9zky",
                      "score": 6,
                      "body": "That's where the problem lies for Sbux. I either pay the same for a better cup at my local shop or I just brew at home since they're both expensive.",
                      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul9zky/",
                      "created": 1730323012,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lulbc21",
                      "score": 3,
                      "body": "Thats not true in europe bro",
                      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulbc21/",
                      "created": 1730323416,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lulbuin",
                          "score": 3,
                          "body": "I can’t speak to pricing in Europe, as an American the thought of going to Starbucks while in Europe instead of a proper cafe blows my mind",
                          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulbuin/",
                          "created": 1730323573,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lulbar0",
              "score": 10,
              "body": "I can clearly tell you this is a much BIGGER issue than just starbucks\n\nLocal coffee shops are even more expensive ( or just as expensive as Starbucks) in fact if you visit a local shop in LA, you are paying $2-$4 more than the big chains\n\nThe big chains have actually lowered costs but the customer has basically gone away from the beverage\n\nFor starbucks to make more money- it will have to diversify - no other option. \n\nI make better coffee at home with a proper machine, people are bringing these activities inwards. Including restaurants.",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulbar0/",
              "created": 1730323406,
              "depth": 2,
              "replies": [
                {
                  "id": "lulwf3t",
                  "score": 8,
                  "body": "diversity into what?",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulwf3t/",
                  "created": 1730330213,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lul5dzo",
          "score": 18,
          "body": "Dunkin hit that mark for a while but it’s so inconsistent the last few years it’s barely a competitor anymore. I find the gas station is that spot now. If you’re going to have mediocre coffee you may as well only pay $1 for it.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul5dzo/",
          "created": 1730321636,
          "depth": 1,
          "replies": [
            {
              "id": "lulmk1p",
              "score": 9,
              "body": "McDonald’s has good coffee",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulmk1p/",
              "created": 1730326926,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lulep13",
          "score": 9,
          "body": "Dutch bros",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulep13/",
          "created": 1730324440,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lula46g",
          "score": 6,
          "body": "So… McDonald’s..?",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lula46g/",
          "created": 1730323050,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lulfkjj",
          "score": 4,
          "body": "Dunkin does ? It’s half the price and taste better",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulfkjj/",
          "created": 1730324709,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lumd1do",
          "score": 3,
          "body": "I mean there are tons of cheaper coffee chains all over the US where people get cheap coffee before work lol",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumd1do/",
          "created": 1730335762,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lullj16",
          "score": 4,
          "body": "McDonald's sells $1.50 large iced coffees and small coffees for $1.19.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lullj16/",
          "created": 1730326592,
          "depth": 1,
          "replies": [
            {
              "id": "lulmo8q",
              "score": 5,
              "body": "McDonald’s is the best.\n\nI know it’s been struggling too but I’d go to McDonald’s everyday over Starbucks",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulmo8q/",
              "created": 1730326964,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lum84h8",
          "score": 2,
          "body": "I feel like Dunkin is doing well. At least around me",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lum84h8/",
          "created": 1730334136,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lul74o5",
          "score": 3,
          "body": "It’s like saying you’re surprised nobody came and took out McDonald’s, some things are iconic. ",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul74o5/",
          "created": 1730322152,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lul4iwz",
      "score": 45,
      "body": "The Lattes cost $7 here in Canada for the large sizes. Go figure.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul4iwz/",
      "created": 1730321385,
      "depth": 0,
      "replies": [
        {
          "id": "lul70w5",
          "score": 16,
          "body": "Anecdotally, you see WAY fewer people in my city walking around with a Starbucks drink than even 3 or 4 years ago.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul70w5/",
          "created": 1730322120,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lul96vn",
          "score": 13,
          "body": "I see more Tim's cups than ever.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul96vn/",
          "created": 1730322770,
          "depth": 1,
          "replies": [
            {
              "id": "lulbez0",
              "score": 6,
              "body": "I honestly see more McDonald's coffee than Tims. Southern Ontario.",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulbez0/",
              "created": 1730323441,
              "depth": 2,
              "replies": [
                {
                  "id": "lulg5oj",
                  "score": 3,
                  "body": "YMMV by area, I observe more Tim's cups in Saskatchewan than any other coffee.",
                  "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulg5oj/",
                  "created": 1730324891,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lulxv33",
              "score": 6,
              "body": "Yea, cause they're investing in their brand. Their habanero chicken wrap is crazy value - no way they're making money on that",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulxv33/",
              "created": 1730330699,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lul1if7",
      "score": 31,
      "body": "We used to buy coffee at a bar because it was better made than our home coffee, there was a better ambiance in the bar too.  And we were more than happy to pay double or even 4 times the price of home made coffee because all that good stuff.\n\nToday we pay 20 times the price of a home made coffee.  We wait patiently in line. The coffee can be tepid at times, or too hot at other times, but there will be a cardboard taste in it.  We have hardly place to sit, and place our coffee on sticky tables.  And we are happy to be back on the road again.\n\nStarbucks... if there is no other offer around, only if it must.  \n\nOr if you are young, you have money and don't know any better.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul1if7/",
      "created": 1730320506,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lul8kjq",
      "score": 31,
      "body": "I think part of this is fueled by anticorporate sentiment in a market where the barrier to entry is tiny. 3 Starbucks in within a mile of my house have closed but the 5+ other small local shops are packed.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul8kjq/",
      "created": 1730322584,
      "depth": 0,
      "replies": [
        {
          "id": "lulz43z",
          "score": 15,
          "body": "I really don’t think it’s anti-corporate sentiment. Starbucks frankly just sucks compared to small local shops.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulz43z/",
          "created": 1730331115,
          "depth": 1,
          "replies": [
            {
              "id": "lun774v",
              "score": 10,
              "body": "Both things can be true",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lun774v/",
              "created": 1730346654,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lullxo2",
      "score": 26,
      "body": "His strategy of squeezing as much money out of the customer is not gonna fly in this economy. I dont expect the share price to recover.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lullxo2/",
      "created": 1730326722,
      "depth": 0,
      "replies": [
        {
          "id": "lumt9fe",
          "score": 6,
          "body": "Getting a nespresso machine has cut down on my takeaway coffees significantly and I’m sure I’m not the only one. ",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumt9fe/",
          "created": 1730341321,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lulpnty",
      "score": 20,
      "body": "Adding a tip screen was a stealth 20% price increase. I hate getting shamed into tipping. I know some will say that I'm cheap but tipping culture is out of hand.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulpnty/",
      "created": 1730327958,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lumcqdy",
      "score": 20,
      "body": "\n1. **Trim the menu size.** We’re all tired of waiting 15 minutes because Becky ordered 8 mocha frappa crappacino smoothies online and wont be here for half an hour but we all have to wait for her drinks to be made first. We’ve all waited inside and watched the entire line of 10 cars in the drive thru come and go before we get our order. I can only imagine how frustrating it is for the employees to memorize everything and ultimately leads to lower consistency. \n\n2. **Improve product quality**. The espresso shots being pulled as the base for most drinks are worse than what any aspiring coffee fanatic is going to make at home after two weeks of being in the hobby. \n\n3. **Bring back the “come chill with us” vibe in stores.** They used to want you hanging out at the store working on your laptop all day. Now the furniture is hostile instead of cozy and leaves you floating in the middle of a busy store. Nobody wants to work or relax in the middle of chaos. \n\n4. **Treat your employees better.** Stop illegally busting unions and return to the days where people bragged about how good it was working at Starbucks. Commit to employee benefits like generous 401k match, stock compensation bonuses, above-minimum-wage pay with annual increases, college tuition assistance, and excellent PTO. Your customers are not happy when your employees are not happy. \n\n5. **Treat your customers better.** You make absolute *bank* off Starbucks card balances. Quite literally bigger than most banks at this point. Yet you continue to decrease loyalty rewards to the point of making them worthless. No, I’m not going to buy 4 of a specific drink in 3 days for the points to expire next month before I even get to use them wtf. \n\nYou’re being really rude lately Starbucks. Stop that.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumcqdy/",
      "created": 1730335657,
      "depth": 0,
      "replies": [
        {
          "id": "lupc31e",
          "score": 4,
          "body": "Ahh. Good ole' Enshittification.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lupc31e/",
          "created": 1730385968,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lupe409",
          "score": 2,
          "body": "Good points.\n\nI would say also improve and simplify the food menu. The starbucks pastries suck. They are so 2004, defrosted crap.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lupe409/",
          "created": 1730386615,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lupusn5",
          "score": 2,
          "body": "1 is key. I can't stand walking in, seeing no line, thinking I'll be in and out only to realize that someone's mobile order is in front of me. That same mobile order is multiple drinks with 15 steps to make them. Now I'm waiting 10 minutes for a Iced Black Coffee. It's infuriating and is the main reason I dont go anymore ",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lupusn5/",
          "created": 1730391885,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lulbus4",
      "score": 15,
      "body": "With the general consensus of Reddit being bearish, Starbucks should be making all time highs within the next year or two. Shoutout to everyone who bought Starbucks at ~$70.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulbus4/",
      "created": 1730323576,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lul6gxz",
      "score": 12,
      "body": "I hate their app. The few times I want to get coffee for my wife, I must pay $10 to preload to buy a $6 coffee. If I don’t preorder I need to waste 30 minutes. No drive thrus by me either.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul6gxz/",
      "created": 1730321955,
      "depth": 0,
      "replies": [
        {
          "id": "lulvexp",
          "score": 7,
          "body": "I think you only need to preload if you want more rewards, but yeah it is annoying.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulvexp/",
          "created": 1730329873,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lul1slh",
      "score": 24,
      "body": "In Canada, McDonald’s (believe it or not) invested lots in something called McCafe. They sell the most popular “fancy” drinks. And their drip coffee- is pretty darn good and 1/3 the price of Starbucks. The coffee in their insulated cups also stays hot for hours. They are a serious competitor in the Canadian coffee market where we basically have Tim Hortons on (seemingly) every corner. (In fact, I hear that when Tim Hortons went with a cheaper brew. McDonald’s Canada switched to the old Tim Hortons supplier). Just curious - is McDonalds USA coffee still as bad as I remember it?",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul1slh/",
      "created": 1730320587,
      "depth": 0,
      "replies": [
        {
          "id": "lul6i3x",
          "score": 8,
          "body": "McDonalds coffee is not great tbh but i prefer it over starbucks and its a lot cheaper. my main issue with starbucks is that if you get a hot drink youre waiting 45 minutes before you can drink it.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul6i3x/",
          "created": 1730321965,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lul3w6e",
          "score": 14,
          "body": "McD coffee is actually the only main chain coffee i prefer when i travel by road.  Its consistently good , both hot and iced, and cheap compared to Starbucks equivalents.  I have tried many alternatives over my 200+ mile weekly drives and usually come back to McD.  Obviously i could find a nice downtown coffee shop off an exit somewhere but for something within 1000 ft of an offramp, McDs beats starbucks every time.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul3w6e/",
          "created": 1730321198,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lulhmhs",
          "score": 3,
          "body": "Same in New Zealand. Starbucks is pretty much dead here. Only a few remaining in city centres for tourists that don't know any better.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulhmhs/",
          "created": 1730325344,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lulurog",
          "score": 3,
          "body": "> The coffee in their insulated cups also stays hot for hours.\n\nMan, McDonald's by far has the best cup out of all the other coffee places. Better than Starbucks, and Tim Hortons, etc. And their coffee is great too. \n\nTim Hortons is just garbage.\n\nHowever, for the iced coffee I still prefer Starbucks. Somehow tastes better.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulurog/",
          "created": 1730329657,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lulluyy",
          "score": 2,
          "body": "The McDonalds near me in the Richmond, VA area sells large iced coffees for $1.50.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulluyy/",
          "created": 1730326698,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lul64vm",
          "score": 2,
          "body": "I remember the big McCafe push 10 years ago or so. It never caught on like they wanted it to but I think the model was all wrong in the US. I remember the construction from them adding in the area in the store. At first they wanted you to order separately at that counter but it changed quickly and not long after it seemed like they gave up. There were a bunch of independent locations too in rest stops, but they all seemed to close.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul64vm/",
          "created": 1730321856,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lumlynb",
      "score": 5,
      "body": "How bout support Palestine? Maybe that might work",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumlynb/",
      "created": 1730338809,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lul4qdz",
      "score": 5,
      "body": "Starbucks has so many problems it's not even funny lol. Some within their control and some outside of their control. They have quite the hole to dig out of and I'm not sure Mr. Cut-Corners is going to make much of an impact.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul4qdz/",
      "created": 1730321445,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lummfhi",
      "score": 5,
      "body": "A cup of coffee is not a chipotle burrito. There really isn’t anything out there as efficient as chipotle. I think investors are buying into a name and that name is Brian niccol. He didn’t do anything extraordinary for chipotle, it was already extraordinary product. “Faster orders and new decor” aren’t going to save a dying brand, people either want it or they don’t and 3 consecutive quarters of sales declines lead me to believe people just don’t want it anymore",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lummfhi/",
      "created": 1730338969,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lulbr0m",
      "score": 8,
      "body": "Have they considered not burning the coffee?\n\n\nI know, crazy idea ",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulbr0m/",
      "created": 1730323544,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lulenpa",
      "score": 11,
      "body": "They still made $909 MILLION fucking dollars after all their expenses! Fucking greed! Starbucks (and the general investors and analysts at large) can suck a dick.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulenpa/",
      "created": 1730324429,
      "depth": 0,
      "replies": [
        {
          "id": "lulvnme",
          "score": 2,
          "body": "Just don't buy their product? There's plenty of other coffee shops out there, and you can also make coffee at home",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulvnme/",
          "created": 1730329956,
          "depth": 1,
          "replies": [
            {
              "id": "lumsw4n",
              "score": 4,
              "body": "I haven’t bought from Starbucks in years. I still think they suck for being greedy.",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumsw4n/",
              "created": 1730341189,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lul3rhj",
      "score": 13,
      "body": "Tried Starbucks coffee for the first time this year. Think they washed the dishes in it first. Blagh",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul3rhj/",
      "created": 1730321159,
      "depth": 0,
      "replies": [
        {
          "id": "lull1hq",
          "score": 6,
          "body": "I only drink black coffee and I really enjoy grinding my owns beans and making a good cup of coffee. \n\nI honestly think something like pre ground Folgers is better than Starbucks black coffee. It’s terrible coffee.",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lull1hq/",
          "created": 1730326436,
          "depth": 1,
          "replies": [
            {
              "id": "lulljg6",
              "score": 5,
              "body": "It’s the worst I’ve ever tasted in my life. I’m definitely a bit of a coffee snob but that stuff was only vaguely a coffee like substance",
              "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulljg6/",
              "created": 1730326596,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lulbbli",
      "score": 3,
      "body": "Make better coffee and stop selling flavored cream and dairy products.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulbbli/",
      "created": 1730323413,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luleya4",
      "score": 3,
      "body": "I enjoy Starbucks coffee and I walk by one nearly every single day, but I’m not paying $7 for a coffee when I can make a better one at home.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luleya4/",
      "created": 1730324518,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lulfiks",
      "score": 3,
      "body": "Does he really fly a private jet to work everyday?",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulfiks/",
      "created": 1730324692,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lulg0nu",
      "score": 3,
      "body": "Anybody else watch this past weeks All In Podcast episode? They spent some time talking about this. Seems as if they are in trouble, especially if they start to \"go back\" to what Starbucks was originally founded on - coffee. Today, most people walk out with these overly sweetened drinks that I wouldn't even call coffee. Is Starbucks going to revert back to it's roots awhile slashing rewards? I genuinely don't know",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulg0nu/",
      "created": 1730324849,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lum9kzx",
      "score": 3,
      "body": "very simple in my opinion. i stopped going to starbucks when my regular coffee went in a queue behind latte this macchiato that. at dunkin, i walk up, order, pay, and leave with my coffee within 60s. i’d mix in starbucks from time to time if they prioritized pouring coffee at the register",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lum9kzx/",
      "created": 1730334620,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lundaak",
      "score": 3,
      "body": "This CEO refuses to relocate and flies his fucking private jet to work instead. When this company tries to pretend they care about the environment lol",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lundaak/",
      "created": 1730349365,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luos4re",
      "score": 3,
      "body": "I have zero faith, and suspect its stupid hot air to justify a ridiculous salary and ensure a golden parachute which seems to be all these guys ever do.\n\n\nStarbucks is down because they're out of reach of everyone and it stopped being funny to try to flaunt you didn't care.\n\n\nI can make better coffee with a $3 tea filter spoon, hand ground dark roast, and some hot water and whole milk.\n\n\nIt costs like $0.85/cup.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luos4re/",
      "created": 1730379061,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lule13s",
      "score": 4,
      "body": "Starbucks sells the definition of an elastic good.  No one needs premium coffee.   They clearly didn’t understand their product.  Raising prices reduced revenue and profit.  \n\nThe path is clear but I doubt they’ll have the guts to do it",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lule13s/",
      "created": 1730324238,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lul9r4a",
      "score": 2,
      "body": "Maybe walk into any Starbucks and look at their menus compared to a decade ago",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul9r4a/",
      "created": 1730322939,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lulef2t",
      "score": 2,
      "body": "Maybe stop burning your coffee beans?",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulef2t/",
      "created": 1730324356,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lulhntz",
      "score": 2,
      "body": "Not sure if the ceo is useful at all. A 3 year old kid know buying a coffee with more half of the cup full with ice does not cost $5+. Yeah this issue is still lingering.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulhntz/",
      "created": 1730325356,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luloviq",
      "score": 2,
      "body": "Their store experience has gone to hell and isn’t improving any time soon. I am so tempted to short it.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luloviq/",
      "created": 1730327693,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lulqspn",
      "score": 2,
      "body": "Maybe no 5 dollar coffee?",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulqspn/",
      "created": 1730328334,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lulumex",
      "score": 2,
      "body": "they're gonna skimp the coffee, it's the old Chipotle CEO after all lol",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulumex/",
      "created": 1730329609,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luluqzc",
      "score": 2,
      "body": "He literally decided to cut back on promotions/discounts, and is shocked when consumers stop visiting.\n\nThe promotions on the app now are trash \"order the same thing 3 days in a row and get a few stars\". Like really? I get you want people to form habits/routines, but that's not going to get people like me to come back.\n\nThey should look to Panera's rewards program and promotions if they want to see how to get people in their stores.\n\nI think WFH is a big culprit, though. When you're in the office, you might pick up starbucks on the way to work. But if you're working from home? Way easier to just make coffee at home.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luluqzc/",
      "created": 1730329651,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lulyhur",
      "score": 2,
      "body": "Make drinks cheaper without reducing quality. Or increase quality And offerings without a price increase. Easy",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulyhur/",
      "created": 1730330909,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lum7gif",
      "score": 2,
      "body": "Does this include the private jet use daily from California to Washington?",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lum7gif/",
      "created": 1730333920,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lumdfjc",
      "score": 2,
      "body": "Their drinks are simply too damn expensive. Easily $7-10 or more. Other competitors are coming in with just as good drinks at $3.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumdfjc/",
      "created": 1730335895,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lumekl3",
      "score": 2,
      "body": "Nice to collect his newly minted 100m pay, nvr step into office and make such hand waving comments on earnings call.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumekl3/",
      "created": 1730336286,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lumh9rc",
      "score": 2,
      "body": "The coffee is also garbage so might wanna do a quality check on those beans bruh",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumh9rc/",
      "created": 1730337210,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lumoo1z",
      "score": 2,
      "body": "Maybe they should make coffee that doesn’t taste like an ash tray smells",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumoo1z/",
      "created": 1730339709,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lump6u4",
      "score": 2,
      "body": "Easy, increase prices. Now pay me 20 million dollars please.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lump6u4/",
      "created": 1730339890,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lumpe30",
      "score": 2,
      "body": "Starbucks cofffee more expensive under this CEO",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumpe30/",
      "created": 1730339959,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lumt11u",
      "score": 2,
      "body": "shit I been going to Casey's gas station getting that bean to cup coffee is it blows Starbucks and dunkin outta the water. AND it's only 2 bucks for a 24oz.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumt11u/",
      "created": 1730341239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lumt9ep",
      "score": 2,
      "body": "I wonder if they tried making better coffee",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumt9ep/",
      "created": 1730341320,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lumtu3r",
      "score": 2,
      "body": "Prices are too high.  Its that simple.  Going to Starbucks leaves you feeling ripped off.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumtu3r/",
      "created": 1730341525,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lumvnln",
      "score": 2,
      "body": "It seems like this CEO just hops around every couple years, nickle and dimes the employees, customers, and suppliers, gets lauded for the temporary ghost profits, and then bounces before the habits of the customers catch up to the shittier experience.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumvnln/",
      "created": 1730342180,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lumzb4b",
      "score": 2,
      "body": "$9 coffee ain't it anymore",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumzb4b/",
      "created": 1730343522,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lumzq7v",
      "score": 2,
      "body": "Take another look at this guy's salary?      Fuck these multi-million dollar CEO'S.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lumzq7v/",
      "created": 1730343682,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lun8sgk",
      "score": 2,
      "body": "I was really legitimately pissed when they devalued the star rewards system thing. I mean they made coffees twice as expensive if you're using stars ... and that sucks.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lun8sgk/",
      "created": 1730347296,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lunccaa",
      "score": 2,
      "body": "Try lowering prices",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lunccaa/",
      "created": 1730348908,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lundjjj",
      "score": 2,
      "body": "It’s gotta be more food - really feels like the only route they can go down; they’ve got health conscious options, good calories / macros, but they still microwave all their shit. A small increase in optionality and lunch probably would go a long way; thinking similar to Pret in UK",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lundjjj/",
      "created": 1730349493,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lungn75",
      "score": 2,
      "body": "Dude, just GO to a Starbucks and order a coffee and watch the process flow of making that coffee. Just watch.  Don’t sit there and do your wordle, try to follow the process of making a single coffee drink. \n\nHow many times does the barista cross the entire kitchen for a single coffee drink??  \n\nHow much of the time is there no cashier at the register taking orders, despite the queue?\n\nChanging culture is hard, I get that, but, damn. I don’t even care that the coffee isn’t very good - I just don’t have time for that shit. I should be able to get a fucking espresso faster than I can get a pizza, but I can’t.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lungn75/",
      "created": 1730351101,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lunhfex",
      "score": 2,
      "body": "Heres a plan: lower prices, pay higher wages, allow employees to unionize, stop burning all the coffee.\n\nFollow these easy steps for us to stop actovely despising you.  Getting us to shop with you will be a whole other story.  But its a start",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lunhfex/",
      "created": 1730351533,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lunkquk",
      "score": 2,
      "body": "Save costs by cutting his private jet work from home bs",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lunkquk/",
      "created": 1730353502,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luo0so1",
      "score": 2,
      "body": "I enjoy driving so sometimes after work I’ll just go for a drive, not to any destination, I’ll just hit my favourite roads and make a little circuit. I used to quite enjoy stopping off at the Starbucks drive through on the way home and getting an iced coffee or a frappe or something. When I started realising just how much it was costing, nearly £5 for a fucking drink, I stopped going and haven’t been back since. It’s overpriced as fuck, that’s their main issue that prevents me from buying from them.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luo0so1/",
      "created": 1730364576,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luo1l5c",
      "score": 2,
      "body": "Start by lowering your prices. It isn’t rocket science.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luo1l5c/",
      "created": 1730365136,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luo2khu",
      "score": 2,
      "body": "Starbucks should rebrand to a glorified milkshake business because that's all it is.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luo2khu/",
      "created": 1730365820,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luo3x6b",
      "score": 2,
      "body": "Just sell good coffee at reasonable prices. Starbucks coffee tastes like ass. 7-11, Cumberland Farms, Wawa all have coffee that is so much more palatable - at least they are better for the non-coffee snob. \n\nOh, and quit with the social BS.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luo3x6b/",
      "created": 1730366743,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luo8twv",
      "score": 2,
      "body": "I stopped going to starbucks because the service is shot.\n\nIts not the people that make the service shit,  it's the company and the choices. \n\nIts so obvious that all you think about is profits.  Your loyalty programs are terribly designed traps that work on suckers.... which gets you a big FU.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luo8twv/",
      "created": 1730369921,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luoc0a3",
      "score": 2,
      "body": "Son refers to SBUX as a \"milk shake shop\"........",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luoc0a3/",
      "created": 1730371753,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luoppi5",
      "score": 2,
      "body": "Maybe make good coffee?",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luoppi5/",
      "created": 1730378103,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luorulz",
      "score": 2,
      "body": "A company that sells luxury drinks can't understand why no one is paying half their hourly wage for one at a time when the average family is struggling to afford the basics... surprised Pikachu face.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luorulz/",
      "created": 1730378954,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luos31p",
      "score": 2,
      "body": "At least for me personally, the only thing I care about is more reasonably priced coffee that tastes better. Especially the price. You can make the experience as fancy and pleasant as you want. I’m still not paying huge prices for what I can make at home for one cup. I can tolerate a reasonable premium for a good brand and convenience, but these 6-7 drinks is wild. I can get a meal for that price at the grocery store or if i use a deal on another fast food app. Idk what it is in my head but once specialty drinks passed $5 it’s been a no for me. I guess for me $5 was already high for a drink so anymore is just insane",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luos31p/",
      "created": 1730379043,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luowyn1",
      "score": 2,
      "body": "Decent coffee would help.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/luowyn1/",
      "created": 1730380863,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lup2qrr",
      "score": 2,
      "body": "Honestly, I think a major driving factor for this is that their coffee tastes so bad",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lup2qrr/",
      "created": 1730382879,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lup6kgf",
      "score": 2,
      "body": "I purchased a $6 Mocha at Bigby about a week ago, something I never do, and felt like I should have my head examined.\n\nIf I had to take a guess, and I am for sure no expert in the coffee business, I'm thinking that could be why the designer coffee industry is struggling.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lup6kgf/",
      "created": 1730384160,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lul2a7t",
      "score": 5,
      "body": "Wow I guess forcing all the workers back to the office didn't improve the performance?",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul2a7t/",
      "created": 1730320729,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lul3xb7",
      "score": 4,
      "body": "Last time I went to a Starbucks over a year ago there were nearly thirty 15-year-old girls in a long line to order their sugary lattes. I wasn’t going to wait 45 mins for small coffee. They really need to figure out who their audience is.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul3xb7/",
      "created": 1730321207,
      "depth": 0,
      "replies": [
        {
          "id": "lulyimd",
          "score": 15,
          "body": "Based on what you've said, it's 15-year-old girls",
          "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulyimd/",
          "created": 1730330916,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lulgnot",
      "score": 1,
      "body": "The restroom open to everyone, chairs open to everyone, five dollar coffee days were a no for me dog. I used to hang but once the restrooms were left a stinky mess and the seats were never open or if they were I couldn’t stay in them because they needed washed. No thank you.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulgnot/",
      "created": 1730325045,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lulq19o",
      "score": 2,
      "body": "Go woke, go broke.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulq19o/",
      "created": 1730328082,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lul9vqu",
      "score": 1,
      "body": "I'll do my part. The Albertsons app has re-upped me with a $2 Starbucks grande beverage for their in-store Starbucks locations, and I'll be getting one this weekend. They do this a couple times per month. I mean, I'll buy that grande Cookie Crumble Frappuccino for 2 dollars.",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lul9vqu/",
      "created": 1730322979,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lulaseu",
      "score": 1,
      "body": "And with coffee crops getting devastated due to global warming...ya might wanna serve something not coffee as your driiver.\n\nGood luck SBUX, keep selling me overpriced olive oil!",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulaseu/",
      "created": 1730323253,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lulcs0s",
      "score": 1,
      "body": "Starbucks is a crap coffeehouse",
      "permalink": "/r/stocks/comments/1gfw9p6/starbucks_ceo_pledges_to_fundamentally_change/lulcs0s/",
      "created": 1730323855,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "Starbucks CEO Brian Niccol announces a strategic shift as the company's sales continue to decline.",
    "companies": [
      "Starbucks",
      "Luckin Coffee"
    ],
    "tickers": [
      "SBUX"
    ],
    "main_ticker": [
      "SBUX"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Starbucks reported disappointing quarterly earnings and revenue, prompting its new CEO to announce a strategic overhaul to revive the company's growth.",
    "stock_recommendations": "The user does not explicitly recommend buying or selling SBUX stock.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "The sentiment is neutral as the post focuses on the company's recent earnings miss and strategic changes without making stock recommendations.",
    "sentiment": "neutral"
  }
}