{
  "title": "Alphabet Deserves A Better Valuation",
  "score": 330,
  "selftext": "**I had recommended Alphabet (GOOG)** [**as a great long-term buy at $150**](https://www.reddit.com/r/stocks/comments/1anr3id/alphabet_goog_150_looks_like_an_excellent_long/), several months ago.\n\nLast evening, Google knocked it out of the park with really stellar results. I bought more shares this morning, and am reiterating a Buy.\n\nI believe analysts’ consensus earnings could be a little conservative and Google should continue to beat estimates with better growth and operating margins.\n\nGoogle's earnings quality is better than several tech giants for the following reasons.\n\n* It has a near monopoly in Search\n* Market leadership in media with YouTube.\n* A strong first-mover advantage with Waymo.\n* A fast-growing Google Cloud business, third only to and catching up with Azure and AWS.\n\n**Its earnings and growth are sustainable, thus it deserves a better valuation and multiple.**\n\nLet's take a closer look at Q3 earnings.\n\nQ3 GAAP EPS came in at $2.12 per share, beating expectations of $1.85 per share $0.27, or 14% - **This was a substantial beat.**\n\nRevenue of $88.3Bn (+14.9% Y/Y) beat by $2.05B or 3%.\n\nConsolidated Alphabet revenues in Q3 2024 increased 15%, or 16% in constant currency, YoY to $88.3Bn reflecting strong momentum across the business.\n\nGoogle Services revenues increased 13% to $76.5 billion, led by strength across Google Search & other, Google subscriptions, platforms, and YouTube ads.\n\n**Total operating income increased 34% and operating margin percent jumped a huge 4.5% to 32%.**\n\nGoogle Cloud revenues grew a whopping 35% to $11.4Bn led by accelerated growth in Google Cloud Platform (GCP) across AI Infrastructure, Generative AI Solutions, and core GCP products, **with record operating margins of 17%** as the cost per AI query decreased by 90% over the past 18 months.\n\nCloud titans Amazon (AWS) and Microsoft (Azure) have commanded huge valuations for their cloud computing businesses; with Google Cloud growing at 35%, it should continue to narrow the gap over the next 5 years. Also importantly, AWS and Azure have operating margins over 30%, and should Google continue to scale and leverage their existing fixed costs, they can reach the same margins. I also believe as they get better at AI, they should be able to charge more.\n\nBased on consensus analysts’ estimates Alphabet’s EPS should grow to $11.60 in 2027 from $5.80 in 2023 - that’s an annual growth rate of 18%. Comparatively, Apple‘s estimated EPS growth through FY2027 is slower at 14%, and it sports a P/E of 33 compared to Google’s 22. Alphabet’s P/E is closer to the S&P 500’s P/E of 21!\n\nI believe this is too low, and there is a lot of potential for its stock to appreciate on the lower valuation.\n\nBesides the strong EPS, a lot of Google’s expenses are noncash depreciation and amortization and their cash flow margins are strong. They generated operating cash of $31Bn on $88Bn last quarter, or a 35% cash flow margin.\n\nThe antitrust regulation will remain a possible negative on Alphabet, but the final decision is still years away as Alphabet vigorously appeals the decision.\n\n**I recommend Alphabet as a buy at $176**",
  "link_flair_text": "Company Discussion",
  "id": "1ggjotg",
  "num_comments": 167,
  "created_utc": 1730394807,
  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/",
  "comments": [
    {
      "id": "luq6c8n",
      "score": 122,
      "body": "The down move after earnings is due to market movement as well as OPENai releasing a “search engine”.\n\nNow the question is… in determining if this is a buy opportunity.\n\n1. Does OPENAI have a better LLM than GOOG? A big huge advantage? Or are they coming into alignment as each platform evolves.\n\n2. Does OPENai know how to run a search engine business? Is that their core competency? \n\nYou decide on those two questions and you’ll know the answer.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luq6c8n/",
      "created": 1730395491,
      "depth": 0,
      "replies": [
        {
          "id": "luq9c82",
          "score": 151,
          "body": "AI Search Engines are known by 90% of the population for nearly 2 years now, yet Google regained market share over the summer. As of now they are just not user intuitive enough, fast enough and dont give the desired results. Google couldn‘t care less if you let ChatGPT explain a math problem to you. But Google does care if you plan to buy a new Car or Make-Up product. And this types of searches are just not done via AI. \n\nTo ad on this, a search via AI costs x10 the amount of elecricity while yielding worse ad revenue. I am quite sure that all AI search engines will be Pay2Use at some point, which greatly reduces their attractiveness.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luq9c82/",
          "created": 1730396416,
          "depth": 1,
          "replies": [
            {
              "id": "lur3uo2",
              "score": 20,
              "body": "To add to that.   Search and prompting AI are not the same thing.   To effectively search with an LLM you need to ask the right question, but often times you don't know the right question to ask.  \n\nWhile it's useful to have a \"dialog\" with an LLM, Google still holds the reins to getting you the information you want quickly.  Plus it has a proven search monetization strategy which will continue to grow.  \n\nFinally, while yes the proverbial 2 people in a garage can technically disrupt an industry, Google has so much of a head start and data it'll be hard to imagine that Google will be replaced overnight.  Which then begs the question, do you believe Google leadership will identify potential technology threats and improve their product offering.",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lur3uo2/",
              "created": 1730406022,
              "depth": 2,
              "replies": [
                {
                  "id": "lutmg7p",
                  "score": 9,
                  "body": "When you ask an LLM to do  search, it basically asks an actual search engine and organizes the result for you. The process is called RAG (retrieval augmented generation). It is more expensive, inferior for queries that aren't general knowledge, lack in modalities and real time navigation, but more importantly prone to hallucinations.",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lutmg7p/",
                  "created": 1730444919,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "luxqqox",
                  "score": 2,
                  "body": ">do you believe Google leadership will identify potential technology threats and improve their product offering.\n\nI believe they will identify threats and introduce multiple Solutions competing with themselves. Eventually rebranding some of those Solutions and combining them and getting rid of others entirely. After maybe a couple of years I suspect they will probably cancel everything all together and then maybe replace it all with something else again and with less functionality than they started with the very beginning.\n\nI have held GOOG for about 9 years though and don't plan to sell it anytime soon.",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luxqqox/",
                  "created": 1730502688,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lur0rgv",
              "score": 10,
              "body": "i just bought a significant amount of google stocks today and am high on their cloud revenues and potential of waymo - as someone who recently started taking them i see myself using them over uber the majority of the time going forward\n\nthat said, the addressing of search engine concerns like \n\n> AI Search Engines are known by 90% of the population for nearly 2 years now, yet Google regained market share over the summer. As of now they are just not user intuitive enough, fast enough and dont give the desired results. Google couldn‘t care less if you let ChatGPT explain a math problem to you. But Google does care if you plan to buy a new Car or Make-Up product. And this types of searches are just not done via AI.\n\nor elsewhere in this thread \n\n> Regardless, the notion of Alphabet losing revenue from search has been thrown around since OpenAI's conception at this point. Meanwhile, GOOGL just reported their highest ever quarterly revenue (including search lol)\n\nare not super convincing to me from a long term standpoint.  i realize that their search revenue just increased again last quarter, but bringing up chatGPT when it first released and when its search capabilities were completely inferior to what they are now doesnt really mean much from a long term perspective, when AI search capabilities will likely continue to improve, as exemplified by the search engine chatGPT released today.  whether or not its currently preferable to google is one thing - i find myself using each about 50/50 depending on what im looking for - but if you have access to searchGPT you can certainly ask it for things like buying a new car and get useful results, including sources\n\n>  I am quite sure that all AI search engines will be Pay2Use at some point, which greatly reduces their attractiveness.\n\nthis just seems like pure speculation to me\n\non top of the fact that concerns are not that google search will become completely irrelevant any time soon, but will simply lose a noticeable market share which even if relatively small would still have a significant negative impact for them",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lur0rgv/",
              "created": 1730405035,
              "depth": 2,
              "replies": [
                {
                  "id": "lurg6nn",
                  "score": 4,
                  "body": ">but will simply lose a noticeable market share\n\nDOJ in it's lawsuit against Alphabet quoted Google's internal findings that the firm wouldn't lose search market share even if the quality of their Google search significantly drops.",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurg6nn/",
                  "created": 1730410118,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lurowrf",
                      "score": 1,
                      "body": "i mean, that is not necessarily a good thing for googles valuation.  that is being used against them by the DOJ from an antitrust perspective \n\nbut also, while that is true up to an extent - googles lead over the competition is significant enough that a drop in quality to an extent would not affect it - if the lead shrinks enough either through a drop in their own quality and/or an increase in the quality of other options, at a certain point it would lose market share.  \n\nunless you believe no matter how crappy their search engine is (like it only returns results from 10+ years ago or something ridiculous), or no matter how good the competition is (a new search engine that somehow always provides the perfect result every single time), google search's market share would not change",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurowrf/",
                      "created": 1730413248,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lus2s2z",
                          "score": -1,
                          "body": "I agree - goes to show you that consumer do not have much choice",
                          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lus2s2z/",
                          "created": 1730418524,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "luqj5qp",
              "score": 7,
              "body": "Assuming we're discussing the long term, I'd argue google definitely cares if your go to explainer of math (or whatever) problems becomes chatgpt. This behavior change definitely has the potential to have a $$ impact for the long term.",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqj5qp/",
              "created": 1730399467,
              "depth": 2,
              "replies": []
            },
            {
              "id": "luv1w22",
              "score": 1,
              "body": "There are also so many creative thoughts out there, which is often what people want to read when they Google items. AI is practical. ",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luv1w22/",
              "created": 1730471382,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lurkqlz",
              "score": -5,
              "body": "It took me almost 2 years to try Perplexity for the first time, but even though it's not easy to set it up to be the default search engine I rarely ever use Google anymore. I'm a techie, others will be even slower, but non-AI search engines are clearly going away.",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurkqlz/",
              "created": 1730411711,
              "depth": 2,
              "replies": [
                {
                  "id": "lurm529",
                  "score": 10,
                  "body": "They arent. ChatGPTs market share declined over summer, while Google gained market share. \n\nFurthermore ad-relevant search requests just dont need AI. Yes, when I have a knowledge question during my studies, I also like to have ChatGPT explain it to me. But if I’m looking for the nearest restaurant or a mobile phone for my mum, I’ll always use Google. Because it’s far too complicated to make a sensible enquiry to AI systems and the answer is usually not what I’m looking for. Less tech-savvy people are even slower at this sort of thing. Change may happen, but over the span of generation. Look at PayPal, its also not dead, although there are clearly better solutions. And for Google that isnt even the case.\n\nAt the moment, all AI engines are gimmicks that are difficult to monetise.",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurm529/",
                  "created": 1730412219,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lus5vv7",
                      "score": 6,
                      "body": "People care about convenience and ease...Google is easy and familiar..people might go try perplexity or chatgpt once then go back to Google...",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lus5vv7/",
                      "created": 1730419732,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lv64ip3",
                          "score": 1,
                          "body": "Exactly. All Perplexity (or ChatGPT/Anthropic) needs to do is come out with something convenient, with no login required, and Google is going to suffer.",
                          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lv64ip3/",
                          "created": 1730637970,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "luqpuv0",
          "score": 12,
          "body": "Many people use Google just as an entry point to other web pages. Why use an LLM for this.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqpuv0/",
          "created": 1730401565,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lur661x",
          "score": 8,
          "body": "Openai couldn’t even tell me the weather",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lur661x/",
          "created": 1730406772,
          "depth": 1,
          "replies": [
            {
              "id": "lur8fof",
              "score": -3,
              "body": "Did you try with OpenAI search? It was definitely able to tell me the weather.",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lur8fof/",
              "created": 1730407503,
              "depth": 2,
              "replies": [
                {
                  "id": "lurmj3c",
                  "score": 6,
                  "body": "Yep. The first thing I did. Weather in nyc. Said you need a plugin",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurmj3c/",
                  "created": 1730412363,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lurryof",
                      "score": -2,
                      "body": "I asked for an obscure city where I live and I got a response with 10 sources on the right, and main content being the exact weather at current time, and even including future weather with icons. Are you sure it's enabled for you?\n\n\"Weather in nyc\" gives me also an answer similar. It even related one of the days to NYC marathon.\n\nI got - and the response was really quick:\n\nNational Weather Service - New York, NY\nforecast.weather.gov\nnew york, ny forecast\n\nAs of 12:39 AM EDT on Friday, November 1, 2024, in New York City, the weather is mostly cloudy with a temperature of 77°F (25°C).\n\n\nSevere Weather: New York City\nFri, Nov 1, 8:00 AM - Fri, Nov 1, 7:00 PM\nRed Flag Warning in effect from Friday, 8:00 AM EDT until Friday, 7:00 PM EDT. Source: U.S. National Weather Service\nCurrently 77° · Mostly cloudy\nNew York, NY, United States\n\n\n\nThu, Oct 31\n81°\n66°\nSunny and warm with the temperature tying the record from 1946; unusually warm for trick-or-treating\n\nToday\n80°\n52°\nA morning shower in spots, then times of sun and clouds in the afternoon; very warm\n\nSaturday\n64°\n45°\nMostly sunny and cooler but pleasant\n\nSunday\n60°\n47°\nSunshine giving way to clouds; great weather for the marathon\n\nMonday\n63°\n55°\nMostly cloudy\n\nTuesday\n74°\n63°\nMostly sunny and warmer; dry weather to get out and vote\n\nWednesday\n75°\n55°\nMainly cloudy and very warm\nPlease note that a Red Flag Warning is in effect from 8:00 AM to 7:00 PM EDT on Friday, November 1, due to expected strong winds and low humidity, which can lead to rapid fire spread.",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurryof/",
                      "created": 1730414396,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lusd7u0",
                          "score": 5,
                          "body": "I’m not sure we’re using the same search bar. I used the new OpenAI search bar and it didn’t work. I will try again",
                          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lusd7u0/",
                          "created": 1730422552,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lvb8cuz",
                          "score": 1,
                          "body": "No clue why you're getting downvoted.\n\nPeople probably still don't understand what \"chatgpt search\" is",
                          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lvb8cuz/",
                          "created": 1730702569,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "luqal24",
          "score": 14,
          "body": "Also, OpenAI with this Search product will be directly competing with MSFT with Bing. So conflicts going to arise, and maybe MSFT provides less support to OpenAi which might constrict them...very interesting dynamics at play",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqal24/",
          "created": 1730396801,
          "depth": 1,
          "replies": [
            {
              "id": "luqef0x",
              "score": 5,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqef0x/",
              "created": 1730397975,
              "depth": 2,
              "replies": [
                {
                  "id": "luqiq75",
                  "score": 10,
                  "body": "It does, but it detracts from bing ad revenue",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqiq75/",
                  "created": 1730399331,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "luqj0v2",
                      "score": 1,
                      "body": "Yea",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqj0v2/",
                      "created": 1730399424,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lur85bq",
                      "score": 0,
                      "body": "But if Bing gets similar cut from it using its APIs it doesn't matter.",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lur85bq/",
                      "created": 1730407412,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lutsfdx",
                  "score": 2,
                  "body": "The most searched term on Bing is Google 😂",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lutsfdx/",
                  "created": 1730449343,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lus50ms",
          "score": 7,
          "body": "They need to figure out a way to make it a lot faster if they want to take some share from Google.\n\nIt is not just the fact that an LLM is going to be slower. But it is up and down the entire stack with network being a big one.\n\nGoogle invented new protocols, QUIC, to make faster. They connect directly to the ISPs. Google created their own network processors to lower latency.\n\nPeople are just to impatient. If they do not get an immediate response they will just go back to Google.\n\nhttps://www.theregister.co.uk/2016/02/09/google_processor/\n\nIt will be interesting to see if it gets any traction. Google just reported search numbers and they had double digit growth. So far it does not look like non Google LLMs are taking any share.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lus50ms/",
          "created": 1730419393,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lutsshy",
          "score": 5,
          "body": "Google may very lose the LLM battle, but they are dominating the AI war.\n\nOpenAI's CEO is a venture capitalist, not an AI/ML scientist.\n\nOpenAI is based on open source models that they decided to close source--they privatized other people's work but still call themselves open.\n\nOpenAI is a non-profit that trained their LLM on copyrighted data without permission. Now, they are trying to privatize their company, and monetize an AI trained on people's copyrighted data, and OpenAI's executives and key engineers are leaving en mass.\n\nMicrosoft is also increasingly distancing themselves from OpenAI. \n\nMicrosoft also just announced that GitHub Copilot will include Google Gemini 1.5.\n\nChatGPT has been available to the public for over two years now, and Google Search's dominance has moved from 94% of the market to 90%, and now back to 92%.\n\ngemini.google.com has more than 300 million active users.\n\nAnd, Google was an early investor in Anthropic (and SpaceX).\n\nBut, LLMs represent less than 1% of Google's business.\n\nLast month, Google's NotebookLM usership grew 400% from 500k users to 3 million users.\n\nGoogle created the original Tensor libraries modern LLMs are based off. Google has been making specialized Tensor Processing Units (TPUs) purpose-built for training AI long before OpenAI even existed. Today's Trillium TPUs are comparable to NVIDIA's H100s and can be produced for a fraction of the cost.\n\nGoogle has whole datacenters powered by their own chips. \n\nGoogle Pixels also run on Google's TPUs and Gemini.\n\nApple trains its AI on top of Google's TPUs.\n\nWaymo, Google's autonomous driving segment, is absolutely dominating the space, providing 150,000 weekly rides, and just got valued at $45B. OpenAI, by the way, backed their own autonomous driving startup that did not get off the ground.\n\nGoogle Wing has already made 350,000 drone deliveries for Walmart.\n\nWe haven't even begun to mention YouTube, Chrome, Cloud, GMail, Android, Home, Chromecast, Pixel Phones and Watches, Workspace, Drive, Maps, Nest, FitBit, News, PlayStore, Wallet, Chat, Video ... and Google's hundreds of other business segments, all of which have their own dedicated teams of AI engineers and researchers.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lutsshy/",
          "created": 1730449618,
          "depth": 1,
          "replies": [
            {
              "id": "luus4en",
              "score": 2,
              "body": "Great write up. \n\nI honestly think Google is the most undervalued stock in the market. It just has negative sentiment dragging it down.",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luus4en/",
              "created": 1730468084,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lutts34",
          "score": 2,
          "body": "Can openai keep up with the cost as the traffic scales up for the search engine? i smell billions down the drain to keep up.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lutts34/",
          "created": 1730450347,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lur8rvb",
          "score": 2,
          "body": "Google has been severely underdelivering in terms of LLM quality compared to competition in my view, also the search engine results have progressively gotten worse as time has gone on. I always have to add \"reddit\" to the queries to be able to get something that doesn't seem SEO spam or just AI generated SEO spam.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lur8rvb/",
          "created": 1730407615,
          "depth": 1,
          "replies": [
            {
              "id": "lurd4c7",
              "score": 2,
              "body": "So do you think goog can’t figure out that issue regarding the +reddit thing? \n\nDo we believe company performance is static? Will they improve or adjust?\n\nThe results show otherwise with search doing fine. Everything else up as hell.\n\nBut anecdotes are important but it sounds more like it’s important for the agile improvement team than for an investment decision.",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurd4c7/",
              "created": 1730409063,
              "depth": 2,
              "replies": [
                {
                  "id": "lurhzad",
                  "score": 0,
                  "body": "I'm just seeing their products stagnating and not keeping up with competition, that's it.",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurhzad/",
                  "created": 1730410741,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lurjcl2",
                      "score": 2,
                      "body": "So the LLM answers in addition to search results aren’t keeping up? Google podcast tool isn’t keeping up? \n\nWaymo isn’t keeping up? \n\nIdk, I feel like a deep dive without bias would help you gather a bit more of the reality of Google vs the competition.",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurjcl2/",
                      "created": 1730411222,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lurztbz",
          "score": 2,
          "body": "None of that is relevant. All shareholders need to know is that Google has huge cash piles and strong growth. Let’s stop finding justification for bs short-term movement",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurztbz/",
          "created": 1730417384,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luuz848",
          "score": 1,
          "body": "I think if there was ever that big of a threat from OpenAI to Google they would abandon all other investments and do whatever it takes to maintain search market share, maybe even acquire OpenAI. They are not going to simply give up on their competitive advantage / cash cow",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luuz848/",
          "created": 1730470503,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luv0jgk",
          "score": 1,
          "body": "I think the important thing to note here is that GOOGL has unlimited runway and openAI has a *ton* to do here to justify its economics. \n\n> OpenAI’s monthly revenue hit $300 million in August, up 1,700 percent since the beginning of 2023, and the company expects about $3.7 billion in annual sales this year, according to financial documents reviewed by The New York Times. OpenAI estimates that its revenue will balloon to $11.6 billion next year.\n> But it expects to lose roughly $5 billion this year after paying for costs related to running its services and other expenses like employee salaries and office rent, according to an analysis by a financial professional who has also reviewed the documents. Those numbers do not include paying out equity-based compensation to employees, among several large expenses not fully explained in the documents.\n\n - Source: https://www.nytimes.com/2024/09/27/technology/openai-chatgpt-investors-funding.html\n\nSo, they are either going to have to massively raise prices (which probably kills growth if not reduces current usage) OR figure out how to manage costs better (reduce compute expense, which means train less? that'd also be a growth killer)? \n\nAs bullish as I am on LLMs in general, so far the lack of accuracy is only solved by the pattern of sending an input, getting a result, and then sending the result back to say - hey double check, was that right? rinse repeat, so you need the economies of scale right now for it to continue to be useful in the way that it is today. \n\nBecause of all that, I'm hesitantly bullish on both but I think openai has \"more to lose\" right now in terms of figuring out the \"economics\" problem while Google just has to keep iterating on its solutions. Search existed before Google but they won that market eventually. \n\nNo positions in either, just how I'm considering the risks on both sides.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luv0jgk/",
          "created": 1730470938,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "luqsbzk",
      "score": 26,
      "body": "I think they are the most well positioned, good value AI offering.\n\nTheir LM notebook is fucking astonishing with its new podcast feature. If you haven’t tried it, just go and do it now. Take something you wrote (or any large piece of text), whack it in there, wait a minute, then listen to their AI podcast. It’s the best thing I’ve seen yet from any AI system.\n\nThat’s just one thing, but their array of assets are also a fucking incredible, diverse and frankly unrivalled data source for their AI development.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqsbzk/",
      "created": 1730402352,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luq5ne8",
      "score": 52,
      "body": "Hopefully it stays low so that I can keep buying it lol",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luq5ne8/",
      "created": 1730395280,
      "depth": 0,
      "replies": [
        {
          "id": "luqgyp3",
          "score": 22,
          "body": "Yep. Either way I just bought 210 shares shortly after the market opened today. Prior to this I had only 36 shares.\n\nI had been on the fence about liquidating one of my other positions to buy GOOGL shares for a while, but this earnings report, as well as the lack of much movement from the market despite how good it was, convinced me to pull the trigger today.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqgyp3/",
          "created": 1730398779,
          "depth": 1,
          "replies": [
            {
              "id": "lurev05",
              "score": 20,
              "body": "The fact that I've been reading everywhere on reddit that GOOGL is undervalued for months makes me feel like it's probably wrong though.\n\nIf there's something I've learned after years on investing subs it's that when people all agree they should invest in something they're usually wrong.",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurev05/",
              "created": 1730409659,
              "depth": 2,
              "replies": [
                {
                  "id": "lussyat",
                  "score": 10,
                  "body": "Regardless of if Google goes up or down people are going to say \"reddit was wrong\", because there's people expressing opinions on both sides in these threads.\n\nIMO a lot of the \"reddit was wrong\" sentiment is often revisionist history in this way where the sizeable number of people with counter opinions are just ignored. Also keep in mind not everyone giving their opinions that stocks XYZ is a great/terrible buy has done a deep dive into it and read the 10K's/etc. I freely admit I do this all the time at reddit (but not for Google, I did the research there), and I know I'm not the only one.",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lussyat/",
                  "created": 1730428649,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lurqffr",
                  "score": -1,
                  "body": "I bought some when Hitler was light skin Vietnamese and most users here hated it. Now I’m definitely going to hold back.",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurqffr/",
                  "created": 1730413816,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "luqaz6k",
          "score": 1,
          "body": "**Mixed opinions on Reddit is a strong BUY signal** \n\n\n Same thing happened to PLTR a year ago. Someone even said, I'd rather hold Intel as an A.I. play instead of PLTR 😂\n\n\nhttps://www.reddit.com/r/stocks/comments/173ge10/comment/k42w43z/\n ",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqaz6k/",
          "created": 1730396919,
          "depth": 1,
          "replies": [
            {
              "id": "lustbuc",
              "score": 3,
              "body": "That sounds like cherry picking more then anything. I can think of plenty of stocks with mixed opinions where the stock continued to sink, including Intel (for multiple years) and Boeing (prior to the pandemic).",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lustbuc/",
              "created": 1730428802,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lur7zy9",
          "score": 1,
          "body": "Plus Google can buy back their own shares at great valuations...\n\n\nWin win",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lur7zy9/",
          "created": 1730407363,
          "depth": 1,
          "replies": [
            {
              "id": "lurbr5l",
              "score": -5,
              "body": "That's not how buybacks work.",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurbr5l/",
              "created": 1730408599,
              "depth": 2,
              "replies": [
                {
                  "id": "lurrsm3",
                  "score": 9,
                  "body": "Ummm...yes it abso-fucking-lutely is. What are you talking about?",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurrsm3/",
                  "created": 1730414333,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lus1k20",
                      "score": -5,
                      "body": "It is just an alternative way to pay a dividend. They aren't \"investing\" in google.",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lus1k20/",
                      "created": 1730418057,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lut6jkr",
                          "score": 4,
                          "body": "I know how buybacks work. Buybacks done at cheaper valuations yield more shareholder value than buybacks at more expensive valuations.\n\n\n$GOOG buying shares here at 22x is more accretive to shareholder value than if they were buying at 38x or 40x.",
                          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lut6jkr/",
                          "created": 1730434796,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lutqe2h",
                              "score": 0,
                              "body": "No they don't that is not how that works. It has a fixed cash value. They can either pay out $1B or buy back $1B, the only difference is that the buy back increases the share price.  \n\nThis is the thing most redditors get obnoxiously wrong and can never explain why it isn't the same as a dividend.",
                              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lutqe2h/",
                              "created": 1730447834,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "luudiua",
                                  "score": 1,
                                  "body": "Yea but its better when they buy it at a cheaper price meaning they can buy more shares which also means that eps will rise because there are less shares outstanding. A rise in EPS yields a better shareholder value.",
                                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luudiua/",
                                  "created": 1730462215,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "luup66n",
                                      "score": 0,
                                      "body": "[removed]",
                                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luup66n/",
                                      "created": 1730467020,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "luvpx4f",
                                          "score": 2,
                                          "body": "Man, you’re stubborn. The price of a stock can be expensive or cheap. Just look at KO, which trades at a 27 P/E but has a -7% earnings growth rate. That means KO is relatively more expensive than GOOGL, which has a 23 P/E and a 30% earnings growth rate. People are willing to pay more for KO stock because of its relatively safe business and long track record, making it pricier than GOOGL.\n\nYou can also check historical P/E ratios to see if a stock is cheaper than its historical value.",
                                          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luvpx4f/",
                                          "created": 1730479041,
                                          "depth": 9,
                                          "replies": []
                                        },
                                        {
                                          "id": "luykwgm",
                                          "score": 0,
                                          "body": "[removed]",
                                          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luykwgm/",
                                          "created": 1730514234,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lur5aag",
      "score": 24,
      "body": "Open AI has been available to the public since 2016, and TikTok in 2016 as well. People say that these platforms are taking away Google's search moat, ***but there has been zero evidence of this when Google reports its search revenue.*** Seriously, if these did have a material effect on Google, we would have likely seen a decrease in revenue by now, but Google search revenue continues to be strong, as do all other aspects of the business.  I think anyone who buys the stock today will see above-market-average returns with a high degree of predictability.\n\n  \njust my 2 cents as a shareholder",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lur5aag/",
      "created": 1730406487,
      "depth": 0,
      "replies": [
        {
          "id": "lvayqh0",
          "score": 1,
          "body": "Sorry but comparing 2016 Open AI (or even 2023 Open AI) to what they have now, makes no sense. I think before/after GPT4 is a better cut.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lvayqh0/",
          "created": 1730697026,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lus0z0r",
          "score": -9,
          "body": "Young people don't search on Google anymore. They do it on tiktok and Instagram ",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lus0z0r/",
          "created": 1730417830,
          "depth": 1,
          "replies": [
            {
              "id": "lus1rxv",
              "score": 16,
              "body": "When I was searching “rechargeable heated jeacket” today on TikTok, most of the results were girls barely clothed, dancing, showing off their amazing talent. There is no way people use TikTok and Instagram rather than google. Maybe for food or clothing reviews and the like, which is more of a competitor to YouTube",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lus1rxv/",
              "created": 1730418141,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lusayw6",
              "score": 13,
              "body": "No one does that.",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lusayw6/",
              "created": 1730421689,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lusubm9",
              "score": 1,
              "body": "A lot of those numbers are highly misleading.\n\nThe biggest issue being how exactly do you define a \"search\"? Like if I go to YouTube and search for \"gaming PC\" is that a search? Is it a search if I instead search for the same thing on Google or Amazon.com? Or what if I instead search on YouTube for \"Funny cat video\", or the name of a content creator on YouTube, are those searches?\n\nAnd if the Amazon and YouTube searches count as \"searches\", am I choosing Amazon or YouTube as my new search engine? Or am I just using different websites for their specific niches?\n\nPoint being this isn't a simple black and white thing. People count what a search is differently, which gives wildly different results to things like if Google search is losing relevance or not.",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lusubm9/",
              "created": 1730429193,
              "depth": 2,
              "replies": [
                {
                  "id": "luxjc6f",
                  "score": 1,
                  "body": "Honestly this is exactly what I’m thinking anything that you can type text into a spit out answer is a search engine.",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luxjc6f/",
                  "created": 1730500017,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvbugok",
              "score": 1,
              "body": "When you say young, you mean 10-15 year olds? I literally know nobody searching tik tok for other than reviews on a product. Then they go search it in google for more info. You are talking about a competitor for review websites, not google search.",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lvbugok/",
              "created": 1730717566,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lurc6mo",
      "score": 10,
      "body": "I think a lot of people are reading way too far into today specifically re: OpenAI search engine and the DOJ law suit. At this stage, OpenAI isn't real competition and the DOJ has had an incredibly poor track record of antitrust claims agianst tech companies.\n\nMy interpretation of today's drop is simply proft taking - myself and almost everyone I know bought in big when GOOGL was sub $150 in early September (less than 2 months ago). I didn't sell, but I can totally understand wanting to crystalize 10+% gains in less than 2 months, especially before year end / election uncertainty.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurc6mo/",
      "created": 1730408745,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lure4dz",
      "score": 5,
      "body": "Like two weeks ago I had no idea which stocks to buy. After this earnings week I've got like five and not enough cash. Alphabet is one of them.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lure4dz/",
      "created": 1730409405,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luq7buh",
      "score": 12,
      "body": "They’re a great company and I agree a great long term buy at these prices. That said, the market has two huge worries on their mind: antitrust regulation and competition.\n\nAs long as regulators have their eyes on Google it makes future growth and acquisitions much harder. Their days of simply buying out any competitors before they can launch search products are probably over. As are the days of just openly bribing Apple and Samsung to make Google search the default cellphone browser. \n\nThen to top it off we have news today that OpenAI is adding search features to ChatGPT and that Meta is exploring search features in their products as well. \n\nAll of these are massive net negatives to Google. Until we get more clarity on the impact, GOOG isn’t likely to make any big moves up imo",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luq7buh/",
      "created": 1730395795,
      "depth": 0,
      "replies": [
        {
          "id": "luqauzt",
          "score": 20,
          "body": "If you have an apple device and are given the choice to use Google Search or craplexity (a Tl;Dr google search) I think most people are picking the prior.\n\nRegardless, the notion of Alphabet losing revenue from search has been thrown around since OpenAI's conception at this point. Meanwhile, GOOGL just reported their highest ever quarterly revenue (including search lol). They have been diversifying their revenue streams (unlike meta trying to break into hardware) with GCP and services.\n\nThis company just innovates like crazy. For example, the use of their in-house build Tensor processing units to bring down the costs of the Google Pixel 9 while outperforming many other flagship phones on the market. They smashed GP9 shipments worldwide.\n\nFrom a regulatory standpoint, I see google as only having a gain. If TikTok gets banned, Youtube alone could command a 1 trillion dollar valuation based on NFLX multiple. Theres also concerns of how much money Open Ai loses and how many users it will eventually lose when it applies fees or spams ads on its chatbot",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqauzt/",
          "created": 1730396884,
          "depth": 1,
          "replies": [
            {
              "id": "luqkcfi",
              "score": 13,
              "body": "> If TikTok gets banned, Youtube alone could command a 1 trillion dollar valuation based on NFLX multiple.\n\nYT is already worth more than Netflix straight up IMO even if that doesn’t happen. 70 billion shorts watched per day and growing. Probably 9/10 people reading this comment watch YT much more than Netflix.",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqkcfi/",
              "created": 1730399838,
              "depth": 2,
              "replies": [
                {
                  "id": "luqmtay",
                  "score": 15,
                  "body": "Waymo is also something that gets completely shrugged off. Waymo just had a financing round last week and the autonomous driving unit  was valued at more than $45B. The idea of having A.i Robotaxis is massive for so many different applications (driveway delivery, enterprise level logistic needs, personal taxi services, google Maps infrastructure autonomy and OPex expansion) . Waymo reached 1 million miles traveled. Im extremely bullish on this segment. I dont think competition is a concern here (Tesla , for example) since this space has a massive TAM. Regulatory approval is the only issue and Waymo going city by city is a much better approach than how TSLA FSD is doing their mass rollout\n\n[https://www.bnnbloomberg.ca/business/technology/2024/10/31/alphabets-waymo-valued-at-more-than-45-billion-after-funding/](https://www.bnnbloomberg.ca/business/technology/2024/10/31/alphabets-waymo-valued-at-more-than-45-billion-after-funding/)\n\nVerily by alphabet also uses true Ai based applications designed by Deepmind (alphaFold) to  determine the 3-D sequences of proteins to design biological and small molecules inhibitors for a variety of diseases. It currently generates around half a billion in revenue in their other bets segment and has massive potential in the biotech space. It's truly an incredible piece of technology and someone at Deepmind received a noble prize for it this year. Its going to cure alot of diseases\n\nhttps://www.technologyreview.com/2024/10/09/1105335/google-deepmind-wins-joint-nobel-prize-in-chemistry-for-protein-prediction-ai/#:\\~:text=Google%20DeepMind%20leaders%20share%20Nobel,Demis%20Hassabis%20and%20John%20M.",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqmtay/",
                  "created": 1730400615,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lutq4gi",
                      "score": 1,
                      "body": "Many areas of proven growth and more emerging areas of future possible growth at a sub 20 pe ratio. Unbelievable.",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lutq4gi/",
                      "created": 1730447635,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "luqsar4",
                      "score": 1,
                      "body": "TSLA hasn't actually even begun the regulartory approval process for driverless cars.",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqsar4/",
                      "created": 1730402341,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "luqxeyp",
                          "score": 0,
                          "body": "Elon already hinted at the overall rollout paradigm. He stated TSLA plans to use a FSD completion --.> model 3 (supervised) ---> model 3 (unsupervised) + Robocar rollout. The supervision part is where TSLA is able to leverage the \"car company\" portion of their moat to speed run the approval process. Waymo obviously cant do this.\n\nBut im not concerned I own both stocks and I think developments by both companies ultimately help each other. Both Waymo and Tesla FSD (preliminary) data showed that autonomous driving is safe and even safer than human drivers. As long as they continue to demonstrate that then I dont see the incentive for governments to block the rollout.",
                          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqxeyp/",
                          "created": 1730403972,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lurarmz",
                              "score": 3,
                              "body": "Supervised -> Unsupervised is by far the hardest part of the whole process. Additionally, Tesla relying on a completely different sensor suite means the approval process will likely be very different, as regulatory bodies will be concerned about deficiencies of camera only systems. This is a long discussed topic, but a quick reason is single sensor platforms are naturally less reliable as they lack redundancy and risk single sources of failure.",
                              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurarmz/",
                              "created": 1730408271,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lus3aqo",
                                  "score": 2,
                                  "body": "I just think it's pointless getting into those tiny nuanced details. So far both SF and phoenix have been very welcoming to WAYMO. the main point is that the TAM of this market segment is massive and that both services will do very well. Just think of how it will connect people, goods & services \n\n  \n[https://www.phoenix.gov/newsroom/aviation/2548](https://www.phoenix.gov/newsroom/aviation/2548)",
                                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lus3aqo/",
                                  "created": 1730418724,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lusc3zk",
                                      "score": 1,
                                      "body": "For sure, but I don't think it is a minor nuance - I think it actually is the biggest blockers of the whole project. If it can't get regulatory approval (which likely won't be sped up by waymos precedence due to different sensor paradigms), then the whole effort is DoA.",
                                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lusc3zk/",
                                      "created": 1730422124,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "luqusjn",
                          "score": -7,
                          "body": "Yea and when Waymo finally conquers Phoenix in 10 years, Tesla will be autonomously driving on Mars. I'm sure Reddit will say it wasn't fair though and \"Elon didn't technically achieve it even though Tesla won the battle...AND IF HE HAD ONLY JUST VOTED FOR KAMALA LIKE I WANTED HIM TO! WAHHHH!\" :)",
                          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqusjn/",
                          "created": 1730403138,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lura4jc",
                              "score": 3,
                              "body": "Waymo robotaxi's are already available in SF as well! Highly recommend giving it a try, it's super cool. Took it multiple times a few weeks ago with no issue :D",
                              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lura4jc/",
                              "created": 1730408059,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lurcmpx",
                                  "score": 0,
                                  "body": "I honestly am excited about both! I'm annoyed by the irrational Tesla hate because it kept me from driving one for a long time and they're absolutely amazing, especially FSD.",
                                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurcmpx/",
                                  "created": 1730408896,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "luripht",
                                      "score": 1,
                                      "body": "We were promised self driving by the next year - in 2016... Elon is a great engineer and I'm certain our kids will be reading about him in the history books, but the Tesla is filled with problems. Priced like a tech stock, with a growth no where near that. It's pure hopium",
                                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luripht/",
                                      "created": 1730410997,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "luqmsuq",
                  "score": 2,
                  "body": "Yeah they said yt revenue in the last 12 months is more than 50B if you combine adds and subscription revenue. Netflix is closer to 38B in revenue. Margins are likely similar but I think Netflix has more operating leverage moving forward given they own the content and don’t have to share a % with creators",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqmsuq/",
                  "created": 1730400611,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "luqp1u6",
                      "score": 5,
                      "body": "I don’t think that’s true of Netflix. They either pay huge licensing fees (which get renegotiated upwards every time revenue increases because of them, holding the margin) or development costs. They’re successfully moving more of the mix towards developing, but I constantly wonder if they’ll develop something that gets them cancelled by the USA cancel culture.\n\nMeanwhile, Google pays a lot less for shorts views than they do for old youtube videos, and meanwhile CapEx scaling and TPU development are bringing their costs down on the other end.\n\nAnother point: Netflix pays money up front to develop something that may not air for years, whether it is successful or not. YouTube pays its creators a piece of the pie only when the video succeeds. And the creators buy their own CapEx (often iPhones now). Very cashflow friendly.\n\nI would choose Youtube straight up between the two. I’d be mortified if you told me I could never use YouTube again. Netflix I can take or leave.",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqp1u6/",
                      "created": 1730401310,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "luqqcmm",
              "score": -2,
              "body": "Google tensor is literally the slowest processor of all flagship phones and by a huge margin too",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqqcmm/",
              "created": 1730401723,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "luq8a0t",
          "score": 4,
          "body": "Meta might be a bigger threat to search than OpenAI",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luq8a0t/",
          "created": 1730396086,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luqn2sl",
          "score": 2,
          "body": "Yes, but Google and so many others are using AI tools in their domains, for example, if I get an answer from Google search via their AI button, I may never need to download ChatGPT - I've been using Gemini, ChatGPT, Claude, and Firefly in the past month and often there are few discernible differences so agreed about the competition but it will take a gargantuan effort to dislodge googling something.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqn2sl/",
          "created": 1730400698,
          "depth": 1,
          "replies": [
            {
              "id": "luqypr4",
              "score": 1,
              "body": "I think the use cases for traditional search is much different than LLM queries. Ai overview can do what chatGPT does for a majority generic search queries. I see LLMs being used more for analyzing search driven outcomes (Academic reports, work presentations etc..) These are two very different things and actually suggests that LLMs will promote the use of web search further which I believe will be the ultimate case\n\nThen again google owns NoteBook LM which is a more  intensive LLM based application tool which helps things like summarizing a clinical research study that you find on JAMA through a google search.\n\noddly enough for me , one of the biggest threats IMO to google search that doesnt get talked about enough is Reddit. Reddit search is innately unique and different than google. I see this competing with google search in a impactful way",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqypr4/",
              "created": 1730404384,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luqgwh4",
      "score": 5,
      "body": "I love that they are integrating google into cars as most cars OS and navigation sucks absolute ass. Rented a Volvo once with google integrated and my next car will definitely have that. Was super convenient and it nullified the need for android auto and apple carplay",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqgwh4/",
      "created": 1730398760,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luqy3iv",
      "score": 3,
      "body": "Regardless of how you look at it , you win as a long term holder.\n\nIf the multiple stays depressed. The company can do buybacks and increase the EPS at a cheaper share price and have more capital available for other uses (larger divvies, R&D etc...)\n\nIf the multiple expands we see gains on equites. This is why stocks are amazing if you pick the right ones",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqy3iv/",
      "created": 1730404187,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luqgdzq",
      "score": 8,
      "body": "> with Google Cloud growing at 35%, it should continue to narrow the gap over the next 5 years\n\nThere is a mistrust to Google brand in general due to actions in consumer products and somewhat in cloud products too. You can't change product decisions constantly if you want to have brand confidence.\n\nUltimately it is not a big barrier but it means they have to work harder to get there.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqgdzq/",
      "created": 1730398599,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luqke8o",
      "score": 4,
      "body": "They apparently need to start offering free lottery tickets on Google search that give you a good chance of winning money.\n\n\nSeriously, it's just completely pathetic that a $2+ EPS just gets you a gap and fade and likely gap fill very soon just because every single news piece continues to whack the stock. In case y'all are wondering, if I can come up with a good tech alternative I like, I am starting to consider the possibility of closing out the position entirely if the stock can get over $200.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqke8o/",
      "created": 1730399854,
      "depth": 0,
      "replies": [
        {
          "id": "lur4kxm",
          "score": -7,
          "body": "PLTR. Wait until mid-$30’s for an entry. Stay for at least 3 years.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lur4kxm/",
          "created": 1730406259,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lusauur",
      "score": 2,
      "body": "Everyone else has said it already, but the two reasons for Google trading lower is due to the antitrust concerns, and AI competition from Perplexity/OpenAI hurting their Search. \n\nI think an interesting factor in their latest report is the United States revenue which grew 19% and is the country that had a full quarter with AI overviews. It's just 1 datapoint, but it implies things going well with the AI overviews over Search. \n\nI guess question 1 is, can Alphabet pivot/update Search to take advantage of AI rather than AI eating their Search? If Yes, then they can do very well! Question 2 is, will AI competitors like openAI/Perplexity get strong enough to hurt Google Search? Well, google having competition is not new... Because I like the idea that, anywhere in the internet where there is a Search bar, is competition for Google Search. That can be Amazon where consumers Search for what they want to buy. Or Gen Z Searching on tik tok instead of Google. Or searching on one of Metas platforms. Using any of these instead of Google Search, is competition for Alphabet. \n\nSo, if google can really improve and capitalize on Gemini and make it sticky with consumers, then even if it is not as good as Chatgpt, then they can still do very well.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lusauur/",
      "created": 1730421646,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvh292w",
      "score": 2,
      "body": ". I bought 100 share at 181 and it crashed.. It was a great valuation even then... I still think it's great.. But yeah in the short term, especially with the elections, it's bound to swing wildly",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lvh292w/",
      "created": 1730781309,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luqjemq",
      "score": 5,
      "body": "Google is probably the most undervalued out of all the big tech companies. With the way their earnings have been going I wouldn’t be surprised if their Forward P/E is in the mid teens right now. Their growth is insane. Obviously it’s not perfect and these are the reasons why I think the stock remains depreciated compared to its peers.  \n\n1. They just lost their case against the DOJ and have been identified by the government as a monopoly. Nobody knows the consequence’s going forward for this. \n\n2. In terms of rewarding shareholders they’re probably the worst. A lot of people are probably confused by this point as it looks like Google spends a lot on shareholders in the form of buybacks and dividends. \n\nIf we look at last year for example Google made about 101 billion dollars in operating cash flow. If we subtract the 22.4 billion in stock based compensation and 32.2 billion in Capex that basically eliminates half their cash flow right there that can spend in buybacks and dividends. \n\nNow lets compare that its peers for example Apple. Apple did about 110 billion dollars in operating cash flow. About 10.8 billion went to stock based comp and another 10.9 billion went to Capex. That leaves about 90 billion that Apple is going to give back shareholders. Microsoft was in the same situation as Apple a couple of years ago but last year they basically doubled their Capex. Microsoft has also dialed back the buybacks this year as well and to be fair it makes sense considering their stock is extremely overpriced. \n\nIf Google could cut back on the stock based comp and Capex and put more money towards their buybacks as well as continue to grow earnings and their cloud business at the current pace this stock could easily double from here.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqjemq/",
      "created": 1730399545,
      "depth": 0,
      "replies": [
        {
          "id": "luqlzpd",
          "score": 12,
          "body": "There’s a reddit trend lately to discount Google’s cashflow for their recent very increased CapEx, but you’re not giving them credit for increased returns in the future on that CapEx.\n\nGoogle have purposefully increased their CapEx more than necessary in order to become the compute leader. This is not merely defensive maintenance CapEx to maintain current earnings. You don’t just cut CapEx and grow the cloud like you’re suggesting… this is how you get the cloud growth.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqlzpd/",
          "created": 1730400357,
          "depth": 1,
          "replies": [
            {
              "id": "lurbp8x",
              "score": -3,
              "body": "That Reddit trend seems to be to ignore all the negatives and act like this company is perfect in every way. That seems to be more of the case based on the comments.",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurbp8x/",
              "created": 1730408581,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "luqsvik",
          "score": -4,
          "body": "None of this matters because search in 5 years won't be the same as now and Google won't hold a monopoly\n\nAnd you don't know what the % margin on ai ads will be compared to Traditional search\n\nYou are using historical financials to project the future for a sea change in the industry, incorrect thinking imo",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqsvik/",
          "created": 1730402523,
          "depth": 1,
          "replies": [
            {
              "id": "lurb8e6",
              "score": -2,
              "body": "The concept of looking at historical numbers to help see the future is part of the game in investing. I am not bearish on the stock and I even own shares but my god the amount of d**k sucking this sub does for this company is off the charts. Like you say one bad thing about this company and people get so emotional about it and they think the company can do no wrong and it’s all great. Yeah I guess none of what I said matters. Yet thats why the stock has underperformed its peers over the last year.",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurb8e6/",
              "created": 1730408424,
              "depth": 2,
              "replies": [
                {
                  "id": "lurhzxf",
                  "score": 4,
                  "body": "Because the financials are still top notch. Plus the argument that Search is getting sidelined is also complete nonsense. I see regards here all the time talking about how they use Craplexity or ChatGPT, when in reality, Reddit is a niche group of tech-savvy people (ish). Your avarage Joe Schmoe is still going to be using for years to come, simply because it's just part of our lives now. Plus DOJ is literally a joke, as a law student I can tell you that the arguments they have are literally just that Google is too good. It's a no brainer investment and honestly I'm debating going all in.",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurhzxf/",
                  "created": 1730410748,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lus3jp5",
                      "score": 0,
                      "body": "1. I never once said anything about their search engine. Their search engine is actually one of my bullish arguments so you’re kind of just yapping at air on that one.\n\n2. The DOJ won their case. If they didn’t have an argument they wouldn’t have won so I don’t know what you’re talking about. This isn’t another Microsoft/Apple cause both Microsoft and Apple won theirs. Google lost so clearly they had a case.",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lus3jp5/",
                      "created": 1730418823,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lurbuvg",
                  "score": -1,
                  "body": "Lol, my comment was bearish on the stock, I thought you were bullish",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurbuvg/",
                  "created": 1730408634,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lurfswa",
                      "score": 1,
                      "body": "I interpreted you saying Google won’t hold a monopoly in 5 years as a bullish statement.",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurfswa/",
                      "created": 1730409985,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "luqsa6b",
      "score": 1,
      "body": "!",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqsa6b/",
      "created": 1730402336,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luqye07",
      "score": 1,
      "body": "Google has started putting an AI result at the top of the search results for me. \n\nEven they admit \"ten blue links\" is over.\n\nAnd will their LLM be better than everyone else's? \n\nThey have a lot of momentum in search but imo this will break their monopoly.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqye07/",
      "created": 1730404279,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lur642d",
      "score": 1,
      "body": "Stocks don’t seem to make sense",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lur642d/",
      "created": 1730406754,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lurbv74",
      "score": 1,
      "body": "AI searches are stupid, and once you get into specialized terms/names, commonly used terms/names or foreign languages it just fails outright. \n\nI also I dont need google to spit out 50 results of the same webpage source just page 1 page 2 page 3, hell the summary of the page, the index of the page which is all of the same thing.\n\nMicrosoft is also doing the same damn thing too, the search results has been stupid in the last year.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lurbv74/",
      "created": 1730408637,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lursvkr",
      "score": 1,
      "body": "They just got sued for more money in the world. How will they ever financially recover?/s",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lursvkr/",
      "created": 1730414743,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lus4qtj",
      "score": 1,
      "body": "The monopoly point is precisely why it's not being turbo loaded. I think plenty are worried for a forced breakup. It's happened to companies in the past and had not too bad of an affect. But, still .makes a lot of investors have cold feet.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lus4qtj/",
      "created": 1730419286,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lus4ved",
      "score": 1,
      "body": "That is for sure.   Google made almost 2x what Apple made this quarter.  Yet Apple has a PE that is about 50% higher.\n\nGoogle made $29 billion and Apple $15 billion.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lus4ved/",
      "created": 1730419336,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lusglvw",
      "score": 1,
      "body": "Omg I have read this thread so many times. Ask yourself once what is Alphabet without search? Now factor that risk into the share price and move on with your life",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lusglvw/",
      "created": 1730423805,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lusialc",
      "score": 1,
      "body": "I'm with you on all of the positives, and GOOG is my largest position, but don't overlook the negatives.  Lots of competition and legal issues on the horizon could mute future earnings.  It's recommend to plan for the worst but hope for the best, stay conservative.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lusialc/",
      "created": 1730424443,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lusu9ci",
      "score": 1,
      "body": "17B in fcf. Could explode if they layoff 50k people which the cfo said might happen",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lusu9ci/",
      "created": 1730429169,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luswqgf",
      "score": 1,
      "body": "Not sure about being the only search engine in the US. Many countries Google is no longer popular.  Rarely looked at top half page which is all paid advertisements.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luswqgf/",
      "created": 1730430170,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lutgmbk",
      "score": 1,
      "body": "OpenAI just launched a competing search engine",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lutgmbk/",
      "created": 1730440766,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luufqt9",
      "score": 1,
      "body": "I asked Chatgpt to translate a Chinese webpage and it directed me to make use of Google translate. \n\nFunny. \n\nNah, Google is fine. Ultimately they will lose a chunk of their search market share because of the competition, but they have more things going on to offset it.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luufqt9/",
      "created": 1730463223,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luy76ql",
      "score": 1,
      "body": "Nah",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luy76ql/",
      "created": 1730508728,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luzqafk",
      "score": 1,
      "body": "I have ChatGPT plus. Changed default search engine to ChatGPT search, following Sam Altman tweet. After using it - it will stay that way.\n\nIf I don't find what I'm looking for, I just go to \"google.com\" and search it there.\n\nI no longer see tons of ads on top, mostly unrelated and with a tiny ad disclaimer. Google making lots their money from old people clicking on ads thinking it's a legitimate search result.\n\n\nThat's the main danger for Google. If 100 million people like me switch their default search engine to LLM based solutions, Google will crash.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luzqafk/",
      "created": 1730538488,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luzxwz0",
      "score": 1,
      "body": "Valuation matters; knowing what you’re buying can save you a lot of headaches. As Peter Lynch said, “Know what you own and why you own it”. At a surface level, Alphabet sounds like it has excellent potential. \n\nUnderstanding a company’s fair value is what sets the noobs and the sharps apart. \n\nThis [valuation investment tool](https://workspace.google.com/marketplace/app/stock_finance_pro/156572510618) offers insights that could help clarify things if you’re curious about assessing Alphabet’s fair value.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luzxwz0/",
      "created": 1730543713,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvfp81l",
      "score": 1,
      "body": "/u/Fountainheadusa what do you think of their Gemini AI offering and how it competes with other AIs like openAI, Copilot, and Groq? \n\nTheir search revenue grew 13% this quarter but if they don't keep up with Gemini, could they lose out?",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lvfp81l/",
      "created": 1730763789,
      "depth": 0,
      "replies": [
        {
          "id": "lvh0rlr",
          "score": 1,
          "body": "I thought Claude was slightly better than Gemini in my limited usage. 13% growth in search is good, given how big the company is. Like all the other Gen AI aspirants, they will have to work harder. The interesting thing about Google is the huge data advantage and ability to lower costs by scaling - AI tokens and retrieval are expensive, I believe Google is getting advantages of scale by continuously lowering this variable cost of AI data retrieval - that is a bit of a competitive advantage over the likes of OpenAI.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lvh0rlr/",
          "created": 1730780703,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvnp2pk",
      "score": 1,
      "body": "Dude besides ad rev, no one uses Google products besides search and Gmail. Their search is under huge threat via ais that will be embedded into device OS. Their search experience got its first face lift “ai overview” which is bullet points and summaries. Took open ai for them to that?? Lol \n\nThis company hasn’t innovated in years. \n\nThey’re not even a contender in enterprise data solutions, they’re around but be serious.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lvnp2pk/",
      "created": 1730872031,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luqttlx",
      "score": 1,
      "body": "An average PE or 21 means about a 5% return on investment. (Typically above inflation). \n\nWhile growth factors, most people want a 10% return on average. At some point all stocks have to achieve this and thus the average has to approach that. Will large companies sustain that growth over 20 years? Likely not. Simply is not enough market and PE ratios have to average around that 10 mark at some point.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqttlx/",
      "created": 1730402827,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lutnqjz",
      "score": 1,
      "body": "I don't know if you heard but Google is in the hole a decillion. Mother Russia owns it now.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lutnqjz/",
      "created": 1730445864,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luq5x8l",
      "score": -7,
      "body": ">It has a near monopoly in Search\n\n\nBeing a monopoly isn't a great bragging point when the government wants to break you up. \n\n\n>Market leadership in media with YouTube.\n\n\nThis is already part of their valuation.\n\n\n>A strong first-mover advantage with Waymo.\n\n\nThey aren't a first mover, and there's a lot of competition.\n\n\nI'm not saying Google isn't a great company, but I'm not seeing why you think they're going to be more profitable than expected.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luq5x8l/",
      "created": 1730395364,
      "depth": 0,
      "replies": [
        {
          "id": "luq8wig",
          "score": 28,
          "body": "With regards to Waymo, I do think they are first movers and leaders by a long shot.  I am curious what company you consider is and what is your rationale for it?",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luq8wig/",
          "created": 1730396280,
          "depth": 1,
          "replies": [
            {
              "id": "luqabql",
              "score": 21,
              "body": "Waymo is hands down the market leader at the moment in autonomous drive (Level 4 or above). It's not even close. Some will argue that their system is \"fenced-in\" but they are taking the smart gradual approach to avoid regulatory scrutiny. Last thing you want to do is create a system that causes the odd injury/death and facing lawsuits/headlines constantly. In the early days, Safety is paramount to get public trust. Waymo has very strong reviews/favorability in their regions they operate. From what I read from a Verge article, Waymo does have Level 5 intentions. [https://www.theverge.com/2024/10/30/24283516/waymo-google-gemini-llm-ai-robotaxi](https://www.theverge.com/2024/10/30/24283516/waymo-google-gemini-llm-ai-robotaxi)",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqabql/",
              "created": 1730396721,
              "depth": 2,
              "replies": []
            },
            {
              "id": "luqkbzj",
              "score": -2,
              "body": "Not OP, but IMO Google won't be seeing any kind of serious profits from Waymo anytime soon. If anything it'll continue to be a drain on their resources as they pump more into R&D and expanding it.\n\nIMO what Waymo is currently going for is just peanuts compared to the true profit that there will be in self driving vehicles. But the problem is that the other use cases won't really work until Waymo can drive you anywhere from the East coast to anywhere on the West coast. I think that the real profits long term aren't going to be in a robo-taxi business at all, but things like:\n\n* Ditching drivers in semi-trucks and just having robo-trucks haul cargo across the US. This alone could bring in such an absurd amount of money each year.\n\n* Replacing humans in last mile delivery services, so that a robo-van/truck can drive up to someone's else, and a drone can deliver the package to their porch. \n\n* Selling self driving vehicles to consumers as a convenience and safety feature. (IMO I remain deeply skeptical that robo-taxis can ever replace human drivers. Car culture is just too strong, and I've run the numbers, and I just don't see how a robotaxi could ever be cheaper than car ownership for the average American)",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqkbzj/",
              "created": 1730399834,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "luq9fqa",
          "score": 22,
          "body": "You couldn't be more wrong about Waymo not being a first mover. Waymo has been having cars drive around San Francisco for YEARS, and for over a year now they have been taking people on rides. You can download an app and order one just like an uber. What other company is even close to that?",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luq9fqa/",
          "created": 1730396446,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luqbsz9",
          "score": 8,
          "body": "Government has been wanting to break up MSFT and APPL as well, having a monopoly in search is not equivalent to being a monopoly. There are tons of competitors who are out there but the google branding is too strong. The worst case scenario out of this would be government saying google can’t pay apple 20 billion to make it default which would help their financials more than anything.\n\nIn what world is Waymo not a first mover and please list their competition",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqbsz9/",
          "created": 1730397171,
          "depth": 1,
          "replies": [
            {
              "id": "luqngii",
              "score": 2,
              "body": "Google saves $20Bn and Apple users still prefer Google/Chrome to Safari![gif](emote|free_emotes_pack|feels_good_man)",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqngii/",
              "created": 1730400818,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "luqel3o",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqel3o/",
          "created": 1730398029,
          "depth": 1,
          "replies": [
            {
              "id": "luqi2d8",
              "score": -6,
              "body": "No, but them having better self driving than Tesla doesn't give them first mover advantage ",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqi2d8/",
              "created": 1730399122,
              "depth": 2,
              "replies": [
                {
                  "id": "luqi7g1",
                  "score": 6,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqi7g1/",
                  "created": 1730399167,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "luqrtxr",
                      "score": -6,
                      "body": "In the \"We got there first\" funding from investors and government sense? Definitely Tesla.",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqrtxr/",
                      "created": 1730402193,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "luqcppv",
          "score": 1,
          "body": "I spend a lot of time on the self driving cars subreddit, and the vast majority of opinions there is that waymo is very far ahead of Cruz and Tesla. There was one post where the top voted comment said they were likely several years ahead.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqcppv/",
          "created": 1730397446,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "luqovum",
      "score": -2,
      "body": "Alphabet is facing serious antitrust lawsuits.\n\nWe see this posted every time. I don't understand reddit obsession with alphabet. Until the antitrust goes away it will have a depressed valuation. That's the entire explanation. They may end up with decades of trials, a judgment against them and then decades of more trials as people sue them for damages after they're found guilty. It could total in the hundreds of billions. \n\nProfessionals understand this. Redditors do not. Research how bad Microsofts antitrust was and what it did to the stock for 20 years.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqovum/",
      "created": 1730401257,
      "depth": 0,
      "replies": [
        {
          "id": "luqrzli",
          "score": 4,
          "body": "or they may be forced to spawn out into multiple companies, which will make the value of each individual branch be recognized by the market and generate a huge profit for those who owned GOOG before the split. I'm not into stock picking, but I still recognize the potential of GOOG at these prices. Only time can tell.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqrzli/",
          "created": 1730402242,
          "depth": 1,
          "replies": [
            {
              "id": "luqt1a5",
              "score": 1,
              "body": "Sure, that's the best case scenario. They'll still have to pay for damages foe all of the businesses they used monopoly power against, which could be an ENORMOUS sum",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqt1a5/",
              "created": 1730402574,
              "depth": 2,
              "replies": [
                {
                  "id": "lur9rby",
                  "score": 3,
                  "body": "Alphabet could pay the historically largest anti trust fine 150 times over with current cash.",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lur9rby/",
                  "created": 1730407939,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "luv8zf8",
                      "score": 1,
                      "body": "The fine isn't the issue, it's the 10,000 lawsuits from every business, individual, and ambulance chasing lawyer after you're found guilty.\n\nIn Microsoft case this was multiple $100million, $10million and $1 million lawsuits (those were 20 years ago, so multiple the numbers for today's values. Would not be surprised to see the first billion dollar judgments here) that they did have to settle, because they were indeed guilty.\n\nFurthermore at least in Microsofts case the trials continued for about 15 years after the verdict until they just stopped fighting it and settled everything without a fight. It is an enormous distraction for the company, it makes regulators continue scrutinizing them, and it forces them to keep an army of lawyers more than they otherwise would on their payroll.",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luv8zf8/",
                      "created": 1730473677,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "luqvh6i",
          "score": 1,
          "body": "This.\n\nThose lawsuits are a dark cloud above them. Could go different ways.",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqvh6i/",
          "created": 1730403358,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "luqaqf4",
      "score": -5,
      "body": "As a Google consumer they suck the valuation is fair.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqaqf4/",
      "created": 1730396846,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lusp0zz",
      "score": 0,
      "body": "Just lol. Everything is valued way too high because of how propped up the entire market is and people are making way more money than they deserve for how dumb they are. When the next correction happens it's going to be a bloodbath for the self proclaimed traders",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/lusp0zz/",
      "created": 1730427055,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luttsae",
      "score": 0,
      "body": "It doesn't.\n\nIt reflects poor management and execution the past decade and little confidence going forward.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luttsae/",
      "created": 1730450351,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luu94ga",
      "score": 0,
      "body": "Nope, it's a shit stock.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luu94ga/",
      "created": 1730460052,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luqge4j",
      "score": -3,
      "body": "Only time will tell but I believe Google's search is at a big risk. The new AI assistants - the likes of Chatgpt, PerplexityAI, MetaAI, others) - will certainly lessen Google's search market share. To what extent, is hard to quantify at this time but it's downhill for Google from here on.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqge4j/",
      "created": 1730398601,
      "depth": 0,
      "replies": [
        {
          "id": "luvcbbd",
          "score": 1,
          "body": "I use chatgpt for search",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luvcbbd/",
          "created": 1730474748,
          "depth": 1,
          "replies": [
            {
              "id": "luvgq7s",
              "score": 2,
              "body": "I use Meta AI search and found to be quite useful. (not a fan of facebook or instagram but they seem to have done a good work on their LLMs).",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luvgq7s/",
              "created": 1730476139,
              "depth": 2,
              "replies": [
                {
                  "id": "luwxawg",
                  "score": 2,
                  "body": "Nice.  Will check it out",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luwxawg/",
                  "created": 1730492629,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "luvg690",
              "score": 1,
              "body": "Through their app or on desktop? Are the search results comparable to Google search engine?",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luvg690/",
              "created": 1730475965,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luqb50e",
      "score": -8,
      "body": "No it doesn't\n\nThey are the next yahoo\n\nSearch is going to fundamentally change and their monopoly will be broken\n\nYou just aren't thinking long term enough\n\nI use Claude LLM just as much if not more than Google now",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqb50e/",
      "created": 1730396969,
      "depth": 0,
      "replies": [
        {
          "id": "luusmlt",
          "score": 1,
          "body": "Lol",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luusmlt/",
          "created": 1730468263,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "luq8wj8",
      "score": -7,
      "body": "So much of their recent products have been crap though. I'd rather invest in something that I feel has growth.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luq8wj8/",
      "created": 1730396281,
      "depth": 0,
      "replies": [
        {
          "id": "luq9fbc",
          "score": 3,
          "body": "Google isn't growing enough for you?",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luq9fbc/",
          "created": 1730396442,
          "depth": 1,
          "replies": [
            {
              "id": "luqaa1y",
              "score": -3,
              "body": "They can grow, I just don't believe in their new products. Therefore I don't want my dollars marching for Google",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqaa1y/",
              "created": 1730396706,
              "depth": 2,
              "replies": [
                {
                  "id": "luqah0v",
                  "score": 5,
                  "body": "You don't use Google search? You'd be the first guy I know who doesn't",
                  "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqah0v/",
                  "created": 1730396766,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "luqofyw",
                      "score": 2,
                      "body": "Hardly- I haven’t touched google search in years. Originally switched to DuckDuckGo, as part of some general effort to improve privacy, decrease tracking, etc. Gave up on that eventually, but kept using Duck because the search results honestly seem better. Google search is just populated by ads and SEO’d articles - you’ve pretty much gotta add “Reddit” to the end to get real, human generated results.",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqofyw/",
                      "created": 1730401119,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "luqam3f",
                      "score": 0,
                      "body": "I see it as a declining asset. I don't use it nearly as much as I used to.",
                      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqam3f/",
                      "created": 1730396809,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "luqcvee",
                          "score": 5,
                          "body": "Gmail? Google drive? Google maps? Yt?",
                          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqcvee/",
                          "created": 1730397495,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "luqzsbx",
      "score": -1,
      "body": "I need to know how many searches on Google are actually questions, because if it’s more than about 25%, I’m not touching it, nor should anyone else who has used ChatGPT.\n\nAlso, I feel this company is becoming the next IBM or Intel - instead of innovating, they’re increasing revenues the wrong way by decreasing user experience and demanding payment for what used to be free levels of quality.",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqzsbx/",
      "created": 1730404723,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luqcs40",
      "score": -5,
      "body": "They have always lagged the other big tech stocks in valuation. Now with the legal issues pending, AI taking market share from search and no real way to monetize their AI why should GOOGL have a higher valuation?",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqcs40/",
      "created": 1730397467,
      "depth": 0,
      "replies": [
        {
          "id": "luqf4gu",
          "score": 8,
          "body": "but there search revenue is growing?",
          "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqf4gu/",
          "created": 1730398199,
          "depth": 1,
          "replies": [
            {
              "id": "luqlqsh",
              "score": -3,
              "body": "Revenue is growing at 12% from search, but that could also be driven by price increases. The number of searches will decline over the next few years IMO due to AI searches. But you never know, maybe they figure it out and leverage AI. Personally, I'm not so sure... but that's what makes a market.",
              "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqlqsh/",
              "created": 1730400279,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luqh1mo",
      "score": -4,
      "body": "I sold at $179, and took a $200 profit. TEPID is how I would describe GOOGL",
      "permalink": "/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/luqh1mo/",
      "created": 1730398804,
      "depth": 0,
      "replies": []
    }
  ]
}