{
  "title": "Amazon Announces Q3 FY24 Earnings: Beats in Retails, Meets in AWS, Strong Guidance",
  "score": 313,
  "selftext": "Amazon Earnings: https://www.businesswire.com/news/home/20241030305950/en/Amazon.com-Announces-Third-Quarter-Results\n\nSEATTLE--(BUSINESS WIRE)--Amazon.com, Inc. (NASDAQ:AMZN) today announced financial results for its third quarter ended September 30, 2024.\n\nNet sales increased 11% to $158.9 billion in the third quarter, compared with $143.1 billion in third quarter 2023. \n\nExcluding the $0.2 billion unfavorable impact from year-over-year changes in foreign exchange rates throughout the quarter, net sales increased 11% compared with third quarter 2023.\n\nNorth America segment sales increased 9% year-over-year to $95.5 billion.\n\nInternational segment sales increased 12% year-over-year to $35.9 billion.\n\nAWS segment sales increased 19% year-over-year to $27.5 billion.\n\nOperating income increased to $17.4 billion in the third quarter, compared with $11.2 billion in third quarter 2023.\n\nNorth America segment operating income was $5.7 billion, compared with operating income of $4.3 billion in third quarter 2023.\n\nInternational segment operating income was $1.3 billion, compared with an operating loss of $0.1 billion in third quarter 2023.\n\nAWS segment operating income was $10.4 billion, compared with operating income of $7.0 billion in third quarter 2023.\n\nNet income increased to $15.3 billion in the third quarter, or $1.43 per diluted share, compared with $9.9 billion, or $0.94 per diluted share, in third quarter 2023.\n\nOperating cash flow increased 57% to $112.7 billion for the trailing twelve months, compared with $71.7 billion for the trailing twelve months ended September 30, 2023.\n\nFree cash flow increased to $47.7 billion for the trailing twelve months, compared with $21.4 billion for the trailing twelve months ended September 30, 2023.\n\nFree cash flow less principal repayments of finance leases and financing obligations increased to $44.9 billion for the trailing twelve months, compared with $15.9 billion for the trailing twelve months ended September 30, 2023.\n\nFree cash flow less equipment finance leases and principal repayments of all other finance leases and financing obligations increased to $46.1 billion for the trailing twelve months, compared with $20.2 billion for the trailing twelve months ended September 30, 2023.",
  "link_flair_text": "Company News",
  "id": "1ggnqgd",
  "num_comments": 72,
  "created_utc": 1730405185,
  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/",
  "comments": [
    {
      "id": "lur4ifp",
      "score": 84,
      "body": "The margin expansion is pretty amazing for the company of Amazon’s size. The huge spending in 2020-2022 which made the EPS trash during high inflation seem to be paying off. This looks to be going above $200 again.",
      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur4ifp/",
      "created": 1730406235,
      "depth": 0,
      "replies": [
        {
          "id": "lur8zfc",
          "score": -34,
          "body": "$200 was the absolute ATH before the Bezos Wall of selling hit the stock. Unfortunately he isn’t done selling, everybody knows it and doesn’t want to touch it near the $200 mark. They will need a strong catalyst to push it over $200. that report was great, but not the strong catalyst this stock needs. A buyback program would be a great way.",
          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur8zfc/",
          "created": 1730407684,
          "depth": 1,
          "replies": [
            {
              "id": "lusgeoe",
              "score": 9,
              "body": "It was their shitty q3 earnings that tanked it in the summer, not Bezos",
              "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lusgeoe/",
              "created": 1730423730,
              "depth": 2,
              "replies": [
                {
                  "id": "luthijw",
                  "score": -4,
                  "body": "Yeah you guys can all down vote me, that only shows that you have no idea what you talking about. The stock hit $200 at the beginning of July. Bezos sold and tanked the stock back to the 180s. The earnings report followed 1st August. And that second heavy drop was related to a mixed earnings but mainly to the Japan carry trade hysteria.\n\nDo your DD.",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/luthijw/",
                  "created": 1730441390,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lutiqtb",
                      "score": 5,
                      "body": "You’re being downvoted because you don’t make any sense. Bezos sold a bunch of his shares after the Q1 report when the price was 180. According to your logic the stock price should have never been higher… yet a few months later it increased by more than 10%",
                      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lutiqtb/",
                      "created": 1730442249,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "luu4ds3",
                      "score": 3,
                      "body": "Amazon averages roughly 37M shares traded daily. Bezos selling a million or two shares isn’t doing that much.",
                      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/luu4ds3/",
                      "created": 1730457437,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lur2rsf",
      "score": 158,
      "body": "Glad I’m a shareholder",
      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur2rsf/",
      "created": 1730405676,
      "depth": 0,
      "replies": [
        {
          "id": "lur730e",
          "score": 45,
          "body": "Hopefully Amazon will soon be the \"why didn't I buy it back then\" stock.",
          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur730e/",
          "created": 1730407067,
          "depth": 1,
          "replies": [
            {
              "id": "lur9dwt",
              "score": 100,
              "body": "You may be a bit late to that bud.",
              "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur9dwt/",
              "created": 1730407817,
              "depth": 2,
              "replies": [
                {
                  "id": "lurk4zu",
                  "score": 17,
                  "body": "Yeah. 2001 - 2013 was the best time frame is buy, apparently. I wish I knew about the stock market when I graduated HS back in 09'.",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurk4zu/",
                  "created": 1730411501,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "luu2foz",
                      "score": 3,
                      "body": "I joined Amazon in 2013 and two years later sold all my RSUs once they vested. Used the funds for a down payment on a condo. \n\nIf only I had held off…. 100 shares… Instead of paying a mortgage I’d be in a paid off condo.",
                      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/luu2foz/",
                      "created": 1730456267,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lurijxm",
                  "score": 5,
                  "body": "I completely agree, even though I have a huge And I’m not selling until or if it becomes the most valuable company in the world. \n\nThat would mean a two bagger, which Is obviously not like changing. \n\nHowever, I do think that eventually this could be an amazing dividend payer With a large enough position today",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurijxm/",
                  "created": 1730410943,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lurjyg7",
                      "score": 7,
                      "body": "Why didn’t I buy more in 2022-2023 should be the topic. Period of $85-100 for a few months which was 2018-2020 levels not even accounting for inflation.",
                      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurjyg7/",
                      "created": 1730411436,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lus1xdj",
                          "score": 3,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lus1xdj/",
                          "created": 1730418198,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lus5ynw",
                              "score": 1,
                              "body": "That’s awesome! I sold off my 2020-2021 shares at a smaller gain and kept my 2022 DCA shares and have been rewarded well. You must be killing it!",
                              "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lus5ynw/",
                              "created": 1730419763,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lurlapx",
                  "score": 2,
                  "body": "I ain’t, most are.",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurlapx/",
                  "created": 1730411910,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lv8a1pg",
              "score": 1,
              "body": "For amazon to go up even 50x, in real terms, it would have to become more valuable than half of the total value of all publicly traded financial assets.",
              "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lv8a1pg/",
              "created": 1730663034,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lurg7zg",
          "score": 1,
          "body": "Me too, even though I bought in precisely before it dipped below $190 and have been holding it at a loss ever since...until now.",
          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurg7zg/",
          "created": 1730410131,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lur4hvw",
      "score": 83,
      "body": "Operating income up 57% with sales up 11% - is AMZN finally turning on the cash gusher? \n\nIf they announce a buyback or dividend, I think this is going to skyrocket. My #2 position",
      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur4hvw/",
      "created": 1730406230,
      "depth": 0,
      "replies": [
        {
          "id": "lur56fx",
          "score": 31,
          "body": "Andy Jassy is essentially Tim Cook. So I expect their stock price grows faster than their innovation",
          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur56fx/",
          "created": 1730406452,
          "depth": 1,
          "replies": [
            {
              "id": "lur7l9v",
              "score": 69,
              "body": "Number of people who parrot this “Apple is not innovating!” Line is ridiculous.\n\n“Innovation” is not always throwing a flashy new thing into your arm. Apple’s innovation has been incredible behind the scenes and most people who aren’t technical do not realise it.\n\nEven then, interms of products, since Tim Cook led the company, Apple had launched wildly successful products. AirPods have become the largest selling EarPod/headphone in the world. Not just Bluetooth headphone, largest selling music listening device *of any kind* in the world.\n\nThey launched Apple Watch which is set the benchmark for what a wearable can do. It is the largest selling watch of any kind in the world. Not just largest selling smart watch, it’s the largest selling watch of any kind. Doing that at that price point is incredible. And they have been innovating non stop on that platform. First ECG on a watch, first FDA approved ECG on a watch, first FDA cleared Spo2 on a watch (to this day only one which has met FDA bar), recently launched FDA approved arterial fibrillation detection, FDA approved sleep apnea detection. On and on. This is incredible innovation, no other competitor is anywhere near all this. \n\n\nApple’s biggest innovation has been ditching intel and creating their own M series chips that have insane performance at a fraction of the power. If M series chips were a company by themselves they would be one of the most innovative semiconductor companies in the world. There is nothing in the windows ecosystem that can match it. Companies that have been making semis for decades aren’t able to beat apple, who started making semis recently. Qualcomm’s latest chip kind of matches M series from 4 years back. \n\nToday a $900 iPad with m series chip has better performance than any windows laptop under $2500. Read that again. All of that is possible because of M series chips that Apple has created.\n\n\nIt’s ridiculous to say these companies don’t innovate just because you don’t see new shiny products. Engineering is a lot of innovation behind the scenes.\n\nAmazon recently launched a new AI delivery routing algorithm that reduces truck driving by 30 mins a day. Most people who don’t understand tech will not pay attention to it. Now multiply it by the number of trucks and how much they pay drivers per hour, how many drivers are there, that little innovation alone is expected to save Amazon $1.2 billion a year. That’s half of openAI’s revenue last year. \n\nIts ridiculous to make blanket statements that say these companies aren’t innovating",
              "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur7l9v/",
              "created": 1730407232,
              "depth": 2,
              "replies": [
                {
                  "id": "lurcwoe",
                  "score": 17,
                  "body": "> Apple Watch\n\nJust want to add. Their new feature for the airpods pro 2 to help people with mild to moderate hearing loss, effectively acting as a hearing aid is really cool. It's one of those examples that made me think \"wow, this is how tech makes our lives easier\". It doesn't have the battery life of a normal hearing aid, yeah. But it's still awesome.",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurcwoe/",
                  "created": 1730408989,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lur95c0",
                  "score": 8,
                  "body": "Who said they don’t innovate. I said their stock price grows faster than innovation\n\nWhat Tim Cook did is control the speed of innovation to maximize the profit",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur95c0/",
                  "created": 1730407739,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lurd2vs",
                  "score": 7,
                  "body": "A lot of this is incremental improvement on existing products and not what I would call a beacon of innovation. Smart watches, bluetooth headphones. The incremental improvements they've made on these products that already existed are very nice but not screaming innovation. What Apple does very well is integrate their products into their hardware and services ecosystem which is what really drives sales. M series chips are based on ARM and made by TSMC. Again, nice technology and integrates well with their products but not particularly innovative. Innovation is creating an entirely new product category and introducing something new to the market.",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurd2vs/",
                  "created": 1730409048,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lurmdxu",
                      "score": 4,
                      "body": "Innovation is ALWAYS based on what exists before that. It's always some way of improvement.",
                      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurmdxu/",
                      "created": 1730412310,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lurmjyr",
                          "score": 1,
                          "body": "I agree but there are obviously levels to innovation that we can talk about. Radical and disruptive innovation is not the same thing as incremental product improvement which everyone does.",
                          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurmjyr/",
                          "created": 1730412372,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lurn3qd",
                              "score": 0,
                              "body": "Radical and disruptive are very subjective terms. There are extreme examples that most people will agree with, but the rest is very subjective.\n\nWith time it might become more obvious, but I don't think enough time has passed here :)",
                              "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurn3qd/",
                              "created": 1730412576,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "luro0n2",
                                  "score": 2,
                                  "body": "I agree it's all subjective. By the most literal definition you can claim every and any feature added to an existing product by an engineer is innovation. By this definition every single tech company innovates. So we are obviously trying to delineate between the levels of innovation here. Who are the best innovators. There are entirely new categories of products like Google Waymo, Nvidia AI data center GPUs, OpenAI ChatGPT, SpaceX Starlink that are clearly far more innovative then improvements on existing products.",
                                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/luro0n2/",
                                  "created": 1730412917,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lurok1s",
                                      "score": -2,
                                      "body": "By definition, any feature added to an existing product by an engineer is an incremental improvement too.\n\nI agree it makes sense to differentiate, but the fine line is really fine. The extremes are easier, the rest is very subjective.",
                                      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurok1s/",
                                      "created": 1730413116,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lurgg2w",
                      "score": 1,
                      "body": "I suggest you look up the definition of innovation as you are incorrect. You are wildly overvaluing one aspect of innovation while ignoring the others.",
                      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurgg2w/",
                      "created": 1730410209,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "luri6ys",
                          "score": 5,
                          "body": "**Innovation:** a new idea, method, or device.\n\nCertainly there are levels to the concept of innovation. Taking a new material from a vendor and being the first to use it in a new application like a phone screen could be called an innovation. When most people talk about innovation they aren't talking normal engineering and incremental product improvement. Every product can be called an innovation at that point because an engineer created something out of nothing. Adding any new feature to an existing product can be called an innovation. But if you're just creating new iterations of existing products with incremental improvements that's not particularly innovative. \n\nI get your point but most people are talking about disruptive innovation in the context of tech companies. New product categories like Google Waymo or AlphaFold, OpenAI ChatGPT chatbot, Nvidia AI data center GPUs, SpaceX Starlink internet constellation, etc.",
                          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/luri6ys/",
                          "created": 1730410817,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lurgadd",
                  "score": 3,
                  "body": "Strong iterator, weak innovator.",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurgadd/",
                  "created": 1730410154,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lurtd36",
                      "score": 2,
                      "body": "Put evolution above revolution to squeeze every dollar",
                      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurtd36/",
                      "created": 1730414926,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lurctog",
                  "score": 2,
                  "body": "People expect Apple to release a life changing device every year basically.",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurctog/",
                  "created": 1730408961,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lure3jx",
                  "score": 1,
                  "body": "My 10 year old macbook cant even play twitch on 480p\n\nI need a new laptop",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lure3jx/",
                  "created": 1730409397,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lurtm8u",
                  "score": 1,
                  "body": "Good argument",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurtm8u/",
                  "created": 1730415023,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "luu8sff",
                  "score": 1,
                  "body": "> Qualcomm’s latest chip kind of matches M series from 4 years back.\n\nQualcomm Snapdragon X elite chips are one of the biggest [failures](https://www.jeffgeerling.com/blog/2024/qualcomm-cancels-snapdragon-dev-kit-refunds-all-orders)",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/luu8sff/",
                  "created": 1730459881,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "luuar77",
                  "score": 1,
                  "body": "Apple is not expanding categories. That's what people mean when they say they aren't innovating.",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/luuar77/",
                  "created": 1730460880,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lurg919",
              "score": 2,
              "body": "Agree with this, I think about it all the time. Jassy is just going to turn them into a boring cash cow. They’re gonna hit $1T in revenues this decade. Even if margins remain thin due to retail business you’re still looking at like $100b in free cash flow each year.",
              "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurg919/",
              "created": 1730410141,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lur4vmu",
          "score": 1,
          "body": "Operating leverage goes crazy but this is also my second largest position but contending to be first with Alphabet.",
          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur4vmu/",
          "created": 1730406357,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lur330r",
      "score": 35,
      "body": "This looks like a good quarter to me. \n\nEdit: slowing YoY revenue growth for Advertising and 3rd party services vs prior quarter's YoY. 3rd party went from 13% to 10%. And advertising went from 20% to 19%. Not awful but not the preferred direction since they are higher margin than the retail side. \n\nAWS still growing at 19% is great though.",
      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur330r/",
      "created": 1730405774,
      "depth": 0,
      "replies": [
        {
          "id": "lur5oxi",
          "score": 17,
          "body": "20% to 19% is growth rate drop, right? So if I went from 100 to 120 (20%) and 120 to 142.8 (19%), I still grew by 2.8 more this year than last year. Or is that a different number.",
          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur5oxi/",
          "created": 1730406619,
          "depth": 1,
          "replies": [
            {
              "id": "lur6h6h",
              "score": 1,
              "body": "It does show Advertising has slowing revenue growth. Looking at the YoY growth for Advertising across the past 6 quarters shows it is slowing down. It was 26% growth back in their Q4 2023 quarter. \n\nThey're still growing very well though. I'm happy to be a shareholder.",
              "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur6h6h/",
              "created": 1730406872,
              "depth": 2,
              "replies": [
                {
                  "id": "luri6yv",
                  "score": 4,
                  "body": "Not really, as I said, you have to see what percentage you are taking of. 20% of 100 is less growth than 19% of 120. If you are using growth rate YoY, you have to use same base for it to be meaningful.",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/luri6yv/",
                  "created": 1730410817,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lur6v2u",
      "score": 32,
      "body": "My entire 401k is Amazon. It will be 300 in \\~2 years",
      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur6v2u/",
      "created": 1730406998,
      "depth": 0,
      "replies": [
        {
          "id": "lurq3he",
          "score": 14,
          "body": "Huge gamble but honestly love it. I’ve been huge bull on Amazon last 5 years. It’s my single largest individual stock holding but don’t have the balls to make it my whole 401k. \n\nI should add more to my position I love Amazon",
          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurq3he/",
          "created": 1730413693,
          "depth": 1,
          "replies": [
            {
              "id": "lurww29",
              "score": 9,
              "body": "Yeah it’s definitely a gamble, but I think as far as individual stocks go it’s about as safe as you can get because their business is so diverse. \n\nI have my own reasons for being bullish. I work at Microsoft in Azure, so I’m more connected to the industry than most and know the AWS business pretty well. \n\nTo me what it boils down to is market caps, I don’t think Amazon should be 2 trillion and Microsoft 3. I think they are much closer, and I also think AWS is a better platform. Also I think RTO is going to ramp up productivity for them. It’s little things like that, that can make a little difference.\n\nPlus I think Amazon has some more growth avenues, they’re getting into the medical industry and robotics as well.\n\nI also applied that logic to Reddit. I knew they were poaching a lot of directors and higher ups from other FAANG’s and seeing how popular the platform is in comparison to their market cap, it seemed like a no brainer. Especially with how lucrative the ad industry is and how poor Reddit’s ads are. I knew it was a matter of time and would be easy to improve them and it showed up in their earnings.\n\nMost recently I rode Baba to 110 from 70. Up really good this year. Just holding Amazon and Reddit for now.\n\nIf I rode my convictions with options I would be able to retire now, but I don’t have those kind of balls lol",
              "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurww29/",
              "created": 1730416272,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lus4cc7",
          "score": 9,
          "body": "Amazon is practically an ETF at this point. When the CapEx cycle settles and we get a buyback announcement it's going to fit into its valuation very quickly and we will see a p/E compression.",
          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lus4cc7/",
          "created": 1730419130,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lus5eb4",
          "score": 3,
          "body": "I don't understand why it isn't there now.",
          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lus5eb4/",
          "created": 1730419544,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luuumv1",
          "score": 2,
          "body": "Let's just see it get to 200 and hold that level. Seems like this stock can't break through that resistance. It has been knocking up against it for years.",
          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/luuumv1/",
          "created": 1730468956,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luuxobr",
          "score": 1,
          "body": "How do you do that? With my 401k I can only pick among options, rn it's all in the sp500.",
          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/luuxobr/",
          "created": 1730469987,
          "depth": 1,
          "replies": [
            {
              "id": "luv0n1s",
              "score": 1,
              "body": "It depends on your broker, with Fidelity I followed a tutorial. You basically open like a sub account within your retirement account and transfer your money to the new sub account and it’s a regular stock account now",
              "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/luv0n1s/",
              "created": 1730470970,
              "depth": 2,
              "replies": [
                {
                  "id": "luvolqr",
                  "score": 1,
                  "body": "Oh, personal investment and Roth ira are with fidelity but 401k is with BlackRock.",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/luvolqr/",
                  "created": 1730478626,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lurb64t",
          "score": 0,
          "body": "I wish",
          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurb64t/",
          "created": 1730408403,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lur3ivg",
      "score": 7,
      "body": "Oh that’s spooky",
      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur3ivg/",
      "created": 1730405916,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lur6kx8",
      "score": 10,
      "body": "I enjoy when my shares go up",
      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur6kx8/",
      "created": 1730406906,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lureac2",
      "score": 4,
      "body": "Seems they are focusing on FCF/operating income.\n\nWonder what they will do, buy backs or divs.\n\nI doubt they can buy another company with FTC.",
      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lureac2/",
      "created": 1730409461,
      "depth": 0,
      "replies": [
        {
          "id": "lus1wfk",
          "score": 3,
          "body": "I’d rather they do massive buy backs but I also wouldn’t mind a small dividend and grow it in the 8-10% range.",
          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lus1wfk/",
          "created": 1730418188,
          "depth": 1,
          "replies": [
            {
              "id": "lus203g",
              "score": 1,
              "body": "Same, either have zero debt or buy backs to balance share based comp.",
              "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lus203g/",
              "created": 1730418226,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lurv4sp",
          "score": 2,
          "body": "They couldn’t even buy iRobot. Leena Khan got her job due to her Amazon study. If Trump wins it’ll be just as bad for them since he hates that Bezos owns the Post. I foresee them keeping a low profile over the next 4 years.",
          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurv4sp/",
          "created": 1730415598,
          "depth": 1,
          "replies": [
            {
              "id": "lurztnj",
              "score": 1,
              "body": "Yup, Apple is keeping a low profile as well.",
              "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurztnj/",
              "created": 1730417387,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lutm80u",
      "score": 3,
      "body": "After too long trying to be smarter than the market I capitulated to a degree, especially on companies like Amazon. One can hem and haw all they want about how 'expensive' these stocks are but they're run by the smartest people in the world, all working every day to make the company better, more integral in our lives. Not putting your hat in the ring with them, at least to some degree, is silly. I'm glad I bought the August dip in Amazon, Alphabet, and Nvidia. Will look to add to Microsoft soon.",
      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lutm80u/",
      "created": 1730444750,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lur6q7b",
      "score": 9,
      "body": "Rev beat, earnings beat, margin beat, OCF and FCF mooning. The conference call in 30 minutes should be interesting, but assuming non-farm payrolls are good tomorrow, I wouldn't be surprised to see this get past $200 tomorrow and $220+ by EOY. Their biggest risk is a blue sweep, which will massively empower the FTC/DOJ and Kahn already has AMZN in her crosshairs. If we get gridlock or a red sweep, this might be $400 next year.",
      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lur6q7b/",
      "created": 1730406954,
      "depth": 0,
      "replies": [
        {
          "id": "lurvi3u",
          "score": 1,
          "body": "I’m a huge Amazon bull but they’re way too mature now to double in a year. Not as much cheap money anymore to pump their multiple and drive consumer spending, plus antitrust risk. I’m happy with 20% cagr now.",
          "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurvi3u/",
          "created": 1730415741,
          "depth": 1,
          "replies": [
            {
              "id": "lurzfhf",
              "score": 4,
              "body": "They've significantly lagged the market. Price hasn't moved much from the late 2020 and 2021 range despite consistently improving fundamentals in their juiciest segments, advertising and AWS. PEG of 0.72 so plenty of room for multiple expansion if they keep up with earnings reports like this one. The most amazing part is their OCF and FCF growth which is just going bonkers.",
              "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurzfhf/",
              "created": 1730417238,
              "depth": 2,
              "replies": [
                {
                  "id": "lus0cii",
                  "score": 1,
                  "body": "Yeah they overspent at the start of the pandemic and then got hammered by interest rates in 2022. I’m a believer but just don’t think they will go back to pre-pandemic multiples.",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lus0cii/",
                  "created": 1730417589,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lus1m5q",
                  "score": 1,
                  "body": "And eventually like any mature company they’ll turn that massive FCF they have been building from their operating businesses into buybacks and dividends. Big W for the patient investor, just wish I had more.",
                  "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lus1m5q/",
                  "created": 1730418079,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lurjpox",
      "score": 1,
      "body": "Why is it too late to buy options when the market is still open?",
      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lurjpox/",
      "created": 1730411350,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lutvegw",
      "score": 1,
      "body": "I bought calls yesterday amid the selloff. Good.",
      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/lutvegw/",
      "created": 1730451539,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luu673q",
      "score": 1,
      "body": "Economy is strong it turns out",
      "permalink": "/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/luu673q/",
      "created": 1730458473,
      "depth": 0,
      "replies": []
    }
  ]
}