{
  "title": "Apple Q4 FY24 Earnings: Meets Targets, Record Install Base, Slight Misses on Services, China",
  "score": 140,
  "selftext": "Apple Earnings: https://investor.apple.com/investor-relations/default.aspx\n\nCUPERTINO, Calif.--(BUSINESS WIRE)--Apple® today announced financial results for its fiscal 2024 fourth quarter ended September 28, 2024. The Company posted quarterly revenue of $94.9 billion, up 6 percent year over year, and quarterly diluted earnings per share of $0.97. Diluted earnings per share was $1.64,1 up 12 percent year over year when excluding the one-time charge recognized during the fourth quarter of 2024 related to the impact of the reversal of the European General Court’s State Aid decision.\n\n“Today Apple is reporting a new September quarter revenue record of $94.9 billion, up 6 percent from a year ago,” said Tim Cook, Apple’s CEO. “During the quarter, we were excited to announce our best products yet, with the all-new iPhone 16 lineup, Apple Watch Series 10, AirPods 4, and remarkable features for hearing health and sleep apnea detection. And this week, we released our first set of features for Apple Intelligence, which sets a new standard for privacy in AI and supercharges our lineup heading into the holiday season.”\n\n“Our record business performance during the September quarter drove nearly $27 billion in operating cash flow, allowing us to return over $29 billion to our shareholders,” said Luca Maestri, Apple’s CFO. “We are very pleased that our active installed base of devices reached a new all-time high across all products and all geographic segments, thanks to our high levels of customer satisfaction and loyalty.”\n\nApple’s board of directors has declared a cash dividend of $0.25 per share of the Company’s common stock. The dividend is payable on November 14, 2024 to shareholders of record as of the close of business on November 11, 2024.\n\nApple will provide live streaming of its Q4 2024 financial results conference call beginning at 2:00 p.m. PT on October 31, 2024 at apple.com/investor/earnings-call. The webcast will be available for replay for approximately two weeks thereafter.",
  "link_flair_text": "Company News",
  "id": "1ggoca5",
  "num_comments": 88,
  "created_utc": 1730406782,
  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/",
  "comments": [
    {
      "id": "lur678g",
      "score": 1,
      "body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lur678g/",
      "created": 1730406783,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lur7myk",
      "score": 62,
      "body": "* **EPS**: $1.64, adjusted, versus $1.60 estimated \n* **Revenue**: $94.93 billion vs. $94.58 billion estimated \n* **iPhone revenue**: $46.22 billion vs. $45.47 billion estimated \n* **Mac revenue**: $7.74 billion vs. $7.82 billion estimated \n* **iPad revenue**: $6.95 billion vs. $7.09 billion estimated \n* **Other Products revenue**: $9.04 billion vs. $9.21 billion estimated \n* **Services revenue**: $24.97 billion vs. $25.28 billion estimated \n* **Gross margin:** 46.2% vs. 46.0% estimated \n\nSource: [https://www.cnbc.com/2024/10/31/apple-aapl-q4-earnings-report-2024.html](https://www.cnbc.com/2024/10/31/apple-aapl-q4-earnings-report-2024.html)",
      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lur7myk/",
      "created": 1730407247,
      "depth": 0,
      "replies": [
        {
          "id": "lurat5g",
          "score": 41,
          "body": "Services miss is concerning because it's been slowing down for a while",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurat5g/",
          "created": 1730408284,
          "depth": 1,
          "replies": [
            {
              "id": "lutu8e4",
              "score": 2,
              "body": "Won’t it drop off a cliff now since the most of that was the money google paid to them which they now have to stop",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lutu8e4/",
              "created": 1730450679,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lusk9p8",
              "score": -11,
              "body": "It’s an everything miss except for iPhones… Apple is stumbling and is about to trip and fall on its face.",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lusk9p8/",
              "created": 1730425204,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lur9h8x",
      "score": 79,
      "body": "Thank you Tim Apple",
      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lur9h8x/",
      "created": 1730407848,
      "depth": 0,
      "replies": [
        {
          "id": "luraasj",
          "score": 38,
          "body": "As a shareholder since 2006, I agree. Thank you Tim for making me wealthy.",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/luraasj/",
          "created": 1730408116,
          "depth": 1,
          "replies": [
            {
              "id": "lut5kpg",
              "score": 7,
              "body": "lucky fuck",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lut5kpg/",
              "created": 1730434298,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lurlolz",
          "score": -7,
          "body": "You think it will keep on rising?",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurlolz/",
          "created": 1730412049,
          "depth": 1,
          "replies": [
            {
              "id": "lus44f8",
              "score": 5,
              "body": "Probably not, the stock is very pricey. I am more of a fan of Google right now than the rest of the big tech companies. However Apple has a moat, huge brand, and it makes mountains of cash so they got that going for them.",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lus44f8/",
              "created": 1730419045,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lur7gdh",
      "score": 67,
      "body": "Soft beat by Apple considering the valuation. This stock is priced for big growth. \n\nI think it sinks.",
      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lur7gdh/",
      "created": 1730407188,
      "depth": 0,
      "replies": [
        {
          "id": "lur8u99",
          "score": 65,
          "body": "Apple is not priced for growth. Look at the analysts estimates. Apple is priced for returns and quality. EPS is where analysts focus on, with major stress on expenses since its mature business.  On every earnings call, they hammer on R&D and Infrastructure, and Services, not the top line.  \n\nNO one cares or expects a company with 390B in revenues and 100B in FCF to grow at double digits except the average reddit degen who doesn’t understand how numbers work besides 3/4 KPIs.\n\nBuybacks + Dividends = circled returns + stock movement = total returns. \n\nEither you think this is expensive or not; its subjective to your own view unless you have a crystal ball that tells you how much a stock price will move; if that is the case, we all should be working for you. Otherwise, value is relative to the buyer aka the market",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lur8u99/",
          "created": 1730407636,
          "depth": 1,
          "replies": [
            {
              "id": "lurjasu",
              "score": 47,
              "body": "35 PE is priced for growth. If you DONT think a 35 PE is priced for growth, then you don't understand valuations.",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurjasu/",
              "created": 1730411204,
              "depth": 2,
              "replies": [
                {
                  "id": "lust9bt",
                  "score": 4,
                  "body": "But AAPL has grown and is growing.\n\nI'm going off a stock screener here\n\nAAPL revenue growth past 5 years: 10.97%\n\nAAPL EPS p.a. growth past 5 years: 15.55%\n\nAAPL EPS growth next 5 years: 9.29%\n\nTheir $1.64 EPS (excluding one-off EU tax) represents 12% growth YoY.\n\nUsing 6.75 TTM EPS gives AAPL a PE ratio of 33.\n\nIf AAPL grows that EPS by 9.29% per year for 5 years, then that's 10.5 EPS for 21 PE.\n\nSo yeah AAPL is priced for growth because they're growing.",
                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lust9bt/",
                  "created": 1730428773,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lut4xqi",
                      "score": -6,
                      "body": ">AAPL revenue growth past 5 years: 10.97%\n\n10% over 5 years is good for a PE over 33 company now ?\n\nLOL",
                      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lut4xqi/",
                      "created": 1730433973,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lut523d",
                          "score": 6,
                          "body": "it's per annum \n\nI think it's a reasonable and fair price to pay, 10% profit growth for the next 5 years for 33x, big moat with locked in customers",
                          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lut523d/",
                          "created": 1730434034,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lusc0d7",
                  "score": 9,
                  "body": "lets not make this personal, it's rather simple really \n\nforward PE of 30 (assumes $7.50 in earnings for 2025) is maybe just a tad stretched \n\nbut let's not forget what Buffett has always taught us: \n\n\"it's much better to buy a great business at a fair price, than it is to buy a fair business at a great price\"\n\nVisa and Mastercard (and others) have enjoyed similar multiples for the past decade, and the stocks have performed exceptionally \n\nif Apple is transitioning into a services company before our very eyes (services grew at 12% YoY with a total disaster in China) then maybe 28, 29, 30x fwd earnings isn't as expensive as you think",
                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lusc0d7/",
                  "created": 1730422086,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lussymf",
                      "score": 8,
                      "body": "Service revenue growth is slowing. \n\nYou just literally also tried to argue it was a growing company while arguing with someone's that its not priced for growth.\n\nIs APPLE priced for growth or value? if its growth why isn't it growing on pace with the likes of MSFT who is growing faster with a similar PE?",
                      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lussymf/",
                      "created": 1730428653,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lut9f2s",
                          "score": 1,
                          "body": "AAPL is spending the least on capex.\n\nTTM figures (nearest billion)\n\nAAPL \n\nSales growth 2% (4% ex-China)\n\nOperating cash flow $118B\n\nCapex $9B\n\nShare based compensation $12B\n\nFree cash flow ex sbc = $97B\n\nAdditional information: Apple's hardware business is affected by the same cycle as other computer hardware businesses. \n\nDell's server business sales increased 80% but consumer sales fell 22%.\n\nHP's overall system sales increased 5% but consumer sales fell 1%.\n\nIn the above context, mac sales increasing just 2% is acceptable because outside of business AI spending, personal computers and devices are not booming right now.\n\nMSFT.\n\nSales growth 16%\n\nOperating cash flow $122B\n\nCapex $49B\n\nShare based compensation $11B\n\nFree cash flow ex sbc = $62B\n\nTherefore, AAPL has lower growth than MSFT but much higher free cash flow because they are spending much less on capex.\n\nYou might be thinking that capex can be reduced by MSFT but if we are going to reduce capex, how does that affect MSFT's growth rate?\n\nWe cannot separate capex from growth, because one affects the other.\n\nIf AAPL spends $50B on capex like MSFT, what would their growth be? If it's 16%, then they're roughly equivalent.",
                          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lut9f2s/",
                          "created": 1730436347,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lut9uag",
                              "score": 4,
                              "body": "You literally proved my point. Apple is priced as if it’s growing yet it isn’t making Capex investments and is basicly riding on the hope of a new upgrade cycle and service revenue (which is now slowing). \n\nThe fact MSFT could flip a switch a become far more profitable is a negative to Apple not a pro. \n\nBasicly Apple is valued as if it’s a growing company when the numbers actually show the opposite. They unlike MSFT cannot find ways to invest money into the business. That’s a sign of a business that isn’t growing.\n\nApple can’t spend 50B on capex because it literally wouldn’t be profitable. That shows they have run out of growth run way and are moving to efficiency based improvement. That’s value",
                              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lut9uag/",
                              "created": 1730436585,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lutaxau",
                                  "score": 0,
                                  "body": "It's not flipping a switch though.\n\nWe don't know how much of their capex is necessary to maintain their current services - it's expensive to run all the data centers. \n\nThen you don't know how much growth would disappear if they turned off all discretionary capex.\n\nAssuming MSFT is running like any business would, they are not paying the capex if they are not going to get a return on their investment. \n\nIn terms of Apple, growing top line by mid single digits and bottom line by 9-10% is fine.\n\n$97B FCF versus $62B FCF. Their FCF is 56% higher than MSFT's so if MSFT's growth rate is 10% higher than AAPL's, it will take 5 years for them to reach parity. \n\nSo the question is not \"apple is not growing versus msft is growing\"\n\nIt's Apple grew EPS by 12% this quarter and MSFT grew EPS by 10% this quarter.\n\nWhile Apple's top line growth is slower, they're tight on costs, allowing their bottom line to grow faster and Microsoft's top line growth is higher, but their costs are growing proportionally faster so their bottom line growth is lower.\n\nIt's basically your preference as an investor if you would like a company that focuses on reinvesting for growth or focuses on efficiency and payouts to shareholders.",
                                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lutaxau/",
                                  "created": 1730437192,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lutbqph",
                                      "score": 2,
                                      "body": ">It’s not flipping a switch though.\n\n>We don’t know how much of their capex is necessary to maintain their current services - it’s expensive to run all the data centers.\n\nThis is a fallacy. Your making it two options either they can totally cut Capex to zero or keep it all. You and I both know the Capex required for maintaince is going to be orders of magnitude in difference. If MSFT wanted to they could substantially cut Capex and go total cash flow. If you won’t accept that there is zero reason in continuing the conversation. Listen to one earning call about Capex and you should understand how much money is being spent on projects that will not turn profitable for years. That’s not needed to maintain service.\n\n> Then you don’t know how much growth would disappear if they turned off all discretionary capex.\n\nIrrelevant. If MSFT was cutting Capex like that it wouldn’t be because they wanted to grow. It would be because they are accepting that growth will slow and a value model is best. Kinda like what apples doing.\n\n> Assuming MSFT is running like any business would, they are not paying the capex if they are not going to get a return on their investment.\n\nYes absolutely which is why Apple isn’t doing Capex and MSFT is. Because one can get a return on that money, while the other is slowing and knows investing money into a business that isn’t growing is waste.\n\nAlmost like that’s why apple isn’t spending as much on Capex as MSFt. They don’t have a good investment.\n\n> In terms of Apple, growing top line by mid single digits and bottom line by 9-10% is fine.\n\nYes which would be fine if it was a value company priced as such. It’s not. It’s a bit cheaper than MSFT which is growing revenue at 16% and cloud investments that are literally seeing triple digit growth.\n\n> $97B FCF versus $62B FCF. Their FCF is 56% higher than MSFT’s so if MSFT’s growth rate is 10% higher than AAPL’s, it will take 5 years for them to reach parity.\n\nYes thank you for explaining that one is a growing business with many opportunities to make money back on Capex while the other is a slowing business that does not have many opportunities to make money back on Capex. You just explain the difference between value and growth.\n\n> So the question is not “apple is not growing versus msft is growing”\n\n> It’s Apple grew EPS by 12% this quarter and MSFT grew EPS by 10% this quarter.\n\nAuto zone grows its EPS every quarter, it’s not growing. The fact you don’t get it is astounding. Auto one is a good company, but it’s a value play. You buy it because it won’t grow but you’re buying $1 for .90 cents. EPS growth shows your section if the pie, not how big the pie is.",
                                      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lutbqph/",
                                      "created": 1730437671,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lutcpd6",
                                          "score": 1,
                                          "body": "Autozone is growing? I see consistent top line growth and double digit bottom line growth.\n\nYou don't know what growing means.\n\nSingle digit growth is growing.\n\nDouble digit growth is growing.\n\nAAPL trades at 35x FCF\n\nMSFT trades at 49X FCF\n\nSo yes the double digit growth stock is trading at a higher multiple.\n\nIf you want to argue what is growth and not then should I just bring in NVDA and say MSFT is not growing because it's not triple digits.",
                                          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lutcpd6/",
                                          "created": 1730438245,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "lutouxe",
                                  "score": 1,
                                  "body": "[deleted]",
                                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lutouxe/",
                                  "created": 1730446699,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "luvwp4q",
                                      "score": 1,
                                      "body": "I’m skeptical about healthcare being the next growth driver. The AirPods as hearing aids is brilliant, but is the healthcare device market big enough to grow earnings for a company that sells the most popular consumer device in the world?\n\nThey need products that 100 million people will buy, not 10 million. That’s a tall order for growth.",
                                      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/luvwp4q/",
                                      "created": 1730481157,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "luvgt93",
                      "score": 1,
                      "body": "Visa and MasterCard are priced the way they are because they are delivering constant double digit revenue growth AND EPS growth. They are also benefiting from long tailwinds related to credit adoption away from cash still.\n\nApple was priced like a stable consumer tech company not too long ago, and their current earnings are not justifying their valuation. What happens when their valuation drops to something reasonable when they cannot continue growing EPS by more than high single digits? Their revenues are essentially flat YoY.",
                      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/luvgt93/",
                      "created": 1730476165,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lut4l4v",
                      "score": -1,
                      "body": ">if Apple is transitioning into **a services company** before our very eyes (services grew at 12% YoY with a total disaster in China)\n\nCan't even beat lowball expectation\n\nLOL",
                      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lut4l4v/",
                      "created": 1730433796,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lurbqw2",
              "score": 28,
              "body": "33 FWD PE is priced for growth",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurbqw2/",
              "created": 1730408596,
              "depth": 2,
              "replies": [
                {
                  "id": "lurggvi",
                  "score": 1,
                  "body": "Look at costco, Wall street dosent give a fuck so long as they can pump it",
                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurggvi/",
                  "created": 1730410216,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lurlyzg",
                      "score": 18,
                      "body": "Works until it doesn't",
                      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurlyzg/",
                      "created": 1730412156,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lurua70",
                          "score": 1,
                          "body": "Bingo",
                          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurua70/",
                          "created": 1730415276,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lurk714",
                  "score": 0,
                  "body": "No disrespect but your point is kind of clueless since you again stressing on revenue growth, which analysts ain’t expecting to grow. Priced for growth is an ancient term for companies trading at a multiple above the average. The S&P as a total, is concentrated, but trading at around 27-30x depending on the day. Apple is trading at above that, but not significantly.\n\nReturns come in many forms. Either you think it’s expensive or not based on the projected returns, that is different story. \n\nNo one expecting the top line of apple to grow significantly. No one with a brain to be particular",
                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurk714/",
                  "created": 1730411520,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lut08uh",
                      "score": 3,
                      "body": "That just means most stocks in the s&p are priced for growth.",
                      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lut08uh/",
                      "created": 1730431715,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lutgr13",
                          "score": 1,
                          "body": "No it doesn’t. Excess Money supply and inflation just mean that the money has to go somewhere. No better quality companies to buy than mag 7. Hence PE just expands.",
                          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lutgr13/",
                          "created": 1730440857,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lutn4c0",
                              "score": 1,
                              "body": "Current earnings have the inflation “priced in” so pe ratio should remain unchanged all things being equal. Future inflation forecasts are down back to normal. I guess if there are still fears of inflation then that could cause asset valuations to inflate while demand for bonds decline. I’m not saying mag 7 is a bad investment or that the everything bubble will burst. I’m just saying from a book value perspective these companies are priced as if they are going to be growing quite a bit in the next decade. They could just keep going up though because at the end of the day an asset is worth whatever the next guy is willing to pay.",
                              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lutn4c0/",
                              "created": 1730445409,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "luri02b",
              "score": 5,
              "body": "Whats the point in holding apple long term from here if your not looking for growth? A very mature business with slower innovation year by year while being far behind in AI compared to the rest of Mag 7. If the Apple cult stops culting what happens to the valuation then?",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/luri02b/",
              "created": 1730410749,
              "depth": 2,
              "replies": [
                {
                  "id": "lurqwvd",
                  "score": 14,
                  "body": "> If the Apple cult stops culting what happens to the valuation then?\n\nI see two options here\n\n\n1. There's not actually a cult \n\n2. It becomes a religion\n\n\nI can't help but feel like those that call it a cult aren't willing to accept that the company just makes excellent products.",
                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurqwvd/",
                  "created": 1730413998,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lutcghf",
                      "score": 1,
                      "body": "> I can't help but feel like those that call it a cult aren't willing to accept that the company just makes excellent products.\n\nWe aren't talking about the price of an iPhone but of a stock here. The product might be great but if the stock doesn't produce more returns than the market, then it's not a good buy.\n\nPeople too often confuse \"good company\" and \"good investment\". They arent the same.",
                      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lutcghf/",
                      "created": 1730438097,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lurkpt3",
                  "score": 7,
                  "body": "What is your point? If revenues expected to grow forever, the price of the business would be infinite. \n\nAs I said, you get returns by buybacks and dividends + appreciation, which is the tricky part since no one knows which way the stock will go.\n\nThe advantage of mature businesses is the stability of their earnings. Low Beta, and easier to project the cash coming and out especially when they have high margin\n\n\nNot gonna argue on AI and innovation since these are the same buzzwords everyone using without understanding",
                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurkpt3/",
                  "created": 1730411703,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lurnppg",
                      "score": 0,
                      "body": "A nit on what you said: growth forever does not mean infinite price. Every company has a growth and terminal phase accounted for in a DCF. These things do not spit out “infinite” as a price.",
                      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurnppg/",
                      "created": 1730412803,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lusod7g",
                          "score": 1,
                          "body": "Nah there are limitations.\n\nTerminal value always assumes growth is less than whatever discount rate you are using.\n\nIf a company grows forever, i.e. growth rate equal or above discount rate, then the formula doesn't work because price approaches infinity as growth rate approaches discount rate.",
                          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lusod7g/",
                          "created": 1730426790,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "luruka5",
                  "score": 2,
                  "body": "If customers stop being customers for any business then the business suffers. What does your jealousy and anger towards Apple customers have to do with anything?",
                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/luruka5/",
                  "created": 1730415383,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lurw2f8",
                      "score": -1,
                      "body": "What's there to be jealous of from Apple customers?![gif](emote|free_emotes_pack|thinking_face_hmm)",
                      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurw2f8/",
                      "created": 1730415957,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lus962b",
                          "score": 4,
                          "body": "Because they get to live rent free in your head.",
                          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lus962b/",
                          "created": 1730421010,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "luraghj",
              "score": 3,
              "body": "[removed]",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/luraghj/",
              "created": 1730408168,
              "depth": 2,
              "replies": [
                {
                  "id": "lurjnyx",
                  "score": 3,
                  "body": "Aapl applying all their capital to buy back their own EXTREMELY overvalued shares is such a garbage use of capital. And yet the market keeps rewarding them for such a terrible capital allocation. It's fucking bonkers.\n\nOnce valuations come back to some sane level, aapl better be punished greatly for buying their low growth turd stock at 35 PE",
                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurjnyx/",
                  "created": 1730411333,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lurmxuo",
                      "score": -2,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurmxuo/",
                      "created": 1730412515,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lurnf6o",
                          "score": 0,
                          "body": "No I'm not....",
                          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurnf6o/",
                          "created": 1730412694,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "luroim2",
                              "score": 1,
                              "body": "You have called the last 10 tops, meanwhile the SP is up 25%… must feel bad to loose money in this market.\n\nThe ER was great all around, but Apple almost always goes down after ER and then up a few days later.",
                              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/luroim2/",
                              "created": 1730413102,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lurvwow",
                                  "score": -1,
                                  "body": "Dude I'm over over 50% this year, amd literally just threw 30% of my account in EOSE at 3.04 this afternoon. \n\nI'm doing FINE lmao. And when SPY crashes, I'll make money on the short too. \n\nAAPL er wasn't great. Services missed. Gross margin missed. Their EPS growth is low teens and PE is 35.",
                                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurvwow/",
                                  "created": 1730415898,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lutnx4a",
                                      "score": 2,
                                      "body": "And yet they still beat, those misses were tiny, and in other important ares they beat like IPhone sales. You make it sound like massive growth was expected, but it was not. They beat estimates.\nIt sounds like you don’t really know how to value a company like Apple.",
                                      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lutnx4a/",
                                      "created": 1730446000,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "luscrqo",
                  "score": 2,
                  "body": "[removed]",
                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/luscrqo/",
                  "created": 1730422376,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lurlhwu",
                  "score": 2,
                  "body": "Sure, that is about 3-3.3% yield vs the current yield of treasury of above 4.4% for short term; hence, my point on where the stock will go, which you seemed glanced over because it doesn’t fit your narrative or couldn’t comprehend reading 50 words in full.\n\nStocks are priced based on where the analysts are projecting them, no analyst is projecting Apple to grow double digits.",
                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurlhwu/",
                  "created": 1730411982,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lurmsvb",
                      "score": 2,
                      "body": "Oh so it's priced for growth now?\n\n\nWeird. Seems you want to flip back and forth to fit your narrative.",
                      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurmsvb/",
                      "created": 1730412463,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lut1gxw",
              "score": 1,
              "body": "> it's subjective to your own view\n\nYes, which is what we are discussing here. If we just say \"value is relative to the market\" and no other perspective is valued then why do we even have this subreddit?",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lut1gxw/",
              "created": 1730432275,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lurlqs9",
              "score": 1,
              "body": "What does \"priced for returns and quality\" even mean? Cash is cash. They definitely are a high quality company, but that can justify only so much of a premium. At 3.4T market cap and around 100B in profits, they are very clearly priced for growth. Growth that has not occurred for the past 4 years. At this point, you mighty as well buy US treasuries as they are also high quality and have a higher yield.",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurlqs9/",
              "created": 1730412071,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lur9dz4",
          "score": 19,
          "body": "The gross margins still insane",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lur9dz4/",
          "created": 1730407818,
          "depth": 1,
          "replies": [
            {
              "id": "lurfa18",
              "score": 12,
              "body": "Business is not the problem, it’s the valuation",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurfa18/",
              "created": 1730409803,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lur7q0a",
          "score": 4,
          "body": "Initial after-hours market reaction is to drop a bit.",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lur7q0a/",
          "created": 1730407274,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lur7o66",
          "score": 7,
          "body": "the services miss doesn't bode great either",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lur7o66/",
          "created": 1730407258,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lurdgsv",
          "score": 1,
          "body": "Maybe right after the earnings but on the long term it \"can‘t“ sink because of the massive buybacks",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurdgsv/",
          "created": 1730409179,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lurkmja",
          "score": -1,
          "body": "They need Jobs back to come up with the next big thing. Cook is a very good operations guy but plays it too safe in my opinion.",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurkmja/",
          "created": 1730411670,
          "depth": 1,
          "replies": [
            {
              "id": "luschy3",
              "score": 5,
              "body": "Jobs’s tenure was during a time where tech was exponentially improving so it’s easy to say that he was “innovative”. You idiots just don’t understand that consumer tech has matured and plateaued for almost a decade now. Why do you think all tech companies are now rushing to adopt AI as the new gold mine.",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/luschy3/",
              "created": 1730422272,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lus4hae",
              "score": 2,
              "body": "Jobs passed away years ago so thats not an option. I don’t get the complaints of Tim Apple either. He has been in charge of the company for over a decade and the company has done exceptionally well under him.",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lus4hae/",
              "created": 1730419184,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lursmyt",
      "score": 10,
      "body": "Tim Ai",
      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lursmyt/",
      "created": 1730414652,
      "depth": 0,
      "replies": [
        {
          "id": "lusaw6d",
          "score": 5,
          "body": "Taim",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lusaw6d/",
          "created": 1730421661,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lut6g46",
      "score": 1,
      "body": "Apple benefits from the darling of Wall Street status, it hasn’t the growth the market expects from it yet it’s still valued like a mega growth company. Just looking at meta and Google that are trading at lower P/E with bigger growth rates and they both do buybacks as well",
      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lut6g46/",
      "created": 1730434746,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luran4p",
      "score": -6,
      "body": "OVERPRICED \n\nBut I ain't shorting",
      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/luran4p/",
      "created": 1730408229,
      "depth": 0,
      "replies": [
        {
          "id": "lurup1b",
          "score": 1,
          "body": "Never tell them your next move",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurup1b/",
          "created": 1730415433,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lus59a9",
      "score": 0,
      "body": "What is amazing is the fact Apple made about half what Google made this quarter, $15B versus $29B for Google.\n\nYet Apple has a PE that is about 50% higher than Google.  It will be even more after factoring in the current quarter.",
      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lus59a9/",
      "created": 1730419489,
      "depth": 0,
      "replies": [
        {
          "id": "lus6oj4",
          "score": 40,
          "body": "To be fair, Apple had to make a one time 14 billion dollar tax payment in the EU. Without that tax payment they would have made a similar profit.",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lus6oj4/",
          "created": 1730420043,
          "depth": 1,
          "replies": [
            {
              "id": "lusivnh",
              "score": 7,
              "body": "Thanks!  Knew something was a miss.",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lusivnh/",
              "created": 1730424666,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lutcjpu",
              "score": 0,
              "body": "Didn't they already provision it?",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lutcjpu/",
              "created": 1730438151,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lurc0bs",
      "score": 1,
      "body": "Non AI technology mega cap",
      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurc0bs/",
      "created": 1730408686,
      "depth": 0,
      "replies": [
        {
          "id": "lurd8n3",
          "score": 6,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurd8n3/",
          "created": 1730409103,
          "depth": 1,
          "replies": [
            {
              "id": "lururns",
              "score": 1,
              "body": "Google and Microsoft is the only company seeing tangible indirect revenue from Ai besides NVDA",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lururns/",
              "created": 1730415459,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lurdo0n",
          "score": 0,
          "body": "Apple intelligence?",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurdo0n/",
          "created": 1730409249,
          "depth": 1,
          "replies": [
            {
              "id": "lurfkfw",
              "score": -3,
              "body": "Run on OpenAI?",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurfkfw/",
              "created": 1730409902,
              "depth": 2,
              "replies": [
                {
                  "id": "lurn4g8",
                  "score": 3,
                  "body": "No, people will have the option to utilize ChatGPT for requests but it’s not a necessity.",
                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurn4g8/",
                  "created": 1730412584,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lurkv75",
                  "score": 5,
                  "body": "No, it's not.  Apple's AI is mostly on-device models, some cloud-side models run by Apple, and then in some cases the user can opt-in to querying ChatGPT.\n\nApple is doing the smart thing here - cloud based gen AI execution is very expensive to run and there are very few use cases and users who are willing to pay more for the result than the query cost to execute.  Apple's plan is brilliant - it is leveraging hardware *it sold to users at a profit* to run AI models (when applicable) at *zero cost to Apple* and just a power (and battery life) cost to the user.  The on-device models won't be as good, but the hope is that they're good enough while also being the right price and cost.",
                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurkv75/",
                  "created": 1730411756,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lurn3l9",
                      "score": -3,
                      "body": "They certainly can run on devices, but that also means it’s very limited. It’s more an automation tool than AI. But they don’t call it “AI”, so no misleading",
                      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurn3l9/",
                      "created": 1730412575,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lurz5d5",
      "score": -7,
      "body": "What a dud. Been saying it for a long time now, how no one see's the writing on the wall to me is just absurd.",
      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurz5d5/",
      "created": 1730417131,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lusf5jo",
      "score": -2,
      "body": "Yikes, rest all missed but only iPhone beats?",
      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lusf5jo/",
      "created": 1730423270,
      "depth": 0,
      "replies": [
        {
          "id": "lut528u",
          "score": 0,
          "body": "Service was the big letdown",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lut528u/",
          "created": 1730434036,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lurcttk",
      "score": -17,
      "body": "FAANG will remain flat or down the next few years. Need to invest in new FAANG stocks",
      "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurcttk/",
      "created": 1730408962,
      "depth": 0,
      "replies": [
        {
          "id": "lurdev2",
          "score": 4,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurdev2/",
          "created": 1730409162,
          "depth": 1,
          "replies": [
            {
              "id": "lurebsi",
              "score": -13,
              "body": "You misspelled Tesla.",
              "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurebsi/",
              "created": 1730409476,
              "depth": 2,
              "replies": [
                {
                  "id": "lurgews",
                  "score": 1,
                  "body": "Good joke....  Hold on, it's not a joke is it :-)\n\nI just wish Leon wouldn't get so directly involved with the politiks.",
                  "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurgews/",
                  "created": 1730410197,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lurv25g",
          "score": 1,
          "body": "They would very quickly fill into their valuation if they tightened up Capex. Everyone wants to be an investor but no one knows what it takes to be one. Amazon is investing heavily into AWS and and other bets for example",
          "permalink": "/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/lurv25g/",
          "created": 1730415571,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}