{
  "title": "Amazon CEO pledges AI investments will pay off as capital expenditures surge 81%",
  "score": 400,
  "selftext": "Amazon CEO Andy Jassy is trying to reassure investors who may be worried about the future payoff of the company’s massive investments in generative artificial intelligence.\n\nOn a conference call with analysts following the company’s third-quarter earnings report on Thursday, Jassy pointed to the success of Amazon’s cloud computing business, Amazon Web Services, which has become a crucial profit engine despite the extreme costs associated with building data centers.\n\n“I think we’ve proven over time that we can drive enough operating income and free cash flow to make this a very successful return on invested capital business,” Jassy said. “We expect the same thing will happen here with generative AI.”\n\nAmazon spent $22.6 billion on property and equipment during the quarter, up 81% from the year before. Jassy said Amazon plans to spend $75 billion on capex in 2024 and expects an even higher number in 2025.\n\nThe jump in spending is primarily being driven by generative AI investments, Jassy said. The company is rushing to invest in data centers, networking gear and hardware to meet vast demand for the technology, which has exploded in popularity since OpenAI released its ChatGPT assistant almost two years ago.\n\n“It is a really unusually large, maybe once-in-a-lifetime type of opportunity,” Jassy said. “And I think our customers, the business and our shareholders will feel good about this long term that we’re aggressively pursuing it.”\n\nAI spending was a big topic on tech earnings calls this week. Meta on Wednesday raised its capital expenditures guidance, and CEO Mark Zuckerberg said he was “quite happy” with the team’s execution. Meanwhile, Microsoft’s investment in OpenAI weighed on its fiscal first-quarter earnings released on Wednesday, and the company said capital spending would continue to rise. A day earlier, Alphabet CFO Anat Ashkenazi warned the company expects capital spending to grow in 2025.\n\nAmazon has said its cloud unit has picked up more business from companies that need infrastructure to deploy generative AI models. It’s also launched several AI products for enterprises, third-party sellers on its marketplace and advertisers in recent months. The company is expected to announce a souped-up version of its Alexa voice assistant that incorporates generative AI, something Jassy said will arrive “in the near future.”\n\nAmazon hasn’t disclosed its revenue from generative AI, but Jassy said Thursday it’s become a “multi-billion-dollar revenue run rate” business within AWS that “continues to grow at a triple-digit year-over-year percentage.”\n\n“It’s growing more than three times faster at this stage of its evolution as AWS itself grew, and we felt like AWS grew pretty quickly,” he added.\n\nSource: [https://www.cnbc.com/2024/10/31/amazon-ceo-pledges-ai-investments-will-pay-off-as-capex-surges-81percent.html](https://www.cnbc.com/2024/10/31/amazon-ceo-pledges-ai-investments-will-pay-off-as-capex-surges-81percent.html)",
  "link_flair_text": null,
  "id": "1ggtl3k",
  "num_comments": 76,
  "created_utc": 1730421881,
  "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/",
  "comments": [
    {
      "id": "lusc1ff",
      "score": 174,
      "body": "Yes and I pledge my calls will print after my wife checks our retirement accounts",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusc1ff/",
      "created": 1730422098,
      "depth": 0,
      "replies": [
        {
          "id": "lusdprq",
          "score": 20,
          "body": "Did you... did you buy the dip?",
          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusdprq/",
          "created": 1730422747,
          "depth": 1,
          "replies": [
            {
              "id": "lusxwen",
              "score": 6,
              "body": "We are still dipping in the market.",
              "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusxwen/",
              "created": 1730430676,
              "depth": 2,
              "replies": [
                {
                  "id": "lusy6o9",
                  "score": 3,
                  "body": "Shut up, we're mooning now son!",
                  "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusy6o9/",
                  "created": 1730430798,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lut7i6l",
                      "score": 4,
                      "body": "tomorrow, will finish around $210",
                      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lut7i6l/",
                      "created": 1730435304,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "luszgvb",
                      "score": 0,
                      "body": "Soon. Not yet.",
                      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luszgvb/",
                      "created": 1730431362,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "luvx88f",
              "score": 3,
              "body": "I bought the Microsoft dip",
              "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luvx88f/",
              "created": 1730481322,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "luy5d1l",
          "score": 1,
          "body": "amazon options are fucking frustrating.\n\nI cut my 190c and barely made anything. I'm done.\n\nwhoever keeps selling at $200.... can get fucked?",
          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luy5d1l/",
          "created": 1730508030,
          "depth": 1,
          "replies": [
            {
              "id": "luzbb9h",
              "score": 1,
              "body": "It's bezos dude lol, pretty well reported on by now",
              "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luzbb9h/",
              "created": 1730527747,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lusd74a",
      "score": 82,
      "body": "Isn’t what Amazon has been doing over the past 10 years, reinvesting and moving profit to Capex? I wonder when it will end",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusd74a/",
      "created": 1730422545,
      "depth": 0,
      "replies": [
        {
          "id": "luseogf",
          "score": 87,
          "body": "Amazon is as much of a tech company as Google or Microsoft, it's just hidden behind a vaneer of online retail. When will any tech giant stop spending? If they want to remain competitive and dominant in their web services, the answer might be never.",
          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luseogf/",
          "created": 1730423098,
          "depth": 1,
          "replies": [
            {
              "id": "luso2sn",
              "score": 53,
              "body": "When they grow their revenue by 15% a year doing it I sure as hell don't want them to stop spending. I don't get this narrative that now, suddenly, capex is a bad thing for tech. It's not like the whole reason they have been this successful the past several years is exactly because they spent a shitload on cloud.\n\nI didn't buy their stock to get that 2% FCF yield paid out to my bank account.",
              "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luso2sn/",
              "created": 1730426674,
              "depth": 2,
              "replies": [
                {
                  "id": "lut4wgu",
                  "score": 11,
                  "body": "> I don't get this narrative that now, suddenly, capex is a bad thing for tech\n\nBecause it's growing at 80% YoY without a demonstrable ROI yet. \"Trust me bro\" (especially the year after you admit you invested in the wrong things and had to layoff a bunch of people and restructure your priorities) isn't a viable business strategy.",
                  "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lut4wgu/",
                  "created": 1730433955,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lutmtat",
                      "score": 13,
                      "body": "Investments like that take years to pay off. People who expect an ROI on AI at this point in time are literally clueless how any of this works.",
                      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lutmtat/",
                      "created": 1730445186,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "luuynga",
                          "score": 2,
                          "body": "At least have a vision of what the ROI looks like. But all we have right now are a bunch of cool magic tricks and a \"we'll figure out how to monetize it\".\n\nAnd God forbid this technology isn't like every other technology and rapidly becomes cheaper and more efficient, leading to a complete waste of all these datacenters, graphics cards, and nuclear reactors.",
                          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luuynga/",
                          "created": 1730470311,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "luvxwq8",
                      "score": 3,
                      "body": "Prime example , Rivian automotive and building out warehouses way too quickly",
                      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luvxwq8/",
                      "created": 1730481532,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "luvy6xy",
                          "score": 3,
                          "body": "Prime example, literally Amazon building out warehouses way too quickly thinking COVID online retail trends would continue",
                          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luvy6xy/",
                          "created": 1730481618,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "luuq938",
                      "score": 2,
                      "body": "You do not get it.",
                      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luuq938/",
                      "created": 1730467418,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "luuwcqg",
                          "score": 4,
                          "body": "\"Hey guys, we spent $10B a year on an ML chatbot that never made back its money, so we are laying half of you off.\"\n\n\"But please believe us when we spend $50B this year and $100B in 2025 on this other ML chatbot, we will surely make money off this!\"",
                          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luuwcqg/",
                          "created": 1730469538,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "luv7qgi",
                              "score": 6,
                              "body": "Their outward facing chat bots are literally the smallest of their AI expenditures. They are investing in making the most popular models easily accessible to customers on AWS.",
                              "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luv7qgi/",
                              "created": 1730473272,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "luv97tz",
                                  "score": 2,
                                  "body": "Yes, but those customers are then turning around and using that model acces to make chatbot like features on their own. Those companies are going to want to see an ROI on their AI spend as well",
                                  "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luv97tz/",
                                  "created": 1730473752,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lv88q3a",
                                      "score": 1,
                                      "body": "They’re buying compute from Amazon, yes some are buying chat bots and other products but anyone that wants to make something with high powered compute is going to tap into Amazons infrastructure for a recurring fee. It’s a similar model to AWS and will be tied in with it. They ve already tokenized compute and can charge it as tokens used to complete said instructions. \n\nIt’s going to print money like mad!",
                                      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lv88q3a/",
                                      "created": 1730662629,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lv8ltlw",
                                          "score": 1,
                                          "body": "I understand the concept. I just don't understand how the economics work out.\n\nLet's say Amazon spends $100B in capex for AI next year. They want to see an ROI, so will charge $150B to the end customers. End customers want to see an ROI, so they need to derive $200B+ in their own revenue to justify the spend. And I'm leaving our operational costs as well.\n\nAnd that's just Amazon. Similar numbers are being thrown around for Azure, for GCP, Oracle. You're starting to get towards a trillion dollars.\n\nIf these were all one time expenses, then fine I guess it could make some sense that they will pay for itself over a longer time period. But based on NVDAs future earnings estimates and Microsoft/Amazon planning for nuclear reactors and shit, this spending is only expected to increase.\n\nAre we going to see Amazon spending $200B in 2027? $500B in 2032? How the fuck are they getting a positive ROI on that? Or their customers spending for the compute? Someone's going to be left holding a massive bag, or we have the entire collapse of the economy as tens of millions of people are being laid off and replaced by AI",
                                          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lv8ltlw/",
                                          "created": 1730666610,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "luu234y",
                      "score": 1,
                      "body": "Not like their capex is actually growing at a rate of 80% YoY.",
                      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luu234y/",
                      "created": 1730456049,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "luvsm5a",
                  "score": 2,
                  "body": "A lot of financial coverage is aimed at short term traders who care about what stocks do in the next quarter or next year, not the the next decade.",
                  "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luvsm5a/",
                  "created": 1730479884,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "luvxoyh",
                  "score": 2,
                  "body": "Everyone’s way too caught up on snapshot metrics like the P/E when in reality it means nothing for a company like Amazon without context . \n\nIf anything I like the suppressed share price because if they ever and inevitably announce a massive buyback program to reward their patient shareholders , they get to buyback shares at a cheaper price and expand the EPS",
                  "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luvxoyh/",
                  "created": 1730481466,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lutgfaz",
                  "score": 1,
                  "body": "Exactly. I don't mind capex spending at all.",
                  "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lutgfaz/",
                  "created": 1730440634,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "luskimi",
              "score": 8,
              "body": "Intel spending on their buybacks",
              "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luskimi/",
              "created": 1730425298,
              "depth": 2,
              "replies": []
            },
            {
              "id": "luuh1sl",
              "score": 3,
              "body": "AMZN stock 10x in the past 10 years. You would be a fool to want them to stop as an investor",
              "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luuh1sl/",
              "created": 1730463787,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lusie58",
          "score": 12,
          "body": "I mean how else are you going to keep expanding? \n\nIf you don't innovate and expand you will be left in the dust",
          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusie58/",
          "created": 1730424481,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lutk5b1",
          "score": 3,
          "body": "They have their own cpus that are cheaper for them than Intel.\n\n\nBut no, let's be afraid of capex because the best companies are insurance and banking because they have 0 capex and 0 rnd",
          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lutk5b1/",
          "created": 1730443263,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luupnf2",
          "score": 1,
          "body": "Never. \n\nAmazon's whole thing is continuous expansion. You can never be caught up to if you never stop expanding\n\nPlus US Tax Code incentives spending. Capex reduces taxable income, which is why Amazon pays minimum taxes every year. The government wants you to invest into your company because it builds the economy, so they reward it through reduced taxes\n\nThey are outspending the competition while being incentivized to do so by the government.",
          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luupnf2/",
          "created": 1730467197,
          "depth": 1,
          "replies": []
        },
        {
          "id": "luxo4v5",
          "score": 1,
          "body": "10 years? Isn't this what they've been doing since the '90s? Reinvest all profit.",
          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luxo4v5/",
          "created": 1730501754,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lv9gb70",
          "score": 1,
          "body": "Watch the market collapse on them and they never get to realize their dividends lol",
          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lv9gb70/",
          "created": 1730676195,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lut89aq",
      "score": 12,
      "body": "Yeah, they said the same thing about .com everything. Some will, most won’t.",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lut89aq/",
      "created": 1730435711,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lusd0u3",
      "score": 49,
      "body": "Cash to NVDA 💵",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusd0u3/",
      "created": 1730422475,
      "depth": 0,
      "replies": [
        {
          "id": "lusft1b",
          "score": 42,
          "body": "Pretty much every other Mag 7 reporting raising Capex for \"once in a lifetime opportunity\", more money to NVDA basically.",
          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusft1b/",
          "created": 1730423512,
          "depth": 1,
          "replies": [
            {
              "id": "lusqga5",
              "score": 1,
              "body": "Looking forward to the $1T/year revenue boost once the $100B/year going to NVidia starts to actually produce a return!",
              "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusqga5/",
              "created": 1730427624,
              "depth": 2,
              "replies": []
            },
            {
              "id": "luurg81",
              "score": -1,
              "body": "So why did NVDA fall so much yesterday?",
              "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luurg81/",
              "created": 1730467845,
              "depth": 2,
              "replies": [
                {
                  "id": "luxopot",
                  "score": 3,
                  "body": "Stocks go down too? People taking profits. People worried it's growing too fast unsustainably. People see it teetering for number one most valuable company by market cap and think it can't keep growing like it has. Plus a million other reasons that make stocks fluctuate.",
                  "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luxopot/",
                  "created": 1730501961,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lusl5rk",
      "score": 25,
      "body": "Amazon has been doing this for the better part of almost 2 decades haven’t they?. Massive capital investments that pay off years down the line. Doesn’t seem like anything new",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusl5rk/",
      "created": 1730425543,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lusoyhf",
      "score": 12,
      "body": "The success of their capex depends on the continued scaling of AI startups using AWS. If the utilization of their infrastructure is too far below capacity, their increased depreciation expense could exceed their new revenues.",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusoyhf/",
      "created": 1730427027,
      "depth": 0,
      "replies": [
        {
          "id": "lusyzsn",
          "score": -8,
          "body": "Depreciation over 30 years.. not sizable for the AI build yet.",
          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusyzsn/",
          "created": 1730431153,
          "depth": 1,
          "replies": [
            {
              "id": "lut23l4",
              "score": 14,
              "body": "Buildings can be depreciated over 30 years, but surely computer hardware isn't, right? Nvidia's AI hardware from more than 3 years ago is practically worthless due to advances in technology.  I would think a 3 year depreciation schedule would make the most sense, but I think a 5 year depreciation schedule is what most tech companies use.",
              "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lut23l4/",
              "created": 1730432571,
              "depth": 2,
              "replies": [
                {
                  "id": "luukwc9",
                  "score": 3,
                  "body": "It’s 3 years generally",
                  "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luukwc9/",
                  "created": 1730465383,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "luu7huq",
                  "score": 2,
                  "body": "> Nvidia's AI hardware from more than 3 years ago is practically worthless due to advances in technology\n\n\n* It's not. Look at cloud offerings, there're 5-6 year old models still bringing in cash to the cloud providers.\n* Raw hardware leases in cloud have an immense markup. Servers pay for themselves in 4-6 months, and generate pure profit after that.",
                  "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luu7huq/",
                  "created": 1730459188,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "luv94pf",
                      "score": 1,
                      "body": "> It's not. Look at cloud offerings, there're 5-6 year old models still bringing in cash to the cloud providers.\n\nThey lease for a tiny fraction of what they used to... why rent older models when you can rent the newer faster ones?",
                      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luv94pf/",
                      "created": 1730473724,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "luvg3nn",
                          "score": 1,
                          "body": "* Most of the time you want the best value, so if you can save 20% by running 3 older cards instead of a single bleeding edge one, you should go for it. It quickly pays off when you run hundreds or thousands of servers.\n* Most ML workloads don't need the most recent hardware to work.",
                          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luvg3nn/",
                          "created": 1730475942,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "luu21pw",
      "score": 4,
      "body": "No one will read this. But I think this is not talked enough and want to vent about it.\n\nWe must not forget this companies are not only growing because they are huge and economies of scale… Amazon & co are able to hire the best humans available and this is no joke.\n\nHere in Europe I would say 4/10 of best people I know have recently being hired but Amazon or Google. It’s amazing and crazy if you think about it.",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luu21pw/",
      "created": 1730456024,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lusp058",
      "score": 13,
      "body": "AKA buy NVDA",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusp058/",
      "created": 1730427046,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luu0ll1",
      "score": 3,
      "body": "All the money spent on GPU's will be considered depreciation in 1 to 3 years. So I really hope these cards make enough profit to justify the investment.\n\n\"Datacenter GPUs may only last from one to three years, depending on their utilization rate, according to a high-ranking Alphabet specialist, quoted by Tech Fund. \"\n\nhttps://www.tomshardware.com/pc-components/gpus/datacenter-gpu-service-life-can-be-surprisingly-short-only-one-to-three-years-is-expected-according-to-unnamed-google-architect",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luu0ll1/",
      "created": 1730455106,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luuq2kg",
      "score": 2,
      "body": "I think there is major froth in AI from the model and infrastructure layer. Model builders are close to hitting the threshold of how \"good\" models can get. ChatGPT & Anthropic are just getting modestly better each time but spending billions to keep that marginal advantage. The capabilities will converge and the models will become commodities (if they aren't already with Llama 3 open source models) that can't support the massive valuations and funding. They are even more open to disruption from P2P models like [Web AI](https://www.webai.com/).\n\nWhere I think you start to see true value is from the application layer in the form of agents like [Zillion](http://tryzillion.com) or  [Hebbai](https://www.hebbia.ai/) for those focused on the financial sector.",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luuq2kg/",
      "created": 1730467352,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luyrjoh",
      "score": 2,
      "body": "AMAZON META MSFT GOOGLE make money to buy NVDA chips. What consequences do you expect? Easy. NVDA is AI itself.",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luyrjoh/",
      "created": 1730517089,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lutmsz7",
      "score": 2,
      "body": "Solid ER despite AI big spend. Bullish.",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lutmsz7/",
      "created": 1730445180,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luu4hv9",
      "score": 3,
      "body": "I just hope they quit their Starlink copy cat thing, it will for sure be a complete waste of money, Starlink is simply too far ahead there's nothing Amazon or any other company could do to even realistically dream to catch up to them. It's a Jeff bezos pet project with terrible ROI",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luu4hv9/",
      "created": 1730457505,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lutn6xg",
      "score": 1,
      "body": "24% ytd which includes the large drop tech had in the summer.",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lutn6xg/",
      "created": 1730445462,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luuhet3",
      "score": 1,
      "body": "I wonder how this focus on AI will affect Amazon’s overall business strategy and whether it will lead to new competitive advantages. It’s definitely a pivotal moment in the tech industry. Do you think Amazon will be able to maintain its lead, or are there other companies that might challenge them in the AI space?",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luuhet3/",
      "created": 1730463943,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luwbni2",
      "score": 1,
      "body": "I honestly thought we would see a new all time high on AMZN, but it hasn’t happened. What’s your take on the limited response to earnings?",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luwbni2/",
      "created": 1730485780,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luwd1nl",
      "score": 1,
      "body": "Amazon is goated.",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luwd1nl/",
      "created": 1730486217,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luydqe4",
      "score": 1,
      "body": "Amazon is an absolute powerhouse...this doesn't surprise me The only thing that will stop Amazon from continuing to spend and grow at this point is if AI turns the world upside down and somehow ruins civilization.\n\nThis is a real possibility... but humans are like ants and super resilient. Some will weather the AI doom, and in 20 years from now, there will emerge another start-up company that rises to power.\n\n Oh the cycle of life and business we all live in! It's amazing and crazy at the same time. Hakuna-Matata Reddit friends!",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luydqe4/",
      "created": 1730511323,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luuaj7i",
      "score": 1,
      "body": "Amazon way is to make a play at everything. Enjoy the winners and cut the losers. No one knows where this company will be in 10 years but I’m happy to be part of the ride.",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luuaj7i/",
      "created": 1730460768,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lusvhvl",
      "score": -3,
      "body": "This is the top.",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusvhvl/",
      "created": 1730429671,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lusfxwt",
      "score": -6,
      "body": "They are lag behind in AI, will need spend more to catch up",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusfxwt/",
      "created": 1730423561,
      "depth": 0,
      "replies": [
        {
          "id": "lusmsjq",
          "score": 12,
          "body": "To achieve what exactly?",
          "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusmsjq/",
          "created": 1730426166,
          "depth": 1,
          "replies": [
            {
              "id": "lusqqct",
              "score": 5,
              "body": "Burn money faster with Alexa.",
              "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusqqct/",
              "created": 1730427738,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lut7trt",
              "score": 2,
              "body": "to achieve an Alexa with an IQ of 69 at least",
              "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lut7trt/",
              "created": 1730435477,
              "depth": 2,
              "replies": [
                {
                  "id": "luy4tft",
                  "score": 1,
                  "body": "Tbh a humanoid Alexa with an 'IQ' of 69 would be big hit imo.",
                  "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luy4tft/",
                  "created": 1730507826,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lusnoj8",
              "score": 0,
              "body": "For retail business and ad business , better recommendations and more targeted ad to increase sales as one use case, could also increase fraud detection etc. for cloud business providing AI capabilities so corporations will use AWS",
              "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusnoj8/",
              "created": 1730426517,
              "depth": 2,
              "replies": [
                {
                  "id": "lutinu9",
                  "score": 3,
                  "body": "I can tell you know nothing. Anyone remotely in this field will tell you not just Amazon but all tech companies have been incorporating \"AI\" for decades now. GenAI isn't new, DL isn't new. Recommender systems, search/IR algos etc have been around for a while, and keep improving. \n\nLook up Amazon science, go check who the platinum sponsors for neurIPS, EMNLP, CVPR etc are. \n\nAlexa might be a failure in incorporating genAI, but AWS is doing very well. Riding the hype and demand, just like they did for crypto, distributed/cloud computing etc.",
                  "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lutinu9/",
                  "created": 1730442190,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "luu3lhw",
                      "score": 2,
                      "body": ">Alexa might be a failure in incorporating genAI, but AWS is doing very well.\n\nPeople seem to be happy with AWS Bedrock, and to me that's all that matters for B2B",
                      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luu3lhw/",
                      "created": 1730456969,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "luu8bl8",
                      "score": 1,
                      "body": "I can tell you know nothing as well",
                      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luu8bl8/",
                      "created": 1730459632,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "luz096q",
      "score": -1,
      "body": "Bro, I so wanna short Amazon.  Whenever the CEO says “trust me bro” I fucking fold lol",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/luz096q/",
      "created": 1730521242,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lusspk6",
      "score": -7,
      "body": "TL;DR can you run that post through ChatGPT to summarize?",
      "permalink": "/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/lusspk6/",
      "created": 1730428549,
      "depth": 0,
      "replies": []
    }
  ]
}