{
  "title": "Etsy's declining gross merchandising sales - from a buyer",
  "score": 67,
  "selftext": "Etsy reported a 6% decline in gross merchandising sales in the third quarter. Active buyers decreased as well as habitual buyers.\n\nI can tell you one of the reasons why (a contributing factor). I have been a buyer on Etsy since 2016. I am also a seller. I cannot purchase multiple items on Etsy say more than 10 items at a time because of Etsy's faulty cart. This has been the case for at least a couple of years. I first started having the problem in my main shop a couple of years ago.\n\nI buy a lot of jewelry supplies so I can easily purchase many items at once and have. I am a habitual buyer who has probably spent approximately $40k maybe more on Etsy all these years.\n\nI started using a second account to purchase because the constant popups in the shop I sell on are too annoying. Many sellers/buyers report the same. Etsy does not care.\n\nAnyway, in my second account I have been trying to add items to my cart (all beads) to purchase from this one shop. I would have bought from them elsewhere if they had their own site but they do not.\n\nLast Sunday I spent a couple of hours looking through the shops over 2000 listings. They have awesome beads and shopping is fun for me. The first time around that is. Thereafter, it is no longer fun and now like work. I added the items on Sunday. I came back on Monday to purchase and I could not access my cart. I contact support who said I would get an email. I did not. I contacted them the next day and asked if they were going to fix my cart. They told me they thought it was a problem with 14 items in the saved for later. I specifically told Etsy support DO NOT remove the 97 items in my cart, but you could the saved for later.\n\nThe next day to my surprise the cart was fixed. But Etsy removed those 97 items in my cart that I wanted to buy! That was time consuming. The problem is that some buyers are not able to add more than 10 items in their cart at a time to purchase, but the cart allows up to 100. I was upset. Support gave me a $20 credit for the inconvenience.\n\nAs it is now like work for me and not fun I go to add the items back in my cart and it is quite time consuming. I did make two purchases earlier today but they were not more than 5 items. I figured I could add up to not more than 40 items and be good. At 38 items my cart glitched out and I cannot access the cart!\n\nI contact support again tonight and told them this. Support was able to get the items down to 20 in my cart to where it works. So it seems I can safely purchase 20 items. But I will have to do a multiple item purchase for all I want to buy. Support gave me another $10 credit. They claim Etsy is trying to fix this problem for buyers.\n\nMost buyers would not persist as I have. Most buyers would move on elsewhere to Amazon, Ebay, etc. And most probably do.\n\nSellers are losing out on sales and so is Etsy because Etsy is incapable of fixing this cart issue. They don't care.\n\nFor 5 days I have tried to purchase a large amount of beads from this one shop and still trying! I have written the COO twice this past week. I probably wrote management a couple of years ago when it happened. They know about it.\n\nI have been buying on Amazon as a prime member for several years. I have been buying on Ebay since 2016. I have NEVER experienced a glitch or malfunction on those marketplaces ever! It is always a seamless experience as a buyer and seller. Etsy has daily glitches and malfunctions. If Amazon and Ebay can do it why can't Etsy?\n\nAnd accessing support as a buyer and seller is quite difficult. I can imagine the average buyer is not going to take the time to try to get through the maze to access support thus they abandon Etsy.\n\nI can imagine how much manpower and $ Etsy has spent fixing buyers cart issues and credits they are issuing. Rather than just fixing the problem once and for all so the cart functions normally and seamlessly.\n\nDon't even get me started on seller's pain points, there are many of them as well.\n\nThe moral of this story is do you want to invest in a company that can't have a functioning cart and treats their buyers and sellers like they do? They don't care obviously that they are losing sales since this has gone on for a long, long time.\n\nEtsy are you listening? No they are not. Elliot management are you listening? Analysts are you listening? Investors are you listening?",
  "link_flair_text": null,
  "id": "1ghl0zv",
  "num_comments": 26,
  "created_utc": 1730509574,
  "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/",
  "comments": [
    {
      "id": "luypve4",
      "score": 120,
      "body": "Etsy turned into AliExpress",
      "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/luypve4/",
      "created": 1730516349,
      "depth": 0,
      "replies": [
        {
          "id": "lv1ewfu",
          "score": 12,
          "body": "Yep. The fact that my aunt and uncle decided to open an Etsy store selling AI generated shit art printed on mugs or shirts says it all. It’s done.",
          "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lv1ewfu/",
          "created": 1730565279,
          "depth": 1,
          "replies": [
            {
              "id": "lv1wlz0",
              "score": 9,
              "body": "Yes. It was quite a short way for Etsy to go from hand-made to industrial drop-shipping. Money above principles",
              "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lv1wlz0/",
              "created": 1730570839,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lv25guf",
          "score": 5,
          "body": "My wife bought some things that turned out to be really cheap. Etsy has no system for quality control. I also think that quality makers are better off getting their own site and just rope people in from Etsy.",
          "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lv25guf/",
          "created": 1730573640,
          "depth": 1,
          "replies": [
            {
              "id": "lv52jf1",
              "score": 3,
              "body": "They don't allow reviews more than 90 days after purchase. Anything you buy could have a 100% failure rate after 3 months and nobody could ever report it in a review.",
              "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lv52jf1/",
              "created": 1730614044,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luybvqh",
      "score": 35,
      "body": "Thanks. Always like read first hand experience. I feel part of reason they don’t care is in craft market, you don’t have a lot alternative",
      "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/luybvqh/",
      "created": 1730510583,
      "depth": 0,
      "replies": [
        {
          "id": "luyfi4s",
          "score": 31,
          "body": "good thing they are fixing that by allowing their site to be flooded with drop shippers from China that pretend to be hand made items.",
          "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/luyfi4s/",
          "created": 1730512031,
          "depth": 1,
          "replies": [
            {
              "id": "luzxozk",
              "score": 9,
              "body": "This is exactly why I stopped using them.  A big reason I want to buy handmade stuff is because it's more durable than most of the mass produced garbage.",
              "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/luzxozk/",
              "created": 1730543569,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "luyecr1",
          "score": 3,
          "body": "YW.",
          "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/luyecr1/",
          "created": 1730511575,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "luyo4rl",
      "score": 11,
      "body": "This can’t be the reason why Etsy sales are down, possibly a contributing factor.\n\nI used to be a humble seller on Etsy, I remember the automation was quite limited, as if Etsy deliberately forces its sellers to spend time on unproductive processes. Like a discount setting is for a month at most. Why not forever? Or adding the products to discount campaign one by one. Absolutely Ridiculous",
      "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/luyo4rl/",
      "created": 1730515595,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv3t558",
      "score": 2,
      "body": "This is more of a personal Etsy complaint post and then you saw their sales are down and decided that makes your admittedly very annoying experience was relevant to it lol",
      "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lv3t558/",
      "created": 1730594059,
      "depth": 0,
      "replies": [
        {
          "id": "lv5ymrk",
          "score": 1,
          "body": "I am sorry but your post does not make sense. My OP is a buyer's experience which is a contributing factor to Etsy's declining GMS in my strong opinion. I am confident this has been a widespread issue  and not isolated incidents. I have seen it reported before by buyers/sellers as sellers are buyers. Etsy support even said to me they are working on fixing this issue for \"buyer's\" quote plural.\n\nI saw \"their sales are down\" who is \"their\" sales the seller I want to buy from? How would I know that? And why would I care as a buyer about the amount of sales this seller has?\n\nIf you are assuming about my sales I don't sell beads (which I have been trying to purchase), supplies or items buyers would buy many items of. My sales are just fine. I never complain about sales. And if I ever was going to I would not come to r/stocks to do it. I also do not feel that this cart problem is affecting my personal shop. I sell jewelry. While I sometimes get multiple item orders they are never over 10/15 items per order. Therefore, this cart problem would not affect my sales. Your assumptions are wrong. I am not in a roundabout way complaining about sales.\n\nI want to be able to make purchases as a buyer without the constant cart issues and I am sure investors want that ability for buyers of Etsy as well.\n\nOf course this is a personal complaint by a buyer - myself. With an ongoing problem of a faulty cart which I feel very confident is a widespread issue.",
          "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lv5ymrk/",
          "created": 1730635177,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lv5z7wo",
      "score": 1,
      "body": "I wanted to thank this community for the support of my OP. 125k views. 45 shares. Maybe just maybe one of those shares may get this problem that keeps buyers from being able to purchase into the right hands that give a darn. I have seen multiple reports of users of Etsy not being able to access their cart for numerous reasons.\n\nEdited to add - Monday morning 149k views and 49 shares. Maybe at Etsy buyers might just get a proper functioning cart!",
      "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lv5z7wo/",
      "created": 1730635463,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvc3w2a",
      "score": 1,
      "body": "Any reason that these handcrafts cant be sold on amazon?",
      "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lvc3w2a/",
      "created": 1730722694,
      "depth": 0,
      "replies": [
        {
          "id": "lvcaue8",
          "score": 1,
          "body": "The beads I want to buy? No as I said the seller does not sell elsewhere.  But many things you can find elsewhere by searching through Google lens - thank you Google!",
          "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lvcaue8/",
          "created": 1730725720,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvjci70",
      "score": 1,
      "body": "I just wanted to update y'all. I received an email from Etsy customer support today. They said because the items are no longer in my cart they are not able to recreate the incident so they can see what is going on.\n\nThey said if it happens again leave the cart as is and contact them so they can recreate this issue and try to fix it.\n\nI have seen numerous reports of this problem. Where there are those that publicly report it there are many more it does happen to that do not report it publicly (meaning in Etsy subs/forums/etc.) or even contact customer support. They will just abandon Etsy if they can't access their cart and check out.\n\nEtsy does not seem interested in fixing this problem for the masses.\n\nI will try maybe tonight to add the items above 20/40 in my cart and see what happens. I am sure the same thing since no one \"fixed\" anything.\n\nI also wanted to add that while my cart would be inaccessible again that means I would not be able to make any purchases for however long they are \"looking into it\".\n\nEdited to add ' 11/6 adding items back into my cart so I can purchase them. I still have not purchased these beads I want to purchase. Over a week now. Etsy sellers are losing sales. I have 44 items in my cart and I get the same error, \"uh oh a stitch has gone awry\" and I cannot accesss the cart at all. I will be contacting support and will let you all know here if my cart ever gets fixed and if I am ever able to purchase these beads! My case is not an isolated incident I am confident of that. Most buyers will not contact Etsy and abandon their cart and Etsy if they can't access the cart to purchase.",
      "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lvjci70/",
      "created": 1730821300,
      "depth": 0,
      "replies": [
        {
          "id": "lvplh0h",
          "score": 1,
          "body": "Oh wow y'all, this is what buyers and sellers deal with.\n\nMy chat just now with customer support as a buyer on this issue -\n\nM\\*\\*\\*\\*\\*\\* says: Hello \\*\\*\\*\\*\\*\n\n8:41 AM\n\n(me) says: Hello, I have had a problem with not being able to access my cart. You can look back and see. I received a reply from J\\*\\*\\*\\*\\* - zendesk. She said that because the items were removed from my cart when you fixed my cart last they cannot help and recreate the problem to try to fix. They said if it happens again to contact Etsy support so that they can try to fix this problem. I am not sure if I contact you or reply to the email J\\*\\*\\*\\* sent. But, please do not touch anything in my cart, but pass this to J\\*\\*\\*\\* -zendesk.\n\nSent · 8:41 AM\n\nM\\*\\*\\*\\*\\*\n\nM\\*\\*\\*\\*\\*\\* says: I'm sorry to hear that you're having issue accessing your cart.\n\n8:44 AM\n\nM\\*\\*\\*\\*\\* says: I'll be glad to check that for you.\n\n8:44 AM\n\nM\\*\\*\\*\\*\\* says: To assist you as quickly as possible and to make sure your account is secure, please respond with the following:\n\n8:44 AM\n\nM\\*\\*\\*\\*\\*\\* says: \\*Email address associated to your account\n\n8:45 AM\n\nM\\*\\*\\*\\*\\*\\*\\* says: \\* Default Shipping address on account\n\n8:45 AM\n\nM\\*\\*\\*\\*\\*\\*\\* says: \\* Last Device Signed in on\n\n8:45 AM\n\n(me) says\" \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* J\\*\\*\\*\\*\\* said this needs to get to them so they can try to fix this problem.\n\nSent · 8:45 AM\n\nM\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nM\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* says: Thanks for the information. One moment please.\n\n8:47 AM\n\nM\\*\\*\\*\\*\\*\\*\\*\\* says: Thanks for waiting.\n\nM\\*\\*\\*\\*\\*\\*\n\nM\\*\\*\\*\\*\\*\\*\\*\\*\\* says: After taking a look, it appears here on my end that you have a lot of item in your cart.\n\nJust now\n\nM\\*\\*\\*\\*\\*\\*\\*\\*\\* says: I'll be glad to move it in your favorites\n\nJust now\n\nsays: NO\n\nSent · Just now\n\nM\\*\\*\\*\\*\\*\\*\\*\\* says: That way you'll be able to access your cart.\n\nOr we will move it to Save for later\"\n\nFYI - only 44 items in my cart.\n\nReally Etsy?",
          "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lvplh0h/",
          "created": 1730901482,
          "depth": 1,
          "replies": [
            {
              "id": "lvqyb8y",
              "score": 1,
              "body": "Rather than posting new in my thread here I will post new to this string of posts so as not to confuse.\n\nJust got done with zendesk support. FYI, I don't blame them. They are only doing their job with what they are given to work with. I blame management.\n\nI will call the support person zendesk. FYI, zendesk is a step higher of support than standard support.\n\nZendesk said they checked with engineering and they are now not seeing the same results even though initially they did. After refreshing the page a few times they were able to get to checkout.\n\nThey then said that if I continue to see the same error after refreshing. Yes I do. When I click on my cart I get a white screen with \"uh oh something has gone awry\". And cannot access the cart unless Etsy removes the items in my cart.\n\nBut, Zendesk said if this keeps happening, of course it will as nothing has been fixed. Anyway, that I will need to check out each time with fewer items. Which is what the support person said the other day. I said to him, surely you understand how ridiculous this is? He said, \"I do, really I do\".\n\nEtsy would not know how many buyers this happens to. They would only know if that buyer contacted support. Most would abandon Etsy and probably do if this happens to them. I don't want to check out in smaller amounts. That is frustrating. Plus if the seller has large order discounts the buyer would lose on that.\n\nI believe I am going to send Elliot management a letter in the mail not to email, but their office address and address it to the board member of Etsy. If they don't care either then neither should buyers and go elsewhere.\n\nInitially I said this would not affect my shop as buyers don't buy more than 10 or 15 items at a time on occasion. It would affect supply shops. But, not at Christmas time. It would affect all shops at Christmas time. Say a buyer comes to Etsy to purchase gifts for 50, 75 people. They add those items into their cart for those people. Something from my shop is included in their cart to purchase. They then get the error and can't check out. If a buyer adds one item from my shop into that list I lose the sale and so do all the other sellers that were included in that purchase.\n\nAs of today I can't access my cart. Therefore I can't buy on Etsy. I think I will do a Google lens search and see if I can find those beads elsewhere.\n\nIf Etsy ever fixes the cart and I am able to purchase I will come back and post here.",
              "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lvqyb8y/",
              "created": 1730914857,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvm69ws",
      "score": 1,
      "body": "Was looking to buy a printed T-shirt yesterday and its all trash. Anything good is ppl dropshipping \"handmade\" goods from India/China... >.>",
      "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lvm69ws/",
      "created": 1730851758,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw917ki",
      "score": 1,
      "body": "Just wanted to post the final results of my OP.\n\nAs I have already stated in this thread what happened when I contacted support. I will jump to the end here.\n\nThe support person (zendesk next level Etsy support) very nice individual passed all I reported to the engineering team. Including my last follow up.\n\nWhich is - I can add up to 18 items before the cart glitches out. It does not matter what browser.\n\nI have also figured out I can add 99 items and purchase as a GUEST (not signed into an account) under the same browser that I am having the problem signed in on.\n\nHowever, I refuse to do that. I can't access my favorites as a guest so I can't add those items into my cart. I also like to buy signed into the account in case I have a problem with the order. And it just feels more secure buying while signed in to my account. I simply won't purchase this way as a guest, too frustrating when I rely on my favorites as well.\n\nThe fact I can purchase properly as a guest from the same browser proves to me that it is indeed an Etsy issue and not an issue on my end.\n\nHowever, because engineering said they can get to the cart after refreshing multiple times even though I can't it appears they have washed their hands of it. It also appears that if the incident cannot be recreated by them they cannot fix the problem. Surely, an experienced engineer can look through the coding and spot the problem?\n\nAnyway, Etsy has no intention of fixing this problem.\n\n155k views on this thread and 51 shares. And Etsy simply does not care to have a functioning cart nor do they want large orders. I am sure it is a random issue and does not happen to everyone. I also believe it to be a widespread issue over at least a couple of years. I first had it happen a couple of years ago in my main account. Of course I reported it, they had to fix my cart.\n\nAnyway, that is that... I have found similar beads off of Etsy.",
      "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lw917ki/",
      "created": 1731161608,
      "depth": 0,
      "replies": []
    },
    {
      "id": "luylb03",
      "score": -8,
      "body": "This is the dumbest DD and is NOT the reason why.",
      "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/luylb03/",
      "created": 1730514400,
      "depth": 0,
      "replies": [
        {
          "id": "luymma5",
          "score": 13,
          "body": "I said it is one reason why. If you understand gross merchandising sales and buyers cannot make purchases because a buyer cannot access the cart to do so there is obviously a correlation and sales not being made that would be with a properly functioning cart.",
          "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/luymma5/",
          "created": 1730514949,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lv68znw",
      "score": 0,
      "body": "I like Etsy because I can get a mounted faux taxidermy unicorn head.  I think they need to highlight awesome stores. They aren't Amazon with their two day promised delivery. I think they had in their early days created a lot of one of kind stuff. I hate to see them try to be Amazon. They need to show the stuff that is the fastest selling or sold out and popular on the site. Not the advertiser focused trending. \n\nI also think that you are hyper focused on this and probably are facing this rather than something that you can't confront in your personal life. I wish you well and hope you feel ready and able to handle it.",
      "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lv68znw/",
      "created": 1730639881,
      "depth": 0,
      "replies": [
        {
          "id": "lv6af8a",
          "score": 1,
          "body": "\"I also think that you are hyper focused on this and probably are facing this rather than something that you can't confront in your personal life. I wish you well and hope you feel ready and able to handle it.\" Huh? The ability to purchase on Etsy has nothing to do with my personal life. Yep, I am most definitely able to \"handle it\" - ready, willing, and able of purchasing these items on Etsy if and when Etsy fixes the cart. I wish you well too!",
          "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/lv6af8a/",
          "created": 1730640466,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "luyfc3b",
      "score": -16,
      "body": "Nice blog. TLDR.",
      "permalink": "/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/luyfc3b/",
      "created": 1730511963,
      "depth": 0,
      "replies": []
    }
  ]
}