{
  "title": "Globalstar and Apple expanded partnership ",
  "score": 32,
  "selftext": "Does anyone have anymore information on Globalstar GSAT and Apple AAPL expanded partnership? Is GSAT a buy after the 40% rise in share price?.\n\nHere is some information I have , but is there anything I should be aware of ? \n\nThe expanded partnership between Globalstar (GSAT) and Apple (APL) could bring significant long-  term benefits to Globalstar's stock, though some challenges may stil lie ahead.  \nPotential Positive Impacts  I. Revenue Growth: With Apple prepaying up to $1.1 billion and committing to pay additional  service fees, Globalstar can expect substantial revenue growth. The agreement is projected to  more than double Globalstar's annual revenue compared to 2024 levels, primarily driven by the  new satellite network's capacity and performance milestones  2. Market Confidence: Apple's involvement and the substantial upfront payments provide market  validation for Globalstar, boosting investor confidence. A stronger association with Apple, along  with its 20% equity stake in Globalstar's satellite network, reinforces the viability and demand for  satellite-enabled connectivity, especially in remote and underserved areas\n3. Future Expansion Opportunities: The network's design and expanded ground infrastructure  allow Globalstar to potentially explore new revenue streams, including other high-reliability  C  industries (e.g., maritime or government sectors), beyond its arrangement with Apple cOwews  \nPotential Risks  \n1. High Dependency on Apple: The partners. p heavily ties Globalstar's growth trajectory to zero.\n3. Future Expansion Opportunities: The network's design and expanded ground infrastructure  allow Globalstar to potentially explore new revenue streams, including other high-reliability  industries (e.g. maritime or government sectors), beyond its arrangement with Apple.\nPotential Risks  \n1. High Dependency on Apple: The partnership heavily ties Globalstar's growth trajectory to  Apple's needs and future directions. If Apple shifts its strategic focus away from satellite  communication, Globalstar's revenue and stock could be negatively affected,  \n2. Execution Risks: Globalstar must deliver the new MSS network according to Apple's  performance milestones. Failing to meet these milestones could result in reduced or delayed  payments, which would likely impact the stock negatively.\nIn the near term, Globalstar's stock may experience heightened volatility, as its year-to-date  performance has already been variable. However, if Globalstar manages this partnership successfully.  it could see sustained growth, especially as satelite connectivity becomes increasingly relevant to  tech giants like Apple.\n",
  "link_flair_text": null,
  "id": "1gi2s7x",
  "num_comments": 9,
  "created_utc": 1730571638,
  "permalink": "/r/stocks/comments/1gi2s7x/globalstar_and_apple_expanded_partnership/",
  "comments": [
    {
      "id": "lv2gura",
      "score": 9,
      "body": "They are due to launch new sats soon, if successful they might rise further. \n\n\nIt would be worth checking out how healthy their constellation looks at the moment.\n\n\nLooks like they may have dropped the ball on their non-apple business. They haven't released a new phone since the GSP1700 came out 10+ years ago and that may be out of production\n\n\nTheir spot messengers are getting a bit dated\n\n\nStiff competition from iridium,starlink,inmarsat,Thuraya\n\n\nASTS & friends nipping at their heels\n\n\nLow bandwidth capacity\n\n\nAsset tracking business quite small",
      "permalink": "/r/stocks/comments/1gi2s7x/globalstar_and_apple_expanded_partnership/lv2gura/",
      "created": 1730577312,
      "depth": 0,
      "replies": [
        {
          "id": "lv34fyg",
          "score": 4,
          "body": ">ASTS & friends nipping at their heels \n\n\nAnd offering a vastly superior product. 35 mbps instead of dialup equivalent speeds, 4g/5g instead of text only, sub millisecond latency instead of seconds, better signal strength and penetration indoors and under cover due to their low bandwidth capabilities which is only an option for ASTS due to the ridiculous size of their satellites.",
          "permalink": "/r/stocks/comments/1gi2s7x/globalstar_and_apple_expanded_partnership/lv34fyg/",
          "created": 1730585263,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lv2hsn0",
      "score": 4,
      "body": "The investment isnt a huge amount for Apple either. Wouldnt surprise me if in 5 years they say phuck it we're using irdm or some other company for satellite services and let gsat die",
      "permalink": "/r/stocks/comments/1gi2s7x/globalstar_and_apple_expanded_partnership/lv2hsn0/",
      "created": 1730577614,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv2sil4",
      "score": 3,
      "body": "Look into MDA....the satellite manufacturer they are likely to contract out to\n\nunder the radar mostly but it's already starting to move. Still early innings of gains imo.",
      "permalink": "/r/stocks/comments/1gi2s7x/globalstar_and_apple_expanded_partnership/lv2sil4/",
      "created": 1730581135,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvaely9",
      "score": 3,
      "body": "Poor Globalstar!  Yes, they have the Apple connection and they are trying their hardest to succeed.  At current, $1.38 per share why not be a part of this company as well as the others?  The price is right and when Apple gets serious, they will be a good producer.  I have a low stake 300 shares @ 1.43 so I’m still waiting for them to improve.   Take that as a hold for now, and they have nowhere else to go but up.  Long hold.",
      "permalink": "/r/stocks/comments/1gi2s7x/globalstar_and_apple_expanded_partnership/lvaely9/",
      "created": 1730688237,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvh07qp",
      "score": 3,
      "body": "Long hold. With money, things and technology can improve",
      "permalink": "/r/stocks/comments/1gi2s7x/globalstar_and_apple_expanded_partnership/lvh07qp/",
      "created": 1730780477,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv2qbeg",
      "score": 2,
      "body": "Try r/gsat",
      "permalink": "/r/stocks/comments/1gi2s7x/globalstar_and_apple_expanded_partnership/lv2qbeg/",
      "created": 1730580405,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvk0i7a",
      "score": 2,
      "body": "My speculation is that this is the first step to Apple cutting out the middlemen.\nFirst, the towers , Verizon, At&T, T-Mobile, etc and they don't want new middlemen like Starlink and Space Mobile so they are getting a 20% stake in GSAT with the goal to eventual buy the entire company once it's been proven to work. They have already booked 80 % of GSATS capacity for the future.",
      "permalink": "/r/stocks/comments/1gi2s7x/globalstar_and_apple_expanded_partnership/lvk0i7a/",
      "created": 1730828331,
      "depth": 0,
      "replies": []
    }
  ]
}