{
  "title": "Healthcare company with a MOAT ?",
  "score": 40,
  "selftext": "Hey all,\n\nI've been diving deep into the healthcare and defense sector as of late. I found defense much easier to understand as a former military member who dealt directly with most products.\n\nHowever the healthcare sector has been very tricky. On one hand I look at kvue for their strong branding like tylenol but with the less than attractive valuation & single digit growth projections it's left me searching elsewhere.\n\nThe issue I see is I don't find anyone has a moat, novo nordisq was appealing but from what I've gathered their market share on a lot of their product is compromised rather quickly. Ozempic is a strong product but how secure is that product?\n\nI have found other niche such as eye care or senior living reits but nothing quite attracted me.\n\nIf you yourself know of companies within the healthcare sector who has a moat I'd love to hear it. Or if there's any healthcare company you have in your portfolio let me know. I'll be doing my own valuation & analysis but suggestions are more than welcomed.",
  "link_flair_text": "Industry Question",
  "id": "1gis61k",
  "num_comments": 69,
  "created_utc": 1730654875,
  "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/",
  "comments": [
    {
      "id": "lv7qjr2",
      "score": 17,
      "body": "Best companies I’ve found in the sector are: tmo, wst, isrg, syk, idxx/zts, and unh. All good business with solid moats. Some more niche/speculative options are clpt and tmdx.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7qjr2/",
      "created": 1730657193,
      "depth": 0,
      "replies": [
        {
          "id": "lv96ttq",
          "score": 5,
          "body": "Regarding TMO - I personally think they're a great company but they've been stuck in the same range for the last two years. Resistance seem to be around \\~$600",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv96ttq/",
          "created": 1730673185,
          "depth": 1,
          "replies": [
            {
              "id": "lv9g2hd",
              "score": 5,
              "body": "Thermo Fisher supplies the whole biotech industry. That imploded in 2021 and is currently rebuilding again.\n\nIt's going to be a while but if you are a buy and hold type it's provides an opportunity to gain higher alpha than holding SPY going forward. Removing COVID from the equation, it normally trades at a 30 PE which is right about where it is now.",
              "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv9g2hd/",
              "created": 1730676117,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lv7q012",
      "score": 31,
      "body": "Intuitive Surgical has as much a moat as any. Sell the davinci machines and lock in longterm contracts for service and upgrade of those machines. No other large players making the same sort of surgery-assisting systems.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7q012/",
      "created": 1730657034,
      "depth": 0,
      "replies": [
        {
          "id": "lv7rzux",
          "score": 26,
          "body": "But it also has a 80 PE ratio, so miss us with that overpriced stuff.",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7rzux/",
          "created": 1730657624,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lv961sa",
          "score": 7,
          "body": "We're talking med. devices, correct? MedTronic is already in this space with their own RAS, and I predict Thermo-Fischer will be rolling out their own in the near future",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv961sa/",
          "created": 1730672937,
          "depth": 1,
          "replies": [
            {
              "id": "lv9tbft",
              "score": 8,
              "body": "Not even close as ISGR. Its like comparing Yahoo with Google.\nIntuitive does not have strong competion. Also, current the DaVinci system is around 2B, huge investment for hospitals and doctors training. Most likely doctors wont want to switch systems.",
              "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv9tbft/",
              "created": 1730680517,
              "depth": 2,
              "replies": [
                {
                  "id": "lva4ctv",
                  "score": 4,
                  "body": "I’d also add, holding both in my portfolio, that iSRG is up 170% over the past 5 years while MDT is actually down 17%   So the market also sees them as pretty different companies",
                  "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lva4ctv/",
                  "created": 1730684479,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvb0ifk",
          "score": 2,
          "body": "Their da Vinci surgical systems really do create a strong competitive moat with those long-term service and upgrade contracts. The technology is unique, and the training and support they provide helps solidify their market position. It’s interesting to see how they maintain a significant barrier to entry in a niche that requires extensive expertise.",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lvb0ifk/",
          "created": 1730697971,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lv7waxm",
      "score": 11,
      "body": "JNJ, CVS",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7waxm/",
      "created": 1730658893,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv9vq8y",
      "score": 10,
      "body": "The defensive picks:\n\nMcKesson: supplier of dressings and the endless plastic products needed in hospitals. \n\nJNJ:  they spun off their lower margin business and are focusing on medical devices. still large portfolio of businesses\n\nSpecialist picks:\n\nEdwards Lifesciences: medical device maker, known for their heart valve business\n\nISRG: I personally did not think that robotic surgery was going to be such a big thing but boy was I wrong on this one. Even no name hospitals in the middle of Tennessee is buying Davincis and hiring surgeons for them.\n\nAngiodynamics, Boston scientific: vascular surgery is another device heavy area\n\nStryker: they have some of the slickest reps. purveyors of fine dining and NFL tickets is all I'm saying. And clearly the strategy works. Ortho and neurosurg equipment sell for obscene margins.\n\nBoring legacy picks: don't ever pay a high multiple for these. only buy when cheap\n\nPfizer, Bristol Meyers Squibb, Roche, Merck: conglomerates that provide the \"drips\". Drip for cancer (chemo), drip for low blood pressure (pressors), drip for infection (antibiotics). You name it, they drip it. Slow growing, consistent businesses. Stock price goes down reliably when their blockbuster drug patent gets close to expiring. Dividend payers. I own pfizer and BMY.\n\nThe next big thing picks: 10X or zero in the next decade who knows\n\nModerna: doing poorly because the vaccine business is a low margin business and right now it only has vaccines. working on personalized cancer vaccine which if works would change the landscape of medicine.\n\nTMDX: an all in one organ transplant provider. business may not make any sense (own and maintain a fleet of jets?) from an outsiders perspective. however, the ability to do what they do is highly valued from hospital standpoint. organ procurement, transport, preservation, transplantation is immensely complex and no hospital administrator wants to deal with this.\n\nUTHR: currently their subsidiary revivicor has developed genetically modified pigs which have certain immunogenic surface markers knocked out (FDA approved 2020). Further work is ongoing to get to the point where such pigs can provide endless organs for human transplantation. Success of this technology will change organ transplantation and medicine as we know it. Ironically if this works out TMDX above becomes a big fat zero.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv9vq8y/",
      "created": 1730681360,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv852kj",
      "score": 10,
      "body": "HCA their moat is that they are swindling the government for money.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv852kj/",
      "created": 1730661504,
      "depth": 0,
      "replies": [
        {
          "id": "lv8qklx",
          "score": 0,
          "body": "They are still at the mercy of the gov/reimbursement",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv8qklx/",
          "created": 1730668064,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lva4l00",
          "score": 0,
          "body": "That’s not a moat - that’s true for the whole category",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lva4l00/",
          "created": 1730684560,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lv8frt0",
          "score": -2,
          "body": "100%.  As with most insurers.   ACA really helped increase profits for all these insurers to records.",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv8frt0/",
          "created": 1730664782,
          "depth": 1,
          "replies": [
            {
              "id": "lv8odjo",
              "score": 0,
              "body": "As opposed to the records before aca?",
              "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv8odjo/",
              "created": 1730667389,
              "depth": 2,
              "replies": [
                {
                  "id": "lv8x45c",
                  "score": -3,
                  "body": "Look it up.  It increased at a significantly higher rate after ACA.  The guaranteed payments from the portal and shitty insurance that provides nothing to those low income families because deductibles, copays, and drugs costs are still too much.  Insurance companies make put like a bandit thanks to Obama",
                  "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv8x45c/",
                  "created": 1730670120,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lv7kbnf",
      "score": 7,
      "body": "ABT, UNH, CAH\n\nI also own a very small amount of CVS. They could build a moat if Aetna becomes like UNH. Also their PBM business is a moat maybe.\n\nAlso own ABBV, wouldn't say they have a moat.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7kbnf/",
      "created": 1730655360,
      "depth": 0,
      "replies": [
        {
          "id": "lv8oxah",
          "score": 2,
          "body": "I have had both… Aetna and UNH and Aetna is just the damn best all around insurance I have ever had between the two in just about every single way possible.",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv8oxah/",
          "created": 1730667559,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lv80umc",
      "score": 7,
      "body": "Pfizer is undervalued right now due in part to an activist investor threat and a Covid misstep",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv80umc/",
      "created": 1730660217,
      "depth": 0,
      "replies": [
        {
          "id": "lva4y4i",
          "score": 2,
          "body": "PFE is down 27% over FIVE years.  Hardly bc of the activists or even their woeful post-Covid mistakes.   They’re chronically undervalued. It’s mystifying - maybe bc of Mgmt?",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lva4y4i/",
          "created": 1730684694,
          "depth": 1,
          "replies": [
            {
              "id": "lvanisd",
              "score": 3,
              "body": "Fair",
              "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lvanisd/",
              "created": 1730691806,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lv7rqeu",
      "score": 3,
      "body": "HCA. They’re the largest hospital chain in the country - it’s not easy to recreate a hospital chain with 186 hospitals. They have economy of scale. They’re also a cannibal, they’ve been buying back shares each year.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7rqeu/",
      "created": 1730657546,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv7q2nl",
      "score": 4,
      "body": "HCA",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7q2nl/",
      "created": 1730657054,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv7kbpj",
      "score": 4,
      "body": "Stryker makes money on selling products and servicing products through their service programs. Stryker has no real competition in selling stretchers and monitors to EMS services. The competition isn’t really all that great as many choose life pak made by Stryker versus the zoll. Stryker also sells predominantly most hospital beds to hospitals. Stryker is a leader in selling surgical equipment and products as well. Stryker just doesn’t give back to shareholders as much as it could honestly and it’s very overvalued.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7kbpj/",
      "created": 1730655360,
      "depth": 0,
      "replies": [
        {
          "id": "lv7kr24",
          "score": 1,
          "body": "I do t know why they acquired Vocera. Useless applications",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7kr24/",
          "created": 1730655489,
          "depth": 1,
          "replies": [
            {
              "id": "lw921db",
              "score": 1,
              "body": "Makes no sense if you are just looking at it from the outside. You have to be a nurse in a busy hospital to really understand why this technology is so useful. You can literally have the hospitalist on a secured speed dial (even faster than speed dial) and it's pretty convenient",
              "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lw921db/",
              "created": 1731161929,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lv7r6l4",
              "score": 0,
              "body": "There’s a reasoning behind it, the new acquisitions they’ve been making will speak for it later on.",
              "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7r6l4/",
              "created": 1730657381,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lw92hgp",
          "score": 1,
          "body": "Stryker is a hard one for me to value. The numbers alone certainly are overvalued. But as least in my experience, they understand how to sell to fickle surgeons with short attention span and inflated egos. And surgeons run hospitals because let's face it internal medicine is always a money losing business and somebody has to pay the bills.",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lw92hgp/",
          "created": 1731162103,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lv7nbzh",
      "score": 6,
      "body": "What about Intuitive Surgical ($ISRG)? It’s on my watchlist, although I haven’t done proper due dilligence on the company and its numbers yet.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7nbzh/",
      "created": 1730656267,
      "depth": 0,
      "replies": [
        {
          "id": "lv7yss6",
          "score": 3,
          "body": "Excellent balance sheet, No debt, cash cow, wide moat for the past decade as well as currently.\n\nHowever, competition will be heating up in the intermediate term.\n\nAlways trades at a sky high p/e never leaving a comfortable time to jump in.",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7yss6/",
          "created": 1730659617,
          "depth": 1,
          "replies": [
            {
              "id": "lv9u5mw",
              "score": 2,
              "body": "Thats true, they keep rising in price. Last time I was waiting for a price drop aka \"timing the market\" but they Rose even more... So, now I simply buy it Whatever the price, they will still be increasing revenue year after year",
              "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv9u5mw/",
              "created": 1730680808,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvac1ko",
      "score": 2,
      "body": "Pharma is difficult because they go through patent cliffs on their blockbusters removing whatever moat they had while on patent.  The trick is to know their patent cliffs and if they are able to survive them with enough new drugs coming to market and/or a new blockbuster creating a new moat for the interim.  They have to be watched and understood.  Some are easy (cancer drugs or cardiac medicine) while others are more difficult to interpret (e.g. rare disease).  JNJ will have Stellara competition coming soon as they lost patent on this blockbuster this past year.  MRK will lose some of it's patents on Keytruda around 2027.  Both, I think, have enough pipeline to weather these patent cliffs, but they will definitely begin to lose revenue from these programs between now and 2030.  Every large pharma with a blockbuster will face this sooner or later.  \n\n  \nSome patent cliffs aren't bad because generics can have a hard time (e.g. intraveneous could become subcutaneous extending patent).  Biologics may be used in multiple areas, etc...  Become an expert.  It's worth it.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lvac1ko/",
      "created": 1730687277,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvafk5w",
      "score": 2,
      "body": "Steris is locking down the MDR CPS biz in healthcare through acquisitions and eliminating competition.   \n\nThe moat comes from their service plans and the use of proprietary chemicals and dispensing.\n\nThe rest of their offerings are just piggyback sales and gravy.\n\nStock peice has been testing upper limit of 240, bouncing down to 220 and so on.  Earnings coming up could be an opportunity for a 2 month 10 to 12% gain.\n\nNot financial advice.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lvafk5w/",
      "created": 1730688602,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvakcg1",
      "score": 2,
      "body": "Inari ($NARI). Their flagship product is a catheter that removes blood clots from lungs. They’ve acquired a company that removes blood clots from legs. They just released a study that shows that they remove clots better than the tech (catheter based clot breakdown/lysis) that comes the closest. \n\nThey’re guidance is to be profitable in the first half 2025. \n\n\nHere’s the biggest catch. While clot removal is becoming first line for high risk clots (submassive high risk) and clots requiring blood pressure meds, the current medical guidelines still has them at second line. Once those guidelines catch up with current practice, I think we’ll see it really take off. ",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lvakcg1/",
      "created": 1730690513,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvcwf9p",
      "score": 2,
      "body": "As an Astrology enthusiast here, I have noticed whenever the Sun transits through Scorpio (Oct 20-Nov 20), the healthcare and pharmaceutical stocks go up.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lvcwf9p/",
      "created": 1730733245,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv7xmv9",
      "score": 4,
      "body": "Apple",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7xmv9/",
      "created": 1730659279,
      "depth": 0,
      "replies": [
        {
          "id": "lv8b64y",
          "score": 2,
          "body": "this is why big tech rules. When you buy Amazon you buy healthcare (pocket pills) , Google (verily Life sciences) and this does not even account for the massive parternships they have with biotech firms in cloud computing and health advances with AI",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv8b64y/",
          "created": 1730663376,
          "depth": 1,
          "replies": [
            {
              "id": "lva597j",
              "score": 0,
              "body": "Not just pocket pills in case of AmZn.  They acquired my provider (one medical) so I’ve now switched to them over cvs for prescriptions, got vaxxed there for a trip to Africa. They’ve been great.",
              "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lva597j/",
              "created": 1730684804,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lv9jen8",
      "score": 4,
      "body": "My grandmother bought me shares of Stryker around the time I was born. I’m still buying shares.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv9jen8/",
      "created": 1730677196,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv8eve1",
      "score": 3,
      "body": "Clover Health. I will get downvoted because people don’t understand the business and just think it’s a meme stock, but if you bother to do research and look into the business you will see how robust of a MOAT they have. You’re welcome.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv8eve1/",
      "created": 1730664503,
      "depth": 0,
      "replies": [
        {
          "id": "lv8fie9",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv8fie9/",
          "created": 1730664701,
          "depth": 1,
          "replies": [
            {
              "id": "lv8h0j9",
              "score": 2,
              "body": "Lol they went public via SPAC years ago. They have a moat because they are the only company that I know of on earth that has developed an AI software platform, used at the point of care by physicians, that definitively creates better health outcomes for patients at a lower cost. This AI software platform was built internally by CLOV and used with their own Medicare Advantage plan/patients. That plan now has 4 stars from CMS and the highest HEDIS score out of any MA plan in the country. Now, on top of their insurance business CLOV is selling their software as a SaaS to other Medicare Advantage providers.",
              "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv8h0j9/",
              "created": 1730665160,
              "depth": 2,
              "replies": [
                {
                  "id": "lv8hicu",
                  "score": 1,
                  "body": "The main mechanism of the software that creates better outcomes and lower costs is the software’s ability to detect chronic diseases, and start to treat them, earlier. Chronic disease is a major issue for the 65+ MA population.",
                  "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv8hicu/",
                  "created": 1730665311,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lv8l8p0",
          "score": 1,
          "body": "Are they a take out target?",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv8l8p0/",
          "created": 1730666436,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lv9e3a7",
      "score": 3,
      "body": "Do your DD on Clov. Just saying!",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv9e3a7/",
      "created": 1730675482,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv8avzc",
      "score": 1,
      "body": "McKesson is a healthcare wholesaler and the biggest one in America they are a top 10 revenue producing company in the usa",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv8avzc/",
      "created": 1730663289,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv8ds6t",
      "score": 1,
      "body": "The main moats in healthcare are regulation and scale. \n\nOver time I've thought about moats conceptually less, and focused more on financial performance. A company's moat quality is usually apparent in financial performance. \n\nFind the businesses with a LT history of high returns, consistent growth and margin expansion, and durable financial performance - particularly in difficult economic cycles for the business in question. There'll usually be a ton of great businesses on the list of companies with the above traits.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv8ds6t/",
      "created": 1730664170,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv8gk5d",
      "score": 1,
      "body": "I have some health care in my portfolio, but I don't really pretend to understand how it gets valued. I've worked within corporate healthcare companies and it seems like a hot mess across the board. The people working there, the office environment, the overall outlook for everyone.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv8gk5d/",
      "created": 1730665023,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv9gsyy",
      "score": 1,
      "body": "I would say you can’t go wrong with JNJ , Abbvie, Medtronic, proctor and Gamble",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv9gsyy/",
      "created": 1730676352,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvc8lf5",
      "score": 1,
      "body": "I don’t have any advice for you on the healthcare front.  Was wondering what you like in the defensive sector.  Like hearing from somebody that knows the sector they talk about",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lvc8lf5/",
      "created": 1730724798,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvceugf",
      "score": 1,
      "body": "Any provider of health care machinery has a pretty big moat. The regulatory hurdles you have to jump through to get approved in order to ´have a chance and get picked up by health care providers is as tough as it gets. \n\nThe ones that can provide an entire hospital environment have an even bigger moat as once that infrastructure is established within a hospital any new machine that is 'native' to that environment has a big advantage over competitors.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lvceugf/",
      "created": 1730727265,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvcsf4r",
      "score": 1,
      "body": "How about CorMedix?",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lvcsf4r/",
      "created": 1730731972,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv7vyp3",
      "score": 1,
      "body": "Besides the obvious like HCA, Intuitive, CVS…. A lot of genomic stocks have been crushed and will have moat if their therapeutic gets approved. An example would be CRISPR that has a cure for sickle cell. Only competitor is blue bird bio which will likely go under.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7vyp3/",
      "created": 1730658792,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv7r1ce",
      "score": 0,
      "body": "Their profits are all at the mercy of government policy",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7r1ce/",
      "created": 1730657338,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lva6qwv",
      "score": -2,
      "body": "Generally people no longer build moats as there is no castle to protect and no invading forces/armies.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lva6qwv/",
      "created": 1730685350,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv7peo8",
      "score": 0,
      "body": "I love Addus. With our aging population, there should always be demand.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7peo8/",
      "created": 1730656859,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv80myd",
      "score": 0,
      "body": "Centene is a hot buy. They’re one of the largest Medicaid insurers in the nation and if musk’s plan causes a recession or ACA is removed, a lot of people are going to jump on Medicaid.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv80myd/",
      "created": 1730660156,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv9589v",
      "score": 0,
      "body": "What about medical devices? TMO comes to mind as having a bit of a MOAT. I personally haven't been able to find a \"pure play\" healthcare company.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv9589v/",
      "created": 1730672678,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv7mkxl",
      "score": -1,
      "body": "TMO. Picks and shovel monopoly in a sector poised for a cyclical rebound",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7mkxl/",
      "created": 1730656038,
      "depth": 0,
      "replies": [
        {
          "id": "lv834c3",
          "score": 3,
          "body": "Thermo Fisher is a good company but is not even close to a monopoly. They’re the biggest in that space but there are a ton of other companies that make various analytical instruments, diagnostic tools, consumables, and software.",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv834c3/",
          "created": 1730660905,
          "depth": 1,
          "replies": [
            {
              "id": "lv8hz8l",
              "score": 0,
              "body": "Come on, I don't think he meant they're a monopoly in the entire fields. They do have several markets cornered so they are \"monopolistic\"",
              "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv8hz8l/",
              "created": 1730665453,
              "depth": 2,
              "replies": [
                {
                  "id": "lv93cps",
                  "score": 5,
                  "body": "People throw the word \"monopoly\" around on here way too often so it's actually hard to know what someone means...",
                  "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv93cps/",
                  "created": 1730672104,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lv7vugl",
          "score": 2,
          "body": "I like Thermo but curious what the catalyst for the cyclical rebound is?",
          "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7vugl/",
          "created": 1730658758,
          "depth": 1,
          "replies": [
            {
              "id": "lv818uv",
              "score": 0,
              "body": "Declining rate environment, mean reversion",
              "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv818uv/",
              "created": 1730660335,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lv7nzd1",
      "score": -2,
      "body": "ILMN. Moat that can't be touched",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7nzd1/",
      "created": 1730656461,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lv7tlfp",
      "score": -2,
      "body": "I looked at the Novo one a few years ago and found it very overpriced. Apparently they have an impressive R&D pipeline that delivers. Never bought any of them, but would have made a lot if i had. Problem is the difficulties of guessing what they have in 5 years.",
      "permalink": "/r/stocks/comments/1gis61k/healthcare_company_with_a_moat/lv7tlfp/",
      "created": 1730658098,
      "depth": 0,
      "replies": []
    }
  ]
}