{
  "title": "Oil giant Saudi Aramco posts 15% drop in third-quarter profit but maintains dividend",
  "score": 122,
  "selftext": "Saudi state oil giant Aramco reported a 15.4% drop in net profit in the third-quarter on the back of “lower crude oil prices and weakening refining margins,” but maintained a 31.05 billion dividend.\n\nThe company reported net income of $27.56 billion in the July-September period, topping a company-provided estimate of $26.9 billion. The print is also a 5% drop from the previous quarter, which came in at $29.1 billion, as lower global oil prices, weaker demand and prolonged OPEC+ production cuts led by Saudi Arabia continue to impact crude prices.\n\nThe average selling price of oil for the second quarter of 2024 stood at $85 per barrel, but dropped to $78.7 per barrel during the third quarter, according to Saudi-based bank Al Rajhi capital, as non-OPEC supply volumes grew.\n\nThe oil firm said its year-on-year decline was partly offset by a “reduction in selling, administrative and general expenses primarily driven by a gain from derivative instruments, and a decrease in production royalties largely reflecting lower crude oil prices and a lower average effective royalty rate compared to the same quarter last year.”\n\nAramco’s dividend includes a base payout of $20.3 billion and an atypical performance-linked one of $10.8 billion. The Saudi government and the kingdom’s sovereign wealth vehicle, the Public Investment Fund, are the main beneficiaries of the dividend, holding stakes of roughly 81.5% and 16% in the company.\n\nThe remaining shareholding trades freely on Saudi Arabia’s Tadāwul stock exchange, with the company having finalized its second public share offering back in June.\n\nAramco’s earnings before Interest and Taxes (EBIT) came in at $51.45 billion in the third quarter, down 17% year-on-year. Aramco’s capital expenditure guidance was brought up 20% to $13.23 billion.\n\nThe company was trading at 27.45 riyals following the announcement, down 0.18% on the previous day.\n\nThe earnings align with a broader trend across oil majors, whose third-quarter profits have also suffered from declines in crude prices and refining margins. Aramco said it achieved average realized crude price of $79.3 per barrel in the third quarter, compared with $89.3 per barrel in the same period of last year.\n\nSaudi Arabia, the world’s largest crude exporter who produces roughly 9 million barrels per day of crude at present, serves as the de facto leader of the OPEC+ oil producers’ alliance, a subset of whom agreed over the weekend to delay a planned December output hike by one month.\n\n“Aramco delivered robust net income and generated strong free cash flow during the third quarter, despite a lower oil price environment,” CEO Amin Nasser said in a statement. “We also progressed our upstream developments, strengthened our downstream value chain, and advanced our new energies program as we continue to invest through cycles.”\n\nThe revenues will be a boon to the Saudi economy, which is currently undergoing a diversification process under Crown Prince Mohammed bin Salman’s legacy Vision 2030 scheme spanning a slew of high-cost infrastructure “gigaprojects.”\n\nEarlier this year, Saudi Arabia’s Ministry of Finance cut the kingdom’s growth forecast to 0.8% in 2024, in a steep decline from a previous projection of 4.4%, and raised the outlook for the national budgetary shortfall to roughly 2.9% of GDP, from a prior indication of 1.9%.\n\nSource: https://www.cnbc.com/2024/11/05/oil-giant-saudi-aramco-posts-15percent-drop-in-third-quarter-profit-but-maintains-dividend.html",
  "link_flair_text": null,
  "id": "1gk57du",
  "num_comments": 9,
  "created_utc": 1730808639,
  "permalink": "/r/stocks/comments/1gk57du/oil_giant_saudi_aramco_posts_15_drop_in/",
  "comments": [
    {
      "id": "lvj1mov",
      "score": 51,
      "body": "\"Saudi Government and it's Sovereign Wealth Fund are it's biggest shareholders\" that right there is why the dividend was untouched even after the profit decline.\n\nOr maybe cuz their net income is still in the tens of billions and they can get away with their dividend payout.",
      "permalink": "/r/stocks/comments/1gk57du/oil_giant_saudi_aramco_posts_15_drop_in/lvj1mov/",
      "created": 1730817942,
      "depth": 0,
      "replies": [
        {
          "id": "lvj78rg",
          "score": 29,
          "body": "The entire country and all its lavish spending depends on a company that makes as much profit as Google. Yikes. Maybe time for Saudi to spend less on football players.",
          "permalink": "/r/stocks/comments/1gk57du/oil_giant_saudi_aramco_posts_15_drop_in/lvj78rg/",
          "created": 1730819709,
          "depth": 1,
          "replies": [
            {
              "id": "lvl9ym9",
              "score": 5,
              "body": "Leave my Neymar alone!",
              "permalink": "/r/stocks/comments/1gk57du/oil_giant_saudi_aramco_posts_15_drop_in/lvl9ym9/",
              "created": 1730841563,
              "depth": 2,
              "replies": [
                {
                  "id": "lw1oh20",
                  "score": 1,
                  "body": "Mother fucker keeps injuring himself, I want a refund",
                  "permalink": "/r/stocks/comments/1gk57du/oil_giant_saudi_aramco_posts_15_drop_in/lw1oh20/",
                  "created": 1731052553,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvk0pml",
      "score": 21,
      "body": "The Saudis, Emirates, Kuwait, Bahrain, Qatar.\nSo much money they could use for the RELIABLE future of the countries, yet they waste it on stupid projects that will neber make it they way they were supposed to work.",
      "permalink": "/r/stocks/comments/1gk57du/oil_giant_saudi_aramco_posts_15_drop_in/lvk0pml/",
      "created": 1730828392,
      "depth": 0,
      "replies": [
        {
          "id": "lvm358q",
          "score": 5,
          "body": "Most of these countries have more money than they can ever spend. Qatar has like 600 years worth of oil and gas reserves.",
          "permalink": "/r/stocks/comments/1gk57du/oil_giant_saudi_aramco_posts_15_drop_in/lvm358q/",
          "created": 1730850674,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvk4xs0",
          "score": 8,
          "body": "It’s a way to funnel the money into their own bank accounts. Most of the local contractors are tied to princes and emirs in one way or another.\nWho cares about a 50 billion dollar project with contractors racking up billions when the contractor is you and your family and friends :)",
          "permalink": "/r/stocks/comments/1gk57du/oil_giant_saudi_aramco_posts_15_drop_in/lvk4xs0/",
          "created": 1730829605,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvqceh3",
          "score": 1,
          "body": "What are your ideas? Maybe you can help",
          "permalink": "/r/stocks/comments/1gk57du/oil_giant_saudi_aramco_posts_15_drop_in/lvqceh3/",
          "created": 1730909020,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvrq0je",
      "score": 1,
      "body": "If electric vehicles become more of a thing they will take a bigger hit",
      "permalink": "/r/stocks/comments/1gk57du/oil_giant_saudi_aramco_posts_15_drop_in/lvrq0je/",
      "created": 1730922391,
      "depth": 0,
      "replies": []
    }
  ]
}