{
  "title": "Burger King parent Restaurant Brands falls short of Q3 revenue expectations",
  "score": 38,
  "selftext": "Restaurant Brands International on Tuesday reported quarterly earnings and revenue that missed analysts’ expectations as domestic same-store sales growth for all four of its chains fell short of Wall Street estimates.\n\nHere’s what the company reported compared with what Wall Street was expecting, based on a survey of analysts by LSEG:\n\nEarnings per share: 93 cents adjusted vs. 95 cents expected\n\nRevenue: $2.29 billion vs. $2.31 billion expected\n\nRestaurant Brands reported third-quarter net income attributable to common shareholders of $252 million, or 79 cents per share, unchanged from a year earlier.\n\nExcluding items, the company earned 93 cents per share.\n\nNet sales climbed 24.7% to $2.29 billion, largely thanks to the company’s acquisitions of its largest U.S. Burger King franchisee and its Popeyes business in China earlier this year.\n\nThe company’s worldwide same-store sales grew just 0.3% in the quarter. Burger King, Firehouse Subs and Popeyes all reported same-store sales declines in their home markets.\n\nBurger King’s same-store sales fell 0.7%. The chain is in the middle of a turnaround in the U.S., but consumers are also spending less at restaurants, reigniting the value wars between Burger King and its rivals.\n\nPopeyes reported same-store sales declines of 4%. In June, the chain launched boneless wings as a permanent menu item for the first time in its history.\n\nFirehouse Subs saw its same-store sales shrink 4.8% in the quarter. The sandwich chain is the latest addition to Restaurant Brands’ portfolio, as of 2021, and the smallest brand by footprint with just 1,300 locations as of the end of the third quarter.\n\nTim Hortons was the top performer, with domestic same-store sales growth of 2.3%. But the Canadian coffee chain still fell short of Wall Street’s same-store sales growth expectations of 4.1%, based on StreetAccount estimates.\n\nOutside of the U.S. and Canada, Restaurant Brands’ international same-store sales rose 1.8% in the quarter, just shy of estimates of 2.2%.\n\nSource: https://www.cnbc.com/2024/11/05/restaurant-brands-international-qsr-earnings-q3-2024.html",
  "link_flair_text": null,
  "id": "1gk58jr",
  "num_comments": 6,
  "created_utc": 1730808758,
  "permalink": "/r/stocks/comments/1gk58jr/burger_king_parent_restaurant_brands_falls_short/",
  "comments": [
    {
      "id": "lvkdhan",
      "score": 23,
      "body": "If Tim Hortons was the top performer, they must really suck",
      "permalink": "/r/stocks/comments/1gk58jr/burger_king_parent_restaurant_brands_falls_short/lvkdhan/",
      "created": 1730832061,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvlbc3h",
      "score": 13,
      "body": "Charging sit down restaurant prices for shit ass fast food? Who would’ve thought sales would decline or not meet expectations.",
      "permalink": "/r/stocks/comments/1gk58jr/burger_king_parent_restaurant_brands_falls_short/lvlbc3h/",
      "created": 1730841958,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvlljhh",
      "score": 3,
      "body": "Maybe they shouldn’t charge 15.00 for a whopper meal",
      "permalink": "/r/stocks/comments/1gk58jr/burger_king_parent_restaurant_brands_falls_short/lvlljhh/",
      "created": 1730844952,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvkujyy",
      "score": 4,
      "body": "I wouldn’t even give a homeless person Burger King. It is below garbage",
      "permalink": "/r/stocks/comments/1gk58jr/burger_king_parent_restaurant_brands_falls_short/lvkujyy/",
      "created": 1730837057,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvtf81b",
      "score": 1,
      "body": "Seems like lots of retailers and auto manufacturers showing weak sales.",
      "permalink": "/r/stocks/comments/1gk58jr/burger_king_parent_restaurant_brands_falls_short/lvtf81b/",
      "created": 1730940370,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvmkpsb",
      "score": -1,
      "body": "Any coffee is better than mud water at Tim Hortons",
      "permalink": "/r/stocks/comments/1gk58jr/burger_king_parent_restaurant_brands_falls_short/lvmkpsb/",
      "created": 1730856843,
      "depth": 0,
      "replies": []
    }
  ]
}