{
  "title": "Musk now says it's 'pointless' to build a $25,000 Tesla for human drivers",
  "score": 746,
  "selftext": "So, will there be any new car model for Tesla in 2025???\n\n&#x200B;\n\n**Musk now says it's 'pointless' to build a $25,000 Tesla for human drivers**\r  \n[https://www.reuters.com/business/autos-transportation/musk-now-says-its-pointless-build-25000-tesla-human-drivers-2024-11-05](https://www.reuters.com/business/autos-transportation/musk-now-says-its-pointless-build-25000-tesla-human-drivers-2024-11-05)\n\n&#x200B;\n\n*When Reuters reported in April that Tesla had scrapped plans for a long-promised, next-generation $25,000 electric vehicle, the automaker’s stock plunged. Chief Executive Elon Musk rushed to respond on X, his social-media network.*\r  \n*“Reuters is lying,” he posted, without elaborating. Tesla’s stock recovered some of its losses.*\r  \n*Six months later, Musk appears to have backed into an admission that Tesla dropped its plans for a human-driven $25,000 car. He said in an Oct. 23 earnings call that building the affordable EV would be \"pointless” unless the car was fully autonomous.*\r  \n*His latest remarks came in response to an investor asking: “When can we expect Tesla to give us the $25,000 non-robotaxi regular car model?”*\r  \n*Musk responded: “We’re not making a non-robo…,” before he was interrupted by another Tesla executive. Musk later added: “Basically, I think having a regular $25K model is pointless. It would be silly.”*\r  \n*The April 5 Reuters article reported that Tesla had abandoned plans for an all-new, affordable mass-market EV but still planned a self-driving robotaxi. Since then, Musk has increasingly touted plans for robotaxis and autonomous vehicles.*\r  \n*Tesla and Musk did not respond to requests for comment for this story.*\r  \n*On the October earnings call, Musk said that Tesla does plan a “$25K car” – its “Cybercab,” a two-door, two-seat, fully autonomous vehicle. Musk unveiled a prototype at a Hollywood-style event on Oct. 10.*\r  \n*Musk says Tesla will start production of the Cybercab in 2026, after it deploys fully autonomous versions of its current Model 3 and Model Y vehicles in Texas and California next year. The automaker faces steep technological, regulatory and legal challenges in delivering on Musk’s latest promises of fully autonomous vehicles, which echo others dating back about a decade.*\r  \n*An all-new affordable Tesla for human drivers had until recently been a linchpin of Tesla’s strategy to become the world’s biggest automaker. For several years, Tesla had a goal of producing 20 million vehicles a year by 2030, more than tenfold what it sells now and nearly double that of Toyota, the current global sales leader. In May, Tesla dropped the 20-million goal from its latest “impact report” on progress toward sustainability goals.*\r  \n*As recently as January of this year, Musk confirmed the plan for an all-new affordable EV in an earnings call. He said the next-generation vehicle would arrive in 2025 and launch a second major \"growth wave,” following the first wave with the release of its Model 3 and Model Y vehicles in 2017 and 2020, respectively.*\r  \n*Investors and Tesla fans commonly called the anticipated cheap car a “Model 2,” slotting in below the Model 3, currently the least-expensive Tesla, starting at $42,490.*\r  \n*In January, Musk described the all-new model as requiring “new revolutionary manufacturing technology.” But in April, after Reuters reported Tesla had scrapped the Model 2, Musk outlined a plan for “more affordable” models that could be produced “on the same manufacturing lines” as current Teslas.*\r  \n*Seth Goldstein, a Morningstar Research Services analyst, said he believes these less-expensive vehicles will be built on current Tesla platforms and priced in the mid-$30,000s.*\r  \n*“It was my understanding that the original plan was to make the more-affordable vehicle on a new platform,” he told Reuters. “I think Tesla realized they were late to making an affordable vehicle versus their Chinese-EV peers … So, they changed their strategy rather than make a large investment to produce a new vehicle.”*\r  \n*After the April 5 Reuters report that Tesla had killed the Model 2, Musk posted that day on X saying Tesla planned a “robotaxi unveil” in August. The event, delayed until October and held on a movie set near Los Angeles, underwhelmed Wall Street and drove a 9% drop in Tesla shares the following day.*\r  \n*Some investors viewed Musk’s comments on the Cybercab – along with displays of an autonomous “Robovan” concept and humanoid robots – as short on concrete details about the products. Tesla hasn’t said whether the Cybercab will feature new self-driving technology beyond the company’s “Full Self-Driving” feature in its current vehicles. Its existing models can’t fully drive themselves and require a human driver paying strict attention.*\r  \n*The target market for the Cybercab isn’t clear. The Cybercab’s sports-car looks and two-door, two-seat configuration – a nearly extinct layout in the wider U.S. auto market – puzzled some analysts who expected a robotaxi with more room for passengers and luggage.*\r  \n*Musk, in the October earnings call, said the concept vehicle’s design was “optimized for autonomy” and would also deliver affordability.*\r  \n*“It will cost … roughly 25K, so it is a 25K car,” Musk said. “It just won't have a steering wheel and pedals.”*",
  "link_flair_text": "Company News",
  "id": "1gk7fz6",
  "num_comments": 381,
  "created_utc": 1730815541,
  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/",
  "comments": [
    {
      "id": "lvivahp",
      "score": 1378,
      "body": "Are you telling me that Elon Musk lied to investors and that Tesla isn’t valued on its fundamentals? First I’m hearing about this",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvivahp/",
      "created": 1730815803,
      "depth": 0,
      "replies": [
        {
          "id": "lvj2zir",
          "score": 105,
          "body": "meme stock where the more he tweets the higher the stock goes",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj2zir/",
          "created": 1730818381,
          "depth": 1,
          "replies": [
            {
              "id": "lvja58o",
              "score": 35,
              "body": "Retail investors.  Tesla has a strong emotion driven following, similar to the GameStop retail investor movement.",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvja58o/",
              "created": 1730820595,
              "depth": 2,
              "replies": [
                {
                  "id": "lvk7bl7",
                  "score": 6,
                  "body": "I’ve seen this movie before",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk7bl7/",
                  "created": 1730830296,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lvl8ehq",
                  "score": 6,
                  "body": "But with a close to 800 billion market cap. There will be many bag holders.",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvl8ehq/",
                  "created": 1730841104,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvj9smp",
              "score": 17,
              "body": "He tweets a lot though. So it must be a good investment",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj9smp/",
              "created": 1730820488,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lviz9jb",
          "score": 138,
          "body": "Big, if true.",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lviz9jb/",
          "created": 1730817161,
          "depth": 1,
          "replies": [
            {
              "id": "lvjag4z",
              "score": 52,
              "body": "Concerning",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjag4z/",
              "created": 1730820686,
              "depth": 2,
              "replies": [
                {
                  "id": "lvkf8tx",
                  "score": 12,
                  "body": "Concerning + AI",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkf8tx/",
                  "created": 1730832568,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvj1nj9",
          "score": 39,
          "body": "We've certainly never seen this type of behavior before... oh, wait.",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj1nj9/",
          "created": 1730817950,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvj4ew3",
          "score": 12,
          "body": "Honestly, I think the model 3 is their 25k (post credit) model.  He can't admit it at this stage because it will be terrible for margins.  No point in going through all the trouble to develop a new model when they can just drop the price.",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj4ew3/",
          "created": 1730818829,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvj996f",
          "score": 17,
          "body": "Elon Musk knows that retail investors hold a huge portion of Tesla’s shares.  They’re basically like the meme investors of GameStop.  TO THE MOON!!!!!\n\n“Meme investors” do zero actual financial analysis, don’t read corporate forward guidance, don’t think about the relationship between current corporate valuations versus “what would even be a realistic valuation to grow into”… aren’t concerned with hedging overvalued positions.\n\nCompetition will be bad for Tesla.  \n\nBut really, consumers aren’t really ready for EVs yet.  If there were sudden mass adoption of EVs…. Imagine many hours long wait times at limited charging stations on highway routes.  Right now…. No problem… there aren’t many EVs proportional to gasoline light duty vehicles.\n\nThis is about stocks, so I’m keeping it focused on corporate valuations and risks to the valuation.  Tesla is priced like a big tech growth stock… with NONE of the potential for rapid growth that makes big tech growth stocks work.  Software and IT services can rapidly expand.  \n\nRapidly expanding automotive manufacturing and national energy distribution infrastructure… not a thing that can be done.\n\nAs long as tens of millions of retail investors hold their long positions though (and don’t start to cash out), it’ll at least hold.\n\nMany financial professionals think Tesla is far overpriced.  Compare it to other companies in the same sector.  It has hype, but there will be another “next big thing” and retail investors will chase it.\n\nWildly overpriced corporations that don’t grow into their valuations will eventually feel a shock (perhaps external) that sends investors running.",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj996f/",
          "created": 1730820327,
          "depth": 1,
          "replies": [
            {
              "id": "lvjszlm",
              "score": 9,
              "body": "Ya by the time it is obvious profits are not matching valuation, all the big investors will be out. It will be meme investors holding the bag. Do not really feel sorry for anyone though.",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjszlm/",
              "created": 1730826141,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lvjr9yh",
              "score": 2,
              "body": "This person knows",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjr9yh/",
              "created": 1730825643,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lvji6lv",
          "score": 10,
          "body": "i wanna see elon get fucked over.\n\npeople get lucky, and then luck ends suddenly.",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvji6lv/",
          "created": 1730822982,
          "depth": 1,
          "replies": [
            {
              "id": "lvkeej6",
              "score": 4,
              "body": "I don't think he ''just got lucky'' love him or hate him, he has done more for the EV adoption than all governements combined.",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkeej6/",
              "created": 1730832326,
              "depth": 2,
              "replies": [
                {
                  "id": "lvludut",
                  "score": 9,
                  "body": "Um. Respectfully, what? There is no Tesla without government subsidies and investment. This is like saying mineral extraction operates independently from USGS or weather reporting from NOAA or SpaceX from NASA.",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvludut/",
                  "created": 1730847733,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvk4dz7",
              "score": 2,
              "body": "China will fuck him once they take what they want from him",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk4dz7/",
              "created": 1730829448,
              "depth": 2,
              "replies": [
                {
                  "id": "lvlul1h",
                  "score": 8,
                  "body": "Heh. They already have. He can’t compete with their new ev’s at half the price, twice the distance/charge, and better (much better) service record. Andddd….. it’s taken a significant market share over Tesla in China. (Elon exports roughly a quarter of his inventory to China annually). So, with a shrinking export market and 60% tariffs, it doesn’t look good for their next ER.\n\nEdit:  You’ve gotta wonder why he hopped on-board the Trump choo-choo, considering. 🤔",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvlul1h/",
                  "created": 1730847799,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvlr9q9",
          "score": 2,
          "body": "He did say during Q3E call. It makes sense though. You can make 80% margin on software but max 20% margin on a car that too if your lucky. \n\nIf you running a business where would you direct the resources to?",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvlr9q9/",
          "created": 1730846735,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvj37g7",
          "score": 2,
          "body": "He seems like a politician, but he’d never do something like that",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj37g7/",
          "created": 1730818451,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvkgdcn",
          "score": 1,
          "body": "Musk is the king of hype. Sometimes he's prove right though...",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkgdcn/",
          "created": 1730832894,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvlcb4y",
          "score": 1,
          "body": "Surprise surprise!",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvlcb4y/",
          "created": 1730842238,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvo7xqs",
          "score": 1,
          "body": "Doesn't matter now Trump won, he's going to be responsible for the grift.",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvo7xqs/",
          "created": 1730879846,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvrptkw",
          "score": 1,
          "body": "Ovcoarse a car company is worth 1 Trillion",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvrptkw/",
          "created": 1730922337,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvt4kr1",
          "score": 1,
          "body": "Making promises and then lying without pretending to have an excuse? He really is a good fit for the Republican party.",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvt4kr1/",
          "created": 1730936917,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvj2xle",
      "score": 227,
      "body": "If Tesla had any autonomous driving product then maybe this statement would have made sense but they can't even trust \"FSD\" enough to get level 3 approval while other manufacturers are going ahead.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj2xle/",
      "created": 1730818364,
      "depth": 0,
      "replies": [
        {
          "id": "lvjsb8l",
          "score": 73,
          "body": "They don't even use FSD in a one way tunnel lol",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjsb8l/",
          "created": 1730825943,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvjmhvo",
          "score": 70,
          "body": "Because other companies use LIDAR and Musk refuses to use anything other than 2D cameras",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjmhvo/",
          "created": 1730824250,
          "depth": 1,
          "replies": [
            {
              "id": "lvk2uut",
              "score": 12,
              "body": "what was his rationale about not using LIDAR? i don't get it.",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk2uut/",
              "created": 1730829010,
              "depth": 2,
              "replies": [
                {
                  "id": "lvk5gd2",
                  "score": 60,
                  "body": "Cost. He ignores the fact that LIDAR brings necessary redundancy and safety in favour of cost model.",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk5gd2/",
                  "created": 1730829755,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lvk6ozd",
                      "score": 22,
                      "body": "His argument is that humans don't use radar either, just our eyes. Elon is all about cost cutting since batteries are expensive. Technically you can do it with cameras alone, it's just going to take more time.",
                      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk6ozd/",
                      "created": 1730830113,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lvkliy9",
                          "score": 36,
                          "body": "Humans are also awful drivers...",
                          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkliy9/",
                          "created": 1730834400,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lvksv4k",
                              "score": 5,
                              "body": "And somehow they’re consistently worse when driving Tesla’s. At least that’s how it goes anytime I’m on my bike. I steer clear of anyone in those shitboxes",
                              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvksv4k/",
                              "created": 1730836557,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lvknfcw",
                          "score": 15,
                          "body": "\n“Me has eyes, me work, camera eyes, they work!”\n\nNot including the millions of years of eye and brain evolution and built-in infrastructure to get to that point. Why the fuck would not take advantage of tech at your finger tips, especially now that Lidar is considerably cheaper than previous, and just gives that much more data? Literally records the inside of your car, but can’t be fucked to actually track the environment around the car. \n\nI hope Elon and his bubble gets the Enron treatment",
                          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvknfcw/",
                          "created": 1730834957,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lvkhuca",
                      "score": 3,
                      "body": "I thought LIDAR cost has dropped significantly due to Chinese competition entering the market?",
                      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkhuca/",
                      "created": 1730833321,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvk5yz9",
                  "score": 16,
                  "body": "It was wildly expensive when he cut it. He also cut radar.\n\nWaymo kept it because an actual functional taxi can absorb the cost. Teslas can’t because they’re fashion EVs being sold to end consumers.",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk5yz9/",
                  "created": 1730829903,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvt50gl",
              "score": 2,
              "body": "Regardless of why, it's still the state of things.",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvt50gl/",
              "created": 1730937059,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lvjntzi",
          "score": 18,
          "body": "Even if it did have level 5 self driving this would STILL be a dumb decision IMO.\n\nAmerica is a very car obsessed culture, where so many idiots will buy cars that they can't afford that cost more than their annual salary. So even if self driving vehicles could replace car ownership and still be cheaper, you AREN'T going to see people ditch car ownership for many decades. Anyone who thinks otherwise IMO is living in an urban bubble.\n\nFull disclosure, I used to own TSLA, but their decision to push for FSD over a $25,000 EV is a big part of why I sold out. IMO it's a terrible long term decision to gamble on the very unsure thing instead of going for the sure thing that would in all likelihood probably bankrupt some of their competition once EV's are undisputedly cheaper than ICE at all price ranges. Chinese EV makers are going to be the ones to step up and do this if Tesla doesn't.",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjntzi/",
          "created": 1730824638,
          "depth": 1,
          "replies": [
            {
              "id": "lvjpudt",
              "score": 15,
              "body": "For real, Americans want to switch self driving on and off but will always want to feel “behind the wheel” at some point",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjpudt/",
              "created": 1730825224,
              "depth": 2,
              "replies": [
                {
                  "id": "lvk70e8",
                  "score": 4,
                  "body": "Until the next generation takes over who hasn't developed old habits.",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk70e8/",
                  "created": 1730830205,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lvkjmx6",
                      "score": 3,
                      "body": "Correct. And they don’t even learn how to drive anymore.",
                      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkjmx6/",
                      "created": 1730833847,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvkibxj",
              "score": 5,
              "body": "That is not necessary true. Look at the rate at which teenagers are getting driver’s licenses. It has been dropping every year. Sure the middle male generation will want to drive their own cars for ever. But young people, old people, women would probably switch to self driven cars that you don’t even own anymore. \nI think a bigger obstacle besides technical issues is lobby industries like insurance, repair shops, or even the cops and of course the petrol industry. All of that would need to be overhauled.\nSo in a  way Musk is right. Why would I want to buy a cheap EV if I can just order a Robo cap without all the hassle that car ownership brings.",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkibxj/",
              "created": 1730833465,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvixqoa",
      "score": 79,
      "body": "Mmmh, I think I'll wait for the SpaceTaxi. 2027 probably.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvixqoa/",
      "created": 1730816644,
      "depth": 0,
      "replies": [
        {
          "id": "lvjp4qd",
          "score": 1,
          "body": "*xSpaceTaxi",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjp4qd/",
          "created": 1730825018,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvk008y",
          "score": 1,
          "body": ">WeAreTheMachine368 · 3 hr. ago  \n>  \n>Mmmh, I think I'll wait for the SpaceTaxi. 2027 probably.\n\nNice try ... ![gif](emote|free_emotes_pack|joy)",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk008y/",
          "created": 1730828186,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvw66uw",
          "score": 1,
          "body": "Mars taxi",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvw66uw/",
          "created": 1730986241,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lviveo1",
      "score": 233,
      "body": "Bros going back and forth on his bet that he’s got a Trump job. \n\nBye Elon",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lviveo1/",
      "created": 1730815844,
      "depth": 0,
      "replies": [
        {
          "id": "lviy20n",
          "score": 148,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lviy20n/",
          "created": 1730816751,
          "depth": 1,
          "replies": [
            {
              "id": "lvla7qg",
              "score": 3,
              "body": "I believe he just got bored of being a billionaire and wants political power.",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvla7qg/",
              "created": 1730841636,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lvj0n53",
              "score": 7,
              "body": "Just to add some balance, while we may not like government supporting monopolistic companies, there is certainly some danger in pushing economic policies that handicap American businesses at the same time the Chinese government pours money and time into Chinese businesses.\n\nThings like autonomy, AI, energy production, etc, are somewhat of an arms race. You don't necessarily want to give a country like China any advantages. And the truth is the American government has given them unreasonable advantages, at the cost of American workers, for nearly 50 years.\n\nI know I'll be downvoted, but what I'm saying is true and relevant. It's the other side of this shitty coin that has to be considered, and never is considered for some reason (political bias, ignorance, something else).",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj0n53/",
              "created": 1730817615,
              "depth": 2,
              "replies": [
                {
                  "id": "lvk21gf",
                  "score": 10,
                  "body": "What policies are handicapping American businesses? The billions of dollars of subsidies? The blind eye toward anti-trust issues? The tax cuts? The bailouts? The historically low interest rates? The inflated deficit spending? \n\n\nAre our companies competitive or not? Tariffs will launch us into a massive depression. Nobody is better off economically speaking in a trade environment with high tariffs. Nobody. \n\nThis economy has done just fine over the last 50 years. There are some communities and industries left behind but screeching the world to a halt for industries that lost at capitalism is so backwards it makes me wanna puke.",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk21gf/",
                  "created": 1730828775,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lvjf8st",
                  "score": 18,
                  "body": "Competition is essential for innovation and is the cornerstone of the success of the US economy. Reducing it (including through tariffs unless to address unfair subsidies or dumping) will be a huge blow to the US economy long term.",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjf8st/",
                  "created": 1730822112,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lvji0r6",
                      "score": 3,
                      "body": "I’m in favor of competition. I’m not in favor of stifling business. In a global world competition is not on a level playing field. That’s what I take issue with.",
                      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvji0r6/",
                      "created": 1730822934,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lvk29m5",
                          "score": 4,
                          "body": "The unfair competition argument is well documented and debunked by economists almost unanimously. If another nation subsidizes an industry, that maximizes our gains from trade because we benefit from the savings as well.",
                          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk29m5/",
                          "created": 1730828841,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lvk7n0a",
                              "score": 3,
                              "body": "Savings aren't everything. You lose market share and then it's very hard to keep up.",
                              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk7n0a/",
                              "created": 1730830388,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lvj5s4q",
                  "score": 15,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj5s4q/",
                  "created": 1730819256,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lviymd1",
          "score": 8,
          "body": "The election lottery fraud case will be very interesting. Can a CEO run a company from prison?",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lviymd1/",
          "created": 1730816942,
          "depth": 1,
          "replies": [
            {
              "id": "lvjcm0v",
              "score": 17,
              "body": "Elon’s net worth allows him to receive a different justice system than the rest of us. He will never go to jail, even if he straight up kills someone. There are two different justice systems in this country.",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjcm0v/",
              "created": 1730821332,
              "depth": 2,
              "replies": [
                {
                  "id": "lvk8ar5",
                  "score": 3,
                  "body": "In any country, if you guys think a billionaire goes to jail in any country then you're dreaming in a fantasy world.",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk8ar5/",
                  "created": 1730830578,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lvlxs5b",
                      "score": 2,
                      "body": "There’s Bernie Madoff and Elizabeth Perkins, if you’re counting the ones who virtually stole their billions.",
                      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvlxs5b/",
                      "created": 1730848867,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvjj331",
                  "score": 2,
                  "body": "> Elon’s net worth allows him to receive a different justice system than the rest of us.\n\nHe tried to have the trial moved to a different court. That request was rejected. I guess we get to watch in realtime and see how teflon he is. I do know Larry Krasner seems particularly invested.",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjj331/",
                  "created": 1730823247,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvj1zn4",
              "score": 6,
              "body": "Saw something this morning that a State judge dismissed the case against him",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj1zn4/",
              "created": 1730818059,
              "depth": 2,
              "replies": [
                {
                  "id": "lvj3z74",
                  "score": 10,
                  "body": "I think it was that they dismissed the emergency motion to halt it, not the entire case.  \n\n'Actually it was just fraud' is definitely one of the more uh, interesting legal defenses I've seen and I think it's still playing out.",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj3z74/",
                  "created": 1730818692,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvj5qot",
          "score": 2,
          "body": "I think he’ll be just fine regardless of the election outcome",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj5qot/",
          "created": 1730819244,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvj1t5v",
      "score": 74,
      "body": "Did Elon just admit he can't beat BYD and other Chinese EV car makers $9,000 entry level price point.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj1t5v/",
      "created": 1730818000,
      "depth": 0,
      "replies": [
        {
          "id": "lvj67ca",
          "score": 46,
          "body": "If byd could sell in the US, they certainly won't sell a 9k car.",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj67ca/",
          "created": 1730819387,
          "depth": 1,
          "replies": [
            {
              "id": "lvj9zd0",
              "score": 24,
              "body": "Not with the 100% tariff Biden put in place for all Chinese EV.  Not to mention dealer mark up, etc.\n\nFord CEO Jim Farley is driving a Xiaomi SU7 as a daily now.  He has nothing but praise for it.\n\nSU7 entry level is only $30K USD, and its specs are much better than the tesla 3.",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj9zd0/",
              "created": 1730820545,
              "depth": 2,
              "replies": [
                {
                  "id": "lvjfjzi",
                  "score": 17,
                  "body": "Even if we didn't have the tarrifs, you can't take pricing in the other countries and assume that's what we're going to pay here.",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjfjzi/",
                  "created": 1730822202,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lvjknwf",
                      "score": 7,
                      "body": "Exactly. The BYD Tang is a pretty interesting competitor to Tesla's Model Y in China starting at $40K while being fairly close in specs/performance, even if it's clearly not quite equal. In Europe, it costs €70K (~$75K) compared to the Model Y's €45K and it's completely irrelevant.",
                      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjknwf/",
                      "created": 1730823714,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lvkcr35",
                          "score": 3,
                          "body": "Drove a BYD Seal U this summer (~$37k I think) and it’s a significantly better vehicle all around than the Model Y.",
                          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkcr35/",
                          "created": 1730831852,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lvjexy6",
                  "score": 5,
                  "body": "Ignoring all of that, the “$9k BYD” wouldn’t be road legal in the US and its shit performance means you still need a $30k car.",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjexy6/",
                  "created": 1730822022,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lvjkihv",
                      "score": 16,
                      "body": "The BYD Dolphin is around $15k in China and has the maximum 5 stars at the Euro Ncap test (so likely perfectly able to pass safety tests in the US). The 200 hp on is more than enough too. \n\n$9k seems a bit of a stretch but they could be definitely selling safe and fast Chinese EV for less than $25k without the tariffs.",
                      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjkihv/",
                      "created": 1730823670,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lvjlvpl",
                          "score": 2,
                          "body": "The $15k dolphin in China is not the same dolphin being sold in the EU…they’re not even the same size\n\nhttps://carnewschina.com/2023/04/17/byds-inflatable-dolphin-why-euro-version-is-larger-than-the-chinese/",
                          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjlvpl/",
                          "created": 1730824072,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lvjs11b",
                              "score": 9,
                              "body": "The export Dolphin has different bumpers to pass western crash tests, that's not a $15k modification.",
                              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjs11b/",
                              "created": 1730825861,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lvjoioj",
                      "score": 7,
                      "body": "If you can get a Fiat 500 and Cooper Mini road legal in the US, not seeing the technical issue for China branded EV.\n\nIf you want an urban kei car for the US, that's an EV, highway safe, listed as a 4 seater but comfortably sits 2; you can definitely get one done with a China brand.\n\nIf you use Tesla as a standard bearer, many Chinese brands at that price point have better specs already.",
                      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjoioj/",
                      "created": 1730824839,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvjgtij",
              "score": 3,
              "body": "Boy -  if folks have gripes with tesla and spare parts, I can’t imagine the challenges with the Chinese brands and US supply chain",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjgtij/",
              "created": 1730822575,
              "depth": 2,
              "replies": [
                {
                  "id": "lvjh5wv",
                  "score": 2,
                  "body": "That's really why I doubt we'll ever see a 9k car from China. There is no logistics network established, although BYD is building in Mexico, so it may get easier in time.",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjh5wv/",
                  "created": 1730822679,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvjfh2a",
          "score": 1,
          "body": "Can anybody beat that price? My base Subaru is already 15k. And that is considered cheap…",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjfh2a/",
          "created": 1730822178,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvo2z21",
          "score": 1,
          "body": "Did we seriously have to wait for Elon to admit that? Come on",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvo2z21/",
          "created": 1730877691,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvp0c0j",
          "score": 1,
          "body": "Byd + government subsidies = 9k\n\n\nVietcorp is selling electric cars in Vietnam for 35k USD. Why wouldn't they also be able to build much cheaper if it wasn't for gov subsidies ?",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvp0c0j/",
          "created": 1730894647,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lwcfxyb",
          "score": 1,
          "body": "The Chinese brands cannot sell EVs any cheaper in western markets than Tesla, and this is ignoring tariffs. The biggest lie in the current car market is cheap Chinese EVs. They ain’t cheap.",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lwcfxyb/",
          "created": 1731203078,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvj1vfv",
      "score": 61,
      "body": "That’s why I never invest in Tesla. I don’t care how much potential money I can lose, I’ve realized it’s basically a marketing company first and a car company second. Anyone who’s been following Elon over the years realize how much he cannot be trusted and how it’s marketing and pump and  dumps",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj1vfv/",
      "created": 1730818021,
      "depth": 0,
      "replies": [
        {
          "id": "lvjkrp3",
          "score": 8,
          "body": "Carvana is run by the cartel and pumping. Smci was a top performing stock this year, until it wasn’t. Big money to be made in fraud !!!",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjkrp3/",
          "created": 1730823746,
          "depth": 1,
          "replies": [
            {
              "id": "lvlb0eu",
              "score": 3,
              "body": "Tell that to people who bought SMCI at $120.",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvlb0eu/",
              "created": 1730841866,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvjbiu8",
      "score": 7,
      "body": "After fsd? So in other words, never.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjbiu8/",
      "created": 1730821009,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvj5omf",
      "score": 15,
      "body": "*Elon Musk walks back an outlandish statement that investors are still somehow dumb enough to believe at face value*\n\nHey I've seen this one before",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj5omf/",
      "created": 1730819226,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvj9mcp",
      "score": 11,
      "body": "Elon Musk is not your friend.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj9mcp/",
      "created": 1730820436,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvj3y5m",
      "score": 9,
      "body": "Concerning....",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj3y5m/",
      "created": 1730818684,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvj04oe",
      "score": 11,
      "body": "New car model with no factory lmao ",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj04oe/",
      "created": 1730817450,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvj9rwd",
      "score": 3,
      "body": "Elon Musk said a lot of stupid things that turned out to be lies...",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj9rwd/",
      "created": 1730820482,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjfotz",
      "score": 4,
      "body": "I am doubtful that Tesla can get full self driving approved if it's based only on visible light cameras.   Even humans crash in the fog, or glaring sunlight, or at night.   Waymo is going to launch and Tesla won't be able to catchup with just an over the air software update.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjfotz/",
      "created": 1730822242,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjmpmx",
      "score": 3,
      "body": "Lyin’ Leon, such a whinny little Bitch.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjmpmx/",
      "created": 1730824312,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvk3ydb",
      "score": 3,
      "body": "This company should have a zero knocked off its market cap.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk3ydb/",
      "created": 1730829323,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvj0jzg",
      "score": 10,
      "body": "Tesla can't even build *a* car for robot drivers.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj0jzg/",
      "created": 1730817589,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjenid",
      "score": 8,
      "body": "Musk is and has always been a charlatan. I long for the day he will finally be held accountable for his financial crimes",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjenid/",
      "created": 1730821937,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvivc1f",
      "score": 8,
      "body": "More market share for GMC through Bolts",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvivc1f/",
      "created": 1730815819,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvj22zw",
      "score": 3,
      "body": "It looks like he finally realized he was never going to be able to build one. ",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj22zw/",
      "created": 1730818089,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvj43t2",
      "score": 5,
      "body": "SEC needs to dry bum this clown 🤡",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj43t2/",
      "created": 1730818732,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvj55jw",
      "score": 2,
      "body": "The point would be to make money for the rest of the shareholders",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj55jw/",
      "created": 1730819061,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjw49q",
      "score": 2,
      "body": "I was very surprised to see the robotaxi concept as a two seater, doesn’t make much sense at all and severely limits its usefulness for a lot of people.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjw49q/",
      "created": 1730827055,
      "depth": 0,
      "replies": [
        {
          "id": "lvk8i2j",
          "score": 3,
          "body": "It's pure vaporware that will never be released so how many it sits doesn't really matter.",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk8i2j/",
          "created": 1730830637,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvk69qv",
      "score": 2,
      "body": "That's from 3 week ago.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk69qv/",
      "created": 1730829990,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvkl87d",
      "score": 2,
      "body": "Self driving is another dream he is selling, Google is doing with camera+lidar+maps data and this guy say I will do with only camera, just lies, after years he will again have to get reliable hardware only if he want to do that.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkl87d/",
      "created": 1730834312,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvm7657",
      "score": 2,
      "body": "I can’t believe everyone fell this lol.  This pos and robot taxis are never coming.  Tesla will keep dangling the carrot to keep the stock price from cratering.\n\nI knew it was DOA when it was 2 seats and 2 scissor doors with limited cargo space.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvm7657/",
      "created": 1730852070,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvo494f",
      "score": 2,
      "body": "Welcome to the club, you got musked. This is what the kid keeps doing for last 9-10 years.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvo494f/",
      "created": 1730878246,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvj66vz",
      "score": 5,
      "body": "Elon Musk lies… You don’t say?",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj66vz/",
      "created": 1730819384,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvj3zfj",
      "score": 3,
      "body": "If what he *claimed* about the Cybercab was true, *and* he wasn't a giant douchebag, I'd absolutely buy one for 25k!\n\nI don't see any of those factors (capability, ceo, or price) being in a good place any time soon.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj3zfj/",
      "created": 1730818694,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjrsbp",
      "score": 3,
      "body": "Inverse Reddit. I’m going in on Tesla.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjrsbp/",
      "created": 1730825791,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvj70de",
      "score": 5,
      "body": "I feel his product’s are sub standard compared to what other auto makers are and will be bringing out in the near future. Bottom line, he’s not the person I thought he was a couple of years ago, he talks a good talk but doesn’t deliver.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj70de/",
      "created": 1730819636,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvj5sjy",
      "score": 4,
      "body": "So it went from Tesla isn't making a 25k car which Musk said wasn't true to Tesla isn't making a 25k car that isnt human drivable but will be making a 25k that is  autonomous.  Isn't that shifting goal posts?",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj5sjy/",
      "created": 1730819260,
      "depth": 0,
      "replies": [
        {
          "id": "lvjbgnf",
          "score": 5,
          "body": "FSD will not be remotely ready for fully autonomous driving in 2 years let alone 5. A camera only system will never be successful.",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjbgnf/",
          "created": 1730820991,
          "depth": 1,
          "replies": [
            {
              "id": "lvjglwa",
              "score": 4,
              "body": "It must be nice living in a world of absolutes. People said the same thing about landing rocket boosters for reuse. \n\nWe've got hundreds of examples of people saying we'd never be able to do something, and over time, we did it.",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjglwa/",
              "created": 1730822512,
              "depth": 2,
              "replies": [
                {
                  "id": "lvjqill",
                  "score": 2,
                  "body": "How dare you make a good point against the hive mind of Reddit",
                  "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjqill/",
                  "created": 1730825421,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvj9hbf",
      "score": 4,
      "body": "LOL at all the replies here. Same people frothing about TSLA being overvalued can't understand why it won't make $25k EV for human driver (where there is zero margin). \n\nI mean, Apple doesn't make $200 phones and Microsoft doesn't sell you $10 software. $25k Robotaxi where the margin is huge is exactly why TSLA is valued at more than all the traditional automakers combined. \n\nHaters gonna hate and thats why they spend all the time on Reddit either complaining or ridiculing others.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj9hbf/",
      "created": 1730820394,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvj0qly",
      "score": 3,
      "body": "He's a fucking phony. Yeah, he's got some accomplished, but has promised and not followed through much more....",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj0qly/",
      "created": 1730817650,
      "depth": 0,
      "replies": [
        {
          "id": "lvkb9qf",
          "score": 1,
          "body": "I'd say he's followed on more promises than he hasn't.",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkb9qf/",
          "created": 1730831425,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvj8l7g",
      "score": 2,
      "body": "Fken stock just pumped again based on that comment. What a joke seriously",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj8l7g/",
      "created": 1730820122,
      "depth": 0,
      "replies": [
        {
          "id": "lvjf7wr",
          "score": 2,
          "body": "We’ve known about this comment since the earnings call…it’s not news",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjf7wr/",
          "created": 1730822104,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvjkrpm",
      "score": 2,
      "body": "There’s very few, if any, people I would trust to run the company that controls my self driving, electric car. Musk is not one of them.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjkrpm/",
      "created": 1730823746,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjoze2",
      "score": 2,
      "body": "Headline 5 years from now: \"Musk says its pointless to build robotaxis\"",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjoze2/",
      "created": 1730824974,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvj2kip",
      "score": 1,
      "body": "Keep doubting, keep downvoting.  If you don't yet see Tesla as a leader in the space I'm not sure what else would convince you.  Other manufacturers can't even compete in the charging game but people think zoox/hyundai/google/amazon/cadillac/etc. is gonna sweep in and out-develop one of the most specialized companies in the world, a company with a massive head start.  Some people seem to believe Tesla FSD is vaporware and I guess think the Model Y being the world's top selling vehicle is due to people being duped by fake marketing or something??  It's unironically elon derangement syndrome causing these very emotional investors to miss obvious winners- like the post robotaxi event/mid october calls.\n\nIt's weird- sometimes it feels like only a minority of investors in the subreddit are here to actually make money and end up missing the boat because they got emotional/swayed by bullshit/took the opinions of morningstar interns seriously.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj2kip/",
      "created": 1730818246,
      "depth": 0,
      "replies": [
        {
          "id": "lvj39eg",
          "score": 9,
          "body": "FSD as driver assistance is not vaporware, many acknowledges that.\n\nFSD as autonomous driving is vaporware though and mainly because there has been no development to show that camera only approach works for autonomous driving today. \n\nLet me ask it this way, if FSD was so great and reliable, why didn't we see at least level 3 approval for Tesla on highways even limited to just clear weather?\n\nAlso from regulatory point of view, there is absolutely no way any city would approve an autonomous car without a backup method of control (steering wheel). I am sure Tesla lawyers, engineers are smart enough to realize this.",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj39eg/",
          "created": 1730818469,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvj4e4k",
          "score": 2,
          "body": "Bro has never stepped out of the USA that's clear. Here in Asia it's mostly BYD you see.\n\nAlso, Tesla is valued at 800 billion. More than all other EV makers combined and then some. Wild that you come here accusing everyone of having \"elon derangement syndrome\" while the market is already giving Tesla a valuation that far exceeds any normal carmakers valuation.\n\nThey produced 7 million cards and are worth 800 billion. Add on top 55 billion in a soon to be granted bonus to Elon that will dilute everyone else. Maybe look in a mirror and ask who is suffering from a derangement syndrome.",
          "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj4e4k/",
          "created": 1730818823,
          "depth": 1,
          "replies": [
            {
              "id": "lvjjudz",
              "score": 3,
              "body": "It's sensible to me tesla is valued beyond that of other auto manufacturers, and I backed this position with my actual money resulting in a skyrocketing net worth.  So in one hand I have your opinion, and in the other hand I have positive movement in my brokerage balances.  Hmm.... which one seems more real and sensible?  Gonna go with my results.\n\nIf Tesla is a loser to you, bet against it- I wish you the best of luck.  Hopefully your strategy pays off as much as mine has.",
              "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjjudz/",
              "created": 1730823470,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvj62mj",
      "score": 1,
      "body": "Used Model 3",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvj62mj/",
      "created": 1730819347,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvja1mn",
      "score": 1,
      "body": "Build it for humanoid drivers then, ffs elon",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvja1mn/",
      "created": 1730820564,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjdevy",
      "score": 1,
      "body": "EV's should have always been aimed towards lower income groups to begin with. Something to get you from A to B in a city or town, get the kids to school, get to work, etc. Nothing flashy or long range but a safe solid car that could save a family on gas. That would have pushed for more infrastructure buy-in across the board.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjdevy/",
      "created": 1730821572,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjfsi2",
      "score": 1,
      "body": "Can they please get Gwenn from spacex over to tesla.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjfsi2/",
      "created": 1730822271,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvji029",
      "score": 1,
      "body": "Build a 25k Tesla for cyborg drivers then.... Sheesh.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvji029/",
      "created": 1730822928,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvji1ny",
      "score": 1,
      "body": "No new model, just lowering the price on existing models.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvji1ny/",
      "created": 1730822941,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjl6di",
      "score": 1,
      "body": "Build it for $10,000 than",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjl6di/",
      "created": 1730823866,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjpimb",
      "score": 1,
      "body": "The imports can do it for 1/2.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjpimb/",
      "created": 1730825129,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjsdzr",
      "score": 1,
      "body": "As a stockholder I would rejoice. Did anyone think it was ideal to loose money on a car. \n\nAs an overall car company that thinks they are going to overtake sales of all the other combined? Not going to happen. This stock is priced on massive growth. This year they are in a decline. Next year should have some moderate growth. Noting to value them at this level though.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjsdzr/",
      "created": 1730825966,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjt9kb",
      "score": 1,
      "body": "musk says a lot of things, but many times its horsepoop",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjt9kb/",
      "created": 1730826223,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvju7b7",
      "score": 1,
      "body": "it's not \"pointless\", it's \"beyond Tesla's capabilities\".",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvju7b7/",
      "created": 1730826497,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjvndc",
      "score": 1,
      "body": "Does that mean predictions are pointless as well?",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjvndc/",
      "created": 1730826920,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjvqba",
      "score": 1,
      "body": "**Best salesman ever, only suckers fall for his claims lol. Smart money keep riding the TSLA waves.**",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjvqba/",
      "created": 1730826944,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjx6yo",
      "score": 1,
      "body": "His goal is subscription based car service, where Tesla owns the cars and you pay a fee for the number of hours you need the car, outside those hours the car is “working” as a taxi or in someone else hands.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjx6yo/",
      "created": 1730827367,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvjzo7x",
      "score": 1,
      "body": "It's pointless because China already has them made and he's nowhere near being able to get it done",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvjzo7x/",
      "created": 1730828090,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvk0ppp",
      "score": 1,
      "body": "GM, Hyundai, and numerous Chinese companies will find a way and reason to do it.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk0ppp/",
      "created": 1730828393,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvk1te5",
      "score": 1,
      "body": "why bother when affordable Chinese EV's will be tarriffed.  No competition to improve and lower prices in the west.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk1te5/",
      "created": 1730828711,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvk2cgs",
      "score": 1,
      "body": "No way!",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk2cgs/",
      "created": 1730828864,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvk482l",
      "score": 1,
      "body": "He's certainly worked hard to make it absolutely pointless for Tesla to manufacture any vehicle and expect me to buy it.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk482l/",
      "created": 1730829401,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvk74xd",
      "score": 1,
      "body": "Do any of u fools believes what muskrat says?",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk74xd/",
      "created": 1730830241,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvk95cw",
      "score": 1,
      "body": "There is a difference between: \n\n>He said in an Oct. 23 earnings call that building the affordable EV would be \"pointless” unless the car was fully autonomous. \n\nAnd \n\n> Musk now says it's 'pointless' to build a $25,000 Tesla for human drivers\n\nIn the first he is saying it is \"pointless\" to build just a regular $25,000 car. He is saying it makes more sense to build a $25,000 with autonomous driving. \n\nSo, Reuters thought, and fairly so to be fair, that it would be a normal car that is $25,000. Anyone would think the same in this day and age. \n\nBut it looks like Elon decided a $25,000 car should be autonomous and not a normal car. \n\nI'm not a fan of Elons personality and his politics, but the title did not take the full quote.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvk95cw/",
      "created": 1730830823,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvkakkn",
      "score": 1,
      "body": "Pointless is to have a fuckn autonomous car.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkakkn/",
      "created": 1730831226,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvkbynj",
      "score": 1,
      "body": "This makes sense only if they do finally deploy FSD fully automated. In that case with the cyber cab the cost of ride hail may drop to 30cents per mile. Which would make it fairly pointless owning a $25000 manually driven car.\n\nOn the other hand I thibk they are about four years away from this. Either becuase of regulation or the cyber cab ramp not starting till 2026. I figure that if they can bring it together in Q126 that it would be at least a two year ramp to move through other states and to reduce the average cost of a mile. Could be longer. My own experiance with current FSD is disappointing.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkbynj/",
      "created": 1730831623,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvkcks4",
      "score": 1,
      "body": "Sounds correct. His double(tripling) down on Robo.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkcks4/",
      "created": 1730831802,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvkf8ea",
      "score": 1,
      "body": "To be completely honest I would agree with him if robotaxi was a normal car, but it’s got two seats and no supercharging so I don’t see why making just a normal car is so pointless, maybe he means they could make a 4-door autonomous car or something but idk I always liked the way teslas worked over waymo because in the event the AI was fucking up you can take over if you just turn off FSD, robotaxi’s just a shitty waymo you can outright buy tbh.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkf8ea/",
      "created": 1730832564,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvkg7j8",
      "score": 1,
      "body": "Shockm",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkg7j8/",
      "created": 1730832847,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvkjudi",
      "score": 1,
      "body": "Elon musk wanted to build Hyperloop instead he used that tunnel for cars. A big slash back for public transport. Now he wants to bring robotaxi and promote car culture even more instead of public transport.  He wants to make USA car only friendly 😂",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkjudi/",
      "created": 1730833908,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvkkq3r",
      "score": 1,
      "body": "He just sell dreams to get money, he have done good things but done very less from what he said.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkkq3r/",
      "created": 1730834165,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvknum2",
      "score": 1,
      "body": "It’s crazy to me that the market rewards him when he lies. You’d think investors and institutions would have figured out he’s full of shit by now ",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvknum2/",
      "created": 1730835081,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvkoqp0",
      "score": 1,
      "body": "Anyone believing $25k for an electric vehicle in 2024 😂",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkoqp0/",
      "created": 1730835345,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvkq1on",
      "score": 1,
      "body": "Musk can go Fusk himself. He's a scam.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkq1on/",
      "created": 1730835727,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvks6xu",
      "score": 1,
      "body": "The article and everyone is misinterpreting Elon's words on investor call \n\n The cheaper model made for human driver is coming but it will have autonomous features and will come q1 2025",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvks6xu/",
      "created": 1730836359,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvkvvyq",
      "score": 1,
      "body": "Another Elon Musk lie uncovered!",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvkvvyq/",
      "created": 1730837457,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvl148v",
      "score": 1,
      "body": "If you want a cheap normal EV.. buy Chinese is what I am hearing. Tesla isn't a car company..it's a Robotaxi company.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvl148v/",
      "created": 1730838993,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvl3cu5",
      "score": 1,
      "body": "Who could have guessed this… *Looks at the Dec 25’ $300 covered calls I sold*",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvl3cu5/",
      "created": 1730839643,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvl53pm",
      "score": 1,
      "body": "Cool, let Rivian build the R3 for that market and eat his lunch",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvl53pm/",
      "created": 1730840146,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvl5wdq",
      "score": 1,
      "body": "Tesla is a car company that can’t compete with China making cheap electric cars so now they make robots.  Please ignore the sleight of hand and focus on the robots.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvl5wdq/",
      "created": 1730840378,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvl884d",
      "score": 1,
      "body": "If you read the entire article you should know what Musk was saying is that the $25000 Tesla should also be able to drive by itself.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvl884d/",
      "created": 1730841052,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvlaavz",
      "score": 1,
      "body": "A 25k cyber cab will end up actually costing 35k. It always ends up costing more than he says. And besides if he could build a 25k robo taxi, please please please where is the 18k non robot car i would actually want to spend my money on??",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvlaavz/",
      "created": 1730841661,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvlbtvp",
      "score": 1,
      "body": "Deerp of course driverless cars",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvlbtvp/",
      "created": 1730842099,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvlidmq",
      "score": 1,
      "body": "The sheer disdain this c*nt has for humanity is astonishing",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvlidmq/",
      "created": 1730843995,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvlj8h5",
      "score": 1,
      "body": "It’s because he can’t.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvlj8h5/",
      "created": 1730844248,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvljah7",
      "score": 1,
      "body": "Reading everything in italics was annoying",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvljah7/",
      "created": 1730844265,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvll0su",
      "score": 1,
      "body": "Elon musk is full of shit?? YOU'RE KIDDING ME",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvll0su/",
      "created": 1730844792,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvlt4je",
      "score": 1,
      "body": "As always, it’s China’s fault. ;-)",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvlt4je/",
      "created": 1730847324,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvlxlch",
      "score": 1,
      "body": "I would rather get a taxi with a human driver than a computer controlled driver for 1 reason. To keep people in jobs so they can feed their families.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvlxlch/",
      "created": 1730848803,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvm4xei",
      "score": 1,
      "body": "And keep those tariffs up to block byd lol fick this guy",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvm4xei/",
      "created": 1730851277,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvmlm1q",
      "score": 1,
      "body": "It is pointless because the model 3 is so cheap now esp used.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvmlm1q/",
      "created": 1730857172,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvmrodv",
      "score": 1,
      "body": "25k would not be profitable for Tesla to be honest.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvmrodv/",
      "created": 1730859367,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvnyjz2",
      "score": 1,
      "body": "His biography states that he resented the idea of putting in steering and pedals on that car, but top management convinced him that for countries where regulation approval might take years it is the best bet to have compatibility to put in the wheel and pedals because it's the same assembly line",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvnyjz2/",
      "created": 1730875888,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvnyyqj",
      "score": 1,
      "body": "I'm not getting into a robo car unless EVERY OTHER CAR is also a robo car. \n\nI simply don't trust other drivers enough, to risk my life inside a vehicle I don't have evasive control of.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvnyyqj/",
      "created": 1730876057,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvo84j6",
      "score": 1,
      "body": "I read that a Trump presidency would be an overall negative for the EV industry as likely the EV rebates/tax incentives get pulled.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvo84j6/",
      "created": 1730879927,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvogtp4",
      "score": 1,
      "body": "Didn't read but , maybe it's not a Bad news , it may be(and imho probably IS) that self driving cab would be far cheaper than human driving car that are Park 20h/24 not doing anything but costing money",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvogtp4/",
      "created": 1730884365,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvoxa8v",
      "score": 1,
      "body": "Musk will get Department of transportation and maybe Defense lol.\n\nHe will draft non-customers to invade developing countries and build infrastructure for Gigafactories on tax payer money.\n\nOr something xD. It's going to be wild.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvoxa8v/",
      "created": 1730893566,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvpmsha",
      "score": 1,
      "body": "Elon Musk is lying nonstop",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvpmsha/",
      "created": 1730901881,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvq3duc",
      "score": 1,
      "body": "Yeah, the poor don’t matter in America, welcome to America.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvq3duc/",
      "created": 1730906613,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvr23kc",
      "score": 1,
      "body": "Oh he is planning to create a bus",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvr23kc/",
      "created": 1730915870,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvrfxt7",
      "score": 1,
      "body": "it might be true since i can get many used good EV under 25k now!",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvrfxt7/",
      "created": 1730919635,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvsnwqo",
      "score": 1,
      "body": "You mean it's pointless to release a car that a person can actually afford? You're right .. what were they thinking? 🤔",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvsnwqo/",
      "created": 1730931723,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvtudc0",
      "score": 1,
      "body": "Couldn’t do it. Ceded that part of the market to Chinese companies.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvtudc0/",
      "created": 1730945343,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvu6jsr",
      "score": 1,
      "body": "So more market manipulation by Musk...   Now he's Trump's best mate don't expect the SCC to do much.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lvu6jsr/",
      "created": 1730949543,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwbu1n9",
      "score": 1,
      "body": "Race to the bottom is never a good business strategy.",
      "permalink": "/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/lwbu1n9/",
      "created": 1731195203,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "Elon Musk stated that building a $25,000 Tesla for human drivers is pointless, focusing instead on autonomous vehicles like the Cybercab.",
    "companies": [
      "Tesla",
      "Reuters",
      "Morningstar"
    ],
    "tickers": [
      "TSLA"
    ],
    "main_ticker": [
      "TSLA"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Elon Musk states that building a $25,000 Tesla for human drivers is pointless, instead focusing on autonomous vehicles like the Cybercab.",
    "stock_recommendations": "The user is not recommending buying or selling any stocks.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": "none",
    "sentiment_summary": "The sentiment is neutral as the post discusses Tesla's strategic shift without recommending any stock action.",
    "sentiment": "neutral"
  }
}