{
  "title": "CELSIUS Reported Earnings this morning ($CELH)",
  "score": 77,
  "selftext": "[$CELH](https://x.com/search?q=%24CELH&src=cashtag_click) Q3 2024  \n  \n\"Pronounced supply chain optimization by our largest distributor, which we believe has largely stabilized, had an outsized and adverse impact on our operating results during an otherwise solid quarter.\" – John Fieldly, CEO  \n  \nRevenue -31%  \n\\*North America -33%  \n\\*International +37%  \nGross Profit -37%  \n\\*marg. 46% (50.4)  \nEBIT -103%  \n\\*marg. -1% (25)  \nNet Income -92%  \nEPS -100%  \n  \nStock Pre-market -4%\n\n  \nAny thoughts? I personally own shares",
  "link_flair_text": null,
  "id": "1gkz14c",
  "num_comments": 47,
  "created_utc": 1730901284,
  "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/",
  "comments": [
    {
      "id": "lvq290c",
      "score": 28,
      "body": "I still think the stock has a chance to perform better in a year or two but clearly this Pepsi disaster combined with the entire energy drink market tanking is hurting them bad. I'm a big bagholder on my shares after trying to catch a falling knife. But I do think this has support in the mid-20s so it's going to be a hold for me.",
      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvq290c/",
      "created": 1730906306,
      "depth": 0,
      "replies": [
        {
          "id": "lvqdif9",
          "score": 6,
          "body": "Tbh I don’t understand the Pepsi disaster.. could you explain it?",
          "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvqdif9/",
          "created": 1730909317,
          "depth": 1,
          "replies": [
            {
              "id": "lvqhie0",
              "score": 36,
              "body": "Pepsi order way too much inventory from Celsius last year. I suppose they had huge demand coming out of the pandemic and that growth did not continue. But Celsius never told investors that this \"demand\" was simply Pepsi overstocking their inventory. Now Pepsi says hey we have a shit ton of Celsius on our hands, we're going to let this sell first before we buy any more. So now we have a situation where on paper Celsius revenue is way down compared to last year but in reality it's on a sort of lag because Pepsi did not time it correctly.",
              "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvqhie0/",
              "created": 1730910386,
              "depth": 2,
              "replies": [
                {
                  "id": "lvqion4",
                  "score": 4,
                  "body": "I see. Thanks for the explanation! I have several questions: \n- isnt this a really bad sign? If sales are contracting 33% and Pepsi inventory is still loaded? \n- is there a particular reason why the energy drink segment is taking a hit as a whole? \n\nThanks!",
                  "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvqion4/",
                  "created": 1730910699,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lvtftlw",
                      "score": 1,
                      "body": "So to make last year's numbers, they jammed pallet buys into all these convenience stores.  Well then they didn't need to buy anything in January or February, so then they slammed them with pallet buys at the end of the first quarter to meet numbers.  They learned from the first quarter and continued to send more in on deliveries, but that wasn't enough to meet numbers, so they slammed them with pallet buys at the end of the 2nd quarter.  Stores said \"woah, too much- no more until this sells through\", so then they had to do pallet buys at the last amen to hit 3rd quarter numbers.   \nCelsius sells, but store managers are pissed about how it is being handled.  They don't want to have to keep filling shelves while Pepsi only delivers sporadically.  They want Pepsi to deliver and fill weekly.",
                      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvtftlw/",
                      "created": 1730940566,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lvqm9r1",
                      "score": 1,
                      "body": "Well this has been happening all year it's just reached a peak this quarter. If you believe the CEO he says this has largely stabilized. Of course they kind of said that in previous quarters too. So yes this is bad which is why the stock is down 70%. Question is what does the next 2-5 years look like for them. My initial thesis with the stock was strong international growth which is slowly materializing. \n\nNo one knows why the energy drink market weakened. Some say a weak consumer in general, others say certain ingredients getting bad press for customers health.",
                      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvqm9r1/",
                      "created": 1730911647,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lvrm56t",
                          "score": 2,
                          "body": "How does it grow internationally? There is no name recognition…. They aren’t red bull who sponsor crazy stuff",
                          "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvrm56t/",
                          "created": 1730921338,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lvrpqwy",
                              "score": 1,
                              "body": "Great marketing and partnerships. They have a partnership with Tesco in eu. \n\nThey're also sponsoring the Jake Paul and Mike Tyson fight which will have alot of coverage",
                              "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvrpqwy/",
                              "created": 1730922317,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lvs7wol",
                                  "score": 3,
                                  "body": "F1 with Ferrari should get more exposure in particular with Lewis Hamilton and a stronger car next season.",
                                  "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvs7wol/",
                                  "created": 1730927248,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "lvsc9cp",
                                  "score": 1,
                                  "body": "I hope so however the market internationally is saturated with domestic brands \n\nRed Bull dominates the premium side (their skus are generally 15% more). They are the only company with great brand recognition due to their excellent advertising in extreme sports and the red bull car/ girls \n\nMonster expanded like crazy due being the first with zero sugar , white monster",
                                  "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvsc9cp/",
                                  "created": 1730928433,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lvscjoe",
                                      "score": 2,
                                      "body": "They took over the domestic market, why wouldn't they be able to take over international market competing against rhe same domestic brands ?",
                                      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvscjoe/",
                                      "created": 1730928513,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lvqp5s0",
                          "score": 1,
                          "body": "By stabilized what we actually mean is that Pepsi’s excess stock of Celsius should deplete soon and they’ll start buying them again correct? \n\nI also saw that they were trying to vertically integrate with their recent acquisition of big beverages contact manufacturing LLC. Will be interesting if this helps their supply chain and also reduce COGS.",
                          "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvqp5s0/",
                          "created": 1730912402,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvq0q5q",
      "score": 22,
      "body": "Personally holding, even in spite of the lack luster results for this quarter. I like the international growth, if they can keep it at a high rate I believe its worth it to keep for the next few years",
      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvq0q5q/",
      "created": 1730905889,
      "depth": 0,
      "replies": [
        {
          "id": "lvtjujk",
          "score": 1,
          "body": "-100% EPS... I won't touch anything like this but it all comes to risk tolerance and when did you buy.",
          "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvtjujk/",
          "created": 1730941872,
          "depth": 1,
          "replies": [
            {
              "id": "lvuu3ha",
              "score": 1,
              "body": "True it is disastrous on the face of it, but some of the capital employed is to acquire Big Beverage corp which I see they would have a solid ROIC, the Pepsi overstocking seems to have normalized and they should continue to buy more to stock inventory next year onward. It is a risk of course, it all boils down to if you believe in a brighter future where the consumer is more confident and that the current moat will increase as I believe they have a great product",
              "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvuu3ha/",
              "created": 1730959813,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvsrut2",
      "score": 6,
      "body": "Still profitable.\n\nThey bought Big beverage seems it is a production/warehouse type company.\n\nInternational is growing.\n\nThe -30%+ domestic is obviously Pepsi. When they start buying it will be a little better.\n\nOver $1 billion revenue.\n\nFCF, what will they do with it. Not much debt.",
      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvsrut2/",
      "created": 1730932893,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvpzmkq",
      "score": 17,
      "body": "People seem to love this stock on Reddit but I think a lot of folks do so purely off past performance/share price drop. \n\nIf buying with an eye towards 10-15% yoy topline growth going forward that’s one thing, but with retail sales leveling off I think anyone convinced it will return to prior growth is doing so without it being fundamentally supported right now.",
      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvpzmkq/",
      "created": 1730905588,
      "depth": 0,
      "replies": [
        {
          "id": "lvusll6",
          "score": 1,
          "body": "\"anything under 50 is a great price\" \n\nGlad I never touched this stock",
          "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvusll6/",
          "created": 1730959029,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvpkvym",
      "score": 12,
      "body": "Some very good stuff in [$CELH](https://x.com/search?q=%24CELH&src=cashtag_click) earnings like International sales increasing dramatically. I will be + to my position for sure if it gets down to the $28s which is my average cost. I'm in a \"no lose\" situation here with my Celsius investment.",
      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvpkvym/",
      "created": 1730901310,
      "depth": 0,
      "replies": [
        {
          "id": "lvpnb6i",
          "score": 26,
          "body": "I’m holding at $60 cost basis. This and solar has royally screwed me this year",
          "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvpnb6i/",
          "created": 1730902038,
          "depth": 1,
          "replies": [
            {
              "id": "lvpo3vl",
              "score": 4,
              "body": "Whats your next play/plan with Celsius shares you have? Average down? Sell for loss? Hold?",
              "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvpo3vl/",
              "created": 1730902278,
              "depth": 2,
              "replies": [
                {
                  "id": "lvpotac",
                  "score": 17,
                  "body": "Average down, I work in the military on a pretty big base and everyone seems to be drinking it which is why I invested in it the first place. So demand is there, they just need to expand internationally. Taste wise I think it’s the best as well",
                  "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvpotac/",
                  "created": 1730902488,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lvr0ywl",
                      "score": 3,
                      "body": "Purely anecdotal but I visited 4 European countries last month and every time i saw it on shelves it was a full euro more expensive than Redbull and Monster, which is all I really saw people drinking. I love the drink, but I buy energy drinks based on cost and mostly buy them because they’re frequently the cheapest at my grocery store.",
                      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvr0ywl/",
                      "created": 1730915568,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lvrlsrl",
                          "score": 6,
                          "body": "It may be more expensive but their international sales are growing by a large margin.",
                          "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvrlsrl/",
                          "created": 1730921245,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lvr2g8d",
                          "score": 2,
                          "body": "That’s interesting that is more expensive over there, by a big amount too. I personally don’t mind paying a little more personally so I don’t have to drink crap but a full buck is nothing to sneeze at. Very interesting, thanks for adding this",
                          "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvr2g8d/",
                          "created": 1730915973,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvqd3lv",
              "score": 3,
              "body": "Same.",
              "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvqd3lv/",
              "created": 1730909208,
              "depth": 2,
              "replies": [
                {
                  "id": "lvqg4wf",
                  "score": 5,
                  "body": "Down 39k, kept thinking it would find a bottom but no it kept drilling while the market kept going up",
                  "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvqg4wf/",
                  "created": 1730910023,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvpoy4z",
          "score": 3,
          "body": "From very low to a little less low..the report is shite! But bad news come in 3s, the drought wont last much longer",
          "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvpoy4z/",
          "created": 1730902528,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvrh554",
      "score": 5,
      "body": "I have been interested in a while and this post made me check the price and since it was down almost 7% today I bought 50 shares for my small collection of single stocks.",
      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvrh554/",
      "created": 1730919970,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvqdty8",
      "score": 3,
      "body": "Can someone explain the Pepsi supply chain optimization? It seems weird and I don’t fully understand it.",
      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvqdty8/",
      "created": 1730909404,
      "depth": 0,
      "replies": [
        {
          "id": "lvrlvpr",
          "score": 2,
          "body": "I’m guessing it’s corporate speak for them shoving too much inventory into the Pepsi distribution channel which they then had to discount and now they’re doing smaller orders.  It’s all negative, but when call it “optimize” that sounds positive.  It’s like saying “right sizing” when the truth is you’re laying off people and killing jobs.",
          "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvrlvpr/",
          "created": 1730921267,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvr9fno",
      "score": 4,
      "body": "Ugh, I still can't believe I sold RKLB and RDDT for this POS. Whatever I will still hold as I don't think it's going to go down that much from here.",
      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvr9fno/",
      "created": 1730917881,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvrlquz",
      "score": 1,
      "body": "It’s 10-25% more expensive than monster but cheaper than red bull internationally",
      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvrlquz/",
      "created": 1730921230,
      "depth": 0,
      "replies": [
        {
          "id": "lvvobgl",
          "score": 0,
          "body": "100-150% more expensive per volume than Monster and something around 20% than Red Bull in my country (EU region)",
          "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvvobgl/",
          "created": 1730978389,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvug8e8",
      "score": 1,
      "body": "This stock is going to sub 20s before skyrocketing again",
      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvug8e8/",
      "created": 1730953330,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvr5i9u",
      "score": 0,
      "body": "are we buying more? selling? I own shares and not sure if I should sell.",
      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvr5i9u/",
      "created": 1730916817,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvuu5jc",
      "score": 0,
      "body": "It's making lower lows. There does seem to be a significant fib and support level around \\~$22. I might buy some shares if it does drop to those levels otherwise the reward isn't there for me personally.",
      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvuu5jc/",
      "created": 1730959844,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvqhtdn",
      "score": -12,
      "body": "never gona buy a stock that only offers chemical mix in a can at gyms",
      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvqhtdn/",
      "created": 1730910468,
      "depth": 0,
      "replies": [
        {
          "id": "lvqweak",
          "score": 3,
          "body": "Clueless comment",
          "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvqweak/",
          "created": 1730914339,
          "depth": 1,
          "replies": [
            {
              "id": "lvr6sdr",
              "score": -7,
              "body": "get owned lol, i hope its not your life savings haha",
              "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvr6sdr/",
              "created": 1730917165,
              "depth": 2,
              "replies": [
                {
                  "id": "lvr7388",
                  "score": 6,
                  "body": "Not even invested in it, ur comment is just dumb 😬",
                  "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvr7388/",
                  "created": 1730917245,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lvrbb7w",
                      "score": -6,
                      "body": "why?its same argument made about SBUX, can not be that \"dumb\"",
                      "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvrbb7w/",
                      "created": 1730918391,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lvvwc66",
                          "score": 3,
                          "body": "Enjoy the downvotes",
                          "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvvwc66/",
                          "created": 1730982331,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lvwdzy9",
                              "score": -2,
                              "body": "downvotes will not make your stock to go up LOL\n\nI rather make money than get upvotes, I will give you one free upvote on the house If you are that desperate",
                              "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvwdzy9/",
                              "created": 1730988964,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lvwwlir",
                                  "score": 1,
                                  "body": "Looking at ur history, ur not really one to talk about money 😭",
                                  "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lvwwlir/",
                                  "created": 1730994748,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lw09u9e",
          "score": 0,
          "body": "At one point monster had the highest all time % gains of any ticker.",
          "permalink": "/r/stocks/comments/1gkz14c/celsius_reported_earnings_this_morning_celh/lw09u9e/",
          "created": 1731030903,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}