{
  "title": "Follow-Up Post on Earnings Day: $IONQ Set for a Massive Rally with Multiple Catalysts Ahead",
  "score": 51,
  "selftext": "**TL;DR:** Still long $IONQ on earnings day and not planning to sell anytime soon. Nothing in this post is financial advice, as I consistently lose money.  \n  \n**Ticker:** $IONQ  \n**Industry:** Computer Hardware  \n**Current Price:** $16.35\n\nA month ago, I [posted](https://www.reddit.com/r/wallstreetbets/comments/1g3rx6h/ionq_will_experience_a_massive_rally_and_has/) about IonQ, and since then, the stock has rallied from $10 to $16. Today, the company is holding its earnings call after hours, and I expect a positive reaction in the stock price, followed by consolidation before a potential higher move later this year. Coined as the Nickelback of DD, I made a few nickels on this trade.\n\nI won’t dive into the tech behind quantum or why it’s game-changing, but from an investment perspective, the time to position is now (though ideally, it was 6 months ago). I believe FOMO is about to kick in.\n\nAll the technical slides and key info are publicly available on IonQ’s investor website, PowerPoints, corporate presentations, and interviews with management over the years.\n\nhttps://preview.redd.it/6lj4rzyh0bzd1.png?width=959&format=png&auto=webp&s=895a8e6b55df96f34886886d734f8659b9472f57\n\n# Sources I recommend:\n\n* Shawn Kwon: A Korean YouTuber who traveled to the States to [interview](https://www.youtube.com/watch?v=YldqcQ35NlQ) IonQ’s management. He recently posted an insightful [interview](https://www.youtube.com/watch?v=OezQl80rloU) with them.\n* Peter Chapman: IonQ’s CEO has had some interviews that are really hyping me up. In a [recent](https://www.youtube.com/watch?v=dSVRPDrI8aI) one, he discusses how quantum is gaining commercial traction, especially due to having the right product at the right time, solving AI's growing energy needs.\n* Forbes Interview on Quantum AI: Forbes recently [covered](https://www.forbes.com/sites/torconstantino/2024/10/02/is-quantum-computing-an-unlikely-answer-to-ais-looming-energy-crisis/) the role of quantum AI in addressing AI's energy demands, with IonQ revealing that they're launching a quantum-AI chip prototype in the coming months aimed at reducing power consumption.\n* IonQ's Technical Roadmap: IonQ is ahead by 1 year on its ambitious [roadmap](https://ionq.com/resources/ionq-technology-and-performance-updates-milestones-commercial-advantage?utm_source=x&utm_medium=social&utm_campaign=Q2-2024-webinar&utm_content=webinar&utm_term=45474) and consistently overdelivers, which gives me even more confidence in their future progress.\n\n# Revenue Growth and Business Progress\n\nAfter all, this is what we’re all here for. IonQ has consistently grown its revenue quarter over quarter. I heard Chapman mention that Q3 and Q4 are expected to be their strongest quarters, so I’m expecting a double beat today as well.\n\nhttps://preview.redd.it/5wcagdfyxazd1.png?width=1979&format=png&auto=webp&s=cb8b94b8151b001a4926163c7c79e7b1d6f5ea55\n\nThis is their roadmap based on the qubits they plan to achieve. They’ve mentioned that they expect to gain a commercial advantage starting in 2026, but after today, good results could lead to forward pricing.\n\nQubits, like bits in classical computers, determine the computational power of quantum computers. In quantum computing, qubits scale exponentially in potential, as each additional qubit doubles the system's computational capacity. This is because a quantum system with multiple qubits can represent a superposition of all possible combinations of the qubit states, making quantum systems exponentially more powerful with each added qubit.\n\nBottom line: For a more powerful system, revenue is expected to scale exponentially as well, unlocking more applications that were previously unattainable.\n\nhttps://preview.redd.it/blkjixeayazd1.png?width=1440&format=png&auto=webp&s=1fcc97293e73bded17a2447ba82232142133eca0\n\nJust two days ago, their latest [system](https://status.ionq.co/), **Forte**, became accessible on their cloud. This will likely drive more revenue, as anyone can now test their systems through IonQ’s cloud or other major cloud providers.\n\nhttps://preview.redd.it/jrla5dymzazd1.png?width=916&format=png&auto=webp&s=4d75c3e90390ded079954b4eb76be0ba50484289\n\nWith hyperscalers now planning to literally build nuclear reactors to power their data centers, I believe this is the perfect moment to introduce a new kind of computing product to the market. All made in the USA.\n\n# Business Applications\n\nI’ve heard a lot of people say that applications are at least 10 years away, and value creation will take 10-15 years. But I disagree with that perspective.\n\nThis is their landing page on quantum [applications](https://ionq.com/applications-services), and it looks solid. They’re focusing on areas that Nvidia is also targeting right now: digital twins, hybrid computing, and machine learning. Many of their staff come from top companies like Nvidia, Amazon, and Dell.\n\nhttps://preview.redd.it/asslamcuuazd1.png?width=1200&format=png&auto=webp&s=a18728c7dbfa500838c003f7e6fe1ec449d02abe\n\nRecently, they’ve posted some interesting job openings: one for **Quantum AI** and the other for **Quantum Applications Chemistry**, both for scientist positions.\n\nhttps://preview.redd.it/plbtkkamtazd1.png?width=917&format=png&auto=webp&s=78a67ea32c71e9e122de2f29c3ad126ccba93f78\n\nhttps://preview.redd.it/syiuz5ertazd1.png?width=901&format=png&auto=webp&s=8b26d7531a88554803c333a0f28f51fcfca52cf1\n\nIt seems like they’re ready to develop apps for customers right away. As mentioned in the previous post, **today** they will showcase their first application, presumably focused on the healthcare industry. Personally, I think it will be related to pharma, especially since they’ve partnered with Quantum Basel in Switzerland to provide quantum access to nearby organizations.\n\nThe good thing is that after today, investors will immediately know whether this showcased app is something of value or not. We’ll find out if it’s commercially viable and applicable to the industry or just a prototype far from commercialization. Either way, it's better to clarify this quickly.\n\n# Options Chain\n\nI’m sharing this to highlight that institutions are taking an interest, not to promote options gambling. In recent months, IonQ’s chain has shifted from being sh\\*tty to balanced. This is the chain for the 2026 LEAPS. The OTM $35 strikes have attracted significant attention over the past few weeks, going from no open interest to 3k contracts for a $3B company since late summer.\n\nhttps://preview.redd.it/ln9ryu8duazd1.png?width=1200&format=png&auto=webp&s=e0da88dfcb6c3b7d26615e06abf5dc9d97c59973\n\n# Institutional and Government Interest\n\nIn a recent interview on [CNBC](https://www.youtube.com/watch?v=78JiA4ealks), Amy Raslin discussed why her fund went long on IonQ. This decision came after the stock rallied from $10 to $14 just a week ago.\n\nAdditionally, Congressman Glenn Ivey [spoke](https://www.youtube.com/watch?v=E27cYheKQHE) with Bloomberg and Peter Chapman about the growing support for IonQ.\n\n# Competitors\n\nFor those saying that Dell or Microsoft are leading the way in quantum hardware, they don’t know what they’re talking about.\n\nIonQ has the highest gate fidelity and error correction in the industry, along with the largest contracts from government institutions like ARLIS. The White House has even highlighted IonQ’s efforts to scale up their manufacturing facility in Bothell as part of their \"[Investing in America](https://www.whitehouse.gov/wp-content/uploads/2024/05/Washington-IIA-State-Fact-Sheet.pdf)\" agenda.\n\nhttps://preview.redd.it/zhb8fjh7wazd1.png?width=988&format=png&auto=webp&s=fd8a2eff6f5f04780723c99178ebc67d3ba404d0\n\n# Bear Thesis\n\nThe bear thesis, largely pushed by day traders these days, focuses on technical analysis charts and claims that IonQ is overbought. A few years ago, Scorpion Capital published a short report, which was promptly [responded](https://ionq.com/posts/may-12-2022-ionq-founders-respond) to by the founders. Since then, no large short positions have emerged with a solid thesis against IonQ. It's a bet against the technology and IonQ's ability to commercialize it.\n\nBears often argue that IonQ is expensive based on valuation metrics and negative EPS. This argument makes no sense since they’re just starting out and went public before generating revenue.\n\nBut this is exactly the moment to make a decision in my opinion: do you believe IonQ will continue to execute its roadmap? If so, do you enter now, before the revenue starts to come in and the price catches up to projections, or do you wait until the stock is trading at higher multiples but miss the current $16 entry point?\n\nI think that a lot of the bearish articles are laughable, especially when they keep repeating that quantum is \"10 years away.\" Beyond timing and valuation, no other real bear arguments seem to make it into the debate.\n\n# Founders\n\nI’ve seen some people argue that the founders leaving IonQ to continue their research signals that the ship is sinking and is an obvious short sell. However, the reality is that the founders didn't leave because the company is failing; they transitioned to focus on their academic work after 20 years of research. The company is now in the hands of a commercial and specialized quantum team focused on scaling up the commercialization efforts.\n\nIt all started 20 years ago in a lab in Maryland, when an investor approached the founders after reading their paper in a journal. That investor proposed creating a company based on their groundbreaking technology, and here we are today.\n\n# Conclusion\n\nThat said, the run on the stock is far from over. It will last for years, with investors cashing out at various price levels along the way. I have no idea what will be said during earnings or what we can expect from the application that is to be showcased, but I’m eagerly waiting to find out.",
  "link_flair_text": "DD",
  "id": "1gl2dp1",
  "num_comments": 65,
  "created_utc": 1730910245,
  "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/",
  "comments": [
    {
      "id": "lvqh05c",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 98 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/) \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvqh05c/",
      "created": 1730910252,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvxcebw",
      "score": 11,
      "body": "Pumped to $22.10 today. ![img](emote|t5_2th52|4276)",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvxcebw/",
      "created": 1730999344,
      "depth": 0,
      "replies": [
        {
          "id": "lvxq5z5",
          "score": 2,
          "body": "How long and how far do you think this rally will go before it finds a major resistance? New ATH in a week?",
          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvxq5z5/",
          "created": 1731003194,
          "depth": 1,
          "replies": [
            {
              "id": "lw2gdgg",
              "score": -2,
              "body": "Check out IONQ’s cash vs expenses… their going to have to dilute soon. I’d wait it out",
              "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw2gdgg/",
              "created": 1731068787,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lw94sj7",
          "score": 3,
          "body": "Earnings call was good! Growth trajectory is upwards! I will start position this week and HOLD it long term! Thanks for the solid DD!",
          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw94sj7/",
          "created": 1731162982,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvr7yp7",
      "score": 7,
      "body": "I’m all in with $20 December calls. Let’s do this thing 🫡",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvr7yp7/",
      "created": 1730917484,
      "depth": 0,
      "replies": [
        {
          "id": "lw14mdj",
          "score": 1,
          "body": "That’s going to be a nice profit already 😃",
          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw14mdj/",
          "created": 1731042085,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvqjrxi",
      "score": 11,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvqjrxi/",
      "created": 1730910990,
      "depth": 0,
      "replies": [
        {
          "id": "lvqt9o4",
          "score": 7,
          "body": "I'm in with shares and calls. I think once they get the error correction going there will be decent gains",
          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvqt9o4/",
          "created": 1730913500,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvqment",
      "score": 9,
      "body": "IONQ was put into an ETF that’s why the price went up",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvqment/",
      "created": 1730911682,
      "depth": 0,
      "replies": [
        {
          "id": "lvrbca9",
          "score": 5,
          "body": "Institutional buying is the hallmark of a blue chip. Not saying IonQ is a blue chip just yet, but the people that matter in the financial industry tend to think it will become one rather soon. These people get in early and protect their money. Nothing could be more bullish.",
          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvrbca9/",
          "created": 1730918399,
          "depth": 1,
          "replies": [
            {
              "id": "lvrm15c",
              "score": 7,
              "body": "Ummmm. No. The ETF it was put in is very speculative, shitty, has an unusually high expense ratio, and isn’t being run by people known for moon-high success in the industry. But, the ETF trades for $50, and IONQ is 3% of the, like, 15 holds.",
              "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvrm15c/",
              "created": 1730921308,
              "depth": 2,
              "replies": [
                {
                  "id": "lvrt4wc",
                  "score": 2,
                  "body": "ETFs are not the only entities buying this stock. Vanguard, Blackrock, Geode, Amazon, etc, etc, etc... Institutional ownership is massive. Vanguard and Blackrock alone have about 35 million shares. And that's without about 200 million shares outstanding. One third of outstanding shares are institution owned.",
                  "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvrt4wc/",
                  "created": 1730923231,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvrjfr1",
          "score": 3,
          "body": "Which ETF?",
          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvrjfr1/",
          "created": 1730920599,
          "depth": 1,
          "replies": [
            {
              "id": "lvt7vl5",
              "score": 0,
              "body": "Defiance Quantum ETF (QTUM) has it, idk if that's the one he's talking about. TMAT, WTAI, SMIZ, and FYC also hold IONQ\n\nI have been buying and selling IONQ for weeks and putting the profits in QTUM",
              "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvt7vl5/",
              "created": 1730937987,
              "depth": 2,
              "replies": [
                {
                  "id": "lvtvwor",
                  "score": 1,
                  "body": "For real? Have you read the prospectus and been to their website!?",
                  "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvtvwor/",
                  "created": 1730945865,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lvtxew2",
                      "score": 0,
                      "body": ".4% expense ratio, for QTUM if thats why youre talking about, what else did I miss? you seem very alarmed",
                      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvtxew2/",
                      "created": 1730946377,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lvtz0pd",
                          "score": 1,
                          "body": "I didn’t really follow any of what you said, but I’m not alarmed. Have you read the prospectus? I hope you’re not buying this in a taxable account.   I decided it would be a terrible idea after researching QTUM. Why do you like Defiance?",
                          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvtz0pd/",
                          "created": 1730946921,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lvu062q",
                              "score": 0,
                              "body": "I wanted to add quantum semis to my portfolio and since its such a burgeoning industry I thought an etf would be less a less volatile place to park some gains",
                              "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvu062q/",
                              "created": 1730947319,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lvu1v8y",
                                  "score": 1,
                                  "body": "Pretty much every other quantum computing ETF would be better. Why do you like Defiance?",
                                  "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvu1v8y/",
                                  "created": 1730947902,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lvu2mn2",
                                      "score": 1,
                                      "body": "IONQ was their top holding, growth seemed good.  Which would you recommend?",
                                      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvu2mn2/",
                                      "created": 1730948161,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lwaon6t",
                                          "score": 1,
                                          "body": "u/Newbiewhitekicks curious which ETF you would recommend if not QTUM?",
                                          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lwaon6t/",
                                          "created": 1731181286,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvwzxz0",
      "score": 9,
      "body": "Thanks bruh. Finally someone with a solid play. I owe you a HJ next time I see you.",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvwzxz0/",
      "created": 1730995776,
      "depth": 0,
      "replies": [
        {
          "id": "lvx0r9s",
          "score": 3,
          "body": "💸🤙",
          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvx0r9s/",
          "created": 1730996014,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvskzkb",
      "score": 3,
      "body": "IONQ DOWN 5-6% AH (11/6/24)",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvskzkb/",
      "created": 1730930869,
      "depth": 0,
      "replies": [
        {
          "id": "lvwlaui",
          "score": 7,
          "body": "Up",
          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvwlaui/",
          "created": 1730991348,
          "depth": 1,
          "replies": [
            {
              "id": "lvwm7of",
              "score": 2,
              "body": "HOWWW",
              "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvwm7of/",
              "created": 1730991631,
              "depth": 2,
              "replies": [
                {
                  "id": "lvwom4m",
                  "score": 2,
                  "body": "The power of quantum memes",
                  "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvwom4m/",
                  "created": 1730992378,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lvwwx00",
                      "score": 2,
                      "body": "Keeps going",
                      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvwwx00/",
                      "created": 1730994841,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvx0sf0",
      "score": 3,
      "body": "🤝",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvx0sf0/",
      "created": 1730996023,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvx1v2t",
      "score": 3,
      "body": "Thanks for the play. After earnings response was interesting on that downturn initially with a slow return after hours to this rocket in the morning even when missing expectations, any thoughts on that? Either way. WE UPPPP\n\nhttps://preview.redd.it/f24txkep8izd1.jpeg?width=1179&format=pjpg&auto=webp&s=45e8a931468551aadd260d4b12ed21adf9848f95",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvx1v2t/",
      "created": 1730996334,
      "depth": 0,
      "replies": [
        {
          "id": "lvxg4m1",
          "score": 1,
          "body": "At this point I’m thinking about exercising my $15 calls. Sold one out of the two…. Hmmm 🤔\n\nI came into this as a trade so maybe i’ll stick to that no clue about quantum computing enough to invest properly",
          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvxg4m1/",
          "created": 1731000395,
          "depth": 1,
          "replies": [
            {
              "id": "lw55u3l",
              "score": 2,
              "body": "Sold today as it reached back to recent ATH of $25. Thank you for the 250% contract gain ![img](emote|t5_2th52|4276)",
              "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw55u3l/",
              "created": 1731099293,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lw2j5kh",
          "score": 1,
          "body": "I listened to the call, I cant understand why it popped off so much",
          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw2j5kh/",
          "created": 1731069968,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvx9ils",
      "score": 3,
      "body": "Got in a few months ago. Almost panick sold. Wish I put in more as you d naturally. 10% of my portfolio in the stock was acceptable risk. Was tempted to YOLO.",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvx9ils/",
      "created": 1730998524,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw0imi4",
      "score": 3,
      "body": "This played out very well young sir. We shall owe you an absolute gratitude beyond words",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw0imi4/",
      "created": 1731033889,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvqwjol",
      "score": 4,
      "body": "Best of luck to you, I read your first DD and enjoyed watching the runup. Personally I am on the bearish side of this one, with puts locked in. I can see the case for long term play, but I think they will have to come out with some really promising guidance and delivery on this call to keep up the momentum on a 144% 3-month run. That said I hope for the success of this company long term",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvqwjol/",
      "created": 1730914380,
      "depth": 0,
      "replies": [
        {
          "id": "lvwyuzv",
          "score": 6,
          "body": "This didn't end really well.",
          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvwyuzv/",
          "created": 1730995456,
          "depth": 1,
          "replies": [
            {
              "id": "lvx0i7w",
              "score": 4,
              "body": "Nope had to bail first thing market open and switch over to calls. Still make money tho so all good. Look forward to seeing them grow the next 2 years",
              "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvx0i7w/",
              "created": 1730995940,
              "depth": 2,
              "replies": [
                {
                  "id": "lw956l0",
                  "score": 1,
                  "body": "Bailing first thing at market open was like the only possible way to lose money, and you did it why?",
                  "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw956l0/",
                  "created": 1731163129,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw954hi",
              "score": 1,
              "body": "Didn’t end well? Bro, if anybody managed to lose on this play, they’re a clown.",
              "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw954hi/",
              "created": 1731163107,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvsa949",
      "score": 3,
      "body": "IONQ P/S is absolutely ludicrous atm, over 100 it’s clearly going to crash",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvsa949/",
      "created": 1730927883,
      "depth": 0,
      "replies": [
        {
          "id": "lw1h1v6",
          "score": 1,
          "body": "whats p/s?",
          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw1h1v6/",
          "created": 1731048184,
          "depth": 1,
          "replies": [
            {
              "id": "lw2fag6",
              "score": 2,
              "body": "Stock price Vs Sales for the year, it’s currently at 117 whilst still has no practical working product",
              "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw2fag6/",
              "created": 1731068310,
              "depth": 2,
              "replies": [
                {
                  "id": "lw2gon6",
                  "score": 1,
                  "body": "It has a working product it’s just the price/ sales is absurd",
                  "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw2gon6/",
                  "created": 1731068922,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lw2gv26",
                      "score": 1,
                      "body": "Unfortunately you’re wrong It’s not yet a commercially viable product is just a test bed currently being used for experimental purposes",
                      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw2gv26/",
                      "created": 1731069000,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lw2h2ll",
                          "score": 1,
                          "body": "I wouldn’t buy at this price and would recommend everyone seeing this not to buy at this price you could lose a lot of money",
                          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw2h2ll/",
                          "created": 1731069091,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvsjvw9",
      "score": 4,
      "body": "Lol they're selling the news.  Time to buy",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvsjvw9/",
      "created": 1730930552,
      "depth": 0,
      "replies": [
        {
          "id": "lvy1l74",
          "score": 2,
          "body": "Ha called it",
          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvy1l74/",
          "created": 1731006363,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvrwknt",
      "score": 2,
      "body": "Good DD\n\n  \nI watched the videos linked and had favorable impressions. The C suite(?) seem to present some real data and talked about daily operations the way I expect a functional company to. Seem to be setting realistic expectations without embellishing\n\nQuestion, the TAM is and will always be just datacenters and enterprise customers correct? I see no use case where the tech is scaled down to a laptop or handheld format? Not that that is an issue, just getting a sense of what they are targeting",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvrwknt/",
      "created": 1730924182,
      "depth": 0,
      "replies": [
        {
          "id": "lw1gzq6",
          "score": 1,
          "body": "No need to scale it down when you can have cloud compute",
          "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw1gzq6/",
          "created": 1731048151,
          "depth": 1,
          "replies": [
            {
              "id": "lw356v9",
              "score": 1,
              "body": "Sure but that doesn't expand the TAM and just falls into anticipated use case",
              "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw356v9/",
              "created": 1731077766,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvx9t96",
      "score": 2,
      "body": "With IONQ making these exponential gains maybe it, and you, will get the credit deserved!!!",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvx9t96/",
      "created": 1730998607,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvxjymq",
      "score": 1,
      "body": "I’ve got December and January $20 calls.. today is a good day. Good enough to sell, but how high do you think this will go?",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvxjymq/",
      "created": 1731001468,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvyl3on",
      "score": 1,
      "body": "Can you give me a brief explanation as to why the stock explosed today? Did you get a listen on their earnings?",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lvyl3on/",
      "created": 1731011888,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw2gc2e",
      "score": 1,
      "body": "Check out IONQ’s cash vs expenses… their going to have to dilute soon. I’d wait it out",
      "permalink": "/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/lw2gc2e/",
      "created": 1731068771,
      "depth": 0,
      "replies": []
    }
  ]
}