{
  "title": "Jerome Powell changing interest rates ",
  "score": 2343,
  "selftext": "",
  "link_flair_text": "Meme",
  "id": "1glyvee",
  "num_comments": 57,
  "created_utc": 1731007872,
  "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/",
  "url_overridden_by_dest": "https://i.redd.it/hpghgtq47jzd1.jpeg",
  "comments": [
    {
      "id": "lvy6zoc",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvy6zoc/",
      "created": 1731007877,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvy800e",
      "score": 152,
      "body": "Well when trump promises to bring inflation back you need to move things up.",
      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvy800e/",
      "created": 1731008163,
      "depth": 0,
      "replies": [
        {
          "id": "lvzr8nt",
          "score": 55,
          "body": "You're reading into his promised actions which will probably be inflationary. \n\nBut Trump actually promised to bring *DOWN* inflation ***WHILE*** doing many of those inflationary things including but not limited to: stopping new inward migrations, while deporting residing migrants, also while putting tariffs on EVERYONE (surely won't be met with any reciprocity... [also Trump was the one who drew/negotiated/signed the new NAFTA?](https://en.wikipedia.org/wiki/United_States%E2%80%93Mexico%E2%80%93Canada_Agreement)), plus escalating the US-CN trade war by pumping tariffs beyond >50% (0 mention of losing the Temu-loophole tho), also a stronger economy (when this economy is considered too hot already) with higher wages, plus more corporate mergers plus less corporate regulation, lower taxes which should boost spending (surely not inflationary), and reversing climate goals/initiatives that are sure to not lead to more natural disasters nor any insurance hikes.\n\nI also call BS on prices coming down meaningfully. Certainly not going to happen with assets until the bubble bursts. We might increase production massively to reduce inflation while growing GDP and pumping markets up. But I think we're most likely going to have normalized 2-4% Fed rates, higher than prior inflation ~3% but not hitting 5%, and higher than normal growth because that's the only way to deal with the massive national debt (unlikely we go back to 0% Fed rate era). Plus Trump likes growth anyways, stock markets hitting ATH to Trump is like a woman saying his cock is huge, Trump will lie about inflation being -9000%, and his base will eat it up.\n\nBut hey, we're WSB and that's not what we focus on here so here's my play TLDR:\n\n1. Short cash. \n\n2. Long US equities (leverage up or options if you're a degen). Then you play the chicken game with stock market going up as what seems to be the foundations of our society collapses around us. Maybe nothing, may recession, maybe world war, etcetc. Who really knows?\n\n3. If you're a bitch then hedge but just know it will mean less gains: bonds, gold, crypto, rural land, food, 100 years worth of TP, guns+bullets, foreign passport, yacht, camper, wine/whisky, dragon dildos, a bunker, or whatever helps you sleep at night. If shit hits the fan then you better pray your hedge works crypto ain't working if we got nuked back to the stone age, gold won't save you from super bubonic plague 2028, guns and bullets might help in a civil war but they won't really help you if it's just a recession, etcetc.\n\n4. If you're a gambling addict then probably learn to trade the VIX since Trump promises a lot of things but one thing he always delivers on is surprises, chaos, and WTF moments.",
          "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvzr8nt/",
          "created": 1731024670,
          "depth": 1,
          "replies": [
            {
              "id": "lw0pwm3",
              "score": 15,
              "body": "Thanks for painting a colorful picture of the next 4 years ![img](emote|t5_2th52|27421)",
              "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw0pwm3/",
              "created": 1731036444,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lw1q4ls",
              "score": 3,
              "body": "Is \"short cash\" hold cash in the short term or is it bet against cash?",
              "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw1q4ls/",
              "created": 1731053568,
              "depth": 2,
              "replies": [
                {
                  "id": "lw1uwdu",
                  "score": 12,
                  "body": "Debt is effectively being short cash.\n\nIf you use debt to acquire appreciating assets, you just need inflation rate + appreciation rate > interest rate to come out ahead.\n\nApply leverage and you now capture the increasing nominal price of the entire asset while only fronting a portion of the cash.\n\nTL;DR: buy house big mortgage max leverage, inflation make rich",
                  "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw1uwdu/",
                  "created": 1731056647,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lw1wiy9",
                      "score": 2,
                      "body": "Ah, so what I did back in 2020 before making out like a bandit selling last year. Makes sense, thanks.",
                      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw1wiy9/",
                      "created": 1731057704,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lw1xli3",
                          "score": 3,
                          "body": "Yep, and this is part of why rates are rising despite the fed continuing to cut. Banks don’t want to give out “cheap” debt and then see inflation enrich someone else\n.",
                          "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw1xli3/",
                          "created": 1731058408,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lw3wk3k",
                          "score": 3,
                          "body": ">Ah, so what I did back in 2020 before making out like a bandit selling last year. Makes sense, thanks.\n\nYou can replace 2020 with 2021, 2022, 2023, 2024 or 2019, 2018, 2017, 2016. There is difference in HOW MUCH you make but there are basically no losses. If you did then you just hold since that's the point of RE. The only real times folks got BTFO in RE the last were 2006/2007/2008 and the time before that was in the 1980s. RE works on longer cycles, is lower vol, higher debt/leverage, and holding long means losses are uncommon but you have lots of maintenance and need lots of time. The whole point of a Trump trade is that we're back at 2016 again so it's likely the case in 2025-2028. The free 25K FTH buyer thing Kamala threw out likely dead or cut back, student loans clearing likely dead or cut back, higher growth/inflation is likely, and Trump is a LITERAL BILLIONAIRE RE mogul so he's going to write the taxes/laws in favor of billionaire real estate guys. Residential RE ain't likely to go down in high demand areas. Commercial RE might but most normal humans can't afford to get into that. That's why GenZ and GenYs who didn't have homes were dummies not voting Harris (not my problem). \n\nHowever the real question for RE for most is whether you can could afford to get into the game at all. Also home =/= investment as it doesn't generate cashflow. It's a money/time heatsink but if you have one then you're slowly building up equity rather than paying it to your landlord.",
                          "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw3wk3k/",
                          "created": 1731085850,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lw411xc",
                              "score": 2,
                              "body": "To be clear, I didn't buy or sell for the purpose of making profit, I sold because I was compelled to move for personal reasons. I just happened to get lucky and the value of the property went up by 40% between when I bought and when I sold. I do not currently own a property because I need the relative mobility that comes with being able to break/sell a lease and scoot.\n\nGiven current political and economic conditions and how they apply to me, I am unlikely to buy any property for any reason in the near future. I have a six figure lump that I'm trying to protect against inflation and a certain degree of imminent market chaos and most of it is now currently sitting in short-term, floating-rate bonds and I need to change that. Realestate definitely isn't it, and neither is being a gambling degenerate. ![img](emote|t5_2th52|4271)\n\nBut there are better nuggets of wisdom in WSB comments than on shit subs like r/investing and r/stocks, where every idiot just shouts \"voo and chill\". Some of us have unique circumstances.",
                              "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw411xc/",
                              "created": 1731087159,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lw44dpl",
                                  "score": 2,
                                  "body": ">To be clear, I didn't buy or sell for the purpose of making profit, I sold because I was compelled to move for personal reasons. I just happened to get lucky and the value of the property went up by 40% between when I bought and when I sold. \n\nI wasn't judging you man. Just giving my thoughts on RE cause I thought you sounded scared but personal/life reasons are always ok in my book. My stocks have been up big so I got into RE \"for personal reasons\". Leveraging up and getting into RE felt right for me but that doesn't mean it's right for you or anyone else. I didn't want to sell my stocks at first, but I wanted that RE for personal reasons. It's life choices. What is the point of money if you don't spend it when you need to? \n\nAnyways, it's never one asset for another even if cryptobros can't seem to understand that. As for bonds? It is \"safe\" but you play the risk of lower returns with higher inflation or loss opportunity cost but win big if you land the jackpot. I have a very small levered bond position of TMF as that \"just in case\" but bonds aren't really my cup of tea over all given personal reasons like my age and hedges being in alternatives. Anyways climate change and geopolitical shit is real out there and Trump only adds chaos so having a hedge is important even if WSB says otherwise.",
                                  "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw44dpl/",
                                  "created": 1731088123,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lw3v7di",
                      "score": 1,
                      "body": "This. Short cash means you want to hold no cash or cash equivalents and ideally lever up in debt be it a mortgage, portfolio loan for a home remodel, using margin on your stocks to buy indexes, selling far OTM put options so you get premium, business loan to expand business inventory, auto loan for a work vehicle, credit card (ideally those 18-24month 0% promos) if you're using it to buy assets or run your business, etcetcetc.\n\nSo long as your debt isn't too high so you don't go default/broke, you're buying assets instead of wasting it on stupid shit, and inflation eats away at your debt or surpasses your interest rate then you win out.",
                      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw3v7di/",
                      "created": 1731085456,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lw2bnti",
              "score": 2,
              "body": "So dont change anything we are doing now. Got it",
              "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw2bnti/",
              "created": 1731066603,
              "depth": 2,
              "replies": [
                {
                  "id": "lw3zazu",
                  "score": 1,
                  "body": "Normally I'd just ignore you, but I'll put myself out there just for you because I'm feeling brotherly. \n\n>dont change anything we are doing now\n\nYes if you're already doing what I mentioned that AND WINNING. Then then why would you change?\n\nWinners keep winning. Losers keep losing. You need money to make money. The rich get richer. Having no girls around you makes you a creep which leads to incels, but having girls around you is like a magical pussy magnet as you will attract attention from girls even if you don't want it.\n\nI wasn't short cash in 2016-2020. I was building up cash to get into RE. I'm in RE now. I wasn't hedging much in 2016-2020 but I am hedging with some of the things I mentioned now. My choices are booze, guns/ammo, and shiny rocks but these hedge choices are subjective and based largely on your values/lifestyle/mentality. No business leverage in 2016-2020 but I took out a business loan, built up inventory, and will likely continue to build it up. Also I learned to trade vix in case of opportunistic events. I don't do it often but I don't lose money on it because I trade selectively. You don't have to do what I do and I can't build an entire fucking plan for you when I'm not you so you're free to do as you like.",
                  "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw3zazu/",
                  "created": 1731086652,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw2h7fq",
              "score": 2,
              "body": "this is a long post i am sleeping i just went to wendys leave me alone",
              "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw2h7fq/",
              "created": 1731069148,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lw6sqby",
              "score": 1,
              "body": "Me reading this: “yup.  Yup.  Yup.  Yup.”\n\nExcept you didn’t address fed independence.  Seems like you are assuming business as normal?",
              "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw6sqby/",
              "created": 1731119301,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lw1y9yc",
              "score": -12,
              "body": "lol found the camel voter. The only world war would have happened under Camela ![img](emote|t5_2th52|4271)",
              "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw1y9yc/",
              "created": 1731058860,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvy7gzz",
      "score": 97,
      "body": "Well this is dumb",
      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvy7gzz/",
      "created": 1731008014,
      "depth": 0,
      "replies": [
        {
          "id": "lvy7s8n",
          "score": 55,
          "body": "Hey he's a WSB user you can't expect him to understand how the economy works.",
          "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvy7s8n/",
          "created": 1731008102,
          "depth": 1,
          "replies": [
            {
              "id": "lvyl5fz",
              "score": 22,
              "body": "Let me explain... The rate of interest in the economy is way up! Cant you see how many people are googling it? But Jerome wants people to be less interested in the economy, because all the interest is clogging the internet, so he needs to lower the interest rates.\n\nIt seems weird I have to explain this, did yall fail homeschool or what?",
              "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvyl5fz/",
              "created": 1731011902,
              "depth": 2,
              "replies": [
                {
                  "id": "lvz3yl9",
                  "score": 3,
                  "body": "Can confirm I wurk4Google",
                  "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvz3yl9/",
                  "created": 1731017257,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lvz6969",
                      "score": 4,
                      "body": "I’m posting cuz our avatars look similar.",
                      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvz6969/",
                      "created": 1731017946,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lvz6txf",
                          "score": 2,
                          "body": "Can confirm",
                          "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvz6txf/",
                          "created": 1731018118,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lvygkw7",
          "score": 2,
          "body": "It’s actually kinda how it works tho?",
          "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvygkw7/",
          "created": 1731010602,
          "depth": 1,
          "replies": [
            {
              "id": "lvymhl6",
              "score": 15,
              "body": "You’re right the only logic for raising it is to lower it",
              "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvymhl6/",
              "created": 1731012279,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lw0welz",
          "score": 1,
          "body": "aren't we all?",
          "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw0welz/",
          "created": 1731038817,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lvya02b",
          "score": -11,
          "body": "Central banking is dumb",
          "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvya02b/",
          "created": 1731008727,
          "depth": 1,
          "replies": [
            {
              "id": "lvyemog",
              "score": 18,
              "body": "Why\n\n(Morons hate this one simple trick)",
              "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvyemog/",
              "created": 1731010043,
              "depth": 2,
              "replies": [
                {
                  "id": "lvylcbz",
                  "score": 10,
                  "body": "Fuck, I was ready for any question but that one!",
                  "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvylcbz/",
                  "created": 1731011956,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lvyqhlf",
                      "score": -3,
                      "body": "I forgot redditors love rich private bankers. The federal reserve is a private bank that decides what our money is worth, congrats. And they give money to other banks which in turn loan it out to you. It’s called fraud. They are loaning out money they don’t have. You have been fooled.",
                      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvyqhlf/",
                      "created": 1731013411,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lvz45an",
                          "score": 8,
                          "body": "As opposed to gold, which gets its value from looking fine in my blinged out grill.",
                          "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvz45an/",
                          "created": 1731017313,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lvz5mcx",
                              "score": -3,
                              "body": "Gold has held value for thousands of years. The federal reserve note decreases in value every day.",
                              "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvz5mcx/",
                              "created": 1731017757,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lvzil7f",
                                  "score": 2,
                                  "body": "So we agree, inherent value is based on shininess and for thousands of years people murdered the shit out of each other for gold because its shiny AF.\n\nPaper money is dull, thats how we know its worthless...\n\nThrow gold at an Egyptian pharo and hed be like \"SWEET MORE GOLD! THAT SHIT WILL LOOK FLY ON MY ANKLET!\"\n\nThrow Greenbacks at a pharo and hed be like, \"Bro, this is garbage, this does not enhance my funerary arrangements whatsoever, the only possible thing that could make this cool would be if 5000 years from now it was a global reserve currency, backed by the financial and military might of a nation that has a quarter of the worlds GDP and half the worlds military spending and I could trade it for cocaine and hookers, but unless that happens, this shit aint shiny at all!\"",
                                  "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvzil7f/",
                                  "created": 1731021797,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lvzwayv",
                                      "score": 0,
                                      "body": "You forgot paper money used to be backed by gold. So paper money did equal gold. Also are you saying ppl don’t murder ppl for paper money? Not sure your point",
                                      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvzwayv/",
                                      "created": 1731026360,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lvylyv3",
                  "score": 1,
                  "body": "Why central banks when lots of small banks",
                  "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvylyv3/",
                  "created": 1731012132,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lvype3s",
                  "score": -1,
                  "body": "Who does the fed serve?\nWhy does the US pay interest on its own money?\nWhy did the US do just fine without it for so long?\nHow do you think market crashes happen?\nHow do you think inflation works?\nWhy do you love paying high interest rates?\nWhy do you love not having access to all your money because the banks don’t actually have it?\n\nIf you knew the answer to these questions you wouldn’t be asking why. \n\n(Morons hate critical thinking)\n\np.s. JFK signed an executive order to end the fed. He was proposing the US the have their own currency before he was assassinated. His VP then threw out his order. Thomas Jefferson was also against central banking. Andrew Jackson ended the central bank and balanced the national budget. The federal reserve and IRS was laid out at a secret meeting in 1910.",
                  "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvype3s/",
                  "created": 1731013097,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lvyz3vr",
                      "score": 6,
                      "body": "Just for funsies in a seperate comment I will answer all your questions\n\nThe US does not pay interest on its own money \n\nIt’s questionable whether the US “did fine without it” given they had a 16 year long economic depression that was only broken by a major world war that destroyed the economies of all major western nations \n\nMarket crashes are a super complicated issue but if I was to boil them down to something it would be speculation. Too much speculation that comes crashing back to reality.\n\nDepends on what we mean when we say “i love paying higher interest rates”. The average fed rate throughout its history is 5.5%. That’s not particularly high for starters. Why I “love” it is it allows my country the ability to act to stop recessions and depressions and fight inflation and unemployment. So I don’t have to just take a 16 year long depression to the face and hope a global war happens and I luck out at the only industrial nation left standing. \n\nI do have access to all my money. My bank has no liquidity issue and my money is FDIC guaranteed. I literally just transferred over 150,000 and it happened over night bank to bank 0 issues. I expect no issues when I spend it. Seems fine.",
                      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvyz3vr/",
                      "created": 1731015859,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lvz1ewh",
                          "score": -1,
                          "body": "1) it does pay interest. \n\n2) the banks have often caused these crashes by committing fraudulent, predatory, high risk loans with money they don’t have and should be in prison for doing so\n\n3) go ask your bank for 150,000 cash. Do they have it? What if everyone asks for their 150,000 cash? Do they have it? (No need to respond the answer is “no”)\n\n4) It’s insured? By what? The govt will print you your money back so now it’s worth less and the bank can continue to make poor, high risk investments with no repercussions because they will get bailed out? That’s sounds fantastic!",
                          "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvz1ewh/",
                          "created": 1731016520,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lvz2tn8",
                              "score": 1,
                              "body": "It pays interest on money borrowers do, moron \n\nHe says with 0 example. This is true to some extent though, but when those banks did that they were acting as investors. And so like I said as investors they over speculated. If you’re mad that the fed allows investment banking fair enough. But that’s more a call for better regulation by the fed not abolishing the fed. \n\nYes my bank will give me 150,000 cash. Might not clear same day but yes they will do it. \n\nIt’s insured by the FDIC which is in part paid for by the member banks, not the government.",
                              "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvz2tn8/",
                              "created": 1731016921,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lvyx1jn",
                      "score": 3,
                      "body": "The US pays interest on its own money? Can you explain that one to me chief? \n\nThe US borrows money. It does this by selling treasuries. It pays an interest rate on those treasuries because nobody is going to lend you money without something in return.\n\nThe US borrows money bc we spend more than we take in in taxes.\n\nNone of this really has much to do with the fed at all save that they are a large purchasers at times of US treasuries.\n\nThe fed rate is the interest rate banks use when lending money to each other over night. It’s not interest on US dollars issued. \n\nSo I think, as expected, you’re a fucking moron and have no clue what you’re even talking about.\n\nFurther evidence of this is your inability to just give a straight answer. Instead you just ask a bunch of vague questions as if the answer is obvious instead of just clearly stating your issue with the fed.",
                      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvyx1jn/",
                      "created": 1731015273,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lvz02pb",
                          "score": -2,
                          "body": "Look at your dollar moron. It says Federal Reserve Note. It’s not “US govt” money like you picture in your head. It’s a quasi bank’s IOU. Fiat. Money used to be managed and created by the US treasury. \n\nNewsflash: 74% of income tax goes towards the govt INTEREST payments. Why don’t you google “does the govt pay interest on its debt” before you call me the idiot.",
                          "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvz02pb/",
                          "created": 1731016137,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lvz1goz",
                              "score": 5,
                              "body": "The government pays interest on money it borrowed to pay for stuff it bought that cost more than what it made in tax revenues \n\nThis would be like me making 1k then spending 2k then paying interest on the difference and you coming along and telling me I’m paying interest on the original 1k\n\nThat’s not what’s happening. I’m paying interest on the 1k I BORROWED\n\nYou’re really fucking dumb.\n\n\nAlso “it’s fiat” isn’t an argument. You have to tell me why fiat is bad.",
                              "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvz1goz/",
                              "created": 1731016534,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lvz3207",
                                  "score": -1,
                                  "body": "So it pays interest? Sounds like you agree with me",
                                  "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvz3207/",
                                  "created": 1731016989,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lvz38w1",
                                      "score": 4,
                                      "body": "On money borrowed yes. Like all borrowers. Is this supposed to be a gotcha? How does that even relate to the federal reserve? \n\nLike explain that. How does congress spending more than it makes relate to the fed?",
                                      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvz38w1/",
                                      "created": 1731017045,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lvz63cc",
                                          "score": 1,
                                          "body": "Who do you think prints the money?\n\nRegarding fiat money, would you prefer an oz of gold or 2700 to hold for the next 20 years? If you chose 2700 you are losing money. If you choose gold you know why fiat money is bad already",
                                          "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvz63cc/",
                                          "created": 1731017899,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvycpyo",
              "score": 7,
              "body": "Have you been to the casino?",
              "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvycpyo/",
              "created": 1731009496,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvzggad",
      "score": 32,
      "body": "The rest of us are usually kidding but you might be an actual regard op ![img](emote|t5_2th52|4271)",
      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvzggad/",
      "created": 1731021108,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvyggsr",
      "score": 57,
      "body": "Yo post your positions so I can inverse you since this is the dumbest take I have ever seen on interest rates",
      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvyggsr/",
      "created": 1731010569,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvydr7r",
      "score": 7,
      "body": "Now I understand how the Fed makes decisions.",
      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvydr7r/",
      "created": 1731009789,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw04em7",
      "score": 3,
      "body": "Tell me you don't know how the economy works without telling me",
      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lw04em7/",
      "created": 1731029105,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvyuf6o",
      "score": 3,
      "body": "Raising interest rates is a sub par way to fight inflation but it does help a bit. I think home prices are about to explode.",
      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvyuf6o/",
      "created": 1731014528,
      "depth": 0,
      "replies": [
        {
          "id": "lvz4mdo",
          "score": 1,
          "body": "So property taxes will go up. How to make money on this beside buying an expensive house?",
          "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvz4mdo/",
          "created": 1731017456,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lvzgvqg",
      "score": -1,
      "body": "In 1981 the government decised to make inflation a permanent fixture to our economy. So started the beginning of the cycle of printing. Say ahem.",
      "permalink": "/r/wallstreetbets/comments/1glyvee/jerome_powell_changing_interest_rates/lvzgvqg/",
      "created": 1731021246,
      "depth": 0,
      "replies": []
    }
  ]
}