{
  "title": "Bullish DAL – High Travel Demand to Continue Driving the Other AI (Airline Industry) Trade, 100k Options Position ",
  "score": 33,
  "selftext": "Previous DD on DAL ([DD1](https://www.reddit.com/r/wallstreetbets/comments/1fa29yp/first_dd_bullish_on_delta_dal_through_both/), [DD2](https://www.reddit.com/r/wallstreetbets/comments/1fka728/delta_airlines_dal_dd_reaffirmation_of_long/)) outlined how margin expansion is driven by premium, rational supply control, and falling oil prices, which will propel the premium brands of the airline business. This materialized as DAL and UAL continued their rally, with DAL up another 30% to 60 since my previous DD, primarily driven by US election results and the Trump Trade.  \n\nWith the upcoming holiday season, tourism and air travel are at the top of mind – DAL and UAL are two domestic airlines best positioned on international, premium, and holiday travel. While UAL offers more INTL, DAL leads in premium and reliability, which are essential for vacation trips. \n\nTo get ahead of the holiday season, we aim to gain insight and forecast holiday travel demand and color on air travel going into 2025. With the recent election, recent MAR, ABNB, and EXPE earnings, and shifting macro trends, this post will focus more on forecasting and market dynamics rather than idiosyncrasies within the AI and DAL. We will project air travel demand and other factors affecting air travel and justify a bullish position on DAL going into Investor Day 2024 on 11/20. \n\n \n\nOutline \n\n* US Election Impact on Travel Demand, the Airline Industry (AI) \n* Macro and industry trend implications for DAL \n* MAR, ABNB, EXPE earnings and guidance implications for the AI \n* Analysis of DAL's current positioning, performance, and upcoming catalysts \n* My Positions \n\nUS Election, Trump Trade Impact on Airline Industry (AI) \n\nLargely under the radar, the AI is part of the larger Trump Trade due to the following factors (https://www.wsj.com/livecoverage/fed-meeting-interest-rate-inflation-today-11-07-2024/card/heard-on-the-street-trump-makes-airlines-great-again-but-why--F7MJW5QDNenQ6RoKscio) \n\n* Green light for M&A (Spirit and JetBlue) to transform the AI landscape \n* Deregulation for AI, 2016 precedent \n* Falling energy and oil prices with increased US production, 2016 precedent \n* Ending wars in Ukraine, the Middle East part of 2024 campaign promise \n* Fiscal policy to boost economy and both consumer and corporate spending, driving air travel demand \n* Tariffs and other fiscal policy to strengthen the dollar, boosting INTL travel (https://www.marcus.com/us/en/resources/heard-at-gs/what-a-strong-us-dollar-means-for-travel) \n\n \n\nMacro and Industry Trends Continue to Favor Airlines  - FED, EXPE earnings, ABNB earnings\n\n* Cutting interest rates globally to boost economic activity continuing into the foreseeable future a tailwind for high-leverage industries such as the AI \n* EXPE air revenue up 4% YoY in Q3 compared to 0% in Q2 and 1.7% in Q1, highlighting positive trends \n* EXPE air bookings up 7.8% YoY in Q3, compared to 6.6% in Q2 and 1.4% in Q1 \n* EXPE cited strong air bookings as a main driver for Q3 performance \n* EXPE raises FY24 outlook, citing growth and opportunities abroad despite previous travel demand concerns \n* EXPE total B2C revenue down 1.4% YoY in Q3 more than offset by 18.4% B2B revenue increase YoY \n* Mild B2C Q3 revenue decrease does signal travel softness, but combined with air revenue increase strengthens thesis for increasing shift to longer distance, INTL vacation travel \n* ABNB earnings gives insight into travel demand, global \n* ABNB Q3 revenue up 10% YoY \n* Strong performance in core markets (US, Canada, Australia, UK, France) represents 75% of business \n* Sees strong opportunity in expansion into other global markets, bullish sign for INTL travel \n* ABNB performance less informative than EXPE on the AI \n\n \n\nCurrent DAL Performance, Positioning, and Upcoming Catalysts \n\nDAL and UAL are industry leaders well-positioned for the upcoming holiday travel season. I chose to gain exposure through DAL; here is a quick overview of DAL Q3 performance:\n\n* DAL YTD profitability to represent 50% of the AI total \n* Double-digit ROIC twice industry average (UAL comparison unknown) \n* Strong premium, loyalty, and co-spend program revenue representing over 50% of total revenue \n* Projected 30% earnings growth in Q4 on growing demand trends \n* Transatlantic benefiting from US strength likely to continue, transatlantic and domestic strongest trends \n* Corporate sales up 7%, corroborating EXPE B2B numbers \n* AMEX remuneration up 6%, lowering inflation backdrop \n* CEO to give more color on tightening domestic capacity, moat, strategic plan on Investor Day 11/20 \n* Volume growth following 2019 baseline rather than 2023, late summer peak travel shifting later into the fall due to weather trends \n* Less enthusiastic about promotional and marketing compared to UAL – is this the right move competitively? \n* Main cabin underperformance main driver of capacity cuts, premium/main spread increasing but both categories to enjoy expanding margins \n* Innovative technological solutions to drive value, including drones (govt. approved) for maintenance inspections  \n\nThroughout the Q3 earnings call, management emphasized Investor Day 2024 to analysts – signaling it to be a significant catalyst. Historically, DAL Investor Day has been a strong catalyst, with DAL rallying 5% on Investor Day in 2023. With all the mention of Transatlantic and domestic strength, airlines are already ahead of the curve by betting on NA-EU travel this upcoming holiday season (https://www.wsj.com/business/airlines/airlines-bank-on-americans-steady-love-of-european-travel-f64b51b3). As a tangent: potential upcoming trade opportunity will be comparing actual TSA check-in data during the winter months and trade off the spread between current AI optimism on Q4 travel and modeling what the actual data represents. \n\nMy Positions: \n\n* 45 Jan25 $55 Calls \n* 100 Jan25 $60 Calls \n* 150 Jan 25 $70 Calls \n* Total position: 100k in Jan25 options \n\ntldr; who needs NVDA when you have the secret AI (airline industry) trade, already turned 4 bagger trading airlines but I plan on riding this plane to the moon right behind Elon",
  "link_flair_text": "Discussion",
  "id": "1gm64sx",
  "num_comments": 16,
  "created_utc": 1731026958,
  "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/",
  "comments": [
    {
      "id": "lvzy40r",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 8 months ago\n**Total Comments** | 16 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1fka728/delta_airlines_dal_dd_reaffirmation_of_long/) \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/lvzy40r/",
      "created": 1731026961,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvzyl3r",
      "score": 14,
      "body": "DAL looking solid af rn. [57% of revenue coming from premium cabins and loyalty programs](https://beyondspx.com/article/delta-air-lines-soaring-high-with-operational-excellence-and-financial-resilience) means they're not just another budget airline. Operating margin double the industry average. \n\nStrong play on holiday travel. Premium cabins printing money. International routes crushing it, especially that Paris Olympics boost. Corporate travel up 7%. \n\nThose Jan25 calls gonna print. Delta's operational excellence is unmatched - [60 days with zero cancellations](https://beyondspx.com/article/delta-air-lines-soaring-high-with-operational-excellence-and-financial-resilience) in first 9 months. That's double last year's performance. \n\nInvestor Day gonna be huge. Previous one pumped stock 5%. With their current momentum and market position, this one's gonna slap.\n\nOnly potential turbulence is that main cabin revenue. But premium revenue growth more than makes up for it. Plus those fuel costs dropping like a rock.\n\nPositions or ban tho. Show us those 100k receipts.",
      "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/lvzyl3r/",
      "created": 1731027121,
      "depth": 0,
      "replies": [
        {
          "id": "lvzzdys",
          "score": 4,
          "body": "Check my previous post",
          "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/lvzzdys/",
          "created": 1731027392,
          "depth": 1,
          "replies": [
            {
              "id": "lw007ov",
              "score": 2,
              "body": "mb",
              "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/lw007ov/",
              "created": 1731027672,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lw0h986",
      "score": 9,
      "body": "Sheesh, those premiums are too high for my blood. If you are expecting a 10x then I might buy those positions",
      "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/lw0h986/",
      "created": 1731033423,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw0icvh",
      "score": 6,
      "body": "In for 10 large 60c @jan 2025...technicals look solid...lets roll",
      "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/lw0icvh/",
      "created": 1731033795,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lvzy3oo",
      "score": 3,
      "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
      "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/lvzy3oo/",
      "created": 1731026958,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw13rma",
      "score": 3,
      "body": "Seems to me like it'd be a good idea to pump some into DAL till the end of December if I understood this correctly",
      "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/lw13rma/",
      "created": 1731041718,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw1nicc",
      "score": 2,
      "body": "What are your price projections? Previous DDs you had mentioned your price target was 56 and it’s already broken that. Only negative is that It’s at all time highs . Missed your other two DDs😔 saw this one on my feed and I’m intrigued.",
      "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/lw1nicc/",
      "created": 1731051967,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw2wxq2",
      "score": 2,
      "body": "Investor day on 20th nov right",
      "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/lw2wxq2/",
      "created": 1731075048,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw4bpyp",
      "score": 2,
      "body": "LUV is also breaking out of a 3 year downward wedge, what is everyone’s thoughts?",
      "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/lw4bpyp/",
      "created": 1731090267,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw0t2ng",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/lw0t2ng/",
      "created": 1731037591,
      "depth": 0,
      "replies": [
        {
          "id": "lw0ucnz",
          "score": 1,
          "body": "More details plz",
          "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/lw0ucnz/",
          "created": 1731038061,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lw5tusa",
      "score": 2,
      "body": "Imma fuck with you hard on this. Loaded up 60c for Jan 2025 🤞",
      "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/lw5tusa/",
      "created": 1731106892,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw60dz1",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/lw60dz1/",
      "created": 1731109151,
      "depth": 0,
      "replies": []
    }
  ]
}