{
  "title": "Why do people continue to pay for stock pickers?",
  "score": 179,
  "selftext": "These “research organizations” or individuals that post YouTube videos everyday, doing 100 dollar monthly subscriptions, we all know that if they truly know how stocks will go they would be putting their own money in the market and making much more instead of creating these channels, but isn’t it also obvious to understand for those that pay for their services? Why are people dumb enough to continue to pay?\n\nIs there something that I’m missing?",
  "link_flair_text": null,
  "id": "1gmunkx",
  "num_comments": 138,
  "created_utc": 1731104042,
  "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/",
  "comments": [
    {
      "id": "lw5n1k3",
      "score": 239,
      "body": "Because stock markets are really scary and confusing to most normal people. \n\nThey’re not morons or idiots, they just never learned what to do. They decide to buy some shares because they’ve heard the market is going up, they see all these tickers, and if you pick the wrong one you might literally lose your retirement. \n\nThat’s terrifying, and here’s a company that seems trustworthy or some guy with 5 million followers who say they have all the behind the scenes info to make sure you don’t lose money, and the fees will pay for itself!\n\nLike, the investment world is filled with liars. The banks, arguably the most trustworthy institution they’ve ever dealt with, are lying to them. Cramer is lying to them. The internet is lying to them. Stock pickers feel safe.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5n1k3/",
      "created": 1731104654,
      "depth": 0,
      "replies": [
        {
          "id": "lw5pbcm",
          "score": 46,
          "body": "Exactly this. They prey on the afraid and confused.\n\nMost people do not understand markets and how they move. For a lot of them it's easier to put faith into an outsider who seems professional and looks like they know what they're doing. Makes them feel more confident in their decision of putting their life savings into the markets.",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5pbcm/",
          "created": 1731105390,
          "depth": 1,
          "replies": [
            {
              "id": "lw5s69r",
              "score": 33,
              "body": "Similar to how religion works",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5s69r/",
              "created": 1731106328,
              "depth": 2,
              "replies": [
                {
                  "id": "lw8660t",
                  "score": -19,
                  "body": "pls be respectful",
                  "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw8660t/",
                  "created": 1731145095,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lw5uavt",
          "score": 23,
          "body": "To be fair, the banks and insurance companies are lying to you.\n\nThey charge high premiums, lock your money up for years, penalize you for early withdrawals, take a huge cut of profits but expect you to absorb the losses, and at the end of it all the return rate isnt even as good as half the rate of SP500.\n\nI also don't live in the USA and most people here do not like investments.",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5uavt/",
          "created": 1731107046,
          "depth": 1,
          "replies": [
            {
              "id": "lwbdrpo",
              "score": 2,
              "body": "Yep historical performance indicates your money is much better left in the S&P 500 than a bank if it's for an extended period of time. Still so many people afraid of doing so for whatever reason",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lwbdrpo/",
              "created": 1731189539,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lw6okqb",
          "score": 5,
          "body": "They are convincing and charismatic and make a good case. Who cares about the truth? Belief trumps truth.\n\nEven if I know rationally they they only sell snake oil, the \"but what if they are right and there is a winning strategy and I could get rich easily\" seduces my lizard brain for moments before my senses kick in.\n\nNow check how many people play the lottery.",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw6okqb/",
          "created": 1731117741,
          "depth": 1,
          "replies": [
            {
              "id": "lw7y3qb",
              "score": -4,
              "body": ">Belief trumps truth.\n\nBelieve Trump's truth? Let's keep politics out of this discussion 😉",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw7y3qb/",
              "created": 1731139683,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lw6cnjg",
          "score": 2,
          "body": "This basically, don't forget that most public information that is paid for or has some sort of monetary motivation is at worst lying and at best trying to manipulate you.\nTry to separate facts from the garbage and never look back imo.",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw6cnjg/",
          "created": 1731113459,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lwaammw",
          "score": 2,
          "body": "For people like them I always recommend VOO and forget. \nI prefer the 8:2 ratio of passive ETFs and money market. \n\nBuying one stock when you have no or little idea is not really the best thing one can do.",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lwaammw/",
          "created": 1731176797,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lw7dw3v",
          "score": 3,
          "body": "Signed up for alpha picks a year ago - their return has been like 140% - have made a relative fortune off it.  Pretty happy with that!",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw7dw3v/",
          "created": 1731128132,
          "depth": 1,
          "replies": [
            {
              "id": "lw7elpx",
              "score": 1,
              "body": "That’s pretty great! Glad to hear it’s paying off!",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw7elpx/",
              "created": 1731128469,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lw7w7le",
              "score": 1,
              "body": "What's your strategy when choosing which stocks to invest in from the ones given?",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw7w7le/",
              "created": 1731138464,
              "depth": 2,
              "replies": [
                {
                  "id": "lwavoub",
                  "score": 1,
                  "body": "Invest equally in each new recommendation (twice monthly). To risk overcapitalising on what I consider a very overpriced market atm, I sell when reduced to hold status. This has generally worked well, except missed the cream on the applovin cake.",
                  "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lwavoub/",
                  "created": 1731183603,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lw5wrym",
          "score": 2,
          "body": "100%.\n\nIt's so easy to lose money on the stock market if you dont know what you're doing.",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5wrym/",
          "created": 1731107893,
          "depth": 1,
          "replies": [
            {
              "id": "lw6k9th",
              "score": 2,
              "body": "It really is, I definitely \"got my start\" by putting a few thousand on various flashy tech IPO type stocks, immediately getting rocked, then selling in frustration before sitting it out for 5 years thinking it's all just a stupid coin toss. I think that's a more common experience than a lot of people realize",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw6k9th/",
              "created": 1731116180,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lw8tfxr",
          "score": 1,
          "body": "> Like, the investment world is filled with liars. The banks, arguably the most trustworthy institution they’ve ever dealt with, are lying to them.\n\nAlso my experience (surprisingly). The investment world has far more people lying than I would have imagined, *like far more*. What exactly \"a lie\" is, is vague, which is why it works.\n\nShockingly, the banks have easily been the most honest FIs I've worked with and/or for, largely due to how regulated they are.",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw8tfxr/",
          "created": 1731158436,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lwa3d0g",
          "score": 1,
          "body": "I'd also add that a lot of people want to find that mutli-bagger stock and get rich. They view stocks as a hobby and a way to achieve financial security. It's not like the people all paying for these monthly substacks or Youtuber content are hurting after spending $50-100/month. That could be nothing to them. It could be like paying for a gym membership.",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lwa3d0g/",
          "created": 1731174485,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lw5m16d",
      "score": 49,
      "body": "Fidelity has free stock screener. But most people lack a strategy and just mimic others.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5m16d/",
      "created": 1731104327,
      "depth": 0,
      "replies": [
        {
          "id": "lw7067n",
          "score": 15,
          "body": "Plus they're too lazy to learn the free tools. Fidelity literally hands you a screener but people would rather pay some guy on YouTube to tell them what to YOLO into next 🤷‍♂️",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw7067n/",
          "created": 1731122145,
          "depth": 1,
          "replies": [
            {
              "id": "lw7170v",
              "score": 6,
              "body": "Arguably when they’re wrong they don’t feel bad as they can blame others. Though it’s their fault.\n\nPeople do more research on which $50 coffee maker to buy rather than where they are punting $50k",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw7170v/",
              "created": 1731122558,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lw9p8vd",
          "score": 2,
          "body": "Its great i used it to find dividend stocks for me",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw9p8vd/",
          "created": 1731169961,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lw6mf1v",
          "score": 3,
          "body": "Tried fidelity stock screener and free advisor program.  They pushed me towards some of their worst junk funds. When I first looked at their recommended products looked great, deeper look found they packed some real junk funds and stocks in those pushed products",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw6mf1v/",
          "created": 1731116948,
          "depth": 1,
          "replies": [
            {
              "id": "lw71h2e",
              "score": 3,
              "body": "I prefer to lose my own money as I learn. I like the stock screener but it kind of sucks getting to it, but it works for people who have rules or criteria.",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw71h2e/",
              "created": 1731122672,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lw931gq",
              "score": 1,
              "body": "So exactly like the people on YouTube.",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw931gq/",
              "created": 1731162320,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lwca9vm",
          "score": 1,
          "body": "and what's your strategy?",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lwca9vm/",
          "created": 1731201014,
          "depth": 1,
          "replies": [
            {
              "id": "lwcdf7e",
              "score": 1,
              "body": "I like large and big cap stocks at the moment. I look for reds. The bigger the sell off, the better. Instead of reading why something may move, I read why it dropped. I buy after it stabilizes and hits support or close to. These seems to limit the downside, and the upside is everything back up torwards where it dropped. Ive held these for hours, to days. Hold longer if you want, but I tend to be aggressive. Take your proceeds and use to swing larger positions, or invest in longer plays or dividends. Rinse and repeat. \n\nPrime example is LLY dropped and I swung it on the rebound when it moved up to 36 gain in a day. It sold back off, and then Friday ripped 40 something in a day. I've been swinging NVDA, ASML, LLY. Debated AMD but choked. I'm familiar with a range of prices and buy when they're lower, let go when they are higher. Cycles are great. Don't get attached. Don't force a trade. Just sit and wait for the opportunity.",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lwcdf7e/",
              "created": 1731202166,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lw5rabs",
      "score": 26,
      "body": "Imagine you actually have the secret to stock picking. You always pick stocks which go up a ton.  \nObviously, you will put as much money in those stocks as possible, probably using margin to increase your returns.  \nBut once you've done that, you may as well also sell those stock picks to other people. Why make money when you could make more money? Plus, you could use the money from the subscriptions to buy more of the stock, and as collateral to get access to more margin.  \n\nSo, therefore, there probably are a few good stock pickers who are running these services. And I would go as far as to say, most people who run these services genuinely believe in the product they are selling. Their strategy works for a few weeks, maybe even a few months, so their followers start trusting their stock picks.  \n\nThe problem, of course, is that different strategies work in different markets. These influencers may think that they're geniuses for buying into speculative bubbles, but when there's a downturn, they will realise that their strategy is not great.  \n\nAnd obviously, the question remains: if you're so good at stock picking, why not just run an ETF or mutual fund and charge a percentage fee? Wouldn't that make you more money?  \nThe problem is, doing so without certain permits would be illegal, and getting those permits is very expensive.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5rabs/",
      "created": 1731106036,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5of03",
      "score": 17,
      "body": "It’s the same basis why many people hire personal trainers at gyms. A lot of them have never really work out or don’t have more than basic understanding of fitness. \n\nSo apply that same for stock pickers.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5of03/",
      "created": 1731105099,
      "depth": 0,
      "replies": [
        {
          "id": "lw9bz19",
          "score": 3,
          "body": "Eeh. There are many average personal trainers but it's a genuine profession full of knowledge, that even professional athletes used. It certainly isn't just for 'noobs'.",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw9bz19/",
          "created": 1731165552,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lw5m9hs",
      "score": 8,
      "body": "Because of entertainment value. Astrology is bunked but people are still into it ",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5m9hs/",
      "created": 1731104403,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5loka",
      "score": 48,
      "body": "why are there Nigerian prince scams? because people are stupid",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5loka/",
      "created": 1731104214,
      "depth": 0,
      "replies": [
        {
          "id": "lw5scks",
          "score": 20,
          "body": "yall just arent following the right stock pickers\n\nluckily for you i just created a stock picker picker that you can access for a low one time fee which you will easily recoup once you subscribe to the algorithmically chosen stock pickers",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5scks/",
          "created": 1731106386,
          "depth": 1,
          "replies": [
            {
              "id": "lw5ztsx",
              "score": 7,
              "body": "Ok, ok, but who chooses your algorithms?",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5ztsx/",
              "created": 1731108954,
              "depth": 2,
              "replies": [
                {
                  "id": "lw638gx",
                  "score": 8,
                  "body": "Alfred George Rithm",
                  "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw638gx/",
                  "created": 1731110152,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lw69q4r",
                  "score": 4,
                  "body": "Zoltar",
                  "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw69q4r/",
                  "created": 1731112425,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lw7bz2t",
                  "score": 1,
                  "body": "The one guy that tried to sell Obi Wan some *Death Stix*.",
                  "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw7bz2t/",
                  "created": 1731127237,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lw88om4",
              "score": 3,
              "body": "Just diversify your stock pickers pickers to minimize the risks!",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw88om4/",
              "created": 1731146787,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lw5twmw",
              "score": 2,
              "body": "😂",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5twmw/",
              "created": 1731106909,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lw5pyj2",
      "score": 8,
      "body": "I thought about writing up a stock here one time and then I thought: why would I want to? It’s not really going to benefit me and most people will be too critical anyway. Best shut up and make my money. Now if they were paying me hundreds a month on the other hand…",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5pyj2/",
      "created": 1731105601,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw7k6wg",
      "score": 7,
      "body": "I paid for a year subscription and did the whole premium package and everything (Motley Fool). I think all in all it cost me like $2k? Super worth it, and cancelled it after a year. I’m not even being sarcastic either.\n\nI did it as a way to help me learn and financially commit myself to investing. I’m also super happy with The Fool because it talks a lot about temperament, long term investing, and not paying attention to the day to day. After a year of reading it, listening to the podcast, and hearing other approaches, I felt comfortable to go out on my own with my own style.\n\nPaying $2k for education that you’re willing to grow and apply is the best ROI you can have, but you have to learn and not blindly follow.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw7k6wg/",
      "created": 1731131290,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5n05r",
      "score": 20,
      "body": "Just like not everything is good advice, not everything is a scam. Some people just trying to make money. Some want to actually try to give good info. No two channels are the same",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5n05r/",
      "created": 1731104641,
      "depth": 0,
      "replies": [
        {
          "id": "lw9lbte",
          "score": 1,
          "body": "And as a viewer, you're not forced to invest in all the stocks they tell you about, or any at all. It's very useful to have an easy intro to a bunch of companies from which you pick a few to follow up with your own analysts.\n\nReally don't know why you'd be mad about it, most YouTube channels are very upfront that they're giving you information and it's your responsibility to make decisions.",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw9lbte/",
          "created": 1731168684,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lw5pjg2",
      "score": 14,
      "body": "$100 is nothing to a lot of people\n\nsome people pay $100 for 30 min of tennis lessons",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5pjg2/",
      "created": 1731105463,
      "depth": 0,
      "replies": [
        {
          "id": "lw60iko",
          "score": 13,
          "body": "Or $500 for 30 seconds of bliss",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw60iko/",
          "created": 1731109195,
          "depth": 1,
          "replies": [
            {
              "id": "lw63e3z",
              "score": 2,
              "body": "😂",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw63e3z/",
              "created": 1731110207,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lw5q242",
      "score": 12,
      "body": "Not everyone has time and energy to learn. There is a reason you hire electrician or plumber. Or are we stupid to hire them.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5q242/",
      "created": 1731105634,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5zqrb",
      "score": 5,
      "body": "Some people are very good at researching and go well beyond what research one could do while managing a full time job, a family, etc…\n\nThey are definitely putting their own money into their strategy but they don’t have yet $2M to live from their investment only.\n\nResearching companies is their job. And people seeing value from these research pay them.\n\nI don’t pay personally for any of these but here is an example of an extensive research on a stock:\nhttps://www.bestanchorstocks.com/p/deere-cultivating-technology\n\nAt some point I’ll have $1.5M+ invested and it may be very well worth it to spend $500 to have access to very well done research and help with investment decisions…",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5zqrb/",
      "created": 1731108924,
      "depth": 0,
      "replies": [
        {
          "id": "lw6ld14",
          "score": 1,
          "body": "Yeah going up 20% a year doesn't mean much if your starting capital is 10 grand, particularly early on",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw6ld14/",
          "created": 1731116573,
          "depth": 1,
          "replies": [
            {
              "id": "lw7z9fg",
              "score": 2,
              "body": "What?\n\nIf I ever find a company that can guarantee 20% gains per year - I will gladly invest in their products/services. \n\nAnd starting with $10,000 is fine if you have a long time horizon. \n\n(If you are 58 and starting with $10k you probably want to delay retirement.)",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw7z9fg/",
              "created": 1731140445,
              "depth": 2,
              "replies": [
                {
                  "id": "lw8105h",
                  "score": 1,
                  "body": "Were you paying attention to the conversation at all? This is about making an income as a full time investor",
                  "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw8105h/",
                  "created": 1731141607,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lw60lus",
      "score": 5,
      "body": "I let my inner spirit guide me and hope that it knows what it’s doing.\n\nSpoiler: most of the time it doesn’t.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw60lus/",
      "created": 1731109226,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5lon2",
      "score": 13,
      "body": "Because people are morons",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5lon2/",
      "created": 1731104215,
      "depth": 0,
      "replies": [
        {
          "id": "lw77kea",
          "score": 1,
          "body": "This is my answer to almost everything now days",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw77kea/",
          "created": 1731125253,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lw6bpg7",
      "score": 4,
      "body": "I use Motley Fool, which everyone hates, but it's paid for itself many times over.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw6bpg7/",
      "created": 1731113127,
      "depth": 0,
      "replies": [
        {
          "id": "lw9idvw",
          "score": 3,
          "body": "Yep, on a long time horizon their main picks do outperform the market.",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw9idvw/",
          "created": 1731167712,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lw6e0it",
      "score": 3,
      "body": "Why do people pay for onlyfans when you can get porn for free?\n\nWho knows and who cares, if they want to spend their money that way, who are we to judge?",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw6e0it/",
      "created": 1731113938,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw73gc3",
      "score": 4,
      "body": "Lol, most people out here have only been investing during a bull market. Everything you invest in turns to gold. \n\nI’ll agree there’s a lot of shit advice you can pay for. But if you are “into research” and if you properly research these stock-picking services, then you’ll find there are some really good ones out there. You just have to find them. \n\nWhen the day comes that the market begins to “bear out”, some better researched advice than Reddit and headlines will help your portfolio. \n\nAdd to this, all of the reading will help you while you’re screening. Theres more to screening than using a screener-only.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw73gc3/",
      "created": 1731123485,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5sd4x",
      "score": 3,
      "body": "I do not have the time to chart and screen for ideas so I’d pay for someone to do that for me if it leads to success. I mean I’ve paid for the wsj and baarons",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5sd4x/",
      "created": 1731106392,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5w84s",
      "score": 3,
      "body": "What would one of these guys need to do to convince you that they are worth listening to? Do they need to have a degree, put their own money in, have a track record, the right work experience?",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5w84s/",
      "created": 1731107705,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw60f0d",
      "score": 3,
      "body": "Because it's easier. Someone is holding your hand and guiding you.\n\nI tried (trial subscription) one of these places - high profile, run by regular CNBC contributors. They were really good in some occasions and screwed up on others - just like most. I didn't buy the subscription. However, if the investor is clueless, it's definitely better than being on his/her own.\n\nIn any case, there are bunch of people on Fintwit that I follow. Sometimes they recommend set ups I miss, and  have made nice profits from some of those though I will never pay for their subscriptions.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw60f0d/",
      "created": 1731109161,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw64nqe",
      "score": 3,
      "body": "Because the stock market is scary to them. Same with people using a higher fee advisor. Ive been trying to get my sister and her husband to switch from a higher fee advisor to vanguard or fidelity but they are timid and would rather have someone else handle it. Lots of people like that",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw64nqe/",
      "created": 1731110651,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw69tet",
      "score": 3,
      "body": "Research takes A LOT OF TIME. Most regular people don’t have hours a day to do it but want to be involved in stocks out of the normal TSLA/AAPL/NVDA etc.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw69tet/",
      "created": 1731112458,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw6prh0",
      "score": 3,
      "body": "I think you might misunderstand stock picks. I get morningstar and argus reports for free and I do like to puruse them sometimes. \n\nI don’t think that they have a magical secret (nor do they claim to have one), it’s just a quick way of finding solid stocks and seeing what opinions are floating around on them.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw6prh0/",
      "created": 1731118186,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw61lpm",
      "score": 5,
      "body": "What makes you think people selling services aren’t also putting their money in?\n\nI pay for a trading community with live trading (the most valuable part imo) and the guy who runs it literally made $400k last week on Nasdaq futes and made $1.4mill on TSLA earnings. He sure as fuck doesn’t need to sell a service, but he does. \n\nThat tired old “if they could make money in the stock market they wouldn’t be selling you anything” mentality is something stupid fucking people say because they either don’t have the money to try out a course/mentorship, got scammed by a furu in the past, or are too damn cheap to risk real capital for a real return.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw61lpm/",
      "created": 1731109577,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5ozpb",
      "score": 2,
      "body": "I follow someone on YouTube who has a paid subscription news letter with a portfolio he shares with anything he buys and sells, so he at least has skin in the game but I don’t subscribe to it so honestly not sure",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5ozpb/",
      "created": 1731105284,
      "depth": 0,
      "replies": [
        {
          "id": "lw5y6xz",
          "score": 1,
          "body": "What YouTuber?",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5y6xz/",
          "created": 1731108383,
          "depth": 1,
          "replies": [
            {
              "id": "lw62b6f",
              "score": 2,
              "body": "Finding value finance. He pretty much does technical analysis on his channel and is big on commodities and value investing. TA is pretty much equivalent to astrology imo but it’s cool to see and get some perspective. I started listening to him pre newsletter and have a pie on M1 of nat gas and oil companies he recommended one day and I just threw 200bucks at it and never touched it, I’m up like 50% over 3 years in that so not anything great, but I’ll take it but that’s the only things I have tracked of his personally. But he does like 2 videos a day like clock work. But by no means would I say he is the end all be all but rather just like listening to different perspectives.",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw62b6f/",
              "created": 1731109827,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lw5qvxp",
      "score": 2,
      "body": "There is one certain thing about gimmicks and scams that stick around. They are very specifically tailored to work on people that won’t be in a position to realize it until too late, if at all. The best scheme is one that the victim is happy to have found. Just feel lucky you don’t like that flavor of koolaid. I am sure there is something else working on you. I can’t say no to collecting an excess of certain mostly useless things because there is a realistic chance i will lose that ability within my life.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5qvxp/",
      "created": 1731105905,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5tcri",
      "score": 2,
      "body": "Grifters are a dime a dozen these days. There’s no shortage of grift on the internet because the entry cost is nearly zero. \n\nInstagram and Youtube are chock full of grifters.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5tcri/",
      "created": 1731106726,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw635l5",
      "score": 2,
      "body": "Experience in the market is expensive. \n\nYou can have a really solid understanding of things like P/e and how interest rates are going to impact the market but have very little understanding on how to execute those ideas.\n\nDo you know how to kick a ball? Run? Now play soccer.\n\nLearning a bit from someone with context can expedite the process and lower the cost for entry.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw635l5/",
      "created": 1731110124,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw63bvm",
      "score": 2,
      "body": "Same reason why poor people voted for the rich to get richer",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw63bvm/",
      "created": 1731110185,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw646gb",
      "score": 2,
      "body": "You asked about stock research organizations and YouTubers.   This answer does not address the subject of YouTubers.  Investment bank research organizations follow stocks diligently until they cease coverage. They'll drop a stock if institutional investors aren't interested. They'll drop a stock if they need to cover a different stock for which there is more interest and they don't have the resources to cover both. Since they tend to cover a stock with a fairly consistent level of attention, quarter after quarter, sometimes for years, they know a lot about the company and the industry and how they're evolving and what happened in the past.  They've asked questions of management and often some of those questions were asked in person.  Even if material non-public information is not disclosed in those private conversations, the opportunity to ask and get answers can be useful.  Institutional investors don't necessarily do that and they don't necessarily have the time to do that kind of research from scratch.  Even if an institutional investor wants to do a \"deep dive\" on a stock, there's no substitute for just asking specific questions of somebody who has covered the stock for years.  That's not to say that the answers they provide are going to help the investor beat the market, but at least it saves time digging for answers, and they'll also let you know which stocks they like and send reports.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw646gb/",
      "created": 1731110482,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw69jq0",
      "score": 2,
      "body": "Some are quacks but there can be value for a lot of people. It’s the same reason people pay a personal trainer, a nutritionist, or a party planner. You pay for the peace of mind that the simple task is being executed right.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw69jq0/",
      "created": 1731112363,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw6orzr",
      "score": 2,
      "body": "Cause ive proven time and again that i suck. Like my shorting of TSLA right at the opening bell today.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw6orzr/",
      "created": 1731117816,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw6z6qn",
      "score": 2,
      "body": "I pay $10/mo for access to an app that has gotten me on some tickers I'd never heard of, and it's turbo charged my gains. This guy put together an algo to help him find stocks and decided to share with the public. He also sells a much higher priced service where you get live access to his trades but I've done well enough with his app that I don't need it.\n\nI have no doubt most services are scams or at worst not particularly good, but there are good ones, and they're worth the money.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw6z6qn/",
      "created": 1731121757,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw70986",
      "score": 2,
      "body": "I see this silly argument over and over. That if someone knew what they were doing why would they sell a service.   And its for any number of reasons.  If you have the personality, and the skill. Why wouldn't you sell a service. Unless you are just an anti social misfit. Its a whole lot easier bringing in subscribers money every month . Than it is to rely on trading for money. That's before you even get into the economic benefits of being a business . Bringing in business income.  VS just straight capitol gains sucking down 40% of everything",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw70986/",
      "created": 1731122179,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw7b94c",
      "score": 2,
      "body": "This is such a silly assertion. I personally belong to one day trading group that now has a crazy accurate swing algorithm. Last 10 signals it alerted the last 2 months have all been profitable. The guy runs polls all the time in public and almost everyone is making money. People pay for services they want to try out and stay loyal to those that are profitable.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw7b94c/",
      "created": 1731126903,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw7oire",
      "score": 2,
      "body": "becoming a CFA charter holder is one of the most rigorous post secondary education programs and is typically required to be a mutual fund manager. \n\ninvestment advisors take years of training and courses to learn to develop investment strategies and to practice fiduciary care. \n\nso i takes years of professional education for the average person to learn about how markets work impact of inflation interest policy economics and on and on. \n\nit is very difficult to “day-trade” profitably and warren buffet even recently said to just buy s&p etfs.\n\nso people no matter what age they are at find out it’s very costly to try and trade and based on the pessimism of the IA industry figure for $100 a month maybe they can get the “tips” they need to beat the market \n\n$.02",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw7oire/",
      "created": 1731133731,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw7vuo8",
      "score": 2,
      "body": "I am a member of a group. I joined a few months ago and it is awesome. \n\nI won't say the group. Whatever.....reasons.\n\nEvery 2-3 weeks they post about 3-4 maybe 5 stocks - ready to make big gains.\n\nI buy $1000-$1100 of each stock. Almost every time.\n\nAnd I cash out after 8-10 days after they post the stock.\n\nMy last ten cash outs have been averaging 6-8% gains in a couple weeks. Not a single stock pick they recommended has been a big loser. 1 lost money and 2 have averaged flat or 1-2% gains - Many have made 8-10% gains in 9 or 10 days. \n\nIt's not going to make me rich. But my accounts have flourished since I joined. It's helpful we are in a bull run. Everything is going up. But these have gone up faster. \n\n(I still have 85% of my money in VOO and VTI and QQQ - but the extra 15% keeps getting bigger - best investment I ever made - was joining that group) \n\nI may decrease my 85% to 80% soon and put more in their stock picks....they are very close to convincing me. If that works - I might go slightly more. Not sure yet",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw7vuo8/",
      "created": 1731138233,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5ofzd",
      "score": 2,
      "body": "I think we significantly underestimate the number of dull people in the world as well as the degree of their dullness. Consider for a moment that 1 in 4 people have an IQ less than 90. Let that sink in.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5ofzd/",
      "created": 1731105108,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5zz9r",
      "score": 2,
      "body": "If you have a large following,  you can pick  almost any stock,  you'll create an uptick \n\nExample: $DJT  , purely based on blind  faith and speculation.  \n\nAlso: \n\nhttps://www.investopedia.com/articles/trading/10/beat-the-market.asp",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5zz9r/",
      "created": 1731109007,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5nmlb",
      "score": 2,
      "body": "Why do you people take investing advice from Reddit or pay stock pickers? Because people are generally speaking stupid.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5nmlb/",
      "created": 1731104844,
      "depth": 0,
      "replies": [
        {
          "id": "lw5oxkq",
          "score": 5,
          "body": "Why people even come to Reddit stock subreddit? Are they stupid?",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5oxkq/",
          "created": 1731105265,
          "depth": 1,
          "replies": [
            {
              "id": "lw69ejl",
              "score": 2,
              "body": "I think information is the game. Separating the good from the not so good, or just plain bad is why anyone seeks other opinions and insights. When you match what you ‘learn’ with what you may have garnered from researching Company information, history and performance, you can reach an informed decision. Just remember, Past Performance does not guarantee future performance! There are so many variables and in the end, it’s the Big Boys (Hedge funds and such) who drive the Market.",
              "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw69ejl/",
              "created": 1731112313,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lw5w0ru",
          "score": 4,
          "body": "Sometimes people just like to talk things through. Even reddit helps. Just remember it's reddit.",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5w0ru/",
          "created": 1731107635,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lw5vp9r",
          "score": 2,
          "body": "I’ve found some gems. The trick is being able to figure out which of the thousands of recommendations is worth paying attention to.",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5vp9r/",
          "created": 1731107526,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lw5vrvf",
          "score": 2,
          "body": "Reddit probably gives better advice than stock pickers.  I definitely had a few winners just by taking a look at r/stocks suggestions.",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5vrvf/",
          "created": 1731107550,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lw5q1ji",
      "score": 1,
      "body": "same reason jim cramer still has a job\n\npeople think theirs someone who knows better than everyone else",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5q1ji/",
      "created": 1731105628,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5sbkg",
      "score": 1,
      "body": "It's the 30%/week they promise",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5sbkg/",
      "created": 1731106377,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5tdx3",
      "score": 1,
      "body": "the shills and the shysters have always had skin in the market. its a gnarly cut throat place and u can lose ur money and ur ass if ur stupid.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5tdx3/",
      "created": 1731106736,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5y34b",
      "score": 1,
      "body": "they are not people; it's bottom feeding. It's the same bunch of idiots who 'pay to win' games on the mobile phone to 'feel superior'. \n\nIf you pay for something it's more real. Real financial literacy should be free.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5y34b/",
      "created": 1731108345,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw61s59",
      "score": 1,
      "body": "What a scam. I’ll only charge you 50",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw61s59/",
      "created": 1731109641,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw63oqz",
      "score": 1,
      "body": "Give a person a fish or teach them a fish ?",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw63oqz/",
      "created": 1731110309,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw64tkt",
      "score": 1,
      "body": "Many people cannot figure this stuff out, and it takes years to get there even if you have the drive.  \n\nSome of those paid services definitely turn profits that the subscribers would never make otherwise.\n\nThe good ones actually just keep you well informed at all times.\n\nThe bad ones tell you what to buy and when.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw64tkt/",
      "created": 1731110708,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw6591g",
      "score": 1,
      "body": "The good news is that because you are able to identify that people do stupid things, you are likely smarter than they are. The bad news is you'll have to live amongst these morons and you'll be forever unable to educate them as to how stupid they are behaving. Such is the curse of intelligence.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw6591g/",
      "created": 1731110859,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw65ajp",
      "score": 1,
      "body": "Why do people read horoscopes?\n\nIt allows people to have some confidence in something they don’t understand and believe is magic 🪄.\n\nHaving someone speak assuredly and with technical terms instills confidence to make a decision and not be in decision paralysis.\n\n(It helps that they are professional registered and certified to give advice, giving the confidence of feeling of not being scammed; vs. say, getting advice on wallstreetbets, or your mate Dave from the pub. Though people paying unlicensed YouTubers are just ‘marks’ at that point and are a modern reimagining of cold callers selling pink slips).\n\nThere’s also going to be some technical management (tax harvesting, managing certain tax lots etc) if they go for a full management service too.\n\nThey likely overstate their impact on people’s returns, as they’re essentially a sales person also.\n\nIt’s perhaps parallel to leaving how to do mays car maintenance or posting a mechanic to change an oil filter for you. Some don’t want to dive deeper, even if it’s within their capability And would definitely financially benefit them.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw65ajp/",
      "created": 1731110874,
      "depth": 0,
      "replies": [
        {
          "id": "lw80444",
          "score": 1,
          "body": ">your mate Dave from the pub\n\nI was at the bar with this guy about two years ago. He was going on and on about his job at Wayfair - said the stock has lost a lot of value since COVID and their stock was way undervalued. - he said he expected that the upcoming 'wayday' would put them way above numbers and their earnings per share would crush it. I laughed it off...bought him a beer and kept drinking. But the next week I bought $2000 in Wayfair stock and sold for $2900 less than six weeks later ......dude was drunk but he knew his company. \n\nSometimes your buddy Dave from the pub gets it right \n\n(Side note - me and my wife took him and his wife out for steaks and wine. And it was good.)",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw80444/",
          "created": 1731141009,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lw66am5",
      "score": 1,
      "body": "some of those dudes aren't bad, and if you can make extra money by sending alerts or signals why not? \n\nstarting at a fucking screen can be incredibly boring, for some people i can see talking and streaming with other people to help break up the monotony while they do it and they make a few extra bucks",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw66am5/",
      "created": 1731111226,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw677tf",
      "score": 1,
      "body": "You are missing attempted minor price manipulation like pump and dump. With a large enough audience and a few lucky hits they can sell a some times sell a self fulfilling prophecy.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw677tf/",
      "created": 1731111549,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw6i1or",
      "score": 1,
      "body": "Because index investing is boring and people want to get rich quick and have a little stock gamble 10x brag story, but not smart enough to do their own research so will pay for someone else's 'research'",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw6i1or/",
      "created": 1731115381,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw6t25d",
      "score": 1,
      "body": "They pray on the fear of people who do not knwo much about the market.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw6t25d/",
      "created": 1731119426,
      "depth": 0,
      "replies": [
        {
          "id": "lw80dl0",
          "score": 2,
          "body": ">They pray on the fear of people who do not knwo much about\n\nSpelling",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw80dl0/",
          "created": 1731141185,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lw6uapj",
      "score": 1,
      "body": "I was following a lot of these guys because I hoped it would help me succeed in a trial by fire period when I started. It's a way for people starting out to feel like they can beat the learning curve that people have to go through.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw6uapj/",
      "created": 1731119900,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw72vli",
      "score": 1,
      "body": "Most services offer screeners for free. Look at ToS, Finviz, TradingView, takeprofit.com - everywhere the basic screener is free and solves most tasks. Where real-time updates are required, everything that creates additional load is naturally paid features, and people are willing to pay for them",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw72vli/",
      "created": 1731123245,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw7570g",
      "score": 1,
      "body": "There's a stock picker already,  it's called SPYG and VONG and it costs only 0.03% off your gains .",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw7570g/",
      "created": 1731124222,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw7gah4",
      "score": 1,
      "body": "Picks and axes...",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw7gah4/",
      "created": 1731129283,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw7gjcr",
      "score": 1,
      "body": "it's to get alternative opinions and to reinforce their own opinions. getting 2nd or 3rd opinions are worthwhile to some extend.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw7gjcr/",
      "created": 1731129403,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw839qm",
      "score": 1,
      "body": "yup, index funds FTW",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw839qm/",
      "created": 1731143136,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw87vww",
      "score": 1,
      "body": "No time to research? Guessing would be similar to playing lottery…\n\nA lot of services people pay for brocade they don’t have the time or interest in doing it.\n\nThere is a service to cancel subscription plans.\nThere is a service to delete your email.\nThere is a service to walk your dog.\nThere is  service to pick your carry out.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw87vww/",
      "created": 1731146252,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw8ijwf",
      "score": 1,
      "body": "if you have a few hundred millions or a few billions dollar of a stock and someone is pumping the stock for you, will you give the person a bunch of money? makes me wonder.\n\n\nI wonder how much those stock promoter makes.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw8ijwf/",
      "created": 1731153093,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw8twkv",
      "score": 1,
      "body": "I want to add, I generally think people prefer using third parties because if the investments go upside down they can blame the third party.\n\nIf we make money, I'm a genius for hiring this investment firm. If we lose money, how could this invement firm have misled us?",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw8twkv/",
      "created": 1731158634,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw94yus",
      "score": 1,
      "body": "Many people don’t have the time to research all the different stocks out there, or the knowledge to know what to look for. Pay someone a few dollars a month like seeking alpha and they make it easier to understand. \n\nThey don’t teach anything about stocks and stock fundamentals in school…",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw94yus/",
      "created": 1731163049,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw9sah1",
      "score": 1,
      "body": "> we all know that if they truly know how stocks will go they would be putting their own money in the market and making much more instead of creating these channels\n\nI mean there is no reason they can't be doing that TOO, in addition to selling subscriptions.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw9sah1/",
      "created": 1731170938,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw9sc9u",
      "score": 1,
      "body": "There are only two I would consider. Louis Navellier and Keith Fitz Gearld. Made money with both and they have never missed for me. Still with Keith. Have met both. Met Louis at the money show during lunch in Orlando about 4 years ago. He was with Steve Forbes. Keith was standing in the back of the room during a presentation his son was doing. Talked with him for about 20 minutes. Great guy. I have done three option trades in the past few weeks that Keith recommended. Hit all three and this info was free.  One was a VIX trade. He has a daily email. He also turned me onto PLTR back in the spring. Take a look at it. Still own it and do CC with it. He also has a paid service called One Bar Ahead and he is featured now then on Fox Buiness.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw9sc9u/",
      "created": 1731170954,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw9y2m2",
      "score": 1,
      "body": "Value Line\n\nMorning Star\n\nJim Cramer",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw9y2m2/",
      "created": 1731172794,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw9ywrs",
      "score": 1,
      "body": "ACHR and SMCI. We bought ACHR October 18, 2024 at the average price of $3.14. We are buying SMCI next week.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw9ywrs/",
      "created": 1731173064,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwa32e4",
      "score": 1,
      "body": "Some people are legit and are putting in their own money. They also have good write ups/videos. Some people are just pushing penny stocks and pump & dumps. I think there's a lot of garbage that came out of FinTwit, but there are some good people. \n\nIt's not that people are dumb or lazy. It's that people want an edge. They want to find the multi-bagger stock. There's a lot of pressure to save, invest, and retire by a certain age. There's a lot of pressure to buy a house and all the things you want in life. \n\nIn a country like the US, it's not like there's a guarantee of a pension or that SSA is going to get your through retirement. There's not enough housing to drive down costs so that home buying is relatively painless. This is on top of the consumerism and other pressures people face economically. So there is a drive to maximize potential wealth in the market. The stock market has been presented to people as a way for lasting wealth throughout their life. So why wouldn't people pay $50 or $100 to get advice? Those people have cash to burn on some hobby and stocks are that hobby for people.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lwa32e4/",
      "created": 1731174392,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwabi6m",
      "score": 1,
      "body": "More people buying means more exit liquidity for the people giving the stock pick. Many of those people will make gains as well, but I'm willing to bet a good portion are explicit exit liquidity for the entity sending the picks",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lwabi6m/",
      "created": 1731177074,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwaplse",
      "score": 1,
      "body": "I think Forbes is a good one to pay for info on stock picks. They have skin in the game and are very transparent with results. They email buy stocks and sell from their master portfolio.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lwaplse/",
      "created": 1731181595,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw62oy2",
      "score": 1,
      "body": "First off if you're paying $100 a month you're crazy. Motley Fool is only $100 A Year. I don't pay for pickers I just wait for WSBs or STOCKs to post them for free for a few karma points. But then I'll typically still pick my own.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw62oy2/",
      "created": 1731109963,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw67x4l",
      "score": 0,
      "body": "You hope the guy has inside info. But reality is his own portfolio is in the red",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw67x4l/",
      "created": 1731111796,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw6ef6m",
      "score": 0,
      "body": "Some people (MAGA) just love to give their money away!",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw6ef6m/",
      "created": 1731114081,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw713qw",
      "score": 0,
      "body": "Who pays for that when you got people like Cathie Wood and Kramer to reverse their bets?",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw713qw/",
      "created": 1731122521,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw76963",
      "score": 0,
      "body": "Remember Buffets charity bet with hedgefunds?\nJust own a low cost SP500 Index fund such as VOO and use your Vegas money on individual stocks.",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw76963/",
      "created": 1731124676,
      "depth": 0,
      "replies": [
        {
          "id": "lw810zu",
          "score": 1,
          "body": "That's me - 85% VOO VTI and QQQ - 15% on the gamble up - (it's working!)",
          "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw810zu/",
          "created": 1731141623,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lw5p9mw",
      "score": -3,
      "body": "Lack of any common logic, “Those who can, do; those who can't, teach.” \n\nThese lemmings that are so blinded by lies, they don't even see the cliff they're about to plummet over. ![gif](emote|free_emotes_pack|joy)",
      "permalink": "/r/stocks/comments/1gmunkx/why_do_people_continue_to_pay_for_stock_pickers/lw5p9mw/",
      "created": 1731105375,
      "depth": 0,
      "replies": []
    }
  ]
}