{
  "title": "IonQ Announces Third Quarter 2024 Financial Results",
  "score": 33,
  "selftext": "IonQ (NYSE: IONQ) has posted robust financial and operational growth in Q3 2024, with revenue hitting $12.4 million, marking a 102% year-over-year increase. They raised their full-year revenue guidance to $38.5-$42.5 million, reflecting strong market momentum in quantum computing. The quarter was highlighted by substantial new bookings, totaling $63.5 million, including a landmark $54.5 million contract with the United States Air Force Research Lab, positioning IonQ as a leader in advancing quantum networking for governmental applications.\n\nStrategic initiatives include a definitive agreement to acquire Qubitekk, furthering IonQ's reach in quantum networking with an enhanced patent portfolio and customer base. Additionally, IonQ has announced high-impact partnerships with AstraZeneca and Ansys, marking significant strides in quantum applications for drug discovery and engineering. The company also strengthened its collaboration with the University of Maryland through a $9 million investment to expand quantum computing access.\n\nThese advancements underscore IonQ's commitment to scaling quantum solutions and leveraging strategic partnerships to drive innovation across industries. With growing commercial traction and government support, IonQ is well-positioned to lead in the evolving landscape of quantum technology.\n\nSource: \nhttps://ionq.com/news/ionq-announces-third-quarter-2024-financial-results\n",
  "link_flair_text": null,
  "id": "1gn68wg",
  "num_comments": 4,
  "created_utc": 1731143528,
  "permalink": "/r/stocks/comments/1gn68wg/ionq_announces_third_quarter_2024_financial/",
  "comments": [
    {
      "id": "lw9ylm2",
      "score": 4,
      "body": "IonQ is a wagon, made me some nice profits so far.  And if the USA invests in QC means only goes higher!",
      "permalink": "/r/stocks/comments/1gn68wg/ionq_announces_third_quarter_2024_financial/lw9ylm2/",
      "created": 1731172964,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwanmxu",
      "score": 1,
      "body": "That was sooo last week. We already ate.",
      "permalink": "/r/stocks/comments/1gn68wg/ionq_announces_third_quarter_2024_financial/lwanmxu/",
      "created": 1731180965,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwc4bp2",
      "score": 3,
      "body": "Man I went heavy into QBTS about a year ago. I was undecided between IonQ and QBTS, but ultimately went with QBTS. After a year of doing due diligence on the QC sector, speaking with some quantum mechanics students, digging through literature. . .  I have to say that I think its more like Cold Fusion than \"the next big thing\". Just around a corner that never seems to come. Good luck to those that bought in, and say a prayer for me over at QBTS!",
      "permalink": "/r/stocks/comments/1gn68wg/ionq_announces_third_quarter_2024_financial/lwc4bp2/",
      "created": 1731198860,
      "depth": 0,
      "replies": []
    }
  ]
}