{
  "title": "Reuters Exclusive: US ordered TSMC to halt shipments to China of chips used in AI applications",
  "score": 132,
  "selftext": "https://www.reuters.com/technology/us-ordered-tsmc-halt-shipments-china-chips-used-ai-applications-source-says-2024-11-10/\n\nNEW YORK/SINGAPORE, Nov 9 (Reuters) - The U.S. ordered Taiwan Semiconductor Manufacturing Co (2330.TW), to halt shipments of advanced chips to Chinese customers that are often used in artificial intelligence applications starting Monday, according to a person familiar with the matter.\n\nThe Department of Commerce sent a letter to TSMC imposing export restrictions on certain sophisticated chips, of 7 nanometer or more advanced designs, destined for China that power AI accelerator and graphics processing units (GPU), the person said.\n\nThe U.S. order, which is being reported for the first time, comes just weeks after TSMC notified the Commerce Department that one of its chips had been found in a Huawei AI processor, as Reuters reported last month. Tech research firm Tech Insights had taken apart the product, revealing the TSMC chip and apparent violation of export controls.\n\nHuawei, at the center of the U.S. action, is on a restricted trade list, which requires suppliers to obtain licenses to ship any goods or technology to the company. Any license that could aid Huawei's AI efforts would likely be denied.\n\nTSMC suspended shipments to China-based chip designer Sophgo after its chip matched the one found on the Huawei AI processor, sources told Reuters last month.\n\nReuters could not determine how the chip ended up on Huawei's Ascend 910B, released in 2022, viewed as the most advanced AI chip available from a Chinese company.\n\nThe latest clampdown hits many more companies and will allow the U.S. to assess whether other companies are diverting chips to Huawei for its AI processor.\n\nAs a result of the letter, TSMC notified affected clients that it was suspending shipments of chips starting Monday, the person said.\nThe Commerce Department declined comment.\n\nA spokesperson for TSMC also declined to comment beyond saying it was a \"law-abiding company...committed to complying with all applicable rules and regulations, including applicable export controls.\"\n\nThe Commerce Department communication -- known as an \"is informed\" letter -- allows the U.S. to bypass lengthy rule-writing processes to quickly impose new licensing requirements on specific companies.\n\nIjiwei, a Chinese media site covering the semiconductor industry, reported on Friday that TSMC notified Chinese chip design companies it would suspend 7 nanometer or below chips for AI and GPU customers beginning Nov. 11.\n\nThe action comes as both Republican and Democratic lawmakers have raised concerns about the inadequacy of export controls on China and the Commerce Department's enforcement of them.\n\nIn 2022, the Commerce Department sent is-informed letters to Nvidia and AMD restricting their ability to export top AI-related chips to China, and to chip equipment makers like Lam Research, Applied Materials and KLA to restrict tools to make advanced chips to China.\n\nThe restrictions in those letters were later turned into rules that apply to companies beyond them.\n\nThe U.S. has been delayed in updating rules on tech exports to China. As Reuters reported in July, the Biden administration drafted new rules on some foreign exports of chipmaking equipment and planned to add about 120 Chinese companies to the Commerce Department's restricted entity list, including chipmaking factories, toolmakers, and related companies.\n\nBut despite plans for an August release, and later tentative target dates for publication, the rules still have not been issued.",
  "link_flair_text": "Company News",
  "id": "1gnos5a",
  "num_comments": 39,
  "created_utc": 1731200267,
  "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/",
  "comments": [
    {
      "id": "lwc88xc",
      "score": 1,
      "body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwc88xc/",
      "created": 1731200268,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwcd0zi",
      "score": 12,
      "body": "Seems like a lot of loss revenue.  I would have to look at the financials.\n\nBut Intel had like 27% of the revenue based in China, prior to the tall fence small yard strategy.   \n\nNow look at Intel.",
      "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcd0zi/",
      "created": 1731202024,
      "depth": 0,
      "replies": [
        {
          "id": "lwcopel",
          "score": 1,
          "body": "Thinking about 7-8% of revenue potential impacted?  Somebody plz chime in if I’m off.  \n\nFrom Q3 2024 report: \n Revenue from China =  11%   \n Revenue from 7nm and below: 69%  \n\n11% * 69% = 7.6\n(Could be off if they sell a lower % of 7nm and below to China compared to other countries)",
          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcopel/",
          "created": 1731206414,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwckm75",
      "score": 23,
      "body": "This isn’t going to end well.",
      "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwckm75/",
      "created": 1731204821,
      "depth": 0,
      "replies": [
        {
          "id": "lwct4j1",
          "score": 6,
          "body": "Said it a year ago, why would any government want the most revolutionary tech going to hands of anyone who can use it to take a lead. Yeah fun and games selling out until the list of who can sell to becomes smaller and smaller.\n\nWe're nowhere near this point yet but already you're starting to see it happen",
          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwct4j1/",
          "created": 1731208134,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwc9qh0",
      "score": 36,
      "body": "How can the US even do this, though? Were the chips produced at US TSMC facilities?\n\nOr due to agreements TSMC had made with US?\n\nThat is, what exactly is the “lever” that US can pull?",
      "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwc9qh0/",
      "created": 1731200815,
      "depth": 0,
      "replies": [
        {
          "id": "lwci82u",
          "score": 19,
          "body": "TSMC uses key technology developed in the Netherlands and America. This technology comes with export controls.\n\nAlso, taking money from the Chips Act has strings attached.",
          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwci82u/",
          "created": 1731203921,
          "depth": 1,
          "replies": [
            {
              "id": "lwcitt2",
              "score": 5,
              "body": "Thanks - this is what I was looking for.",
              "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcitt2/",
              "created": 1731204147,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lwcancs",
          "score": 31,
          "body": "Not sure of the actual legal reasoning, but you have to remember that Taiwan and TSMC would already be part of China if the US didn't exist and currently provide it protection. There is a lot of pressure to do as the US wants in situations like this. The Taiwanese government also almost certainly is playing a role in this not covered by the article - my guess would be that the US applied pressure on them to push TSMC into fully abiding by their terms.\n\nAdditionally, remember that TSMC requires a lot of incredibly sophisticated, advanced equipment. The vast majority comes from 5 companies, 3 of which are US-based companies in the Bay Area. These 5 companies (ASML; AMAT; LRCX; KLAC; TOELY) are currently under massive export restrictions - and they could easily be made to reduce their exports to TSMC were it not to abide by the letter. \n\n'Soft power' is still power.",
          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcancs/",
          "created": 1731201153,
          "depth": 1,
          "replies": [
            {
              "id": "lwcfgzv",
              "score": 2,
              "body": "To clarify:\n\nASML is a multi-national Dutch corporation.\n\nTokyo Electron is a Japanese corporation. TOELY refers to their American Depository Receipts.",
              "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcfgzv/",
              "created": 1731202906,
              "depth": 2,
              "replies": [
                {
                  "id": "lwcfuuv",
                  "score": 17,
                  "body": "Hence me saying **3 of the 5** companies were American. That implies that two were not based in the US. I'm proud you knew one of the two!",
                  "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcfuuv/",
                  "created": 1731203046,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lwcifut",
                      "score": 1,
                      "body": "ASML is by far the biggest provider of machines to TSMC though.",
                      "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcifut/",
                      "created": 1731204002,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lwciyyh",
                          "score": 3,
                          "body": "The 5 companies are each providing different types of machines that have different use cases.",
                          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwciyyh/",
                          "created": 1731204201,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lwcq5tb",
                          "score": 2,
                          "body": "ASML’s lithography machines require components from the U.S. based companies to work.\n\nThat was their point.",
                          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcq5tb/",
                          "created": 1731206983,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lwcw5yz",
                              "score": 1,
                              "body": "It's not components, they bought Cymer, a US company fot their source tech. The issue is because of patents.",
                              "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcw5yz/",
                              "created": 1731209338,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwceuyj",
          "score": 7,
          "body": "The lever of the US is protecting the country from being annexed.",
          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwceuyj/",
          "created": 1731202683,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lwcnoxp",
          "score": 4,
          "body": "Regardless of whether or not there's a formal reason, Taiwan needs the US as an ally to protect itself from getting annexed by China. TSMC was founded specifically for this purpose. The Taiwanese government knew it needed something to offer more powerful countries like the US so that if China ever invaded those countries would come to its defense. They realized that being the only country on Earth that can produce the most advanced microchips would definitely achieve that, and it worked.\n\n\nTaiwan does not want to be part of China and it very much wants to be allied with the US. So if the US says \"don't sell this shit to China\" TSMC's response is gonna be \"no problem\".",
          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcnoxp/",
          "created": 1731206019,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lwcnqfg",
          "score": 1,
          "body": "Prob ably American semi companies.",
          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcnqfg/",
          "created": 1731206035,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lwceaj6",
          "score": 0,
          "body": "Because we have the biggest dick in the room.",
          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwceaj6/",
          "created": 1731202478,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwcbo0i",
      "score": 3,
      "body": "Will this affect all semis?",
      "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcbo0i/",
      "created": 1731201527,
      "depth": 0,
      "replies": [
        {
          "id": "lwccmsj",
          "score": 8,
          "body": "Depends on how irrational the market is on Monday. The reality is this seems to be targeting homegrown Chinese AI accelerators, this (in theory) shouldn't cause additional impact to AMD, Nvidia, and others beyond the export controls enacted earlier this year, but I could be wrong\n\nThe companies I could realistically seeing this impact is TSMC and ASML, assuming that these chips make up a decent chunk of TSMC's revenue\n\n(This is my view, I could be way off)\n\nEDIT: I guess there is a real risk this escalates the existing trade war, I didn't think of that angle. So yes this could impact all semis",
          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwccmsj/",
          "created": 1731201882,
          "depth": 1,
          "replies": [
            {
              "id": "lwcinht",
              "score": 3,
              "body": "Wouldn't this lead to China investing in domestic chip production, for which they would need ASML anyway (at least for the moment)?",
              "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcinht/",
              "created": 1731204080,
              "depth": 2,
              "replies": [
                {
                  "id": "lwcji24",
                  "score": 1,
                  "body": "China is already trying to do their own thing, but with semiconductor fabs just tossing money at the problem isn't a short to medium term solution. You're right they need ASML at the moment",
                  "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcji24/",
                  "created": 1731204404,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lwcxhqb",
                  "score": 1,
                  "body": "They are trying hard, what people tend to forget is that Japan (both Canon, and Nikon, yes, the camera and printer company) also blew a massive load of cash on research and lost the battle against ASML.  \n  \nThe US is also blocking some Japanese exports for the exact same reasons, and both Canon and Nikon are often forgotten in this whole thing. Canon is currently throwing a bunch of money at Nano Imprint Lithography (NIL) as example, and for China this might also be something. EUV isn't the only way, but it's the most advanced method as of now.  \n  \nChina has stolen a lot of data from ASML as well, spying is rather common, and they're also working on their own domestic steppers; however progress is limited. Currently Zeiss is the only company even capable of manufacturing some of the most critical components.",
                  "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcxhqb/",
                  "created": 1731209883,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lwclwpf",
      "score": 3,
      "body": "Semi stocks red on Monday.",
      "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwclwpf/",
      "created": 1731205326,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwcbdq9",
      "score": 2,
      "body": "There goes all my calls.",
      "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcbdq9/",
      "created": 1731201420,
      "depth": 0,
      "replies": [
        {
          "id": "lwcd9zr",
          "score": 2,
          "body": "I almost sold Friday my shares. This makes the decision easier. Will pick back up the shares when things stabilize.",
          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcd9zr/",
          "created": 1731202115,
          "depth": 1,
          "replies": [
            {
              "id": "lwcey8p",
              "score": 1,
              "body": "See you at 250",
              "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcey8p/",
              "created": 1731202716,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwcd3y6",
      "score": -2,
      "body": "Geopolitical risk starts in Washington.",
      "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcd3y6/",
      "created": 1731202054,
      "depth": 0,
      "replies": [
        {
          "id": "lwco8mz",
          "score": 5,
          "body": "LOL your post history\n\n\nHow's the weather in Moscow this time of year? Snowing yet?",
          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwco8mz/",
          "created": 1731206234,
          "depth": 1,
          "replies": [
            {
              "id": "lwcr5tp",
              "score": -5,
              "body": "Thanks for your interest! Definitely not creepy! Did you notice that this is a post about the U.S. government ordering a private company in a foreign country that they can't sell a product to a (arguably) different foreign country, with implications for investors. Where in the world do YOU think geopolitical investment risk is generated?",
              "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcr5tp/",
              "created": 1731207372,
              "depth": 2,
              "replies": [
                {
                  "id": "lwcvszu",
                  "score": 0,
                  "body": "Lol the people downvoting you 😂 anyone who sees this shit and think it's justice are fucked in the head and should not be touching stocks or talk about finance/economics.",
                  "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcvszu/",
                  "created": 1731209193,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lwcaofh",
      "score": -11,
      "body": "China's a walking cash cow but the US actively stopping companies from doing business with them will only negatively affect share prices.\n\nAnd for what?",
      "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcaofh/",
      "created": 1731201164,
      "depth": 0,
      "replies": [
        {
          "id": "lwcc5qn",
          "score": 24,
          "body": "National security?",
          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcc5qn/",
          "created": 1731201708,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lwcegm0",
          "score": 1,
          "body": "Sorry but do you mean all of the companies that weren't allowed to do business in China because China wouldn't let them do business anyway?  I'm sure you could Google that but they don't have Google in China so",
          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcegm0/",
          "created": 1731202540,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lwch3vd",
          "score": -5,
          "body": "They’re the enemy.",
          "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwch3vd/",
          "created": 1731203506,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwcr1m1",
      "score": -1,
      "body": "Nothing about this is good",
      "permalink": "/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/lwcr1m1/",
      "created": 1731207327,
      "depth": 0,
      "replies": []
    }
  ]
}