{
  "title": "These should I sell posts. ",
  "score": 85,
  "selftext": "I’m ready for the down votes. I am here for all the smoke. \n\nYou had the confidence or Regard mentality to make the investment. Unless looking for attention, make that decision on your own. \n\nBut in case that’s not possible, I’ll do your thinking for you. \n\n1. Is your entire life savings in this investment? If so, yeah probably not a great idea to keep holding without taking some off the table. Except for that family farm guy, that was hilarious and should be made into a hallmark movie.  \n\n2. Do you like the stock justifiably or are you just full on FOMO and/or greedy? If the latter; sell.\n\n3. Life comes down to a few important choices. Decide if this is one. Personally I wouldn’t let an online community make that decision for me. Maybe I’m uNiQuE.\n\n4. And a bit of a repeat. Grow up. Be an adult and make your own choices. If you arent sophisticated enough to do so, accept you’re at the casino (totally fine) or stop investing in moon shots and just throw your money in an index fund until you are sophisticated enough. \n\n5. I don’t care what you do. And I find all these posts very enjoyable and entertaining. 💎 🙌🏼 to the 🌙 and all. \n\nBackground: I am a CFA charterholder, a CFP professional, a CPWA professional, and hold the CTFA designation. Ethically I must share that this doesn’t mean I am smarter or can produce better returns vs those without. Also, my Roth IRA is 50% NVDA, 25% TSLA, 17% AAPL, 3% MSFT and GOOG. My 401k which is 4 times the size is invested purely in index funds. \n\nYou all did make me money on the meme stocks…which I was just told by Reddit that I cannot reference in my post. So thank you Regards. Keep on keeping on. \n\nEdit: While I’m clearly qualified to give financial advice, this is just something to reflect on and not meant as advice. Read this, ignore this, take this as a challenge. I’m indifferent lol\n\nEdit 2: My taxable dollars are invested in illiquid assets like PE/RE. Likely not relevant but I figured why not share everything but my SSN. ",
  "link_flair_text": "Discussion",
  "id": "1gnywp5",
  "num_comments": 94,
  "created_utc": 1731239123,
  "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/",
  "comments": [
    {
      "id": "lwech8l",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 12 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwech8l/",
      "created": 1731239128,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lweczf8",
      "score": 32,
      "body": "NVDA raw numbers speak for themselves. [Revenue up 122% YoY with $30B](https://finance.yahoo.com/m/1eeabfe4-bbe0-3b56-87d2-4bb36cd7ab2e/should-you-buy-nvidia-stock.html) last quarter. 98% data center GPU market share. Not some meme play anymore.\n\nYour split between yolo plays and boomer funds actually makes sense. Throw the risky shit in Roth where gains are tax free. Keep the responsible stuff in 401k. Big brain move.\n\nTSLA though... Might wanna trim that. [Deliveries only grew 8% YoY](https://finance.yahoo.com/m/149cca8c-4cf0-3e38-bbe6-ef56056b503a/meet-3-supercharged-growth.html). Competition eating their lunch. \n\nBut what do I know. I'm just another regard on WSB. Keep those diamond hands if you believe in it. Not financial advice.",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lweczf8/",
      "created": 1731239429,
      "depth": 0,
      "replies": [
        {
          "id": "lweczg0",
          "score": 13,
          "body": "PUT YOUR HANDS UP nanocapinvestor!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lweczg0/",
          "created": 1731239429,
          "depth": 1,
          "replies": [
            {
              "id": "lwf4cmi",
              "score": 6,
              "body": "Cuff him",
              "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf4cmi/",
              "created": 1731251331,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lwedemm",
          "score": 14,
          "body": "NVDA was never a meme play for me. I have a $2.5 cost basis. Tesla I have held for over 5 years. I loaded up even more pre-election. Personally I believe it will (for no fundamental reason) run up another 20-30% before normalization occurs. I will be trimming then. \n\nHowever I will say on Tesla. If EV credits go away, the competition will not be able to afford to eat their lunch. Tesla does not rely on them as much as the competitors do.",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwedemm/",
          "created": 1731239678,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwejk7z",
      "score": 73,
      "body": "https://preview.redd.it/pzwkzr35m20e1.png?width=800&format=pjpg&auto=webp&s=35f5879a1cc6b16add33b8a9d28b273c4ea19969",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwejk7z/",
      "created": 1731242951,
      "depth": 0,
      "replies": [
        {
          "id": "lwek9vo",
          "score": 19,
          "body": "I respect the first. Don’t care who reads. And I am here for the smoke. The other two don’t apply here, but I’m going to print your post out and put it in my wallet for when I’m feeling down.",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwek9vo/",
          "created": 1731243294,
          "depth": 1,
          "replies": [
            {
              "id": "lwex01t",
              "score": 4,
              "body": "But everyone said monkey stock would moon! So I remortgaged my home, sold my 401k and put my life savings! I'm only down 85% but then again the monkeys told me to average down? \n\nAlternatively I could have bought an index and be up 40% or tech and be up 500% but 💎  ✋️ for life! \n\nDoing it right, right?",
              "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwex01t/",
              "created": 1731248695,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lwf2g8r",
          "score": 3,
          "body": "So why bother opening the post?",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf2g8r/",
          "created": 1731250676,
          "depth": 1,
          "replies": [
            {
              "id": "lwf55j3",
              "score": 5,
              "body": "It's almost as if you can't see the entire post until you actually open it. You belong in this sub.",
              "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf55j3/",
              "created": 1731251605,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lweopyb",
      "score": 14,
      "body": "Sound advice that does not belong at this Wendy’s",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lweopyb/",
      "created": 1731245318,
      "depth": 0,
      "replies": [
        {
          "id": "lweozy9",
          "score": 4,
          "body": "I lol’d",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lweozy9/",
          "created": 1731245437,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwefz48",
      "score": 22,
      "body": "Sir this is a casino…\n\nJokes aside, this is solid and sound advice. ",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwefz48/",
      "created": 1731241110,
      "depth": 0,
      "replies": [
        {
          "id": "lwegrcf",
          "score": 10,
          "body": "When I walk into a casino I’m going home with $10k or I’m waking out empty handed. I only bring with me the money I’m ready to light on fire. That is the casino way. It is the only way 😂. The casino point and the idgaf point are valid. Not necessarily IMO smart to do with life savings as under this approach you have to be ready to leave with zero. \n\nI do appreciate you saying that. Hoping I save one person from life choices that may have them moving into their mom’s basement. Although laundry and meals are appealing. \n\nAgain for the mods out there I meant this as life advice and my financial opinion.",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwegrcf/",
          "created": 1731241525,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lweothv",
      "score": 13,
      "body": "Nerd. Go to r/investing . This is thunderdome",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lweothv/",
      "created": 1731245359,
      "depth": 0,
      "replies": [
        {
          "id": "lwepirp",
          "score": 6,
          "body": "Mad Max reference; respect. \n\nFunny how life turns out for nerds. Like right now, I get to interact with you! Every life decision I’ve made up until now led to this",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwepirp/",
          "created": 1731245667,
          "depth": 1,
          "replies": [
            {
              "id": "lwf24im",
              "score": 8,
              "body": "Maybe get a room to interact in",
              "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf24im/",
              "created": 1731250564,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwepzcu",
      "score": 7,
      "body": "I think most of the posts are for getting karma points and nothing else",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwepzcu/",
      "created": 1731245862,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lweuv2c",
      "score": 6,
      "body": "I dont think those posts are serious. I always viewed them as bragging.",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lweuv2c/",
      "created": 1731247870,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwewkzh",
      "score": 3,
      "body": "The answer is always SELL. At least, noticeable unrealized gains I had (100%-800%) were not for that long I hoped them to be.",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwewkzh/",
      "created": 1731248534,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lweio7z",
      "score": 6,
      "body": "And also, fuck em if they can't take a joke. There's a common theme amongst the posts you referenced and that is that they never had a plan to begin with. WSB is nothing if not entertaining. The majority of the time the only way to learn is to go experience it first hand.",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lweio7z/",
      "created": 1731242512,
      "depth": 0,
      "replies": [
        {
          "id": "lwek09o",
          "score": 6,
          "body": "Agreed. And I may be more conservative than most, but my first “learning investment” did not risk my financial stability. It also did not provide the chance for early retirement lol. (I view this very differently than leaving your job to take a risk on a start up)\n\nAnd again agreed. I come here solely for entertainment. I just think those that come here for financial advice and ask our community of Regards and Apes (again love y’all) to tell them how to make a major life decisions that they already initiated on their own should just own it themselves. \n\nI prefer the save the family farm, tendies, and gross 0dt call option posts over the “I can’t figure out my life posts”. I imagine that’s why in 99% of those posts epic trolling occurs.",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwek09o/",
          "created": 1731243168,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwejt65",
      "score": 6,
      "body": "So your all those things (CFP Proffessional blahblanblah) and your Roth consists of four stocks All in tech? What advice would all your training demand you give to someone who walked in with that portfolio?",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwejt65/",
      "created": 1731243073,
      "depth": 0,
      "replies": [
        {
          "id": "lwelc2v",
          "score": 2,
          "body": "So my Roth is less than 7% of my net worth. So, if I had a client come in with the same circumstances I’d advise on the benefits of diversification. But if they, like me, could have the account go to zero without affecting their lifestyle, retirement, or goals; I would and have said, cool play around with this. I do not work on commission, which allows me to be unbiased in my advice.\n\nAnd…if you read my post, my the FIVE (5)*** stocks in my ROTH really account for less than 10% of my total retirement assets. And I am being a big boy and will not ask for advice here or to anyone on when/if I should sell. I will decide that for myself. Which was the entire premise of this post.\n\nEdit: You sound like a wieny.",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwelc2v/",
          "created": 1731243796,
          "depth": 1,
          "replies": [
            {
              "id": "lwf6i8e",
              "score": 1,
              "body": "I’m confused. \n\nSo you’re saying I should sell my NVDA shares, put them in a 401K, then transfer to an IRA, sell them because they’ll be tax free, reinvest that into PEP OTM 0dte call? 🚀😤😤",
              "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf6i8e/",
              "created": 1731252060,
              "depth": 2,
              "replies": [
                {
                  "id": "lwf7pin",
                  "score": 1,
                  "body": "Well unless you work at NVDA that is not possible. But I love the excitement!",
                  "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf7pin/",
                  "created": 1731252461,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lweqj2p",
      "score": 7,
      "body": "I downvoted it because you said you were ready for it. No other reason. \n\nSolid, Advice tho.",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lweqj2p/",
      "created": 1731246094,
      "depth": 0,
      "replies": [
        {
          "id": "lweqo08",
          "score": 2,
          "body": "Hahahahahha yes!!! This is another reason I love WSB",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lweqo08/",
          "created": 1731246151,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwf19v7",
      "score": 3,
      "body": "By off the table you men buy more palantir and tesla? Love it OP",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf19v7/",
      "created": 1731250265,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwf246z",
      "score": 3,
      "body": "So you are an accredited investor?\n\nAlso CFPs are scammers. 99% of people are just better off investing in index funds. \n\nI know a CFP and he clears 700k a year",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf246z/",
      "created": 1731250561,
      "depth": 0,
      "replies": [
        {
          "id": "lwfjz0y",
          "score": 2,
          "body": "Agree about the CFP certification but being a CFA Charter-holder makes things a little different … CFA is much much more difficult to obtain and takes years to complete.",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwfjz0y/",
          "created": 1731256398,
          "depth": 1,
          "replies": [
            {
              "id": "lwfk4ih",
              "score": 2,
              "body": "Yes. CFA is very difficult. Even more difficult than the CPA exams - which I have passed.",
              "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwfk4ih/",
              "created": 1731256445,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lwf2f8r",
          "score": 0,
          "body": "Yes, and a qualified purchaser.",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf2f8r/",
          "created": 1731250666,
          "depth": 1,
          "replies": [
            {
              "id": "lwf3erh",
              "score": 1,
              "body": "You must be loaded. Can I ask about your career path?",
              "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf3erh/",
              "created": 1731251006,
              "depth": 2,
              "replies": [
                {
                  "id": "lwf77p0",
                  "score": 2,
                  "body": "As mentioned earlier I don’t work on commission. So not much I can really scam over. \n\nAlso I agree most people are better off with index funds. I believe I mentioned something to that extent earlier. \n\nI wouldn’t say I’m loaded, but that’s relative and a matter of perspective. I have a number in my head. When I hit that number I’ll feel loaded. \n\nI do focus on investment management but estate planning for those with net worths in excess of the lifetime exemption amount is what I really enjoy. I’m preparing to get castrated for this comment but my client minimum is $40mm. It is this because that’s the number where I am able to offer the value which I believe justifies my pay. \n\nIf a serious question about career path…and tough to tell if it is, I started as a junior associate right out of school, excelled, took every opportunity I had to continue my education and broaden my expertise. While I do have a wife, I do not have children, and I enjoy working hard and long hours. It turns out this was rewarded and exponentially accelerated my track. My advice is the same as I’m sure you’ve heard before: Know your worth, don’t be afraid to work harder than the person next to you or your boss—you can’t control when the position you want becomes available, but you can control when you’re ready for it—ask for help and for mentors. I called the president of my company and asked if I could have 30 mins to pick his brain and he actually said yes, haha.",
                  "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf77p0/",
                  "created": 1731252296,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lwfbca9",
                      "score": 2,
                      "body": "Awesome advice and insight. Thanks! \n\nI’m 30 - I’m a CPA and this is my second career. Looking to have kids soon with the wife. But I’m applying to a top MBA program before that.",
                      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwfbca9/",
                      "created": 1731253643,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lwfc6x7",
                          "score": 2,
                          "body": "Any of the M7 programs will launch you forward in your career or help you switch industries. The real benefit IMO is the alumni network you gain access to. One last piece of advice, knock out the MBA pre-kids. Might not be feasible but I’m sure kids first would make life a bit more stressful.",
                          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwfc6x7/",
                          "created": 1731253917,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lwfe40q",
                              "score": 2,
                              "body": "Unfortunately I don’t have the luxury to do a full time program. I have to see if any of the weekend or part time top program are worth it.",
                              "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwfe40q/",
                              "created": 1731254528,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lwfeoyv",
                                  "score": 2,
                                  "body": "EMBA programs would be something to consider. Wharton, Booth, Kellogg, etc all have them. They’re the same degree as a full time,I.e., the diploma doesn’t say “executive mba” on it. They allow you to keep working while you are attending, and much less of a time/travel commitment.",
                                  "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwfeoyv/",
                                  "created": 1731254714,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lwfilhq",
                                      "score": 1,
                                      "body": "Just would have to make sure I leverage the network and career services still.",
                                      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwfilhq/",
                                      "created": 1731255967,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lwf2azk",
      "score": 3,
      "body": "Generally the people on here who claim to be professionals are the most regarded",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf2azk/",
      "created": 1731250624,
      "depth": 0,
      "replies": [
        {
          "id": "lwf7usp",
          "score": 1,
          "body": "I could see that",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf7usp/",
          "created": 1731252511,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwevfxx",
      "score": 2,
      "body": "I think some profit taking is warranted, but this is generally the most profitable time of the year so although we might see a small pullback next week, stocks are sure to rally even more in December.",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwevfxx/",
      "created": 1731248097,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwf4vlp",
      "score": 2,
      "body": "Wondering if I’m officially a regard yet..I’m old fat and broke..I received 15 k from a settlement and invested (gambled) in the market..in just 7 months I’ve lost it with bad trades along with another 12 k on my credit which I’m now paying monthly interest on..I have 1 k left in stock..is this a good time to learn options and make a spectacular recovery?",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf4vlp/",
      "created": 1731251510,
      "depth": 0,
      "replies": [
        {
          "id": "lwf7xav",
          "score": 1,
          "body": "God speed.",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf7xav/",
          "created": 1731252534,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwf6pz1",
      "score": 2,
      "body": "If you made >500% on your options yolo, yes close. My P/L this year is +$50K on options with only two losers (SPY 0DTE  and UPS). You can't lose if you take profit. There's always another play.",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf6pz1/",
      "created": 1731252133,
      "depth": 0,
      "replies": [
        {
          "id": "lwf8vbw",
          "score": 1,
          "body": "Thank you.",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf8vbw/",
          "created": 1731252840,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwf8aq5",
      "score": 2,
      "body": "please.  if we're not yoloing dailies/weeklies, why even bother",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf8aq5/",
      "created": 1731252659,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwenmvq",
      "score": 3,
      "body": "I originally joined this thread for the outlandish bets and the loss porn. Yeah sure it was fun to participate in some of the short squeezes, but it’s not what this thread was about.\n\nNow the short squeeze hype is over, all I see is dumbass kids who are sitting on gains from a crazy volatile bull run asking what to do. Like shut the fuck up and reinvest. It’s not really that hard of a question. \n\nIt’s not real money if you can’t keep it.",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwenmvq/",
      "created": 1731244838,
      "depth": 0,
      "replies": [
        {
          "id": "lwenmw5",
          "score": 6,
          "body": "Squeeze deez nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwenmw5/",
          "created": 1731244838,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwemz4r",
      "score": 3,
      "body": "If you are what you say you are, WTF are you doing here, wasting your time giving free advice to degenerates?\n\nI don't think you are what you say you are.",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwemz4r/",
      "created": 1731244546,
      "depth": 0,
      "replies": [
        {
          "id": "lwenf4r",
          "score": 2,
          "body": "Because it’s 6am on a Sunday and I’m in bed.\n\nBut actually, I’m 50 and live in my mom’s basement because i yolo’d life savings and then asked a Regard for advice and I couldn’t make up my mind. And out of pure altruism, I want to help others.\n\nEdit: You too sound like a wieny.",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwenf4r/",
          "created": 1731244744,
          "depth": 1,
          "replies": [
            {
              "id": "lwennvn",
              "score": 2,
              "body": "Thanks for being honest.",
              "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwennvn/",
              "created": 1731244850,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lweoiij",
      "score": 3,
      "body": "Gey",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lweoiij/",
      "created": 1731245226,
      "depth": 0,
      "replies": [
        {
          "id": "lweps60",
          "score": 1,
          "body": "I expect better. 1/10 on the trolling scale.",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lweps60/",
          "created": 1731245778,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwewqj8",
      "score": 2,
      "body": "Are you writing this for yourself?",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwewqj8/",
      "created": 1731248594,
      "depth": 0,
      "replies": [
        {
          "id": "lwexqse",
          "score": 0,
          "body": "I mean I guess we all post our posts for ourselves. Who knows. What do you think? Vastly interested in you opinion on this",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwexqse/",
          "created": 1731248979,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwf2ize",
      "score": 2,
      "body": "Wait, you can make money doing this?! Not sure how to process that. \n\nMost of us are used to the agony of defeat and when we somehow find ourselves in the green, we’re over here googling “how to handle profits” like it’s some kind of foreign language.\n\nWinning is an altogether strange and unfamiliar feeling and I’m not sure I like it. I’m now stressing on what my next move should be when my usual strategy involves diamond-handing straight to negative gains. This must be how people who plan things feel, but honestly, I’m not cut out for it. *Hold me.*",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf2ize/",
      "created": 1731250702,
      "depth": 0,
      "replies": [
        {
          "id": "lwf7ab1",
          "score": 2,
          "body": "And this is why I love WSB",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf7ab1/",
          "created": 1731252320,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwflenr",
      "score": 1,
      "body": "CFA, CFP, CPWA, CTFA ... all the rest.  Hope you meet your financial goals before the AI replaces folks like you.",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwflenr/",
      "created": 1731256845,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwevfwq",
      "score": 1,
      "body": "I don't understand the point of this post",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwevfwq/",
      "created": 1731248096,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwf8tlv",
      "score": 0,
      "body": "Edit 3: I'm a clown that keeps editing and I want everyone to know that I edited.",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf8tlv/",
      "created": 1731252825,
      "depth": 0,
      "replies": [
        {
          "id": "lwf9hjz",
          "score": 1,
          "body": "I thought that was the rule. I guess not. Appreciate the heads up.\n\n2/10 on the clown troll",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf9hjz/",
          "created": 1731253043,
          "depth": 1,
          "replies": [
            {
              "id": "lwfbubk",
              "score": 0,
              "body": "The rule is that CFAs like fingers up their butthole",
              "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwfbubk/",
              "created": 1731253806,
              "depth": 2,
              "replies": [
                {
                  "id": "lwfckti",
                  "score": 1,
                  "body": "Hmm. I was genuine about the edit comment you made. I thought that was an unwritten rule. \n\nI’m here for the smoke. Let me have it. Butthole thing must be a new requirement. Appreciate the heads up",
                  "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwfckti/",
                  "created": 1731254041,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lwewlhg",
      "score": -1,
      "body": "I'm not sure what the purpose of your rant is, but perhaps you don't know how this novel concept of an online forum works.  Are you new here, boomer?\n\nThe posts have value to people that want points and counterpoints for HODLing.  Of course, one has to sort through all the noise and get to substance, but it's there.\n\nKeep the posts coming, y'all.  This asshat is a CFP.  He doesn't know shit about shit.",
      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwewlhg/",
      "created": 1731248540,
      "depth": 0,
      "replies": [
        {
          "id": "lwewuvn",
          "score": 1,
          "body": "I woke up feeling dangerous. I’m sorry I hurt your feelings.\n\nEdit: Another wieny alert\n\nEdit 2: If the CFP is the designation you’re focused on. I commend you on your Regard seniority. \n\nAlso, again, wieny.",
          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwewuvn/",
          "created": 1731248640,
          "depth": 1,
          "replies": [
            {
              "id": "lwexa7k",
              "score": -1,
              "body": "You woke up being stupid.  You didn't hurt my feelings.  Call me a \"weiny\", now that hurts my feelings, boomer.\n\nListen, put your dentures in, change your diaper, and get yourself some breakfast at Denny's with your senior discount.",
              "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwexa7k/",
              "created": 1731248804,
              "depth": 2,
              "replies": [
                {
                  "id": "lwexj4n",
                  "score": -1,
                  "body": "Bruh I’m 31 years old. Not going to get in a pissing contest with you because that won’t make me feel better about myself. \n\nBut yes, you are a weiny.",
                  "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwexj4n/",
                  "created": 1731248897,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lwexwoq",
                      "score": 1,
                      "body": "You're 31 acting like a boomer.  Just log off.  Yes, you have shit for brains.  That's why you're a CFP.",
                      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwexwoq/",
                      "created": 1731249041,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lweyrs2",
                          "score": 0,
                          "body": "Lmao. You’re right. Brb going to go sit in my car with the garage door closed. It’s funny because if I said my name you’d know it. I wonder if I’d know yours. \n\nBut f*ck yeah keep the smoke coming ya wieny\n\nEdit: there is no chance he would know my name.",
                          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lweyrs2/",
                          "created": 1731249365,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lwezj9y",
                              "score": 1,
                              "body": "Please do that. We agree.  \n\nNobody here knows your name, clown.  The only people who know you are the other boomers that visit your office next to the local insurance salesman and the Subway in the same strip mall.\n\nBoomer, I can do this all day.  Have you taken your ginko biloba?",
                              "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwezj9y/",
                              "created": 1731249647,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lwf0k29",
                                  "score": 0,
                                  "body": "Ngl, the we agree thing sounds a bit skitso. And no, I have not yet, thank you for reminding me.\n\nYou really seem angry. I can’t give medical advice but I think maybe some form of stress reducing activity might be beneficial for you. Getting laid might also do you some good. \n\n(Prepare for the “I get laid all the time comment”)",
                                  "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf0k29/",
                                  "created": 1731250014,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lwf17y6",
                                      "score": 0,
                                      "body": "I don't laid get all the time.  I'm not one of your wife's boyfriends.  It's more likely she's more famous than you pretend to be.\n\nYou're right though.  I have a very low tolerance for stupidity, and there seems to be a disproportionately high incidence of this amount CFPs.  Why is that?  I also have disdain for wannabe famous people on the internet.  So, boomer, it's already strike two for you.",
                                      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf17y6/",
                                      "created": 1731250246,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lwf1t3k",
                                          "score": 0,
                                          "body": "I can’t do this anymore. I said you’d know my name because I’ve been published and have appeared on various channels. But the one regret I have is stating that because it brings me closer to you. \n\nBut seriously man. You need to relax lol. This is wild. I enjoy the smoke but I’m starting to worry that I’m ruining your day. Apologies",
                                          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf1t3k/",
                                          "created": 1731250452,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "lwf0kl5",
                              "score": 1,
                              "body": "I've never met a famous CFP before.  Are you so good at what you do that we'd know your name or are you just a delusional cuck trying to impress your wife's boyfriends.",
                              "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf0kl5/",
                              "created": 1731250020,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lwf177j",
                                  "score": 0,
                                  "body": "Well honestly you probably wouldn’t. Starting to figure that out from this conversation. But yeah I’d go with the former. Also the CFP was a joke. I took it because why not. Maybe that will be one thing we’ll agree on. Although probs not.\n\nComplementing me that you think I have a wife! Man I must’ve pegged you wrong. I wonder if others peg you too?",
                                  "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf177j/",
                                  "created": 1731250239,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lwf1i01",
                                      "score": 1,
                                      "body": "I'd hope you have a wife.  It's okay.  I don't judge.  Is it a husband? Boyfriend?",
                                      "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf1i01/",
                                      "created": 1731250343,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lwf21mx",
                                          "score": 0,
                                          "body": "I don’t kiss and tell",
                                          "permalink": "/r/wallstreetbets/comments/1gnywp5/these_should_i_sell_posts/lwf21mx/",
                                          "created": 1731250536,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}