{
  "title": "SAAB - Swedish arms manufacturer",
  "score": 106,
  "selftext": "Swedish arms manufacturer SAAB is a forgotten gem among European defense stocks. Like all other defense stocks, SAAB gained a lot in the beginning of the Ukraine war and is now trading at around P/E 30 which is historically high and not that impressive.   \n  \nWhat makes the stock interesting now is how many orders have been coming in lately and how the price of the stock hasn't skyrocketed further in response, yet at least. Relative to other arms manufacturers, SAAB is not that large and their potential market cap is enormous.  \n  \nI initially bought a small position in SAAB because I was impressed with the fighter jet Gripen and figured that given the quite small current market cap it just takes 1-3 countries to adopt the Gripen system to massively increase the revenue for SAAB. Nowadays the orders just keep coming in, and the stock price is not really keeping up, so I've bought more shares. Colombia just decided to buy Gripen and Brazil is going to expand their fleet.  \nApart from Gripen, which is of course the crown jewel of SAABs products they also make the NLAW anti tank missile, AT4 anti tank missiles, radar systems, top tier camouflage fabrics and a lot of other high tech defense related products. [Products | Saab](https://www.saab.com/products) They are also designing their first drone at the moment. This is a really well run company, with a long history of building weapons, they are relatively small compared to other major players in the industry and just offers a very impressive range of products.   \n  \nI can't see this stock not being a good pick. ",
  "link_flair_text": null,
  "id": "1go2cjl",
  "num_comments": 24,
  "created_utc": 1731250398,
  "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/",
  "comments": [
    {
      "id": "lwf3yl6",
      "score": 22,
      "body": "SAAB's Q3 numbers are insane. [Order backlog hit SEK190 billion](https://finance.yahoo.com/news/saab-ab-saabf-q3-2024-110024670.html) - up 37% YoY. Their organic growth is at 17.5% and EBIT margins improved from 7.5% to 8.8%. \n\nThat DoJ investigation into the Brazil Gripen deal isn't great news, but both Brazilian and Swedish authorities already cleared them. Plus the original deal was from 2014. Old news.\n\nThey're expanding production capacity big time - new facilities in India and Michigan. Smart move with all these orders flowing in. The Gripen's picking up steam internationally and their anti-tank weapons are basically printing money since Ukraine.\n\nTheir P/E of 30 looks high historically but makes sense given their growth trajectory and massive backlog. Defense spending's not slowing down anytime soon. This is a solid long-term play in the defense sector.",
      "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwf3yl6/",
      "created": 1731251197,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwf2b65",
      "score": 20,
      "body": "you lost me at the p/e of 30",
      "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwf2b65/",
      "created": 1731250626,
      "depth": 0,
      "replies": [
        {
          "id": "lwf9az4",
          "score": 3,
          "body": "I know it's high face value, but if you look at the actual growth, order log, the potential growth for a relatively small company with very well positioned products I don't think it's high.",
          "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwf9az4/",
          "created": 1731252982,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwf2irb",
      "score": 12,
      "body": "Yeah I don’t see the edge here unless you really think the US will pull out of NATO",
      "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwf2irb/",
      "created": 1731250700,
      "depth": 0,
      "replies": [
        {
          "id": "lwf9ntt",
          "score": 6,
          "body": "I don't think the US will pull out of NATO. But all of these \"minor factors\" such as smaller or non-existent US support for Ukraine, peace or no peace in Ukraine - all of those are short term things that overlook the bigger picture. Europe is rearming itself big time and that is not going to stop within the next 20 years at least.",
          "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwf9ntt/",
          "created": 1731253100,
          "depth": 1,
          "replies": [
            {
              "id": "lwfb238",
              "score": 4,
              "body": "With this username I thought you’d have insight into other conflicts they can leverage. Any non European clients ?",
              "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwfb238/",
              "created": 1731253550,
              "depth": 2,
              "replies": [
                {
                  "id": "lwfubz3",
                  "score": 2,
                  "body": "Haha, that is hilarous I didn't even think about. This username is old though, from before I even bought my first stock.",
                  "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwfubz3/",
                  "created": 1731259605,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lwgdlwh",
          "score": 3,
          "body": "Isn't the fear that US will pull out of NATO enough to drive EU defense spending?",
          "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwgdlwh/",
          "created": 1731265359,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwf6fgc",
      "score": 5,
      "body": "It’s an interesting stock. Besides Sweden and Europe, Canada and Australia are the biggest buyers. USA is only 1% of revenue. They are increasing their sales to South American countries every year. They are working to sell jet fighters to Brazil at the moment. According to analysts, forward P/E is 17-18. They expect the revenue will be 71% higher in 2027 compared to today.",
      "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwf6fgc/",
      "created": 1731252034,
      "depth": 0,
      "replies": [
        {
          "id": "lwf8u4p",
          "score": 1,
          "body": "The Brazil deal was confirmed yesterday [Brazil and Sweden deepen aerospace cooperation - Government.se](https://www.government.se/press-releases/2024/11/brazil-and-sweden-deepen-aerospace-cooperation/)",
          "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwf8u4p/",
          "created": 1731252830,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwge15b",
      "score": 5,
      "body": "I like this one , nice growth and good thesis \n\nGoes along with trump trade, Europe going to have to rearm.\n\nI like Rolls-Royce though cause it makes engines for airbus and Boeing losing market share, in addition to playing on the aerospace defense play.\n\nAlso better data reporting for me on my platforms\n\nDo they have any other revenue streams besides defense, in case that trade fades ?",
      "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwge15b/",
      "created": 1731265484,
      "depth": 0,
      "replies": [
        {
          "id": "lwghh0a",
          "score": 1,
          "body": ">Do they have any other revenue streams besides defense, in case that trade fades ?\n\nuhh...I don't think war is going anywhere any time soon. If anything, there's going to be more of it.",
          "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwghh0a/",
          "created": 1731266511,
          "depth": 1,
          "replies": [
            {
              "id": "lwgiiak",
              "score": 1,
              "body": "Gotcha , so a pure play then.\n\nJust pointing out the risks\n\nAlso another risk is that warfar is waged with drone and other non traditional and more lightweight means . More drones and less tanks and aircraft etc.\n\nPersonally not sure what Saab makes and doesn’t at this point. Will need to look into it further but thanks to OP for the article !\n\nProbably won’t invest here, big investments mean more debt and declining cash flow and risk should the expansion prove to not be needed longterm.\n\nMuch easier to scale software/hardware or tech in my mind.",
              "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwgiiak/",
              "created": 1731266821,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwfmz2i",
      "score": 2,
      "body": "I see Saab and I think of the car from the 90s… it was the OG Pontiac Aztec.",
      "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwfmz2i/",
      "created": 1731257332,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwfdso4",
      "score": 1,
      "body": "The only symbol I can find for it is OTC.  Am I missing something?",
      "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwfdso4/",
      "created": 1731254428,
      "depth": 0,
      "replies": [
        {
          "id": "lwfklap",
          "score": 4,
          "body": "It is a Swedish company, it trades on Nasdaq Stockholm exchange on ticker SAAB-B, ISIN SE0021921269.\n\n\nhttps://www.nasdaqomxnordic.com/shares/microsite?Instrument=SSE1051",
          "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwfklap/",
          "created": 1731256591,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lwfu19p",
          "score": 1,
          "body": "Sorry, maybe that wasn't clear, it's a swedish company that trades on the swedish Nasdaq. There might be trackers you can buy if you don't want to buy OTC.",
          "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwfu19p/",
          "created": 1731259513,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lwfpmty",
      "score": 1,
      "body": "As a Colombian i would like to mention the fact that we are in the process of modernizing our fighter fleet and one of the possible candidates for our new fighter is the Saab Grippen, and we would buy at least 14 of them with the decision being announced sometime before the end of the year. \n\n\nI would like to think that even if this is going to be a small sale this could open the door to other nations buying saab fighters instead of the traditional sellers. For example Peru is another country that has been talking about replacing their fleet due to the difficulties of buying Russian spare parts and equipment nowadays.",
      "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwfpmty/",
      "created": 1731258155,
      "depth": 0,
      "replies": [
        {
          "id": "lwft9wg",
          "score": 2,
          "body": "Yes, the Colombia deal is looking very good. Especially since from what I understand there is already co-operation with Brazils air force and they confirmed yesterday that they will be expanding their fleet of Gripens.",
          "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwft9wg/",
          "created": 1731259277,
          "depth": 1,
          "replies": [
            {
              "id": "lwfvqi8",
              "score": 2,
              "body": "Tbh Saab came with a good proposal they are not only offering the planes and equipment but also they're looking to invest in the local aeronautical and technical industry.\n\nSomething that the government ( left wing)finds as important as the planes themselves , you know the typical: we need to be less depending on foreign industry etc.",
              "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwfvqi8/",
              "created": 1731260035,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwfyri2",
      "score": 1,
      "body": "SAAB is such an interesting company - they produced airplanes, then when WW2 ended they started using the Aerospace tech to build cars. The first year they were all painted military green because that was the only paint available.",
      "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwfyri2/",
      "created": 1731260956,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwgxoc8",
      "score": 1,
      "body": "I won't invest until they make cars again",
      "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwgxoc8/",
      "created": 1731271392,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lwfn5gn",
      "score": 1,
      "body": "Saab is the best. Everything they do they do perfectly. Their cars, for example, drive like smooth-tanks forever and the Swedish military industry is the best in the world ",
      "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwfn5gn/",
      "created": 1731257387,
      "depth": 0,
      "replies": [
        {
          "id": "lwg8odf",
          "score": 1,
          "body": "That's why I bought my first shares. I saw a demonstration where they land Gripen on a damn country road in the forest, refuel and reload and take off in 15 minutes. It is insane.",
          "permalink": "/r/stocks/comments/1go2cjl/saab_swedish_arms_manufacturer/lwg8odf/",
          "created": 1731263900,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}